#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccountUpgradeMenuWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AccountUpgradeMenuWidget.AccountUpgradeMenuWidget_C.ExecuteUbergraph_AccountUpgradeMenuWidget
// 0x0004 (0x0004 - 0x0000)
struct AccountUpgradeMenuWidget_C_ExecuteUbergraph_AccountUpgradeMenuWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountUpgradeMenuWidget_C_ExecuteUbergraph_AccountUpgradeMenuWidget) == 0x000004, "Wrong alignment on AccountUpgradeMenuWidget_C_ExecuteUbergraph_AccountUpgradeMenuWidget");
static_assert(sizeof(AccountUpgradeMenuWidget_C_ExecuteUbergraph_AccountUpgradeMenuWidget) == 0x000004, "Wrong size on AccountUpgradeMenuWidget_C_ExecuteUbergraph_AccountUpgradeMenuWidget");
static_assert(offsetof(AccountUpgradeMenuWidget_C_ExecuteUbergraph_AccountUpgradeMenuWidget, EntryPoint) == 0x000000, "Member 'AccountUpgradeMenuWidget_C_ExecuteUbergraph_AccountUpgradeMenuWidget::EntryPoint' has a wrong offset!");

// Function AccountUpgradeMenuWidget.AccountUpgradeMenuWidget_C.SetSoloHovered
// 0x0001 (0x0001 - 0x0000)
struct AccountUpgradeMenuWidget_C_SetSoloHovered final
{
public:
	bool                                          bHovered;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AccountUpgradeMenuWidget_C_SetSoloHovered) == 0x000001, "Wrong alignment on AccountUpgradeMenuWidget_C_SetSoloHovered");
static_assert(sizeof(AccountUpgradeMenuWidget_C_SetSoloHovered) == 0x000001, "Wrong size on AccountUpgradeMenuWidget_C_SetSoloHovered");
static_assert(offsetof(AccountUpgradeMenuWidget_C_SetSoloHovered, bHovered) == 0x000000, "Member 'AccountUpgradeMenuWidget_C_SetSoloHovered::bHovered' has a wrong offset!");

// Function AccountUpgradeMenuWidget.AccountUpgradeMenuWidget_C.SetCoopHovered
// 0x0001 (0x0001 - 0x0000)
struct AccountUpgradeMenuWidget_C_SetCoopHovered final
{
public:
	bool                                          bHovered;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AccountUpgradeMenuWidget_C_SetCoopHovered) == 0x000001, "Wrong alignment on AccountUpgradeMenuWidget_C_SetCoopHovered");
static_assert(sizeof(AccountUpgradeMenuWidget_C_SetCoopHovered) == 0x000001, "Wrong size on AccountUpgradeMenuWidget_C_SetCoopHovered");
static_assert(offsetof(AccountUpgradeMenuWidget_C_SetCoopHovered, bHovered) == 0x000000, "Member 'AccountUpgradeMenuWidget_C_SetCoopHovered::bHovered' has a wrong offset!");

// Function AccountUpgradeMenuWidget.AccountUpgradeMenuWidget_C.UpdateDisplay
// 0x0008 (0x0008 - 0x0000)
struct AccountUpgradeMenuWidget_C_UpdateDisplay final
{
public:
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountUpgradeMenuWidget_C_UpdateDisplay) == 0x000004, "Wrong alignment on AccountUpgradeMenuWidget_C_UpdateDisplay");
static_assert(sizeof(AccountUpgradeMenuWidget_C_UpdateDisplay) == 0x000008, "Wrong size on AccountUpgradeMenuWidget_C_UpdateDisplay");
static_assert(offsetof(AccountUpgradeMenuWidget_C_UpdateDisplay, CallFunc_SelectFloat_ReturnValue) == 0x000000, "Member 'AccountUpgradeMenuWidget_C_UpdateDisplay::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_UpdateDisplay, CallFunc_SelectFloat_ReturnValue_1) == 0x000004, "Member 'AccountUpgradeMenuWidget_C_UpdateDisplay::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");

// Function AccountUpgradeMenuWidget.AccountUpgradeMenuWidget_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct AccountUpgradeMenuWidget_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(AccountUpgradeMenuWidget_C_OnFocusReceived) == 0x000008, "Wrong alignment on AccountUpgradeMenuWidget_C_OnFocusReceived");
static_assert(sizeof(AccountUpgradeMenuWidget_C_OnFocusReceived) == 0x0001B0, "Wrong size on AccountUpgradeMenuWidget_C_OnFocusReceived");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'AccountUpgradeMenuWidget_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'AccountUpgradeMenuWidget_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'AccountUpgradeMenuWidget_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'AccountUpgradeMenuWidget_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

