#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccountUpgradeMenuWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AccountUpgradeMenuWidget.AccountUpgradeMenuWidget_C
// 0x0078 (0x0380 - 0x0308)
class UAccountUpgradeMenuWidget_C final : public URBAccountUpgradeMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 bg;                                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CoopBackground;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CoopButton;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CoopOverlay;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayMultiplayerText;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayMultiplayerTitle;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlaySoloText;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlaySoloTitle;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SoloBackground;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SoloButton;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SoloIcon;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SoloOverlay;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bSoloHovered;                                      // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCoopHovered;                                      // 0x0379(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AccountUpgradeMenuWidget(int32 EntryPoint);
	void Construct();
	void BndEvt__AccountUpgradeMenuWidget_CoopButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__AccountUpgradeMenuWidget_CoopButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__AccountUpgradeMenuWidget_SoloButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__AccountUpgradeMenuWidget_SoloButton_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__AccountUpgradeMenuWidget_SoloButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__AccountUpgradeMenuWidget_CoopButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void SetSoloHovered(bool bHovered);
	void SetCoopHovered(bool bHovered);
	void UpdateDisplay();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AccountUpgradeMenuWidget_C">();
	}
	static class UAccountUpgradeMenuWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccountUpgradeMenuWidget_C>();
	}
};
static_assert(alignof(UAccountUpgradeMenuWidget_C) == 0x000008, "Wrong alignment on UAccountUpgradeMenuWidget_C");
static_assert(sizeof(UAccountUpgradeMenuWidget_C) == 0x000380, "Wrong size on UAccountUpgradeMenuWidget_C");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, UberGraphFrame) == 0x000308, "Member 'UAccountUpgradeMenuWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, bg) == 0x000310, "Member 'UAccountUpgradeMenuWidget_C::bg' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, CoopBackground) == 0x000318, "Member 'UAccountUpgradeMenuWidget_C::CoopBackground' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, CoopButton) == 0x000320, "Member 'UAccountUpgradeMenuWidget_C::CoopButton' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, CoopOverlay) == 0x000328, "Member 'UAccountUpgradeMenuWidget_C::CoopOverlay' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, Image_1) == 0x000330, "Member 'UAccountUpgradeMenuWidget_C::Image_1' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, PlayMultiplayerText) == 0x000338, "Member 'UAccountUpgradeMenuWidget_C::PlayMultiplayerText' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, PlayMultiplayerTitle) == 0x000340, "Member 'UAccountUpgradeMenuWidget_C::PlayMultiplayerTitle' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, PlaySoloText) == 0x000348, "Member 'UAccountUpgradeMenuWidget_C::PlaySoloText' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, PlaySoloTitle) == 0x000350, "Member 'UAccountUpgradeMenuWidget_C::PlaySoloTitle' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, SoloBackground) == 0x000358, "Member 'UAccountUpgradeMenuWidget_C::SoloBackground' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, SoloButton) == 0x000360, "Member 'UAccountUpgradeMenuWidget_C::SoloButton' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, SoloIcon) == 0x000368, "Member 'UAccountUpgradeMenuWidget_C::SoloIcon' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, SoloOverlay) == 0x000370, "Member 'UAccountUpgradeMenuWidget_C::SoloOverlay' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, bSoloHovered) == 0x000378, "Member 'UAccountUpgradeMenuWidget_C::bSoloHovered' has a wrong offset!");
static_assert(offsetof(UAccountUpgradeMenuWidget_C, bCoopHovered) == 0x000379, "Member 'UAccountUpgradeMenuWidget_C::bCoopHovered' has a wrong offset!");

}

