#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActionIconWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActionIconWidget.ActionIconWidget_C
// 0x0140 (0x03C0 - 0x0280)
class UActionIconWidget_C final : public URBInputIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               EscapeKey;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gamepad_Border_Bottom;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gamepad_Border_Top;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gamepad_Button;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               GamepadInput_Overlay;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               GamepadSizeBox;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              IconScaleBox;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyboardButtonBorder_Bottom;                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyboardButtonBorder_Top;                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyboardIcon_Enter;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyboardIcon_Esc;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyboardIcon_Space;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyboardIcon_Tab;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyboardIconBG;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyboardIconLargeBG;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               KeyboardInput_Custom_Overlay;                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               KeyboardInput_Overlay;                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               KeyboardInput_Overlay_Hold;                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KeyboardLabelText;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseButtonBG;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseButtonBorder_Bottom;                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseButtonBorder_Top;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseButtonLeft;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseButtonMiddle;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseButtonRight;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseButtonThumb;                                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseButtonThumb2;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MouseInput_Overlay;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseScrollDown;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseScrollUp;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MouseSizeBox;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         baseHeight;                                        // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FillInformation;                                   // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BorderMaterial_Mouse;                              // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BorderMaterial_Gamepad;                            // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CurrentlyVisibleWidgets;                           // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          ShowOnlyGamepad;                                   // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowOnlyKBM;                                       // 0x03A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShouldIntersect;                                   // 0x03AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C27[0x5];                                     // 0x03AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               BorderMaterial_Keyboard;                           // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowOnGamepad;                                    // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShowOnKBM;                                        // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsUsingGamepad;                                   // 0x03BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ActionIconWidget(int32 EntryPoint);
	void ForceRefreshIcon();
	void OnHudActionProgressChanged(float NewProgress, EActionProgressContext Context);
	void OnMenuActionProgressChanged(const class FName& Param_ActionName, float NewProgress);
	void OnMenuInputSourceChanged();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetActionName(class FName NewActionName, int32 Value);
	void RefreshActionIcon();
	void HideIcons();
	void ShowContainer(class UPanelWidget* Container);
	void SetDesiredHeight(float Param_DesiredHeight);
	void UpdateSize();
	void SetWidgetVisible(class UWidget* Widget);
	void ResetVisibleIcons();
	void SetHoldRequirement(bool RequiresHold);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActionIconWidget_C">();
	}
	static class UActionIconWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionIconWidget_C>();
	}
};
static_assert(alignof(UActionIconWidget_C) == 0x000008, "Wrong alignment on UActionIconWidget_C");
static_assert(sizeof(UActionIconWidget_C) == 0x0003C0, "Wrong size on UActionIconWidget_C");
static_assert(offsetof(UActionIconWidget_C, UberGraphFrame) == 0x000280, "Member 'UActionIconWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, EscapeKey) == 0x000288, "Member 'UActionIconWidget_C::EscapeKey' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, Gamepad_Border_Bottom) == 0x000290, "Member 'UActionIconWidget_C::Gamepad_Border_Bottom' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, Gamepad_Border_Top) == 0x000298, "Member 'UActionIconWidget_C::Gamepad_Border_Top' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, Gamepad_Button) == 0x0002A0, "Member 'UActionIconWidget_C::Gamepad_Button' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, GamepadInput_Overlay) == 0x0002A8, "Member 'UActionIconWidget_C::GamepadInput_Overlay' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, GamepadSizeBox) == 0x0002B0, "Member 'UActionIconWidget_C::GamepadSizeBox' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, IconScaleBox) == 0x0002B8, "Member 'UActionIconWidget_C::IconScaleBox' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, KeyboardButtonBorder_Bottom) == 0x0002C0, "Member 'UActionIconWidget_C::KeyboardButtonBorder_Bottom' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, KeyboardButtonBorder_Top) == 0x0002C8, "Member 'UActionIconWidget_C::KeyboardButtonBorder_Top' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, KeyboardIcon_Enter) == 0x0002D0, "Member 'UActionIconWidget_C::KeyboardIcon_Enter' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, KeyboardIcon_Esc) == 0x0002D8, "Member 'UActionIconWidget_C::KeyboardIcon_Esc' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, KeyboardIcon_Space) == 0x0002E0, "Member 'UActionIconWidget_C::KeyboardIcon_Space' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, KeyboardIcon_Tab) == 0x0002E8, "Member 'UActionIconWidget_C::KeyboardIcon_Tab' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, KeyboardIconBG) == 0x0002F0, "Member 'UActionIconWidget_C::KeyboardIconBG' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, KeyboardIconLargeBG) == 0x0002F8, "Member 'UActionIconWidget_C::KeyboardIconLargeBG' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, KeyboardInput_Custom_Overlay) == 0x000300, "Member 'UActionIconWidget_C::KeyboardInput_Custom_Overlay' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, KeyboardInput_Overlay) == 0x000308, "Member 'UActionIconWidget_C::KeyboardInput_Overlay' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, KeyboardInput_Overlay_Hold) == 0x000310, "Member 'UActionIconWidget_C::KeyboardInput_Overlay_Hold' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, KeyboardLabelText) == 0x000318, "Member 'UActionIconWidget_C::KeyboardLabelText' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, MouseButtonBG) == 0x000320, "Member 'UActionIconWidget_C::MouseButtonBG' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, MouseButtonBorder_Bottom) == 0x000328, "Member 'UActionIconWidget_C::MouseButtonBorder_Bottom' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, MouseButtonBorder_Top) == 0x000330, "Member 'UActionIconWidget_C::MouseButtonBorder_Top' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, MouseButtonLeft) == 0x000338, "Member 'UActionIconWidget_C::MouseButtonLeft' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, MouseButtonMiddle) == 0x000340, "Member 'UActionIconWidget_C::MouseButtonMiddle' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, MouseButtonRight) == 0x000348, "Member 'UActionIconWidget_C::MouseButtonRight' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, MouseButtonThumb) == 0x000350, "Member 'UActionIconWidget_C::MouseButtonThumb' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, MouseButtonThumb2) == 0x000358, "Member 'UActionIconWidget_C::MouseButtonThumb2' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, MouseInput_Overlay) == 0x000360, "Member 'UActionIconWidget_C::MouseInput_Overlay' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, MouseScrollDown) == 0x000368, "Member 'UActionIconWidget_C::MouseScrollDown' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, MouseScrollUp) == 0x000370, "Member 'UActionIconWidget_C::MouseScrollUp' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, MouseSizeBox) == 0x000378, "Member 'UActionIconWidget_C::MouseSizeBox' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, baseHeight) == 0x000380, "Member 'UActionIconWidget_C::baseHeight' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, FillInformation) == 0x000384, "Member 'UActionIconWidget_C::FillInformation' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, BorderMaterial_Mouse) == 0x000388, "Member 'UActionIconWidget_C::BorderMaterial_Mouse' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, BorderMaterial_Gamepad) == 0x000390, "Member 'UActionIconWidget_C::BorderMaterial_Gamepad' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, CurrentlyVisibleWidgets) == 0x000398, "Member 'UActionIconWidget_C::CurrentlyVisibleWidgets' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, ShowOnlyGamepad) == 0x0003A8, "Member 'UActionIconWidget_C::ShowOnlyGamepad' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, ShowOnlyKBM) == 0x0003A9, "Member 'UActionIconWidget_C::ShowOnlyKBM' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, ShouldIntersect) == 0x0003AA, "Member 'UActionIconWidget_C::ShouldIntersect' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, BorderMaterial_Keyboard) == 0x0003B0, "Member 'UActionIconWidget_C::BorderMaterial_Keyboard' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, bShowOnGamepad) == 0x0003B8, "Member 'UActionIconWidget_C::bShowOnGamepad' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, bShowOnKBM) == 0x0003B9, "Member 'UActionIconWidget_C::bShowOnKBM' has a wrong offset!");
static_assert(offsetof(UActionIconWidget_C, bIsUsingGamepad) == 0x0003BA, "Member 'UActionIconWidget_C::bIsUsingGamepad' has a wrong offset!");

}

