#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActiveEffectsHudWidget

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function ActiveEffectsHudWidget.ActiveEffectsHudWidget_C.ExecuteUbergraph_ActiveEffectsHudWidget
// 0x0088 (0x0088 - 0x0000)
struct ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FActiveEffectTrackingData& ActiveEffectTrackingDataEntry)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UActiveEffectEntryWidget_C*             CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_Event_oldPlayer;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_Event_newPlayer;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UActiveEffectEntryWidget_C*             CallFunc_Create_ReturnValue_1;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName& EffectId)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FActiveEffectTrackingData& ActiveEffectTrackingDataEntry)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	EHudMode                                      K2Node_Event_newHudMode;                           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FActiveEffectTrackingData              K2Node_CustomEvent_activeEffectTrackingDataEntry;  // 0x0074(0x0010)(ConstParm, NoDestructor)
};
static_assert(alignof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget) == 0x000008, "Wrong alignment on ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget");
static_assert(sizeof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget) == 0x000088, "Wrong size on ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, EntryPoint) == 0x000000, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, K2Node_Event_IsDesignTime) == 0x000014, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, CallFunc_Create_ReturnValue) == 0x000018, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, K2Node_Event_oldPlayer) == 0x000020, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::K2Node_Event_oldPlayer' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, K2Node_Event_newPlayer) == 0x000028, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::K2Node_Event_newPlayer' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000030, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, CallFunc_Create_ReturnValue_1) == 0x000040, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000058, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, K2Node_Event_newHudMode) == 0x000070, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::K2Node_Event_newHudMode' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000071, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000072, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, CallFunc_BooleanOR_ReturnValue) == 0x000073, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget, K2Node_CustomEvent_activeEffectTrackingDataEntry) == 0x000074, "Member 'ActiveEffectsHudWidget_C_ExecuteUbergraph_ActiveEffectsHudWidget::K2Node_CustomEvent_activeEffectTrackingDataEntry' has a wrong offset!");

// Function ActiveEffectsHudWidget.ActiveEffectsHudWidget_C.OnActiveEffectAdded
// 0x0010 (0x0010 - 0x0000)
struct ActiveEffectsHudWidget_C_OnActiveEffectAdded final
{
public:
	struct FActiveEffectTrackingData              ActiveEffectTrackingDataEntry;                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ActiveEffectsHudWidget_C_OnActiveEffectAdded) == 0x000004, "Wrong alignment on ActiveEffectsHudWidget_C_OnActiveEffectAdded");
static_assert(sizeof(ActiveEffectsHudWidget_C_OnActiveEffectAdded) == 0x000010, "Wrong size on ActiveEffectsHudWidget_C_OnActiveEffectAdded");
static_assert(offsetof(ActiveEffectsHudWidget_C_OnActiveEffectAdded, ActiveEffectTrackingDataEntry) == 0x000000, "Member 'ActiveEffectsHudWidget_C_OnActiveEffectAdded::ActiveEffectTrackingDataEntry' has a wrong offset!");

// Function ActiveEffectsHudWidget.ActiveEffectsHudWidget_C.Event_OnHudModeChanged
// 0x0001 (0x0001 - 0x0000)
struct ActiveEffectsHudWidget_C_Event_OnHudModeChanged final
{
public:
	EHudMode                                      NewHudMode;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActiveEffectsHudWidget_C_Event_OnHudModeChanged) == 0x000001, "Wrong alignment on ActiveEffectsHudWidget_C_Event_OnHudModeChanged");
static_assert(sizeof(ActiveEffectsHudWidget_C_Event_OnHudModeChanged) == 0x000001, "Wrong size on ActiveEffectsHudWidget_C_Event_OnHudModeChanged");
static_assert(offsetof(ActiveEffectsHudWidget_C_Event_OnHudModeChanged, NewHudMode) == 0x000000, "Member 'ActiveEffectsHudWidget_C_Event_OnHudModeChanged::NewHudMode' has a wrong offset!");

// Function ActiveEffectsHudWidget.ActiveEffectsHudWidget_C.Event_OnWatchedPlayerChanged
// 0x0010 (0x0010 - 0x0000)
struct ActiveEffectsHudWidget_C_Event_OnWatchedPlayerChanged final
{
public:
	class ARBPlayer*                              OldPlayer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              NewPlayer;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActiveEffectsHudWidget_C_Event_OnWatchedPlayerChanged) == 0x000008, "Wrong alignment on ActiveEffectsHudWidget_C_Event_OnWatchedPlayerChanged");
static_assert(sizeof(ActiveEffectsHudWidget_C_Event_OnWatchedPlayerChanged) == 0x000010, "Wrong size on ActiveEffectsHudWidget_C_Event_OnWatchedPlayerChanged");
static_assert(offsetof(ActiveEffectsHudWidget_C_Event_OnWatchedPlayerChanged, OldPlayer) == 0x000000, "Member 'ActiveEffectsHudWidget_C_Event_OnWatchedPlayerChanged::OldPlayer' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_Event_OnWatchedPlayerChanged, NewPlayer) == 0x000008, "Member 'ActiveEffectsHudWidget_C_Event_OnWatchedPlayerChanged::NewPlayer' has a wrong offset!");

// Function ActiveEffectsHudWidget.ActiveEffectsHudWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActiveEffectsHudWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActiveEffectsHudWidget_C_PreConstruct) == 0x000001, "Wrong alignment on ActiveEffectsHudWidget_C_PreConstruct");
static_assert(sizeof(ActiveEffectsHudWidget_C_PreConstruct) == 0x000001, "Wrong size on ActiveEffectsHudWidget_C_PreConstruct");
static_assert(offsetof(ActiveEffectsHudWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ActiveEffectsHudWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ActiveEffectsHudWidget.ActiveEffectsHudWidget_C.AddActiveEffect
// 0x0090 (0x0090 - 0x0000)
struct ActiveEffectsHudWidget_C_AddActiveEffect final
{
public:
	struct FActiveEffectTrackingData              ActiveEffectTrackingDataEntry;                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	float                                         Delay;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActiveEffectEntryWidget_C*             CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerTime_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBUIEffectDisplayData                 CallFunc_Map_Find_Value;                           // 0x0058(0x0030)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActiveEffectsHudWidget_C_AddActiveEffect) == 0x000008, "Wrong alignment on ActiveEffectsHudWidget_C_AddActiveEffect");
static_assert(sizeof(ActiveEffectsHudWidget_C_AddActiveEffect) == 0x000090, "Wrong size on ActiveEffectsHudWidget_C_AddActiveEffect");
static_assert(offsetof(ActiveEffectsHudWidget_C_AddActiveEffect, ActiveEffectTrackingDataEntry) == 0x000000, "Member 'ActiveEffectsHudWidget_C_AddActiveEffect::ActiveEffectTrackingDataEntry' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_AddActiveEffect, Delay) == 0x000010, "Member 'ActiveEffectsHudWidget_C_AddActiveEffect::Delay' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_AddActiveEffect, CallFunc_Create_ReturnValue) == 0x000018, "Member 'ActiveEffectsHudWidget_C_AddActiveEffect::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_AddActiveEffect, Temp_delegate_Variable) == 0x000020, "Member 'ActiveEffectsHudWidget_C_AddActiveEffect::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_AddActiveEffect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'ActiveEffectsHudWidget_C_AddActiveEffect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_AddActiveEffect, CallFunc_PostEventGlobal_ReturnValue) == 0x000034, "Member 'ActiveEffectsHudWidget_C_AddActiveEffect::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_AddActiveEffect, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000038, "Member 'ActiveEffectsHudWidget_C_AddActiveEffect::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_AddActiveEffect, CallFunc_BooleanOR_ReturnValue) == 0x000039, "Member 'ActiveEffectsHudWidget_C_AddActiveEffect::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_AddActiveEffect, CallFunc_Add_FloatFloat_ReturnValue) == 0x00003C, "Member 'ActiveEffectsHudWidget_C_AddActiveEffect::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_AddActiveEffect, CallFunc_GetServerTime_ReturnValue) == 0x000040, "Member 'ActiveEffectsHudWidget_C_AddActiveEffect::CallFunc_GetServerTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_AddActiveEffect, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000048, "Member 'ActiveEffectsHudWidget_C_AddActiveEffect::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_AddActiveEffect, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000050, "Member 'ActiveEffectsHudWidget_C_AddActiveEffect::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_AddActiveEffect, CallFunc_Map_Find_Value) == 0x000058, "Member 'ActiveEffectsHudWidget_C_AddActiveEffect::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_AddActiveEffect, CallFunc_Map_Find_ReturnValue) == 0x000088, "Member 'ActiveEffectsHudWidget_C_AddActiveEffect::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function ActiveEffectsHudWidget.ActiveEffectsHudWidget_C.UpdateActiveEffect
// 0x0060 (0x0060 - 0x0000)
struct ActiveEffectsHudWidget_C_UpdateActiveEffect final
{
public:
	struct FActiveEffectTrackingData              ActiveEffectTrackingDataEntry;                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActiveEffectEntryWidget_C*             K2Node_DynamicCast_AsActive_Effect_Entry_Widget;   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActiveEffectsHudWidget_C_UpdateActiveEffect) == 0x000008, "Wrong alignment on ActiveEffectsHudWidget_C_UpdateActiveEffect");
static_assert(sizeof(ActiveEffectsHudWidget_C_UpdateActiveEffect) == 0x000060, "Wrong size on ActiveEffectsHudWidget_C_UpdateActiveEffect");
static_assert(offsetof(ActiveEffectsHudWidget_C_UpdateActiveEffect, ActiveEffectTrackingDataEntry) == 0x000000, "Member 'ActiveEffectsHudWidget_C_UpdateActiveEffect::ActiveEffectTrackingDataEntry' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_UpdateActiveEffect, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'ActiveEffectsHudWidget_C_UpdateActiveEffect::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_UpdateActiveEffect, Temp_int_Array_Index_Variable) == 0x000014, "Member 'ActiveEffectsHudWidget_C_UpdateActiveEffect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_UpdateActiveEffect, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'ActiveEffectsHudWidget_C_UpdateActiveEffect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_UpdateActiveEffect, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'ActiveEffectsHudWidget_C_UpdateActiveEffect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_UpdateActiveEffect, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'ActiveEffectsHudWidget_C_UpdateActiveEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_UpdateActiveEffect, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'ActiveEffectsHudWidget_C_UpdateActiveEffect::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_UpdateActiveEffect, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'ActiveEffectsHudWidget_C_UpdateActiveEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_UpdateActiveEffect, CallFunc_Array_Get_Item) == 0x000040, "Member 'ActiveEffectsHudWidget_C_UpdateActiveEffect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_UpdateActiveEffect, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'ActiveEffectsHudWidget_C_UpdateActiveEffect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_UpdateActiveEffect, K2Node_DynamicCast_AsActive_Effect_Entry_Widget) == 0x000050, "Member 'ActiveEffectsHudWidget_C_UpdateActiveEffect::K2Node_DynamicCast_AsActive_Effect_Entry_Widget' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_UpdateActiveEffect, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'ActiveEffectsHudWidget_C_UpdateActiveEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_UpdateActiveEffect, CallFunc_BooleanAND_ReturnValue) == 0x000059, "Member 'ActiveEffectsHudWidget_C_UpdateActiveEffect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_UpdateActiveEffect, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00005A, "Member 'ActiveEffectsHudWidget_C_UpdateActiveEffect::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function ActiveEffectsHudWidget.ActiveEffectsHudWidget_C.RemoveActiveEffect
// 0x0058 (0x0058 - 0x0000)
struct ActiveEffectsHudWidget_C_RemoveActiveEffect final
{
public:
	class FName                                   EffectId;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActiveEffectEntryWidget_C*             K2Node_DynamicCast_AsActive_Effect_Entry_Widget;   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActiveEffectsHudWidget_C_RemoveActiveEffect) == 0x000008, "Wrong alignment on ActiveEffectsHudWidget_C_RemoveActiveEffect");
static_assert(sizeof(ActiveEffectsHudWidget_C_RemoveActiveEffect) == 0x000058, "Wrong size on ActiveEffectsHudWidget_C_RemoveActiveEffect");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, EffectId) == 0x000000, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::EffectId' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, CallFunc_RemoveChildAt_ReturnValue) == 0x000018, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, CallFunc_Array_Get_Item) == 0x000038, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, K2Node_DynamicCast_AsActive_Effect_Entry_Widget) == 0x000040, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::K2Node_DynamicCast_AsActive_Effect_Entry_Widget' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000051, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_RemoveActiveEffect, CallFunc_BooleanAND_ReturnValue) == 0x000052, "Member 'ActiveEffectsHudWidget_C_RemoveActiveEffect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ActiveEffectsHudWidget.ActiveEffectsHudWidget_C.Refresh
// 0x0038 (0x0038 - 0x0000)
struct ActiveEffectsHudWidget_C_Refresh final
{
public:
	TArray<struct FActiveEffectTrackingData>      ActiveEffectTrackingDataEntries;                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveEffectTrackingData              CallFunc_Array_Get_Item;                           // 0x001C(0x0010)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActiveEffectsHudWidget_C_Refresh) == 0x000008, "Wrong alignment on ActiveEffectsHudWidget_C_Refresh");
static_assert(sizeof(ActiveEffectsHudWidget_C_Refresh) == 0x000038, "Wrong size on ActiveEffectsHudWidget_C_Refresh");
static_assert(offsetof(ActiveEffectsHudWidget_C_Refresh, ActiveEffectTrackingDataEntries) == 0x000000, "Member 'ActiveEffectsHudWidget_C_Refresh::ActiveEffectTrackingDataEntries' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_Refresh, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'ActiveEffectsHudWidget_C_Refresh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_Refresh, Temp_int_Array_Index_Variable) == 0x000014, "Member 'ActiveEffectsHudWidget_C_Refresh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_Refresh, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'ActiveEffectsHudWidget_C_Refresh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_Refresh, CallFunc_Array_Get_Item) == 0x00001C, "Member 'ActiveEffectsHudWidget_C_Refresh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_Refresh, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'ActiveEffectsHudWidget_C_Refresh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_Refresh, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'ActiveEffectsHudWidget_C_Refresh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function ActiveEffectsHudWidget.ActiveEffectsHudWidget_C.TryAddDelayedEffects
// 0x0058 (0x0058 - 0x0000)
struct ActiveEffectsHudWidget_C_TryAddDelayedEffects final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveEffectTrackingData              CallFunc_Map_Find_Value;                           // 0x0030(0x0010)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Map_Find_Value_1;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetElapsedServerTime_ReturnValue;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActiveEffectsHudWidget_C_TryAddDelayedEffects) == 0x000008, "Wrong alignment on ActiveEffectsHudWidget_C_TryAddDelayedEffects");
static_assert(sizeof(ActiveEffectsHudWidget_C_TryAddDelayedEffects) == 0x000058, "Wrong size on ActiveEffectsHudWidget_C_TryAddDelayedEffects");
static_assert(offsetof(ActiveEffectsHudWidget_C_TryAddDelayedEffects, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ActiveEffectsHudWidget_C_TryAddDelayedEffects::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ActiveEffectsHudWidget_C_TryAddDelayedEffects, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ActiveEffectsHudWidget_C_TryAddDelayedEffects::Temp_int_Loop_Counter_Variable' has a wrong offset!");
