#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActionIconWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ActionIconWidget.ActionIconWidget_C.ExecuteUbergraph_ActionIconWidget
// 0x00F8 (0x00F8 - 0x0000)
struct ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AB6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float NewProgress, EActionProgressContext Context)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AB7[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue_1;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AB8[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBHUD*                                 CallFunc_GetHUD_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AB9[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetActionProgress_ReturnValue;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ABA[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ABB[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2ABC[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ABD[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ABE[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_actionName;                     // 0x00C4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_newProgress_1;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_newProgress;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActionProgressContext                        K2Node_CustomEvent_context;                        // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ABF[0x1];                                     // 0x00D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBMenuPlayerController*                CallFunc_GetLocalMenuController_ReturnValue;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC0[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName& ActionName, float NewProgress)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget) == 0x000008, "Wrong alignment on ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget");
static_assert(sizeof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget) == 0x0000F8, "Wrong size on ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, EntryPoint) == 0x000000, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_GetMenuManager_ReturnValue) == 0x000008, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, K2Node_Event_IsDesignTime) == 0x000020, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, K2Node_Event_MyGeometry) == 0x000024, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, K2Node_Event_InDeltaTime) == 0x00005C, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_GetMenuManager_ReturnValue_1) == 0x000060, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_GetMenuManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000068, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_FClamp_ReturnValue) == 0x000070, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_IsValid_ReturnValue) == 0x000074, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_GetHUD_ReturnValue) == 0x000078, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_GetActionProgress_ReturnValue) == 0x000084, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_GetActionProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_IsValid_ReturnValue_2) == 0x000088, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000090, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_IsValid_ReturnValue_3) == 0x000098, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x0000B0, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_IsValid_ReturnValue_4) == 0x0000B8, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x0000BC, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x0000C0, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, K2Node_CustomEvent_actionName) == 0x0000C4, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::K2Node_CustomEvent_actionName' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, K2Node_CustomEvent_newProgress_1) == 0x0000CC, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::K2Node_CustomEvent_newProgress_1' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, K2Node_CustomEvent_newProgress) == 0x0000D0, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::K2Node_CustomEvent_newProgress' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, K2Node_CustomEvent_context) == 0x0000D4, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::K2Node_CustomEvent_context' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D5, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000D6, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_GetLocalMenuController_ReturnValue) == 0x0000D8, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_GetLocalMenuController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, CallFunc_IsValid_ReturnValue_5) == 0x0000E0, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E4, "Member 'ActionIconWidget_C_ExecuteUbergraph_ActionIconWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function ActionIconWidget.ActionIconWidget_C.OnHudActionProgressChanged
// 0x0008 (0x0008 - 0x0000)
struct ActionIconWidget_C_OnHudActionProgressChanged final
{
public:
	float                                         NewProgress;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActionProgressContext                        Context;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionIconWidget_C_OnHudActionProgressChanged) == 0x000004, "Wrong alignment on ActionIconWidget_C_OnHudActionProgressChanged");
static_assert(sizeof(ActionIconWidget_C_OnHudActionProgressChanged) == 0x000008, "Wrong size on ActionIconWidget_C_OnHudActionProgressChanged");
static_assert(offsetof(ActionIconWidget_C_OnHudActionProgressChanged, NewProgress) == 0x000000, "Member 'ActionIconWidget_C_OnHudActionProgressChanged::NewProgress' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_OnHudActionProgressChanged, Context) == 0x000004, "Member 'ActionIconWidget_C_OnHudActionProgressChanged::Context' has a wrong offset!");

// Function ActionIconWidget.ActionIconWidget_C.OnMenuActionProgressChanged
// 0x000C (0x000C - 0x0000)
struct ActionIconWidget_C_OnMenuActionProgressChanged final
{
public:
	class FName                                   Param_ActionName;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewProgress;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionIconWidget_C_OnMenuActionProgressChanged) == 0x000004, "Wrong alignment on ActionIconWidget_C_OnMenuActionProgressChanged");
static_assert(sizeof(ActionIconWidget_C_OnMenuActionProgressChanged) == 0x00000C, "Wrong size on ActionIconWidget_C_OnMenuActionProgressChanged");
static_assert(offsetof(ActionIconWidget_C_OnMenuActionProgressChanged, Param_ActionName) == 0x000000, "Member 'ActionIconWidget_C_OnMenuActionProgressChanged::Param_ActionName' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_OnMenuActionProgressChanged, NewProgress) == 0x000008, "Member 'ActionIconWidget_C_OnMenuActionProgressChanged::NewProgress' has a wrong offset!");

// Function ActionIconWidget.ActionIconWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct ActionIconWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionIconWidget_C_Tick) == 0x000004, "Wrong alignment on ActionIconWidget_C_Tick");
static_assert(sizeof(ActionIconWidget_C_Tick) == 0x00003C, "Wrong size on ActionIconWidget_C_Tick");
static_assert(offsetof(ActionIconWidget_C_Tick, MyGeometry) == 0x000000, "Member 'ActionIconWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'ActionIconWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function ActionIconWidget.ActionIconWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActionIconWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionIconWidget_C_PreConstruct) == 0x000001, "Wrong alignment on ActionIconWidget_C_PreConstruct");
static_assert(sizeof(ActionIconWidget_C_PreConstruct) == 0x000001, "Wrong size on ActionIconWidget_C_PreConstruct");
static_assert(offsetof(ActionIconWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ActionIconWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ActionIconWidget.ActionIconWidget_C.SetActionName
// 0x0010 (0x0010 - 0x0000)
struct ActionIconWidget_C_SetActionName final
{
public:
	class FName                                   NewActionName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionIconWidget_C_SetActionName) == 0x000004, "Wrong alignment on ActionIconWidget_C_SetActionName");
static_assert(sizeof(ActionIconWidget_C_SetActionName) == 0x000010, "Wrong size on ActionIconWidget_C_SetActionName");
static_assert(offsetof(ActionIconWidget_C_SetActionName, NewActionName) == 0x000000, "Member 'ActionIconWidget_C_SetActionName::NewActionName' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_SetActionName, Value) == 0x000008, "Member 'ActionIconWidget_C_SetActionName::Value' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_SetActionName, CallFunc_NotEqual_NameName_ReturnValue) == 0x00000C, "Member 'ActionIconWidget_C_SetActionName::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");

// Function ActionIconWidget.ActionIconWidget_C.RefreshActionIcon
// 0x0108 (0x0108 - 0x0000)
struct ActionIconWidget_C_RefreshActionIcon final
{
public:
	struct FKey                                   CurrentKey;                                        // 0x0000(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsMouseButton_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWiderInputTexture_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC1[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionKeyMapping                 CallFunc_GetInputBinding_ReturnValue;              // 0x0028(0x0028)()
	bool                                          CallFunc_IsActionMappingValid_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC2[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping;             // 0x0058(0x0028)()
	bool                                          CallFunc_IsAxisMappingValid_ReturnValue;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC3[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetKeyFName_ReturnValue;                  // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC4[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0098(0x0018)()
	class FName                                   CallFunc_GetKeyFName_ReturnValue_1;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC5[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC6[0x6];                                     // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_4;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_5;        // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AC7[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetGamepadInputTextureFromKey_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC8[0x1];                                     // 0x00F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetKeyFName_ReturnValue_2;                // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_6;        // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_7;        // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_8;        // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_9;        // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_10;       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_11;       // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_12;       // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionIconWidget_C_RefreshActionIcon) == 0x000008, "Wrong alignment on ActionIconWidget_C_RefreshActionIcon");
static_assert(sizeof(ActionIconWidget_C_RefreshActionIcon) == 0x000108, "Wrong size on ActionIconWidget_C_RefreshActionIcon");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CurrentKey) == 0x000000, "Member 'ActionIconWidget_C_RefreshActionIcon::CurrentKey' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_BooleanAND_ReturnValue) == 0x000019, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_BooleanAND_ReturnValue_1) == 0x00001A, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00001C, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_Key_IsMouseButton_ReturnValue) == 0x000020, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_Key_IsMouseButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_IsWiderInputTexture_ReturnValue) == 0x000021, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_IsWiderInputTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_GetInputBinding_ReturnValue) == 0x000028, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_GetInputBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_IsActionMappingValid_ReturnValue) == 0x000050, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_IsActionMappingValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, K2Node_MakeStruct_InputAxisKeyMapping) == 0x000058, "Member 'ActionIconWidget_C_RefreshActionIcon::K2Node_MakeStruct_InputAxisKeyMapping' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_IsAxisMappingValid_ReturnValue) == 0x000080, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_IsAxisMappingValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_GetKeyFName_ReturnValue) == 0x000084, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_GetKeyFName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_BooleanOR_ReturnValue_1) == 0x00008C, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00008D, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x00008E, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, Temp_bool_Variable) == 0x00008F, "Member 'ActionIconWidget_C_RefreshActionIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, Temp_byte_Variable) == 0x000090, "Member 'ActionIconWidget_C_RefreshActionIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_Key_GetDisplayName_ReturnValue) == 0x000098, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_Key_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_GetKeyFName_ReturnValue_1) == 0x0000B0, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_GetKeyFName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B8, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x0000C8, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_Len_ReturnValue) == 0x0000CC, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D0, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_EqualEqual_NameName_ReturnValue_3) == 0x0000D1, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_EqualEqual_NameName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, K2Node_Select_Default) == 0x0000D8, "Member 'ActionIconWidget_C_RefreshActionIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_EqualEqual_NameName_ReturnValue_4) == 0x0000E0, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_EqualEqual_NameName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_EqualEqual_NameName_ReturnValue_5) == 0x0000E1, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_EqualEqual_NameName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_GetGamepadInputTextureFromKey_ReturnValue) == 0x0000E8, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_GetGamepadInputTextureFromKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_Key_IsGamepadKey_ReturnValue) == 0x0000F1, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_Key_IsGamepadKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, Temp_byte_Variable_1) == 0x0000F2, "Member 'ActionIconWidget_C_RefreshActionIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_GetKeyFName_ReturnValue_2) == 0x0000F4, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_GetKeyFName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_EqualEqual_NameName_ReturnValue_6) == 0x0000FC, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_EqualEqual_NameName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_EqualEqual_NameName_ReturnValue_7) == 0x0000FD, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_EqualEqual_NameName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_EqualEqual_NameName_ReturnValue_8) == 0x0000FE, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_EqualEqual_NameName_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_EqualEqual_NameName_ReturnValue_9) == 0x0000FF, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_EqualEqual_NameName_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_EqualEqual_NameName_ReturnValue_10) == 0x000100, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_EqualEqual_NameName_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_EqualEqual_NameName_ReturnValue_11) == 0x000101, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_EqualEqual_NameName_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, CallFunc_EqualEqual_NameName_ReturnValue_12) == 0x000102, "Member 'ActionIconWidget_C_RefreshActionIcon::CallFunc_EqualEqual_NameName_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, Temp_bool_Variable_1) == 0x000103, "Member 'ActionIconWidget_C_RefreshActionIcon::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_RefreshActionIcon, K2Node_Select_Default_1) == 0x000104, "Member 'ActionIconWidget_C_RefreshActionIcon::K2Node_Select_Default_1' has a wrong offset!");

// Function ActionIconWidget.ActionIconWidget_C.ShowContainer
// 0x0048 (0x0048 - 0x0000)
struct ActionIconWidget_C_ShowContainer final
{
public:
	class UPanelWidget*                           Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC9[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ACA[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPanelWidget*>                   K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ACB[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionIconWidget_C_ShowContainer) == 0x000008, "Wrong alignment on ActionIconWidget_C_ShowContainer");
static_assert(sizeof(ActionIconWidget_C_ShowContainer) == 0x000048, "Wrong size on ActionIconWidget_C_ShowContainer");
static_assert(offsetof(ActionIconWidget_C_ShowContainer, Container) == 0x000000, "Member 'ActionIconWidget_C_ShowContainer::Container' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ShowContainer, Temp_byte_Variable) == 0x000008, "Member 'ActionIconWidget_C_ShowContainer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ShowContainer, Temp_byte_Variable_1) == 0x000009, "Member 'ActionIconWidget_C_ShowContainer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ShowContainer, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'ActionIconWidget_C_ShowContainer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ShowContainer, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'ActionIconWidget_C_ShowContainer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ShowContainer, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'ActionIconWidget_C_ShowContainer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ShowContainer, Temp_bool_Variable) == 0x000018, "Member 'ActionIconWidget_C_ShowContainer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ShowContainer, K2Node_MakeArray_Array) == 0x000020, "Member 'ActionIconWidget_C_ShowContainer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ShowContainer, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'ActionIconWidget_C_ShowContainer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ShowContainer, CallFunc_Array_Get_Item) == 0x000038, "Member 'ActionIconWidget_C_ShowContainer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ShowContainer, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'ActionIconWidget_C_ShowContainer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ShowContainer, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000041, "Member 'ActionIconWidget_C_ShowContainer::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ShowContainer, K2Node_Select_Default) == 0x000042, "Member 'ActionIconWidget_C_ShowContainer::K2Node_Select_Default' has a wrong offset!");

// Function ActionIconWidget.ActionIconWidget_C.SetDesiredHeight
// 0x0004 (0x0004 - 0x0000)
struct ActionIconWidget_C_SetDesiredHeight final
{
public:
	float                                         Param_DesiredHeight;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionIconWidget_C_SetDesiredHeight) == 0x000004, "Wrong alignment on ActionIconWidget_C_SetDesiredHeight");
static_assert(sizeof(ActionIconWidget_C_SetDesiredHeight) == 0x000004, "Wrong size on ActionIconWidget_C_SetDesiredHeight");
static_assert(offsetof(ActionIconWidget_C_SetDesiredHeight, Param_DesiredHeight) == 0x000000, "Member 'ActionIconWidget_C_SetDesiredHeight::Param_DesiredHeight' has a wrong offset!");

// Function ActionIconWidget.ActionIconWidget_C.UpdateSize
// 0x0004 (0x0004 - 0x0000)
struct ActionIconWidget_C_UpdateSize final
{
public:
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionIconWidget_C_UpdateSize) == 0x000004, "Wrong alignment on ActionIconWidget_C_UpdateSize");
static_assert(sizeof(ActionIconWidget_C_UpdateSize) == 0x000004, "Wrong size on ActionIconWidget_C_UpdateSize");
static_assert(offsetof(ActionIconWidget_C_UpdateSize, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000000, "Member 'ActionIconWidget_C_UpdateSize::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function ActionIconWidget.ActionIconWidget_C.SetWidgetVisible
// 0x0018 (0x0018 - 0x0000)
struct ActionIconWidget_C_SetWidgetVisible final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWidgetClipping                               Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetClipping                               Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ACC[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetClipping                               K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActionIconWidget_C_SetWidgetVisible) == 0x000008, "Wrong alignment on ActionIconWidget_C_SetWidgetVisible");
static_assert(sizeof(ActionIconWidget_C_SetWidgetVisible) == 0x000018, "Wrong size on ActionIconWidget_C_SetWidgetVisible");
static_assert(offsetof(ActionIconWidget_C_SetWidgetVisible, Widget) == 0x000000, "Member 'ActionIconWidget_C_SetWidgetVisible::Widget' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_SetWidgetVisible, Temp_bool_Variable) == 0x000008, "Member 'ActionIconWidget_C_SetWidgetVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_SetWidgetVisible, Temp_byte_Variable) == 0x000009, "Member 'ActionIconWidget_C_SetWidgetVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_SetWidgetVisible, Temp_byte_Variable_1) == 0x00000A, "Member 'ActionIconWidget_C_SetWidgetVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_SetWidgetVisible, CallFunc_Array_AddUnique_ReturnValue) == 0x00000C, "Member 'ActionIconWidget_C_SetWidgetVisible::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_SetWidgetVisible, K2Node_Select_Default) == 0x000010, "Member 'ActionIconWidget_C_SetWidgetVisible::K2Node_Select_Default' has a wrong offset!");

// Function ActionIconWidget.ActionIconWidget_C.ResetVisibleIcons
// 0x0020 (0x0020 - 0x0000)
struct ActionIconWidget_C_ResetVisibleIcons final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ACD[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionIconWidget_C_ResetVisibleIcons) == 0x000008, "Wrong alignment on ActionIconWidget_C_ResetVisibleIcons");
static_assert(sizeof(ActionIconWidget_C_ResetVisibleIcons) == 0x000020, "Wrong size on ActionIconWidget_C_ResetVisibleIcons");
static_assert(offsetof(ActionIconWidget_C_ResetVisibleIcons, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ActionIconWidget_C_ResetVisibleIcons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ResetVisibleIcons, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ActionIconWidget_C_ResetVisibleIcons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ResetVisibleIcons, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ActionIconWidget_C_ResetVisibleIcons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ResetVisibleIcons, CallFunc_Array_Get_Item) == 0x000010, "Member 'ActionIconWidget_C_ResetVisibleIcons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ResetVisibleIcons, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'ActionIconWidget_C_ResetVisibleIcons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ResetVisibleIcons, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'ActionIconWidget_C_ResetVisibleIcons::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_ResetVisibleIcons, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'ActionIconWidget_C_ResetVisibleIcons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ActionIconWidget.ActionIconWidget_C.SetHoldRequirement
// 0x0002 (0x0002 - 0x0000)
struct ActionIconWidget_C_SetHoldRequirement final
{
public:
	bool                                          RequiresHold;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActionIconWidget_C_SetHoldRequirement) == 0x000001, "Wrong alignment on ActionIconWidget_C_SetHoldRequirement");
static_assert(sizeof(ActionIconWidget_C_SetHoldRequirement) == 0x000002, "Wrong size on ActionIconWidget_C_SetHoldRequirement");
static_assert(offsetof(ActionIconWidget_C_SetHoldRequirement, RequiresHold) == 0x000000, "Member 'ActionIconWidget_C_SetHoldRequirement::RequiresHold' has a wrong offset!");
static_assert(offsetof(ActionIconWidget_C_SetHoldRequirement, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'ActionIconWidget_C_SetHoldRequirement::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

}

