#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActiveEffectEntryWidget

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ActiveEffectEntryWidget.ActiveEffectEntryWidget_C.ExecuteUbergraph_ActiveEffectEntryWidget
// 0x0060 (0x0060 - 0x0000)
struct ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CF5[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerTime_ReturnValue;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CF6[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CF7[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget) == 0x000008, "Wrong alignment on ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget");
static_assert(sizeof(ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget) == 0x000060, "Wrong size on ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget");
static_assert(offsetof(ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget, EntryPoint) == 0x000000, "Member 'ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget, K2Node_Event_MyGeometry) == 0x000008, "Member 'ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget, K2Node_Event_InDeltaTime) == 0x000040, "Member 'ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget, CallFunc_GetServerTime_ReturnValue) == 0x000044, "Member 'ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget::CallFunc_GetServerTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000048, "Member 'ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00004C, "Member 'ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000050, "Member 'ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000058, "Member 'ActiveEffectEntryWidget_C_ExecuteUbergraph_ActiveEffectEntryWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function ActiveEffectEntryWidget.ActiveEffectEntryWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct ActiveEffectEntryWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ActiveEffectEntryWidget_C_Tick) == 0x000004, "Wrong alignment on ActiveEffectEntryWidget_C_Tick");
static_assert(sizeof(ActiveEffectEntryWidget_C_Tick) == 0x00003C, "Wrong size on ActiveEffectEntryWidget_C_Tick");
static_assert(offsetof(ActiveEffectEntryWidget_C_Tick, MyGeometry) == 0x000000, "Member 'ActiveEffectEntryWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'ActiveEffectEntryWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function ActiveEffectEntryWidget.ActiveEffectEntryWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActiveEffectEntryWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActiveEffectEntryWidget_C_PreConstruct) == 0x000001, "Wrong alignment on ActiveEffectEntryWidget_C_PreConstruct");
static_assert(sizeof(ActiveEffectEntryWidget_C_PreConstruct) == 0x000001, "Wrong size on ActiveEffectEntryWidget_C_PreConstruct");
static_assert(offsetof(ActiveEffectEntryWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ActiveEffectEntryWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ActiveEffectEntryWidget.ActiveEffectEntryWidget_C.Setup
// 0x0080 (0x0080 - 0x0000)
struct ActiveEffectEntryWidget_C_Setup final
{
public:
	class FName                                   Param_EffectId;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_UntilServerTime;                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_DisplayValue;                                // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CF8[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBUIEffectDisplayData                 CallFunc_Map_Find_Value;                           // 0x0020(0x0030)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CF9[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0058(0x0028)()
};
static_assert(alignof(ActiveEffectEntryWidget_C_Setup) == 0x000008, "Wrong alignment on ActiveEffectEntryWidget_C_Setup");
static_assert(sizeof(ActiveEffectEntryWidget_C_Setup) == 0x000080, "Wrong size on ActiveEffectEntryWidget_C_Setup");
static_assert(offsetof(ActiveEffectEntryWidget_C_Setup, Param_EffectId) == 0x000000, "Member 'ActiveEffectEntryWidget_C_Setup::Param_EffectId' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_Setup, Param_UntilServerTime) == 0x000008, "Member 'ActiveEffectEntryWidget_C_Setup::Param_UntilServerTime' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_Setup, Param_DisplayValue) == 0x00000C, "Member 'ActiveEffectEntryWidget_C_Setup::Param_DisplayValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_Setup, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000010, "Member 'ActiveEffectEntryWidget_C_Setup::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_Setup, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'ActiveEffectEntryWidget_C_Setup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_Setup, CallFunc_Map_Find_Value) == 0x000020, "Member 'ActiveEffectEntryWidget_C_Setup::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_Setup, CallFunc_Map_Find_ReturnValue) == 0x000050, "Member 'ActiveEffectEntryWidget_C_Setup::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_Setup, K2Node_MakeStruct_SlateColor) == 0x000058, "Member 'ActiveEffectEntryWidget_C_Setup::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function ActiveEffectEntryWidget.ActiveEffectEntryWidget_C.UpdateText
// 0x0108 (0x0108 - 0x0000)
struct ActiveEffectEntryWidget_C_UpdateText final
{
public:
	float                                         CallFunc_GetServerTime_ReturnValue;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_1;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CFA[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0058(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CFB[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBUIEffectDisplayData                 CallFunc_Map_Find_Value;                           // 0x00B8(0x0030)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CFC[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
};
static_assert(alignof(ActiveEffectEntryWidget_C_UpdateText) == 0x000008, "Wrong alignment on ActiveEffectEntryWidget_C_UpdateText");
static_assert(sizeof(ActiveEffectEntryWidget_C_UpdateText) == 0x000108, "Wrong size on ActiveEffectEntryWidget_C_UpdateText");
static_assert(offsetof(ActiveEffectEntryWidget_C_UpdateText, CallFunc_GetServerTime_ReturnValue) == 0x000000, "Member 'ActiveEffectEntryWidget_C_UpdateText::CallFunc_GetServerTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_UpdateText, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'ActiveEffectEntryWidget_C_UpdateText::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_UpdateText, CallFunc_FCeil_ReturnValue) == 0x000008, "Member 'ActiveEffectEntryWidget_C_UpdateText::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_UpdateText, CallFunc_FCeil_ReturnValue_1) == 0x00000C, "Member 'ActiveEffectEntryWidget_C_UpdateText::CallFunc_FCeil_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_UpdateText, CallFunc_Abs_Int_ReturnValue) == 0x000010, "Member 'ActiveEffectEntryWidget_C_UpdateText::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_UpdateText, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'ActiveEffectEntryWidget_C_UpdateText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_UpdateText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000058, "Member 'ActiveEffectEntryWidget_C_UpdateText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_UpdateText, K2Node_MakeArray_Array) == 0x000098, "Member 'ActiveEffectEntryWidget_C_UpdateText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_UpdateText, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x0000A8, "Member 'ActiveEffectEntryWidget_C_UpdateText::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_UpdateText, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'ActiveEffectEntryWidget_C_UpdateText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_UpdateText, CallFunc_Map_Find_Value) == 0x0000B8, "Member 'ActiveEffectEntryWidget_C_UpdateText::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_UpdateText, CallFunc_Map_Find_ReturnValue) == 0x0000E8, "Member 'ActiveEffectEntryWidget_C_UpdateText::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(ActiveEffectEntryWidget_C_UpdateText, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'ActiveEffectEntryWidget_C_UpdateText::CallFunc_Format_ReturnValue' has a wrong offset!");

}

