#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActiveSkillCountdown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActiveSkillCountdown.ActiveSkillCountdown_C
// 0x0020 (0x0280 - 0x0260)
class UActiveSkillCountdown_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Counter;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_ActiveSkillEntry;                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ARBActiveSkill*                         CurrentActiveSkill;                                // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ActiveSkillCountdown(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void On_AS_Cooldown_State_Changed(bool IsInCooldown, class ARBActiveSkill* NewActiveSkill);
	void UpdateCounter();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActiveSkillCountdown_C">();
	}
	static class UActiveSkillCountdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActiveSkillCountdown_C>();
	}
};
static_assert(alignof(UActiveSkillCountdown_C) == 0x000008, "Wrong alignment on UActiveSkillCountdown_C");
static_assert(sizeof(UActiveSkillCountdown_C) == 0x000280, "Wrong size on UActiveSkillCountdown_C");
static_assert(offsetof(UActiveSkillCountdown_C, UberGraphFrame) == 0x000260, "Member 'UActiveSkillCountdown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActiveSkillCountdown_C, Counter) == 0x000268, "Member 'UActiveSkillCountdown_C::Counter' has a wrong offset!");
static_assert(offsetof(UActiveSkillCountdown_C, InvalidationBox_ActiveSkillEntry) == 0x000270, "Member 'UActiveSkillCountdown_C::InvalidationBox_ActiveSkillEntry' has a wrong offset!");
static_assert(offsetof(UActiveSkillCountdown_C, CurrentActiveSkill) == 0x000278, "Member 'UActiveSkillCountdown_C::CurrentActiveSkill' has a wrong offset!");

}

