#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActiveEffectEntryWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActiveEffectEntryWidget.ActiveEffectEntryWidget_C
// 0x0040 (0x02A0 - 0x0260)
class UActiveEffectEntryWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         Container;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EffectName;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   EffectId;                                          // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UntilServerTime;                                   // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFadeOutPlayed;                                    // 0x0294(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DisplayValue;                                      // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ActiveEffectEntryWidget(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void Setup(class FName EffectId_0, float UntilServerTime_0, float DisplayValue_0);
	void UpdateText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActiveEffectEntryWidget_C">();
	}
	static class UActiveEffectEntryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActiveEffectEntryWidget_C>();
	}
};
static_assert(alignof(UActiveEffectEntryWidget_C) == 0x000008, "Wrong alignment on UActiveEffectEntryWidget_C");
static_assert(sizeof(UActiveEffectEntryWidget_C) == 0x0002A0, "Wrong size on UActiveEffectEntryWidget_C");
static_assert(offsetof(UActiveEffectEntryWidget_C, UberGraphFrame) == 0x000260, "Member 'UActiveEffectEntryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActiveEffectEntryWidget_C, FadeOut) == 0x000268, "Member 'UActiveEffectEntryWidget_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UActiveEffectEntryWidget_C, Container) == 0x000270, "Member 'UActiveEffectEntryWidget_C::Container' has a wrong offset!");
static_assert(offsetof(UActiveEffectEntryWidget_C, EffectName) == 0x000278, "Member 'UActiveEffectEntryWidget_C::EffectName' has a wrong offset!");
static_assert(offsetof(UActiveEffectEntryWidget_C, Icon) == 0x000280, "Member 'UActiveEffectEntryWidget_C::Icon' has a wrong offset!");
static_assert(offsetof(UActiveEffectEntryWidget_C, EffectId) == 0x000288, "Member 'UActiveEffectEntryWidget_C::EffectId' has a wrong offset!");
static_assert(offsetof(UActiveEffectEntryWidget_C, UntilServerTime) == 0x000290, "Member 'UActiveEffectEntryWidget_C::UntilServerTime' has a wrong offset!");
static_assert(offsetof(UActiveEffectEntryWidget_C, bFadeOutPlayed) == 0x000294, "Member 'UActiveEffectEntryWidget_C::bFadeOutPlayed' has a wrong offset!");
static_assert(offsetof(UActiveEffectEntryWidget_C, DisplayValue) == 0x000298, "Member 'UActiveEffectEntryWidget_C::DisplayValue' has a wrong offset!");

}

