#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Alarm_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Alarm_BP.Alarm_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Alarm_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Alarm_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on Alarm_BP_C_ReceiveTick");
static_assert(sizeof(Alarm_BP_C_ReceiveTick) == 0x000004, "Wrong size on Alarm_BP_C_ReceiveTick");
static_assert(offsetof(Alarm_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Alarm_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Alarm_BP.Alarm_BP_C.ToggleOnOff
// 0x0001 (0x0001 - 0x0000)
struct Alarm_BP_C_ToggleOnOff final
{
public:
	bool                                          bAlarmState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Alarm_BP_C_ToggleOnOff) == 0x000001, "Wrong alignment on Alarm_BP_C_ToggleOnOff");
static_assert(sizeof(Alarm_BP_C_ToggleOnOff) == 0x000001, "Wrong size on Alarm_BP_C_ToggleOnOff");
static_assert(offsetof(Alarm_BP_C_ToggleOnOff, bAlarmState) == 0x000000, "Member 'Alarm_BP_C_ToggleOnOff::bAlarmState' has a wrong offset!");

// Function Alarm_BP.Alarm_BP_C.ExecuteUbergraph_Alarm_BP
// 0x0100 (0x0100 - 0x0000)
struct Alarm_BP_C_ExecuteUbergraph_Alarm_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A33[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x002C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_bAlarmState;                    // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A34[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A35[0x2];                                     // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A36[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default_1;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP) == 0x000008, "Wrong alignment on Alarm_BP_C_ExecuteUbergraph_Alarm_BP");
static_assert(sizeof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP) == 0x000100, "Wrong size on Alarm_BP_C_ExecuteUbergraph_Alarm_BP");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, EntryPoint) == 0x000000, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, Temp_struct_Variable) == 0x000004, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, Temp_delegate_Variable) == 0x000014, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, Temp_bool_Variable) == 0x000024, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, CallFunc_HasAuthority_ReturnValue) == 0x000025, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x00002C, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, K2Node_CustomEvent_bAlarmState) == 0x0000B4, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::K2Node_CustomEvent_bAlarmState' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, Temp_struct_Variable_1) == 0x0000B8, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C8, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000D4, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000D8, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, Temp_bool_Variable_1) == 0x0000D9, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, K2Node_Select_Default) == 0x0000DC, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, K2Node_Select_Default_1) == 0x0000F0, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Alarm_BP_C_ExecuteUbergraph_Alarm_BP, CallFunc_PostEventOnActor_ReturnValue) == 0x0000F8, "Member 'Alarm_BP_C_ExecuteUbergraph_Alarm_BP::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");

}

