#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Amplifier_Brain_ActiveSkill_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Amplifier_Brain_ActiveSkill_BP.Amplifier_Brain_ActiveSkill_BP_C
// 0x0020 (0x04A8 - 0x0488)
class AAmplifier_Brain_ActiveSkill_BP_C final : public ARBItemActiveSkill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBSoundComponent*                      RBSound;                                           // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Amplifier_Brain_ActiveSkill_BP(int32 EntryPoint);
	void Event_OnForceDeactivatedEffectTriggered();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Amplifier_Brain_ActiveSkill_BP_C">();
	}
	static class AAmplifier_Brain_ActiveSkill_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAmplifier_Brain_ActiveSkill_BP_C>();
	}
};
static_assert(alignof(AAmplifier_Brain_ActiveSkill_BP_C) == 0x000008, "Wrong alignment on AAmplifier_Brain_ActiveSkill_BP_C");
static_assert(sizeof(AAmplifier_Brain_ActiveSkill_BP_C) == 0x0004A8, "Wrong size on AAmplifier_Brain_ActiveSkill_BP_C");
static_assert(offsetof(AAmplifier_Brain_ActiveSkill_BP_C, UberGraphFrame) == 0x000488, "Member 'AAmplifier_Brain_ActiveSkill_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAmplifier_Brain_ActiveSkill_BP_C, RBSound) == 0x000490, "Member 'AAmplifier_Brain_ActiveSkill_BP_C::RBSound' has a wrong offset!");
static_assert(offsetof(AAmplifier_Brain_ActiveSkill_BP_C, StaticMesh) == 0x000498, "Member 'AAmplifier_Brain_ActiveSkill_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AAmplifier_Brain_ActiveSkill_BP_C, DefaultSceneRoot) == 0x0004A0, "Member 'AAmplifier_Brain_ActiveSkill_BP_C::DefaultSceneRoot' has a wrong offset!");

}

