#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArmWrestling_WinFeedbackWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArmWrestling_WinFeedbackWidget.ArmWrestling_WinFeedbackWidget_C
// 0x0030 (0x0290 - 0x0260)
class UArmWrestling_WinFeedbackWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WinBig;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WinSmall;                                          // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WinMedium;                                         // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_61;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ApplyColor(int32 InputIndex);
	void Construct();
	void ExecuteUbergraph_ArmWrestling_WinFeedbackWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ArmWrestling_WinFeedbackWidget_C">();
	}
	static class UArmWrestling_WinFeedbackWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArmWrestling_WinFeedbackWidget_C>();
	}
};
static_assert(alignof(UArmWrestling_WinFeedbackWidget_C) == 0x000008, "Wrong alignment on UArmWrestling_WinFeedbackWidget_C");
static_assert(sizeof(UArmWrestling_WinFeedbackWidget_C) == 0x000290, "Wrong size on UArmWrestling_WinFeedbackWidget_C");
static_assert(offsetof(UArmWrestling_WinFeedbackWidget_C, UberGraphFrame) == 0x000260, "Member 'UArmWrestling_WinFeedbackWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UArmWrestling_WinFeedbackWidget_C, WinBig) == 0x000268, "Member 'UArmWrestling_WinFeedbackWidget_C::WinBig' has a wrong offset!");
static_assert(offsetof(UArmWrestling_WinFeedbackWidget_C, WinSmall) == 0x000270, "Member 'UArmWrestling_WinFeedbackWidget_C::WinSmall' has a wrong offset!");
static_assert(offsetof(UArmWrestling_WinFeedbackWidget_C, WinMedium) == 0x000278, "Member 'UArmWrestling_WinFeedbackWidget_C::WinMedium' has a wrong offset!");
static_assert(offsetof(UArmWrestling_WinFeedbackWidget_C, Image_61) == 0x000280, "Member 'UArmWrestling_WinFeedbackWidget_C::Image_61' has a wrong offset!");
static_assert(offsetof(UArmWrestling_WinFeedbackWidget_C, Overlay_0) == 0x000288, "Member 'UArmWrestling_WinFeedbackWidget_C::Overlay_0' has a wrong offset!");

}

