#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArmWreslingPanel_BP

#include "Basic.hpp"

#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function ArmWreslingPanel_BP.ArmWreslingPanel_BP_C.TryHideHud
// 0x0018 (0x0018 - 0x0000)
struct ArmWreslingPanel_BP_C_TryHideHud final
{
public:
	class URBHUDWidget*                           CallFunc_GetHUDWidget_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerHud_C*                           K2Node_DynamicCast_AsPlayer_Hud;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ArmWreslingPanel_BP_C_TryHideHud) == 0x000008, "Wrong alignment on ArmWreslingPanel_BP_C_TryHideHud");
static_assert(sizeof(ArmWreslingPanel_BP_C_TryHideHud) == 0x000018, "Wrong size on ArmWreslingPanel_BP_C_TryHideHud");
static_assert(offsetof(ArmWreslingPanel_BP_C_TryHideHud, CallFunc_GetHUDWidget_ReturnValue) == 0x000000, "Member 'ArmWreslingPanel_BP_C_TryHideHud::CallFunc_GetHUDWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_TryHideHud, K2Node_DynamicCast_AsPlayer_Hud) == 0x000008, "Member 'ArmWreslingPanel_BP_C_TryHideHud::K2Node_DynamicCast_AsPlayer_Hud' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_TryHideHud, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ArmWreslingPanel_BP_C_TryHideHud::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_TryHideHud, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'ArmWreslingPanel_BP_C_TryHideHud::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ArmWreslingPanel_BP.ArmWreslingPanel_BP_C.ShowHUD
// 0x0008 (0x0008 - 0x0000)
struct ArmWreslingPanel_BP_C_ShowHUD final
{
public:
	class UArmWrestlingMinigameWidget_C*          CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmWreslingPanel_BP_C_ShowHUD) == 0x000008, "Wrong alignment on ArmWreslingPanel_BP_C_ShowHUD");
static_assert(sizeof(ArmWreslingPanel_BP_C_ShowHUD) == 0x000008, "Wrong size on ArmWreslingPanel_BP_C_ShowHUD");
static_assert(offsetof(ArmWreslingPanel_BP_C_ShowHUD, CallFunc_Create_ReturnValue) == 0x000000, "Member 'ArmWreslingPanel_BP_C_ShowHUD::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function ArmWreslingPanel_BP.ArmWreslingPanel_BP_C.BndEvt__ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_8_OnPanelEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_8_OnPanelEvent__DelegateSignature final
{
public:
	class URBInteractiblePanelComponent*          Panel;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                PawnInteracting;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_8_OnPanelEvent__DelegateSignature) == 0x000008, "Wrong alignment on ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_8_OnPanelEvent__DelegateSignature");
static_assert(sizeof(ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_8_OnPanelEvent__DelegateSignature) == 0x000010, "Wrong size on ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_8_OnPanelEvent__DelegateSignature");
static_assert(offsetof(ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_8_OnPanelEvent__DelegateSignature, Panel) == 0x000000, "Member 'ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_8_OnPanelEvent__DelegateSignature::Panel' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_8_OnPanelEvent__DelegateSignature, PawnInteracting) == 0x000008, "Member 'ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_8_OnPanelEvent__DelegateSignature::PawnInteracting' has a wrong offset!");

// Function ArmWreslingPanel_BP.ArmWreslingPanel_BP_C.BndEvt__ArmWreslingPanel_BP_ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_0_ArmWreslingPanelTauntEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanel_BP_ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_0_ArmWreslingPanelTauntEvent__DelegateSignature final
{
public:
	class ARBPlayer*                              Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanel_BP_ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_0_ArmWreslingPanelTauntEvent__DelegateSignature) == 0x000008, "Wrong alignment on ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanel_BP_ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_0_ArmWreslingPanelTauntEvent__DelegateSignature");
static_assert(sizeof(ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanel_BP_ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_0_ArmWreslingPanelTauntEvent__DelegateSignature) == 0x000008, "Wrong size on ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanel_BP_ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_0_ArmWreslingPanelTauntEvent__DelegateSignature");
static_assert(offsetof(ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanel_BP_ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_0_ArmWreslingPanelTauntEvent__DelegateSignature, Pawn) == 0x000000, "Member 'ArmWreslingPanel_BP_C_BndEvt__ArmWreslingPanel_BP_ArmWreslingPanelComponent_BP_K2Node_ComponentBoundEvent_0_ArmWreslingPanelTauntEvent__DelegateSignature::Pawn' has a wrong offset!");

// Function ArmWreslingPanel_BP.ArmWreslingPanel_BP_C.CustomEvent_0
// 0x0038 (0x0038 - 0x0000)
struct ArmWreslingPanel_BP_C_CustomEvent_0 final
{
public:
	struct FArmWreslingPlayerRoundData            PlayerRoundData;                                   // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ArmWreslingPanel_BP_C_CustomEvent_0) == 0x000008, "Wrong alignment on ArmWreslingPanel_BP_C_CustomEvent_0");
static_assert(sizeof(ArmWreslingPanel_BP_C_CustomEvent_0) == 0x000038, "Wrong size on ArmWreslingPanel_BP_C_CustomEvent_0");
static_assert(offsetof(ArmWreslingPanel_BP_C_CustomEvent_0, PlayerRoundData) == 0x000000, "Member 'ArmWreslingPanel_BP_C_CustomEvent_0::PlayerRoundData' has a wrong offset!");

// Function ArmWreslingPanel_BP.ArmWreslingPanel_BP_C.ExecuteUbergraph_ArmWreslingPanel_BP
// 0x00E0 (0x00E0 - 0x0000)
struct ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3889[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URBInteractiblePanelComponent*          K2Node_ComponentBoundEvent_panel;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_ComponentBoundEvent_pawnInteracting;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388A[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_DynamicCast_AsRB_Player;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsFlaggedAsFakePlayer_ReturnValue;     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388B[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_ComponentBoundEvent_pawn;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_DynamicCast_AsRB_Player_1;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388C[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGhostAnimInstance*                   CallFunc_GetGhostAnimBP_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArmWreslingPanel_GhostAnimBP_C*        K2Node_DynamicCast_AsArm_Wresling_Panel_Ghost_Anim_BP; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388D[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                CallFunc_GetPawnInteracting_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_DynamicCast_AsRB_Player_2;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlledOrSpectated_ReturnValue; // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388E[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FArmWreslingPlayerRoundData            K2Node_CustomEvent_playerRoundData;                // 0x0078(0x0038)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388F[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGhostAnimInstance*                   CallFunc_GetGhostAnimBP_ReturnValue_1;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3890[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UArmWreslingPanel_GhostAnimBP_C*        K2Node_DynamicCast_AsArm_Wresling_Panel_Ghost_Anim_BP_1; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3891[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP) == 0x000008, "Wrong alignment on ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP");
static_assert(sizeof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP) == 0x0000E0, "Wrong size on ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, EntryPoint) == 0x000000, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, K2Node_ComponentBoundEvent_panel) == 0x000008, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::K2Node_ComponentBoundEvent_panel' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, K2Node_ComponentBoundEvent_pawnInteracting) == 0x000010, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::K2Node_ComponentBoundEvent_pawnInteracting' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, K2Node_DynamicCast_AsRB_Player) == 0x000020, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::K2Node_DynamicCast_AsRB_Player' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, CallFunc_BP_IsFlaggedAsFakePlayer_ReturnValue) == 0x000029, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::CallFunc_BP_IsFlaggedAsFakePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, K2Node_ComponentBoundEvent_pawn) == 0x000030, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::K2Node_ComponentBoundEvent_pawn' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, K2Node_DynamicCast_AsRB_Player_1) == 0x000038, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::K2Node_DynamicCast_AsRB_Player_1' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, CallFunc_GetGhostAnimBP_ReturnValue) == 0x000048, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::CallFunc_GetGhostAnimBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, K2Node_DynamicCast_AsArm_Wresling_Panel_Ghost_Anim_BP) == 0x000050, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::K2Node_DynamicCast_AsArm_Wresling_Panel_Ghost_Anim_BP' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, CallFunc_GetPawnInteracting_ReturnValue) == 0x000060, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::CallFunc_GetPawnInteracting_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, K2Node_DynamicCast_AsRB_Player_2) == 0x000068, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::K2Node_DynamicCast_AsRB_Player_2' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, K2Node_DynamicCast_bSuccess_3) == 0x000070, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, CallFunc_IsLocallyControlledOrSpectated_ReturnValue) == 0x000071, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::CallFunc_IsLocallyControlledOrSpectated_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, K2Node_CustomEvent_playerRoundData) == 0x000078, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::K2Node_CustomEvent_playerRoundData' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, CallFunc_BooleanAND_ReturnValue) == 0x0000B0, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, CallFunc_GetGhostAnimBP_ReturnValue_1) == 0x0000B8, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::CallFunc_GetGhostAnimBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, K2Node_DynamicCast_AsArm_Wresling_Panel_Ghost_Anim_BP_1) == 0x0000C8, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::K2Node_DynamicCast_AsArm_Wresling_Panel_Ghost_Anim_BP_1' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, K2Node_DynamicCast_bSuccess_4) == 0x0000D0, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D4, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'ArmWreslingPanel_BP_C_ExecuteUbergraph_ArmWreslingPanel_BP::CallFunc_Array_Get_Item' has a wrong offset!");

}

