#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackToLobbyMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BackToLobbyMenu.BackToLobbyMenu_C.ExecuteUbergraph_BackToLobbyMenu
// 0x0050 (0x0050 - 0x0000)
struct BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EBE[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EBF[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button_2;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button_1;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsGamepad;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu) == 0x000008, "Wrong alignment on BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu");
static_assert(sizeof(BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu) == 0x000050, "Wrong size on BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu");
static_assert(offsetof(BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu, EntryPoint) == 0x000000, "Member 'BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu, Temp_bool_Variable) == 0x000004, "Member 'BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu, Temp_byte_Variable) == 0x000018, "Member 'BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu, Temp_byte_Variable_1) == 0x000019, "Member 'BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu, K2Node_ComponentBoundEvent_Button_2) == 0x000020, "Member 'BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu, K2Node_ComponentBoundEvent_Button_1) == 0x000028, "Member 'BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu, K2Node_ComponentBoundEvent_Button) == 0x000040, "Member 'BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu, K2Node_Event_bIsGamepad) == 0x000048, "Member 'BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu::K2Node_Event_bIsGamepad' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu, K2Node_Select_Default) == 0x000049, "Member 'BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x00004A, "Member 'BackToLobbyMenu_C_ExecuteUbergraph_BackToLobbyMenu::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");

// Function BackToLobbyMenu.BackToLobbyMenu_C.Event_InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct BackToLobbyMenu_C_Event_InputSourceChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BackToLobbyMenu_C_Event_InputSourceChanged) == 0x000001, "Wrong alignment on BackToLobbyMenu_C_Event_InputSourceChanged");
static_assert(sizeof(BackToLobbyMenu_C_Event_InputSourceChanged) == 0x000001, "Wrong size on BackToLobbyMenu_C_Event_InputSourceChanged");
static_assert(offsetof(BackToLobbyMenu_C_Event_InputSourceChanged, bIsGamepad) == 0x000000, "Member 'BackToLobbyMenu_C_Event_InputSourceChanged::bIsGamepad' has a wrong offset!");

// Function BackToLobbyMenu.BackToLobbyMenu_C.BndEvt__BackToLobbyMenu_BackBtn_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BackToLobbyMenu_C_BndEvt__BackToLobbyMenu_BackBtn_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BackToLobbyMenu_C_BndEvt__BackToLobbyMenu_BackBtn_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BackToLobbyMenu_C_BndEvt__BackToLobbyMenu_BackBtn_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature");
static_assert(sizeof(BackToLobbyMenu_C_BndEvt__BackToLobbyMenu_BackBtn_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BackToLobbyMenu_C_BndEvt__BackToLobbyMenu_BackBtn_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature");
static_assert(offsetof(BackToLobbyMenu_C_BndEvt__BackToLobbyMenu_BackBtn_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'BackToLobbyMenu_C_BndEvt__BackToLobbyMenu_BackBtn_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function BackToLobbyMenu.BackToLobbyMenu_C.BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BackToLobbyMenu_C_BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BackToLobbyMenu_C_BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BackToLobbyMenu_C_BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(BackToLobbyMenu_C_BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BackToLobbyMenu_C_BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(BackToLobbyMenu_C_BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'BackToLobbyMenu_C_BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function BackToLobbyMenu.BackToLobbyMenu_C.BndEvt__ReturnAloneBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BackToLobbyMenu_C_BndEvt__ReturnAloneBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BackToLobbyMenu_C_BndEvt__ReturnAloneBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BackToLobbyMenu_C_BndEvt__ReturnAloneBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(sizeof(BackToLobbyMenu_C_BndEvt__ReturnAloneBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BackToLobbyMenu_C_BndEvt__ReturnAloneBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(offsetof(BackToLobbyMenu_C_BndEvt__ReturnAloneBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'BackToLobbyMenu_C_BndEvt__ReturnAloneBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function BackToLobbyMenu.BackToLobbyMenu_C.AreButtonsEnabled
// 0x0005 (0x0005 - 0x0000)
struct BackToLobbyMenu_C_AreButtonsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOperationPending_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLeaving_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BackToLobbyMenu_C_AreButtonsEnabled) == 0x000001, "Wrong alignment on BackToLobbyMenu_C_AreButtonsEnabled");
static_assert(sizeof(BackToLobbyMenu_C_AreButtonsEnabled) == 0x000005, "Wrong size on BackToLobbyMenu_C_AreButtonsEnabled");
static_assert(offsetof(BackToLobbyMenu_C_AreButtonsEnabled, ReturnValue) == 0x000000, "Member 'BackToLobbyMenu_C_AreButtonsEnabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_AreButtonsEnabled, CallFunc_IsOperationPending_ReturnValue) == 0x000001, "Member 'BackToLobbyMenu_C_AreButtonsEnabled::CallFunc_IsOperationPending_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_AreButtonsEnabled, CallFunc_IsLeaving_ReturnValue) == 0x000002, "Member 'BackToLobbyMenu_C_AreButtonsEnabled::CallFunc_IsLeaving_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_AreButtonsEnabled, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'BackToLobbyMenu_C_AreButtonsEnabled::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_AreButtonsEnabled, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'BackToLobbyMenu_C_AreButtonsEnabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BackToLobbyMenu.BackToLobbyMenu_C.IsLeaveWithPartyEnabled
// 0x0004 (0x0004 - 0x0000)
struct BackToLobbyMenu_C_IsLeaveWithPartyEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AreButtonsEnabled_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanReturnWithParty_ReturnValue;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BackToLobbyMenu_C_IsLeaveWithPartyEnabled) == 0x000001, "Wrong alignment on BackToLobbyMenu_C_IsLeaveWithPartyEnabled");
static_assert(sizeof(BackToLobbyMenu_C_IsLeaveWithPartyEnabled) == 0x000004, "Wrong size on BackToLobbyMenu_C_IsLeaveWithPartyEnabled");
static_assert(offsetof(BackToLobbyMenu_C_IsLeaveWithPartyEnabled, ReturnValue) == 0x000000, "Member 'BackToLobbyMenu_C_IsLeaveWithPartyEnabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_IsLeaveWithPartyEnabled, CallFunc_AreButtonsEnabled_ReturnValue) == 0x000001, "Member 'BackToLobbyMenu_C_IsLeaveWithPartyEnabled::CallFunc_AreButtonsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_IsLeaveWithPartyEnabled, CallFunc_CanReturnWithParty_ReturnValue) == 0x000002, "Member 'BackToLobbyMenu_C_IsLeaveWithPartyEnabled::CallFunc_CanReturnWithParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_IsLeaveWithPartyEnabled, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'BackToLobbyMenu_C_IsLeaveWithPartyEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BackToLobbyMenu.BackToLobbyMenu_C.GetWarningText
// 0x0020 (0x0020 - 0x0000)
struct BackToLobbyMenu_C_GetWarningText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	bool                                          CallFunc_IsInTutorialStage_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLeaving_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BackToLobbyMenu_C_GetWarningText) == 0x000008, "Wrong alignment on BackToLobbyMenu_C_GetWarningText");
static_assert(sizeof(BackToLobbyMenu_C_GetWarningText) == 0x000020, "Wrong size on BackToLobbyMenu_C_GetWarningText");
static_assert(offsetof(BackToLobbyMenu_C_GetWarningText, Text) == 0x000000, "Member 'BackToLobbyMenu_C_GetWarningText::Text' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_GetWarningText, CallFunc_IsInTutorialStage_ReturnValue) == 0x000018, "Member 'BackToLobbyMenu_C_GetWarningText::CallFunc_IsInTutorialStage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_GetWarningText, CallFunc_IsLeaving_ReturnValue) == 0x000019, "Member 'BackToLobbyMenu_C_GetWarningText::CallFunc_IsLeaving_ReturnValue' has a wrong offset!");

// Function BackToLobbyMenu.BackToLobbyMenu_C.UpdateControlVisibility
// 0x0018 (0x0018 - 0x0000)
struct BackToLobbyMenu_C_UpdateControlVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC0[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOperationPending_ReturnValue;           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLeaving_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BackToLobbyMenu_C_UpdateControlVisibility) == 0x000008, "Wrong alignment on BackToLobbyMenu_C_UpdateControlVisibility");
static_assert(sizeof(BackToLobbyMenu_C_UpdateControlVisibility) == 0x000018, "Wrong size on BackToLobbyMenu_C_UpdateControlVisibility");
static_assert(offsetof(BackToLobbyMenu_C_UpdateControlVisibility, Temp_bool_Variable) == 0x000000, "Member 'BackToLobbyMenu_C_UpdateControlVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateControlVisibility, Temp_byte_Variable) == 0x000001, "Member 'BackToLobbyMenu_C_UpdateControlVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateControlVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'BackToLobbyMenu_C_UpdateControlVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateControlVisibility, CallFunc_GetMenuManager_ReturnValue) == 0x000008, "Member 'BackToLobbyMenu_C_UpdateControlVisibility::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateControlVisibility, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000010, "Member 'BackToLobbyMenu_C_UpdateControlVisibility::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateControlVisibility, K2Node_Select_Default) == 0x000011, "Member 'BackToLobbyMenu_C_UpdateControlVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateControlVisibility, CallFunc_IsOperationPending_ReturnValue) == 0x000012, "Member 'BackToLobbyMenu_C_UpdateControlVisibility::CallFunc_IsOperationPending_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateControlVisibility, CallFunc_IsLeaving_ReturnValue) == 0x000013, "Member 'BackToLobbyMenu_C_UpdateControlVisibility::CallFunc_IsLeaving_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateControlVisibility, CallFunc_BooleanOR_ReturnValue) == 0x000014, "Member 'BackToLobbyMenu_C_UpdateControlVisibility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BackToLobbyMenu.BackToLobbyMenu_C.UpdateShowWithPartyVisibility
// 0x0058 (0x0058 - 0x0000)
struct BackToLobbyMenu_C_UpdateShowWithPartyVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EC1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanReturnWithParty_ReturnValue;           // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC2[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0040(0x0018)()
};
static_assert(alignof(BackToLobbyMenu_C_UpdateShowWithPartyVisibility) == 0x000008, "Wrong alignment on BackToLobbyMenu_C_UpdateShowWithPartyVisibility");
static_assert(sizeof(BackToLobbyMenu_C_UpdateShowWithPartyVisibility) == 0x000058, "Wrong size on BackToLobbyMenu_C_UpdateShowWithPartyVisibility");
static_assert(offsetof(BackToLobbyMenu_C_UpdateShowWithPartyVisibility, Temp_bool_Variable) == 0x000000, "Member 'BackToLobbyMenu_C_UpdateShowWithPartyVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateShowWithPartyVisibility, Temp_text_Variable) == 0x000008, "Member 'BackToLobbyMenu_C_UpdateShowWithPartyVisibility::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateShowWithPartyVisibility, Temp_text_Variable_1) == 0x000020, "Member 'BackToLobbyMenu_C_UpdateShowWithPartyVisibility::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateShowWithPartyVisibility, Temp_bool_Variable_1) == 0x000038, "Member 'BackToLobbyMenu_C_UpdateShowWithPartyVisibility::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateShowWithPartyVisibility, Temp_byte_Variable) == 0x000039, "Member 'BackToLobbyMenu_C_UpdateShowWithPartyVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateShowWithPartyVisibility, Temp_byte_Variable_1) == 0x00003A, "Member 'BackToLobbyMenu_C_UpdateShowWithPartyVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateShowWithPartyVisibility, CallFunc_CanReturnWithParty_ReturnValue) == 0x00003B, "Member 'BackToLobbyMenu_C_UpdateShowWithPartyVisibility::CallFunc_CanReturnWithParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateShowWithPartyVisibility, K2Node_Select_Default) == 0x00003C, "Member 'BackToLobbyMenu_C_UpdateShowWithPartyVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateShowWithPartyVisibility, K2Node_Select_Default_1) == 0x000040, "Member 'BackToLobbyMenu_C_UpdateShowWithPartyVisibility::K2Node_Select_Default_1' has a wrong offset!");

// Function BackToLobbyMenu.BackToLobbyMenu_C.UpdateLoadingWidgetVisibility
// 0x0003 (0x0003 - 0x0000)
struct BackToLobbyMenu_C_UpdateLoadingWidgetVisibility final
{
public:
	bool                                          CallFunc_IsOperationPending_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLeaving_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BackToLobbyMenu_C_UpdateLoadingWidgetVisibility) == 0x000001, "Wrong alignment on BackToLobbyMenu_C_UpdateLoadingWidgetVisibility");
static_assert(sizeof(BackToLobbyMenu_C_UpdateLoadingWidgetVisibility) == 0x000003, "Wrong size on BackToLobbyMenu_C_UpdateLoadingWidgetVisibility");
static_assert(offsetof(BackToLobbyMenu_C_UpdateLoadingWidgetVisibility, CallFunc_IsOperationPending_ReturnValue) == 0x000000, "Member 'BackToLobbyMenu_C_UpdateLoadingWidgetVisibility::CallFunc_IsOperationPending_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateLoadingWidgetVisibility, CallFunc_IsLeaving_ReturnValue) == 0x000001, "Member 'BackToLobbyMenu_C_UpdateLoadingWidgetVisibility::CallFunc_IsLeaving_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateLoadingWidgetVisibility, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'BackToLobbyMenu_C_UpdateLoadingWidgetVisibility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BackToLobbyMenu.BackToLobbyMenu_C.UpdateWarningText
// 0x0048 (0x0048 - 0x0000)
struct BackToLobbyMenu_C_UpdateWarningText final
{
public:
	bool                                          CallFunc_IsOperationPending_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLeaving_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EC3[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetWarningText_text;                      // 0x0008(0x0018)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EC4[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0028(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BackToLobbyMenu_C_UpdateWarningText) == 0x000008, "Wrong alignment on BackToLobbyMenu_C_UpdateWarningText");
static_assert(sizeof(BackToLobbyMenu_C_UpdateWarningText) == 0x000048, "Wrong size on BackToLobbyMenu_C_UpdateWarningText");
static_assert(offsetof(BackToLobbyMenu_C_UpdateWarningText, CallFunc_IsOperationPending_ReturnValue) == 0x000000, "Member 'BackToLobbyMenu_C_UpdateWarningText::CallFunc_IsOperationPending_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateWarningText, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BackToLobbyMenu_C_UpdateWarningText::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackToLobbyMenu_C_UpdateWarningText, CallFunc_IsLeaving_ReturnValue) == 0x000002, "Member 'BackToLobbyMenu_C_UpdateWarningText::CallFunc_IsLeaving_ReturnValue' has a wrong offset!");
