#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackgroundCharacter_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BackgroundCharacter_AnimBP.BackgroundCharacter_AnimBP_C
// 0x18D0 (0x1C50 - 0x0380)
class UBackgroundCharacter_AnimBP_C final : public URBAnimInstanceBackgroundCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x03B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x03E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0408(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0430(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0458(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0480(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x04A8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x04D0(0x00A8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x0578(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x0660(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x06E0(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x0710(0x00A8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x07B8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x0860(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x08E0(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0960(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0988(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x09B0(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x0A98(0x00A8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x0B40(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0BE8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0C68(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0CE8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x0D18(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0E00(0x00A8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0EA8(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0F50(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0FD0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1050(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1080(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1100(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1180(0x00A8)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x1228(0x0190)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x13B8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x13E8(0x0080)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x1468(0x0190)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x15F8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1628(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x16D8(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1708(0x00A8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x17B0(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1898(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1918(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1948(0x00A8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x19F0(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1AD8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1B58(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1B88(0x00B0)()
	bool                                          IsLookingAt;                                       // 0x1C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAlert;                                           // 0x1C39(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAGuard;                                          // 0x1C3A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CE0[0x1];                                     // 0x1C3B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LookAtHorizontal;                                  // 0x1C3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookAtVertical;                                    // 0x1C40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookAtAlpha_0;                                     // 0x1C44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnGround;                                          // 0x1C48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_BackgroundCharacter_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BackgroundCharacter_AnimBP_C">();
	}
	static class UBackgroundCharacter_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBackgroundCharacter_AnimBP_C>();
	}
};
static_assert(alignof(UBackgroundCharacter_AnimBP_C) == 0x000010, "Wrong alignment on UBackgroundCharacter_AnimBP_C");
static_assert(sizeof(UBackgroundCharacter_AnimBP_C) == 0x001C50, "Wrong size on UBackgroundCharacter_AnimBP_C");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, UberGraphFrame) == 0x000380, "Member 'UBackgroundCharacter_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_Root) == 0x000388, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x0003B8, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x0003E0, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x000408, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x000430, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x000458, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x000480, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x0004A8, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendListByBool_9) == 0x0004D0, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendListByBool_9' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendSpacePlayer_4) == 0x000578, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendSpacePlayer_4' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_SequencePlayer_11) == 0x000660, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_StateResult_7) == 0x0006E0, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendListByBool_8) == 0x000710, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendListByBool_8' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendListByBool_7) == 0x0007B8, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendListByBool_7' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_SequencePlayer_10) == 0x000860, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_SequencePlayer_9) == 0x0008E0, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000960, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_TransitionResult) == 0x000988, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendSpacePlayer_3) == 0x0009B0, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendSpacePlayer_3' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendListByBool_6) == 0x000A98, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendListByBool_6' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendListByBool_5) == 0x000B40, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_SequencePlayer_8) == 0x000BE8, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x000C68, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_StateResult_6) == 0x000CE8, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendSpacePlayer_2) == 0x000D18, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x000E00, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x000EA8, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x000F50, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x000FD0, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_StateResult_5) == 0x001050, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x001080, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x001100, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x001180, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace_1) == 0x001228, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace_1' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_StateResult_4) == 0x0013B8, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x0013E8, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x001468, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_StateResult_3) == 0x0015F8, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x001628, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_StateResult_2) == 0x0016D8, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x001708, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x0017B0, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x001898, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_StateResult_1) == 0x001918, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x001948, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x0019F0, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x001AD8, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_StateResult) == 0x001B58, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, AnimGraphNode_StateMachine) == 0x001B88, "Member 'UBackgroundCharacter_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, IsLookingAt) == 0x001C38, "Member 'UBackgroundCharacter_AnimBP_C::IsLookingAt' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, IsAlert) == 0x001C39, "Member 'UBackgroundCharacter_AnimBP_C::IsAlert' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, IsAGuard) == 0x001C3A, "Member 'UBackgroundCharacter_AnimBP_C::IsAGuard' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, LookAtHorizontal) == 0x001C3C, "Member 'UBackgroundCharacter_AnimBP_C::LookAtHorizontal' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, LookAtVertical) == 0x001C40, "Member 'UBackgroundCharacter_AnimBP_C::LookAtVertical' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, LookAtAlpha_0) == 0x001C44, "Member 'UBackgroundCharacter_AnimBP_C::LookAtAlpha_0' has a wrong offset!");
static_assert(offsetof(UBackgroundCharacter_AnimBP_C, OnGround) == 0x001C48, "Member 'UBackgroundCharacter_AnimBP_C::OnGround' has a wrong offset!");

}

