#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Barlow_Catalogue_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Barlow_Catalogue_AnimBP.Barlow_Catalogue_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Barlow_Catalogue_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Barlow_Catalogue_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Barlow_Catalogue_AnimBP_C_AnimGraph");
static_assert(sizeof(Barlow_Catalogue_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Barlow_Catalogue_AnimBP_C_AnimGraph");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Barlow_Catalogue_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Barlow_Catalogue_AnimBP.Barlow_Catalogue_AnimBP_C.ExecuteUbergraph_Barlow_Catalogue_AnimBP
// 0x0030 (0x0030 - 0x0000)
struct Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29F7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29F8[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_LastReset_Variable;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStageResetCount_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29F9[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP) == 0x000008, "Wrong alignment on Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP");
static_assert(sizeof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP) == 0x000030, "Wrong size on Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, EntryPoint) == 0x000000, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue) == 0x000008, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, Temp_bool_IsClosed_Variable) == 0x000010, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, Temp_int_LastReset_Variable) == 0x000014, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::Temp_int_LastReset_Variable' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, CallFunc_GetStageResetCount_ReturnValue) == 0x000018, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::CallFunc_GetStageResetCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00001C, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001E, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x00001F, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x000020, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, CallFunc_Not_PreBool_ReturnValue_2) == 0x000021, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, CallFunc_BooleanAND_ReturnValue_2) == 0x000022, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, CallFunc_Not_PreBool_ReturnValue_3) == 0x000023, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, CallFunc_BooleanAND_ReturnValue_3) == 0x000024, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000028, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP, CallFunc_Less_FloatFloat_ReturnValue) == 0x00002C, "Member 'Barlow_Catalogue_AnimBP_C_ExecuteUbergraph_Barlow_Catalogue_AnimBP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

