#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Barlow_Novel_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Barlow_Novel_AnimBP.Barlow_Novel_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Barlow_Novel_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Barlow_Novel_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Barlow_Novel_AnimBP_C_AnimGraph");
static_assert(sizeof(Barlow_Novel_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Barlow_Novel_AnimBP_C_AnimGraph");
static_assert(offsetof(Barlow_Novel_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Barlow_Novel_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Barlow_Novel_AnimBP.Barlow_Novel_AnimBP_C.ExecuteUbergraph_Barlow_Novel_AnimBP
// 0x0010 (0x0010 - 0x0000)
struct Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP) == 0x000004, "Wrong alignment on Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP");
static_assert(sizeof(Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP) == 0x000010, "Wrong size on Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP");
static_assert(offsetof(Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP, EntryPoint) == 0x000000, "Member 'Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x000008, "Member 'Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP, CallFunc_Less_FloatFloat_ReturnValue) == 0x00000C, "Member 'Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00000D, "Member 'Barlow_Novel_AnimBP_C_ExecuteUbergraph_Barlow_Novel_AnimBP::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");

}

