#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseConfirmCancelPopupWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BaseConfirmCancelPopupWidget.BaseConfirmCancelPopupWidget_C
// 0x00C0 (0x03F8 - 0x0338)
class UBaseConfirmCancelPopupWidget_C : public URBPopUpConfirmCancelWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        CancelMenuButton;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        ConfirmMenuButton;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line;                                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_1;                                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PopUpIconImage;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         PopupText;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleTxt;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            PopUpTint;                                         // 0x0380(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             PopUpIcon;                                         // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DefaultTitle;                                      // 0x03B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DefaultConfirmTxt;                                 // 0x03C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DefaultCancelTxt;                                  // 0x03E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BaseConfirmCancelPopupWidget(int32 EntryPoint);
	void OninputChanged();
	void Destruct();
	void BndEvt__CancelMenuButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void Event_InitializePopup(const class FText& TitleText, const class FText& MainText, const class FText& ConfirmText, const class FText& CancelText);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetConfrmSound(class UAkAudioEvent* Sound);
	void SetCancelSound(class UAkAudioEvent* Sound);
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BaseConfirmCancelPopupWidget_C">();
	}
	static class UBaseConfirmCancelPopupWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseConfirmCancelPopupWidget_C>();
	}
};
static_assert(alignof(UBaseConfirmCancelPopupWidget_C) == 0x000008, "Wrong alignment on UBaseConfirmCancelPopupWidget_C");
static_assert(sizeof(UBaseConfirmCancelPopupWidget_C) == 0x0003F8, "Wrong size on UBaseConfirmCancelPopupWidget_C");
static_assert(offsetof(UBaseConfirmCancelPopupWidget_C, UberGraphFrame) == 0x000338, "Member 'UBaseConfirmCancelPopupWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBaseConfirmCancelPopupWidget_C, Background) == 0x000340, "Member 'UBaseConfirmCancelPopupWidget_C::Background' has a wrong offset!");
static_assert(offsetof(UBaseConfirmCancelPopupWidget_C, CancelMenuButton) == 0x000348, "Member 'UBaseConfirmCancelPopupWidget_C::CancelMenuButton' has a wrong offset!");
static_assert(offsetof(UBaseConfirmCancelPopupWidget_C, ConfirmMenuButton) == 0x000350, "Member 'UBaseConfirmCancelPopupWidget_C::ConfirmMenuButton' has a wrong offset!");
static_assert(offsetof(UBaseConfirmCancelPopupWidget_C, Line) == 0x000358, "Member 'UBaseConfirmCancelPopupWidget_C::Line' has a wrong offset!");
static_assert(offsetof(UBaseConfirmCancelPopupWidget_C, Line_1) == 0x000360, "Member 'UBaseConfirmCancelPopupWidget_C::Line_1' has a wrong offset!");
static_assert(offsetof(UBaseConfirmCancelPopupWidget_C, PopUpIconImage) == 0x000368, "Member 'UBaseConfirmCancelPopupWidget_C::PopUpIconImage' has a wrong offset!");
static_assert(offsetof(UBaseConfirmCancelPopupWidget_C, PopupText) == 0x000370, "Member 'UBaseConfirmCancelPopupWidget_C::PopupText' has a wrong offset!");
static_assert(offsetof(UBaseConfirmCancelPopupWidget_C, TitleTxt) == 0x000378, "Member 'UBaseConfirmCancelPopupWidget_C::TitleTxt' has a wrong offset!");
static_assert(offsetof(UBaseConfirmCancelPopupWidget_C, PopUpTint) == 0x000380, "Member 'UBaseConfirmCancelPopupWidget_C::PopUpTint' has a wrong offset!");
static_assert(offsetof(UBaseConfirmCancelPopupWidget_C, PopUpIcon) == 0x0003A8, "Member 'UBaseConfirmCancelPopupWidget_C::PopUpIcon' has a wrong offset!");
static_assert(offsetof(UBaseConfirmCancelPopupWidget_C, DefaultTitle) == 0x0003B0, "Member 'UBaseConfirmCancelPopupWidget_C::DefaultTitle' has a wrong offset!");
static_assert(offsetof(UBaseConfirmCancelPopupWidget_C, DefaultConfirmTxt) == 0x0003C8, "Member 'UBaseConfirmCancelPopupWidget_C::DefaultConfirmTxt' has a wrong offset!");
static_assert(offsetof(UBaseConfirmCancelPopupWidget_C, DefaultCancelTxt) == 0x0003E0, "Member 'UBaseConfirmCancelPopupWidget_C::DefaultCancelTxt' has a wrong offset!");

}

