#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseOptionsEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BaseOptionsEntry.BaseOptionsEntry_C.ExecuteUbergraph_BaseOptionsEntry
// 0x0040 (0x0040 - 0x0000)
struct BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C81[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_newTitle;                             // 0x0008(0x0018)(ConstParm)
	class FText                                   K2Node_Event_newValue;                             // 0x0020(0x0018)(ConstParm)
	bool                                          K2Node_Event_forceUpdateSlider;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSlider_ReturnValue;                     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSubButton_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSlider_ReturnValue_1;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSubButton_ReturnValue_1;                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanNOR_ReturnValue_1;                 // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry) == 0x000008, "Wrong alignment on BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry");
static_assert(sizeof(BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry) == 0x000040, "Wrong size on BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry");
static_assert(offsetof(BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry, EntryPoint) == 0x000000, "Member 'BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry, K2Node_Event_newTitle) == 0x000008, "Member 'BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry::K2Node_Event_newTitle' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry, K2Node_Event_newValue) == 0x000020, "Member 'BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry::K2Node_Event_newValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry, K2Node_Event_forceUpdateSlider) == 0x000038, "Member 'BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry::K2Node_Event_forceUpdateSlider' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry, CallFunc_IsSlider_ReturnValue) == 0x000039, "Member 'BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry::CallFunc_IsSlider_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry, CallFunc_IsSubButton_ReturnValue) == 0x00003A, "Member 'BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry::CallFunc_IsSubButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry, CallFunc_BooleanNOR_ReturnValue) == 0x00003B, "Member 'BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry, CallFunc_IsSlider_ReturnValue_1) == 0x00003C, "Member 'BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry::CallFunc_IsSlider_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry, CallFunc_IsSubButton_ReturnValue_1) == 0x00003D, "Member 'BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry::CallFunc_IsSubButton_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry, CallFunc_BooleanNOR_ReturnValue_1) == 0x00003E, "Member 'BaseOptionsEntry_C_ExecuteUbergraph_BaseOptionsEntry::CallFunc_BooleanNOR_ReturnValue_1' has a wrong offset!");

// Function BaseOptionsEntry.BaseOptionsEntry_C.RefreshValue
// 0x0001 (0x0001 - 0x0000)
struct BaseOptionsEntry_C_RefreshValue final
{
public:
	bool                                          ForceUpdateSlider;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseOptionsEntry_C_RefreshValue) == 0x000001, "Wrong alignment on BaseOptionsEntry_C_RefreshValue");
static_assert(sizeof(BaseOptionsEntry_C_RefreshValue) == 0x000001, "Wrong size on BaseOptionsEntry_C_RefreshValue");
static_assert(offsetof(BaseOptionsEntry_C_RefreshValue, ForceUpdateSlider) == 0x000000, "Member 'BaseOptionsEntry_C_RefreshValue::ForceUpdateSlider' has a wrong offset!");

// Function BaseOptionsEntry.BaseOptionsEntry_C.Event_UpdateSubButtonText
// 0x0018 (0x0018 - 0x0000)
struct BaseOptionsEntry_C_Event_UpdateSubButtonText final
{
public:
	class FText                                   NewValue;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BaseOptionsEntry_C_Event_UpdateSubButtonText) == 0x000008, "Wrong alignment on BaseOptionsEntry_C_Event_UpdateSubButtonText");
static_assert(sizeof(BaseOptionsEntry_C_Event_UpdateSubButtonText) == 0x000018, "Wrong size on BaseOptionsEntry_C_Event_UpdateSubButtonText");
static_assert(offsetof(BaseOptionsEntry_C_Event_UpdateSubButtonText, NewValue) == 0x000000, "Member 'BaseOptionsEntry_C_Event_UpdateSubButtonText::NewValue' has a wrong offset!");

// Function BaseOptionsEntry.BaseOptionsEntry_C.Event_UpdateTitle
// 0x0018 (0x0018 - 0x0000)
struct BaseOptionsEntry_C_Event_UpdateTitle final
{
public:
	class FText                                   NewTitle;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BaseOptionsEntry_C_Event_UpdateTitle) == 0x000008, "Wrong alignment on BaseOptionsEntry_C_Event_UpdateTitle");
static_assert(sizeof(BaseOptionsEntry_C_Event_UpdateTitle) == 0x000018, "Wrong size on BaseOptionsEntry_C_Event_UpdateTitle");
static_assert(offsetof(BaseOptionsEntry_C_Event_UpdateTitle, NewTitle) == 0x000000, "Member 'BaseOptionsEntry_C_Event_UpdateTitle::NewTitle' has a wrong offset!");

// Function BaseOptionsEntry.BaseOptionsEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BaseOptionsEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseOptionsEntry_C_PreConstruct) == 0x000001, "Wrong alignment on BaseOptionsEntry_C_PreConstruct");
static_assert(sizeof(BaseOptionsEntry_C_PreConstruct) == 0x000001, "Wrong size on BaseOptionsEntry_C_PreConstruct");
static_assert(offsetof(BaseOptionsEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BaseOptionsEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BaseOptionsEntry.BaseOptionsEntry_C.UpdateEnableStatus
// 0x0001 (0x0001 - 0x0000)
struct BaseOptionsEntry_C_UpdateEnableStatus final
{
public:
	bool                                          CallFunc_CanBeDisplayed_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseOptionsEntry_C_UpdateEnableStatus) == 0x000001, "Wrong alignment on BaseOptionsEntry_C_UpdateEnableStatus");
static_assert(sizeof(BaseOptionsEntry_C_UpdateEnableStatus) == 0x000001, "Wrong size on BaseOptionsEntry_C_UpdateEnableStatus");
static_assert(offsetof(BaseOptionsEntry_C_UpdateEnableStatus, CallFunc_CanBeDisplayed_ReturnValue) == 0x000000, "Member 'BaseOptionsEntry_C_UpdateEnableStatus::CallFunc_CanBeDisplayed_ReturnValue' has a wrong offset!");

// Function BaseOptionsEntry.BaseOptionsEntry_C.TrySetupCounter
// 0x0003 (0x0003 - 0x0000)
struct BaseOptionsEntry_C_TrySetupCounter final
{
public:
	bool                                          CallFunc_IsSubButton_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSlider_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseOptionsEntry_C_TrySetupCounter) == 0x000001, "Wrong alignment on BaseOptionsEntry_C_TrySetupCounter");
static_assert(sizeof(BaseOptionsEntry_C_TrySetupCounter) == 0x000003, "Wrong size on BaseOptionsEntry_C_TrySetupCounter");
static_assert(offsetof(BaseOptionsEntry_C_TrySetupCounter, CallFunc_IsSubButton_ReturnValue) == 0x000000, "Member 'BaseOptionsEntry_C_TrySetupCounter::CallFunc_IsSubButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_TrySetupCounter, CallFunc_IsSlider_ReturnValue) == 0x000001, "Member 'BaseOptionsEntry_C_TrySetupCounter::CallFunc_IsSlider_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_TrySetupCounter, CallFunc_BooleanNOR_ReturnValue) == 0x000002, "Member 'BaseOptionsEntry_C_TrySetupCounter::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");

// Function BaseOptionsEntry.BaseOptionsEntry_C.OnKeyDown
// 0x03D8 (0x03D8 - 0x0000)
struct BaseOptionsEntry_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          LeftPressed;                                       // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C82[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0130(0x00B8)()
	struct FInputEvent                            CallFunc_GetInputEventFromKeyEvent_ReturnValue;    // 0x01E8(0x0018)()
	bool                                          CallFunc_InputEvent_IsRepeat_ReturnValue;          // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C83[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowButton_C*                         CallFunc_GetArrowBtn_ArrowButton;                  // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C84[0x7];                                     // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowButton_C*                         CallFunc_GetArrowBtn_ArrowButton_1;                // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINavigation                                 CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue; // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C85[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputEvent                            CallFunc_GetInputEventFromKeyEvent_ReturnValue_1;  // 0x0228(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InputEvent_IsRepeat_ReturnValue_1;        // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C86[0x3];                                     // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowButton_C*                         CallFunc_GetArrowBtn_ArrowButton_2;                // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArrowButton_C*                         CallFunc_GetArrowBtn_ArrowButton_3;                // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSlider_ReturnValue;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSubButton_ReturnValue;                  // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x025B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanBeEdited_ReturnValue;                  // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C87[0x3];                                     // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0260(0x00B8)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C88[0x6];                                     // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x0320(0x00B8)()
};
static_assert(alignof(BaseOptionsEntry_C_OnKeyDown) == 0x000008, "Wrong alignment on BaseOptionsEntry_C_OnKeyDown");
static_assert(sizeof(BaseOptionsEntry_C_OnKeyDown) == 0x0003D8, "Wrong size on BaseOptionsEntry_C_OnKeyDown");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'BaseOptionsEntry_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'BaseOptionsEntry_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'BaseOptionsEntry_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, LeftPressed) == 0x000128, "Member 'BaseOptionsEntry_C_OnKeyDown::LeftPressed' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000130, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_GetInputEventFromKeyEvent_ReturnValue) == 0x0001E8, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_GetInputEventFromKeyEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_InputEvent_IsRepeat_ReturnValue) == 0x000200, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_InputEvent_IsRepeat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_GetArrowBtn_ArrowButton) == 0x000208, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_GetArrowBtn_ArrowButton' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_Not_PreBool_ReturnValue) == 0x000210, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_GetArrowBtn_ArrowButton_1) == 0x000218, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_GetArrowBtn_ArrowButton_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue) == 0x000220, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_GetInputEventFromKeyEvent_ReturnValue_1) == 0x000228, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_GetInputEventFromKeyEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000240, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_InputEvent_IsRepeat_ReturnValue_1) == 0x000241, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_InputEvent_IsRepeat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000242, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_BooleanOR_ReturnValue) == 0x000243, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_Not_PreBool_ReturnValue_1) == 0x000244, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_GetArrowBtn_ArrowButton_2) == 0x000248, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_GetArrowBtn_ArrowButton_2' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_GetArrowBtn_ArrowButton_3) == 0x000250, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_GetArrowBtn_ArrowButton_3' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_IsSlider_ReturnValue) == 0x000258, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_IsSlider_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_Not_PreBool_ReturnValue_2) == 0x000259, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_IsSubButton_ReturnValue) == 0x00025A, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_IsSubButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_Not_PreBool_ReturnValue_3) == 0x00025B, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_CanBeEdited_ReturnValue) == 0x00025C, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_CanBeEdited_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000260, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_BooleanAND_ReturnValue) == 0x000318, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_BooleanAND_ReturnValue_1) == 0x000319, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyDown, CallFunc_Handled_ReturnValue_1) == 0x000320, "Member 'BaseOptionsEntry_C_OnKeyDown::CallFunc_Handled_ReturnValue_1' has a wrong offset!");

// Function BaseOptionsEntry.BaseOptionsEntry_C.OnKeyUp
// 0x02C0 (0x02C0 - 0x0000)
struct BaseOptionsEntry_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsSubButton_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanBeEdited_ReturnValue;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUINavigation                                 CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue; // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C89[0x3];                                     // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0130(0x00B8)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C8A[0x6];                                     // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01F0(0x00B8)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C8B[0x6];                                     // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowButton_C*                         CallFunc_GetArrowBtn_ArrowButton;                  // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArrowButton_C*                         CallFunc_GetArrowBtn_ArrowButton_1;                // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseOptionsEntry_C_OnKeyUp) == 0x000008, "Wrong alignment on BaseOptionsEntry_C_OnKeyUp");
static_assert(sizeof(BaseOptionsEntry_C_OnKeyUp) == 0x0002C0, "Wrong size on BaseOptionsEntry_C_OnKeyUp");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'BaseOptionsEntry_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, InKeyEvent) == 0x000038, "Member 'BaseOptionsEntry_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, ReturnValue) == 0x000070, "Member 'BaseOptionsEntry_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, CallFunc_IsSubButton_ReturnValue) == 0x000128, "Member 'BaseOptionsEntry_C_OnKeyUp::CallFunc_IsSubButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, CallFunc_CanBeEdited_ReturnValue) == 0x000129, "Member 'BaseOptionsEntry_C_OnKeyUp::CallFunc_CanBeEdited_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, CallFunc_Not_PreBool_ReturnValue) == 0x00012A, "Member 'BaseOptionsEntry_C_OnKeyUp::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, CallFunc_BooleanAND_ReturnValue) == 0x00012B, "Member 'BaseOptionsEntry_C_OnKeyUp::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue) == 0x00012C, "Member 'BaseOptionsEntry_C_OnKeyUp::CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, CallFunc_Unhandled_ReturnValue) == 0x000130, "Member 'BaseOptionsEntry_C_OnKeyUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001E8, "Member 'BaseOptionsEntry_C_OnKeyUp::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001E9, "Member 'BaseOptionsEntry_C_OnKeyUp::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, CallFunc_Handled_ReturnValue) == 0x0001F0, "Member 'BaseOptionsEntry_C_OnKeyUp::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, CallFunc_BooleanOR_ReturnValue) == 0x0002A8, "Member 'BaseOptionsEntry_C_OnKeyUp::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, CallFunc_BooleanAND_ReturnValue_1) == 0x0002A9, "Member 'BaseOptionsEntry_C_OnKeyUp::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, CallFunc_GetArrowBtn_ArrowButton) == 0x0002B0, "Member 'BaseOptionsEntry_C_OnKeyUp::CallFunc_GetArrowBtn_ArrowButton' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnKeyUp, CallFunc_GetArrowBtn_ArrowButton_1) == 0x0002B8, "Member 'BaseOptionsEntry_C_OnKeyUp::CallFunc_GetArrowBtn_ArrowButton_1' has a wrong offset!");

// Function BaseOptionsEntry.BaseOptionsEntry_C.OnAnalogValueChanged
// 0x0508 (0x0508 - 0x0000)
struct BaseOptionsEntry_C_OnAnalogValueChanged final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FAnalogInputEvent                      InAnalogInputEvent;                                // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          bIsRepeatInput;                                    // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCanRepeatInput;                                   // 0x0131(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLeftPressed;                                      // 0x0132(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C8C[0x1];                                     // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnalogValue_ReturnValue;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C8D[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C8E[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue; // 0x0148(0x0038)()
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0180(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSlider_ReturnValue;                     // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C8F[0x2];                                     // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetElapsedTime_ReturnValue;               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C90[0x3];                                     // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTime_ReturnValue;                  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTime_ReturnValue_1;                // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetElapsedTime_ReturnValue_1;             // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C91[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C92[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowButton_C*                         CallFunc_GetArrowBtn_ArrowButton;                  // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArrowButton_C*                         CallFunc_GetArrowBtn_ArrowButton_1;                // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArrowButton_C*                         CallFunc_GetArrowBtn_ArrowButton_2;                // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetElapsedTime_ReturnValue_2;             // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C93[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowButton_C*                         CallFunc_GetArrowBtn_ArrowButton_3;                // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnalogValue_ReturnValue_1;             // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_2;                        // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0200(0x00B8)()
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C94[0x1];                                     // 0x02BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_3;                        // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSubButton_ReturnValue;                  // 0x02C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanBeEdited_ReturnValue;                  // 0x02C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C95[0x6];                                     // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue_1;                  // 0x02D0(0x00B8)()
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSlider_ReturnValue_1;                   // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C96[0x6];                                     // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue_2;                  // 0x0390(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C97[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0450(0x00B8)()
};
static_assert(alignof(BaseOptionsEntry_C_OnAnalogValueChanged) == 0x000008, "Wrong alignment on BaseOptionsEntry_C_OnAnalogValueChanged");
static_assert(sizeof(BaseOptionsEntry_C_OnAnalogValueChanged) == 0x000508, "Wrong size on BaseOptionsEntry_C_OnAnalogValueChanged");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, MyGeometry) == 0x000000, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::MyGeometry' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, InAnalogInputEvent) == 0x000038, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::InAnalogInputEvent' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, ReturnValue) == 0x000078, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, bIsRepeatInput) == 0x000130, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::bIsRepeatInput' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, bCanRepeatInput) == 0x000131, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::bCanRepeatInput' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, bLeftPressed) == 0x000132, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::bLeftPressed' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, Temp_float_Variable) == 0x000134, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_GetAnalogValue_ReturnValue) == 0x000138, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_GetAnalogValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Less_FloatFloat_ReturnValue) == 0x00013C, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Abs_ReturnValue) == 0x000140, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000144, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue) == 0x000148, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_GetKey_ReturnValue) == 0x000180, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000198, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_IsSlider_ReturnValue) == 0x000199, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_IsSlider_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_GetElapsedTime_ReturnValue) == 0x00019C, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_GetElapsedTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001A0, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_FFloor_ReturnValue) == 0x0001A4, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Abs_ReturnValue_1) == 0x0001A8, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Max_ReturnValue) == 0x0001AC, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x0001B0, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_GetGameTime_ReturnValue) == 0x0001B4, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_GetGameTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_GetGameTime_ReturnValue_1) == 0x0001B8, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_GetGameTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_GetElapsedTime_ReturnValue_1) == 0x0001BC, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_GetElapsedTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0001C0, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, Temp_float_Variable_1) == 0x0001C4, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Not_PreBool_ReturnValue) == 0x0001C8, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_GetArrowBtn_ArrowButton) == 0x0001D0, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_GetArrowBtn_ArrowButton' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_GetArrowBtn_ArrowButton_1) == 0x0001D8, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_GetArrowBtn_ArrowButton_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_GetArrowBtn_ArrowButton_2) == 0x0001E0, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_GetArrowBtn_ArrowButton_2' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_GetElapsedTime_ReturnValue_2) == 0x0001E8, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_GetElapsedTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_GetArrowBtn_ArrowButton_3) == 0x0001F0, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_GetArrowBtn_ArrowButton_3' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_GetAnalogValue_ReturnValue_1) == 0x0001F8, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_GetAnalogValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Abs_ReturnValue_2) == 0x0001FC, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Unhandled_ReturnValue) == 0x000200, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x0002B8, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_BooleanOR_ReturnValue) == 0x0002B9, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, Temp_bool_Variable) == 0x0002BA, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, K2Node_Select_Default) == 0x0002BC, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Abs_ReturnValue_3) == 0x0002C0, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Abs_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x0002C4, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x0002C5, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_IsSubButton_ReturnValue) == 0x0002C6, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_IsSubButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_CanBeEdited_ReturnValue) == 0x0002C7, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_CanBeEdited_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002C8, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_BooleanAND_ReturnValue) == 0x0002C9, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Unhandled_ReturnValue_1) == 0x0002D0, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Unhandled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_BooleanAND_ReturnValue_1) == 0x000388, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_IsSlider_ReturnValue_1) == 0x000389, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_IsSlider_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Unhandled_ReturnValue_2) == 0x000390, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Unhandled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Not_PreBool_ReturnValue_2) == 0x000448, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_OnAnalogValueChanged, CallFunc_Handled_ReturnValue) == 0x000450, "Member 'BaseOptionsEntry_C_OnAnalogValueChanged::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function BaseOptionsEntry.BaseOptionsEntry_C.GetArrowBtn
// 0x0010 (0x0010 - 0x0000)
struct BaseOptionsEntry_C_GetArrowBtn final
{
public:
	bool                                          Left;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C98[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowButton_C*                         ArrowButton;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseOptionsEntry_C_GetArrowBtn) == 0x000008, "Wrong alignment on BaseOptionsEntry_C_GetArrowBtn");
static_assert(sizeof(BaseOptionsEntry_C_GetArrowBtn) == 0x000010, "Wrong size on BaseOptionsEntry_C_GetArrowBtn");
static_assert(offsetof(BaseOptionsEntry_C_GetArrowBtn, Left) == 0x000000, "Member 'BaseOptionsEntry_C_GetArrowBtn::Left' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_GetArrowBtn, ArrowButton) == 0x000008, "Member 'BaseOptionsEntry_C_GetArrowBtn::ArrowButton' has a wrong offset!");

// Function BaseOptionsEntry.BaseOptionsEntry_C.HandleSliderOnInput
// 0x0008 (0x0008 - 0x0000)
struct BaseOptionsEntry_C_HandleSliderOnInput final
{
public:
	bool                                          bLeftPressed;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C99[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TimeBasedMultiplier;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseOptionsEntry_C_HandleSliderOnInput) == 0x000004, "Wrong alignment on BaseOptionsEntry_C_HandleSliderOnInput");
static_assert(sizeof(BaseOptionsEntry_C_HandleSliderOnInput) == 0x000008, "Wrong size on BaseOptionsEntry_C_HandleSliderOnInput");
static_assert(offsetof(BaseOptionsEntry_C_HandleSliderOnInput, bLeftPressed) == 0x000000, "Member 'BaseOptionsEntry_C_HandleSliderOnInput::bLeftPressed' has a wrong offset!");
static_assert(offsetof(BaseOptionsEntry_C_HandleSliderOnInput, TimeBasedMultiplier) == 0x000004, "Member 'BaseOptionsEntry_C_HandleSliderOnInput::TimeBasedMultiplier' has a wrong offset!");

}

