#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BASE_ElectricalSwitchMinus01_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AnalogOperatableTriggerablesStruct_structs.hpp"


namespace SDK::Params
{

// Function BASE_ElectricalSwitch-01_BP.BASE_ElectricalSwitch-01_BP_C.HasInteractingPawn
// 0x0020 (0x0020 - 0x0000)
struct BASE_ElectricalSwitchMinus01_BP_C_HasInteractingPawn final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARBPawn*>                        CallFunc_BP_GetInteractorPawns_ReturnValue;        // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BASE_ElectricalSwitchMinus01_BP_C_HasInteractingPawn) == 0x000008, "Wrong alignment on BASE_ElectricalSwitchMinus01_BP_C_HasInteractingPawn");
static_assert(sizeof(BASE_ElectricalSwitchMinus01_BP_C_HasInteractingPawn) == 0x000020, "Wrong size on BASE_ElectricalSwitchMinus01_BP_C_HasInteractingPawn");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_HasInteractingPawn, Value) == 0x000000, "Member 'BASE_ElectricalSwitchMinus01_BP_C_HasInteractingPawn::Value' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_HasInteractingPawn, CallFunc_BP_GetInteractorPawns_ReturnValue) == 0x000008, "Member 'BASE_ElectricalSwitchMinus01_BP_C_HasInteractingPawn::CallFunc_BP_GetInteractorPawns_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_HasInteractingPawn, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BASE_ElectricalSwitchMinus01_BP_C_HasInteractingPawn::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_HasInteractingPawn, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'BASE_ElectricalSwitchMinus01_BP_C_HasInteractingPawn::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BASE_ElectricalSwitch-01_BP.BASE_ElectricalSwitch-01_BP_C.UpdateLightMaterial
// 0x0020 (0x0020 - 0x0000)
struct BASE_ElectricalSwitchMinus01_BP_C_UpdateLightMaterial final
{
public:
	int32                                         CurrentLight;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MaterialName;                                      // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D8[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BASE_ElectricalSwitchMinus01_BP_C_UpdateLightMaterial) == 0x000008, "Wrong alignment on BASE_ElectricalSwitchMinus01_BP_C_UpdateLightMaterial");
static_assert(sizeof(BASE_ElectricalSwitchMinus01_BP_C_UpdateLightMaterial) == 0x000020, "Wrong size on BASE_ElectricalSwitchMinus01_BP_C_UpdateLightMaterial");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_UpdateLightMaterial, CurrentLight) == 0x000000, "Member 'BASE_ElectricalSwitchMinus01_BP_C_UpdateLightMaterial::CurrentLight' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_UpdateLightMaterial, MaterialName) == 0x000004, "Member 'BASE_ElectricalSwitchMinus01_BP_C_UpdateLightMaterial::MaterialName' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_UpdateLightMaterial, Material) == 0x000010, "Member 'BASE_ElectricalSwitchMinus01_BP_C_UpdateLightMaterial::Material' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_UpdateLightMaterial, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'BASE_ElectricalSwitchMinus01_BP_C_UpdateLightMaterial::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BASE_ElectricalSwitch-01_BP.BASE_ElectricalSwitch-01_BP_C.SetWaitingForResetCompleted
// 0x0002 (0x0002 - 0x0000)
struct BASE_ElectricalSwitchMinus01_BP_C_SetWaitingForResetCompleted final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BASE_ElectricalSwitchMinus01_BP_C_SetWaitingForResetCompleted) == 0x000001, "Wrong alignment on BASE_ElectricalSwitchMinus01_BP_C_SetWaitingForResetCompleted");
static_assert(sizeof(BASE_ElectricalSwitchMinus01_BP_C_SetWaitingForResetCompleted) == 0x000002, "Wrong size on BASE_ElectricalSwitchMinus01_BP_C_SetWaitingForResetCompleted");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_SetWaitingForResetCompleted, Value) == 0x000000, "Member 'BASE_ElectricalSwitchMinus01_BP_C_SetWaitingForResetCompleted::Value' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_SetWaitingForResetCompleted, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'BASE_ElectricalSwitchMinus01_BP_C_SetWaitingForResetCompleted::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BASE_ElectricalSwitch-01_BP.BASE_ElectricalSwitch-01_BP_C.SetCableHeight
// 0x00C4 (0x00C4 - 0x0000)
struct BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x001C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight) == 0x000004, "Wrong alignment on BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight");
static_assert(sizeof(BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight) == 0x0000C4, "Wrong size on BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight, CallFunc_BreakVector_X) == 0x000004, "Member 'BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight, CallFunc_BreakVector_Y) == 0x000008, "Member 'BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight, CallFunc_BreakVector_Z) == 0x00000C, "Member 'BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00001C, "Member 'BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A4, "Member 'BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight, CallFunc_VSize_ReturnValue) == 0x0000B0, "Member 'BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000B4, "Member 'BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight, CallFunc_MakeVector_ReturnValue_1) == 0x0000B8, "Member 'BASE_ElectricalSwitchMinus01_BP_C_SetCableHeight::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

// Function BASE_ElectricalSwitch-01_BP.BASE_ElectricalSwitch-01_BP_C.UserConstructionScript
// 0x0048 (0x0048 - 0x0000)
struct BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnalogOperatableTriggerablesStruct    CallFunc_Array_Get_Item;                           // 0x0010(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30DA[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnalogOperatableTriggerablesStruct    CallFunc_Array_Get_Item_1;                         // 0x0028(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnalogOperatableTriggerablesStruct    K2Node_MakeStruct_AnalogOperatableTriggerablesStruct; // 0x0038(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript) == 0x000048, "Wrong size on BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000010, "Member 'BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000021, "Member 'BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript, K2Node_MakeStruct_AnalogOperatableTriggerablesStruct) == 0x000038, "Member 'BASE_ElectricalSwitchMinus01_BP_C_UserConstructionScript::K2Node_MakeStruct_AnalogOperatableTriggerablesStruct' has a wrong offset!");

// Function BASE_ElectricalSwitch-01_BP.BASE_ElectricalSwitch-01_BP_C.Event_OnOperationProgressChanged
// 0x0004 (0x0004 - 0x0000)
struct BASE_ElectricalSwitchMinus01_BP_C_Event_OnOperationProgressChanged final
{
public:
	float                                         CurrentProgressRatio;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BASE_ElectricalSwitchMinus01_BP_C_Event_OnOperationProgressChanged) == 0x000004, "Wrong alignment on BASE_ElectricalSwitchMinus01_BP_C_Event_OnOperationProgressChanged");
static_assert(sizeof(BASE_ElectricalSwitchMinus01_BP_C_Event_OnOperationProgressChanged) == 0x000004, "Wrong size on BASE_ElectricalSwitchMinus01_BP_C_Event_OnOperationProgressChanged");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_Event_OnOperationProgressChanged, CurrentProgressRatio) == 0x000000, "Member 'BASE_ElectricalSwitchMinus01_BP_C_Event_OnOperationProgressChanged::CurrentProgressRatio' has a wrong offset!");

// Function BASE_ElectricalSwitch-01_BP.BASE_ElectricalSwitch-01_BP_C.SetTriggerableActivation
// 0x0010 (0x0010 - 0x0000)
struct BASE_ElectricalSwitchMinus01_BP_C_SetTriggerableActivation final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30DB[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBTriggerable*                         RBTriggerable;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BASE_ElectricalSwitchMinus01_BP_C_SetTriggerableActivation) == 0x000008, "Wrong alignment on BASE_ElectricalSwitchMinus01_BP_C_SetTriggerableActivation");
static_assert(sizeof(BASE_ElectricalSwitchMinus01_BP_C_SetTriggerableActivation) == 0x000010, "Wrong size on BASE_ElectricalSwitchMinus01_BP_C_SetTriggerableActivation");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_SetTriggerableActivation, Condition) == 0x000000, "Member 'BASE_ElectricalSwitchMinus01_BP_C_SetTriggerableActivation::Condition' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_SetTriggerableActivation, RBTriggerable) == 0x000008, "Member 'BASE_ElectricalSwitchMinus01_BP_C_SetTriggerableActivation::RBTriggerable' has a wrong offset!");

// Function BASE_ElectricalSwitch-01_BP.BASE_ElectricalSwitch-01_BP_C.Event_OnCompletedOperation
// 0x0010 (0x0010 - 0x0000)
struct BASE_ElectricalSwitchMinus01_BP_C_Event_OnCompletedOperation final
{
public:
	TArray<class ARBPawn*>                        Pawns;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BASE_ElectricalSwitchMinus01_BP_C_Event_OnCompletedOperation) == 0x000008, "Wrong alignment on BASE_ElectricalSwitchMinus01_BP_C_Event_OnCompletedOperation");
static_assert(sizeof(BASE_ElectricalSwitchMinus01_BP_C_Event_OnCompletedOperation) == 0x000010, "Wrong size on BASE_ElectricalSwitchMinus01_BP_C_Event_OnCompletedOperation");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_Event_OnCompletedOperation, Pawns) == 0x000000, "Member 'BASE_ElectricalSwitchMinus01_BP_C_Event_OnCompletedOperation::Pawns' has a wrong offset!");

// Function BASE_ElectricalSwitch-01_BP.BASE_ElectricalSwitch-01_BP_C.ExecuteUbergraph_BASE_ElectricalSwitch-01_BP
// 0x0168 (0x0168 - 0x0000)
struct BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x000C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30DC[0x1];                                     // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_currentProgressRatio;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnalogOperatableTriggerablesStruct    CallFunc_Array_Get_Item;                           // 0x0040(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30DD[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Condition;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30DE[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBTriggerable*                         K2Node_CustomEvent_RBTriggerable;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ARBPawn*>                        K2Node_Event_pawns;                                // 0x0070(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30DF[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnalogOperatableTriggerablesStruct    CallFunc_Array_Get_Item_1;                         // 0x0088(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E0[0x1];                                     // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E1[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x00BC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E2[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventOnActor_ReturnValue_1;           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E3[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x00D8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30E4[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_Map_Find_Value;                           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E5[0x2];                                     // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0104(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_30E6[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys_1;                          // 0x0118(0x0010)(ReferenceParm)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0128(0x0010)(ConstParm, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E7[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasInteractingPawn_value;                 // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E8[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARBPawn*>                        CallFunc_BP_GetInteractorPawns_ReturnValue;        // 0x0150(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasInteractingPawn_value_1;               // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP) == 0x000008, "Wrong alignment on BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP");
static_assert(sizeof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP) == 0x000168, "Wrong size on BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, EntryPoint) == 0x000000, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, Temp_int_Array_Index_Variable_1) == 0x000008, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, Temp_delegate_Variable) == 0x00000C, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_PostEventOnActor_ReturnValue) == 0x00001C, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000034, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000035, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000036, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, K2Node_Event_currentProgressRatio) == 0x000038, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::K2Node_Event_currentProgressRatio' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00003C, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Array_Get_Item) == 0x000040, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Round_ReturnValue) == 0x000050, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000054, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000055, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, Temp_int_Array_Index_Variable_3) == 0x00005C, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000060, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, K2Node_CustomEvent_Condition) == 0x000061, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::K2Node_CustomEvent_Condition' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, K2Node_CustomEvent_RBTriggerable) == 0x000068, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::K2Node_CustomEvent_RBTriggerable' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, K2Node_Event_pawns) == 0x000070, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::K2Node_Event_pawns' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, Temp_int_Loop_Counter_Variable_2) == 0x000080, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000099, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Not_PreBool_ReturnValue_1) == 0x00009A, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Add_IntInt_ReturnValue_2) == 0x00009C, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, Temp_int_Loop_Counter_Variable_3) == 0x0000A4, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A8, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000AC, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000B0, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B4, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000B8, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, Temp_delegate_Variable_1) == 0x0000BC, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000CC, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_PostEventOnActor_ReturnValue_1) == 0x0000D0, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_PostEventOnActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_HasAuthority_ReturnValue) == 0x0000D4, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Map_Keys_Keys) == 0x0000D8, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Array_Get_Item_2) == 0x0000E8, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Array_Length_ReturnValue_2) == 0x0000F0, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Map_Find_Value) == 0x0000F8, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Map_Find_ReturnValue) == 0x000100, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Less_IntInt_ReturnValue_2) == 0x000101, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, Temp_delegate_Variable_2) == 0x000104, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Map_Keys_Keys_1) == 0x000118, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, Temp_struct_Variable) == 0x000128, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Array_Get_Item_3) == 0x000138, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Array_Length_ReturnValue_3) == 0x000140, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Less_IntInt_ReturnValue_3) == 0x000144, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_PostAkEvent_ReturnValue) == 0x000148, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_HasInteractingPawn_value) == 0x00014C, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_HasInteractingPawn_value' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_BP_GetInteractorPawns_ReturnValue) == 0x000150, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_BP_GetInteractorPawns_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Array_Length_ReturnValue_4) == 0x000160, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_Greater_IntInt_ReturnValue) == 0x000164, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP, CallFunc_HasInteractingPawn_value_1) == 0x000165, "Member 'BASE_ElectricalSwitchMinus01_BP_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_BP::CallFunc_HasInteractingPawn_value_1' has a wrong offset!");

// Function BASE_ElectricalSwitch-01_BP.BASE_ElectricalSwitch-01_BP_C.GetInteractionPawnLocation
// 0x00E0 (0x00E0 - 0x0000)
struct BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation final
{
public:
	const class ARBPawn*                          Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  SpecialMove;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30E9[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutLocation;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutDirection;                                      // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30EA[0xB];                                     // 0x0025(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30EB[0xC];                                     // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetWorldTransformFromAnimationAnchorByTransform_outLocation; // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWorldTransformFromAnimationAnchorByTransform_outDirection; // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation) == 0x000010, "Wrong alignment on BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation");
static_assert(sizeof(BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation) == 0x0000E0, "Wrong size on BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation, Pawn) == 0x000000, "Member 'BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation::Pawn' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation, SpecialMove) == 0x000008, "Member 'BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation::SpecialMove' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation, OutLocation) == 0x00000C, "Member 'BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation::OutLocation' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation, OutDirection) == 0x000018, "Member 'BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation::OutDirection' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation, ReturnValue) == 0x000024, "Member 'BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000030, "Member 'BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation, CallFunc_BreakTransform_Location) == 0x000060, "Member 'BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation, CallFunc_BreakTransform_Rotation) == 0x00006C, "Member 'BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation, CallFunc_BreakTransform_Scale) == 0x000078, "Member 'BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation, CallFunc_GetWorldTransformFromAnimationAnchorByTransform_outLocation) == 0x0000C0, "Member 'BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation::CallFunc_GetWorldTransformFromAnimationAnchorByTransform_outLocation' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation, CallFunc_GetWorldTransformFromAnimationAnchorByTransform_outDirection) == 0x0000CC, "Member 'BASE_ElectricalSwitchMinus01_BP_C_GetInteractionPawnLocation::CallFunc_GetWorldTransformFromAnimationAnchorByTransform_outDirection' has a wrong offset!");

// Function BASE_ElectricalSwitch-01_BP.BASE_ElectricalSwitch-01_BP_C.TestPhysicsClearance
// 0x0050 (0x0050 - 0x0000)
struct BASE_ElectricalSwitchMinus01_BP_C_TestPhysicsClearance final
{
public:
	const class ARBPawn*                          InteractorPawn;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30EC[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DefaultTestPhysicsClearance_ReturnValue;  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30ED[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DotProduct2D_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
