#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseAnimatedQuestGiver_BP

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BaseAnimatedQuestGiver_BP.BaseAnimatedQuestGiver_BP_C.Set Playing Storyline
// 0x0001 (0x0001 - 0x0000)
struct BaseAnimatedQuestGiver_BP_C_Set_Playing_Storyline final
{
public:
	bool                                          bPlaying;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseAnimatedQuestGiver_BP_C_Set_Playing_Storyline) == 0x000001, "Wrong alignment on BaseAnimatedQuestGiver_BP_C_Set_Playing_Storyline");
static_assert(sizeof(BaseAnimatedQuestGiver_BP_C_Set_Playing_Storyline) == 0x000001, "Wrong size on BaseAnimatedQuestGiver_BP_C_Set_Playing_Storyline");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_Set_Playing_Storyline, bPlaying) == 0x000000, "Member 'BaseAnimatedQuestGiver_BP_C_Set_Playing_Storyline::bPlaying' has a wrong offset!");

// Function BaseAnimatedQuestGiver_BP.BaseAnimatedQuestGiver_BP_C.SetAnimationParameters
// 0x0028 (0x0028 - 0x0000)
struct BaseAnimatedQuestGiver_BP_C_SetAnimationParameters final
{
public:
	bool                                          Reset;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38B1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuest_AnimBP_C*                        NewParam;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUILevelInfo                           LevelInfo;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayedVoicelineForLastLevelGained_ReturnValue; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseAnimatedQuestGiver_BP_C_SetAnimationParameters) == 0x000008, "Wrong alignment on BaseAnimatedQuestGiver_BP_C_SetAnimationParameters");
static_assert(sizeof(BaseAnimatedQuestGiver_BP_C_SetAnimationParameters) == 0x000028, "Wrong size on BaseAnimatedQuestGiver_BP_C_SetAnimationParameters");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_SetAnimationParameters, Reset) == 0x000000, "Member 'BaseAnimatedQuestGiver_BP_C_SetAnimationParameters::Reset' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_SetAnimationParameters, NewParam) == 0x000008, "Member 'BaseAnimatedQuestGiver_BP_C_SetAnimationParameters::NewParam' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_SetAnimationParameters, LevelInfo) == 0x000010, "Member 'BaseAnimatedQuestGiver_BP_C_SetAnimationParameters::LevelInfo' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_SetAnimationParameters, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BaseAnimatedQuestGiver_BP_C_SetAnimationParameters::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_SetAnimationParameters, CallFunc_HasPlayedVoicelineForLastLevelGained_ReturnValue) == 0x000021, "Member 'BaseAnimatedQuestGiver_BP_C_SetAnimationParameters::CallFunc_HasPlayedVoicelineForLastLevelGained_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_SetAnimationParameters, CallFunc_Not_PreBool_ReturnValue_1) == 0x000022, "Member 'BaseAnimatedQuestGiver_BP_C_SetAnimationParameters::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_SetAnimationParameters, CallFunc_BooleanAND_ReturnValue) == 0x000023, "Member 'BaseAnimatedQuestGiver_BP_C_SetAnimationParameters::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BaseAnimatedQuestGiver_BP.BaseAnimatedQuestGiver_BP_C.TryPlayHailing
// 0x0098 (0x0098 - 0x0000)
struct BaseAnimatedQuestGiver_BP_C_TryPlayHailing final
{
public:
	class UAkAudioEvent*                          Voiceline;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38B2[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38B3[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetElapsedTime_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MeetRequirements_ReturnValue;             // 0x0030(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMetaNPCUnlocked_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38B4[0x5];                                     // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNPCLobbyInteractionData               CallFunc_Map_Find_Value;                           // 0x0038(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38B5[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38B6[0x1];                                     // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default_1;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTime_ReturnValue;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsPlaying_ReturnValue;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38B7[0x2];                                     // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayAkEvent_ReturnValue;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing) == 0x000008, "Wrong alignment on BaseAnimatedQuestGiver_BP_C_TryPlayHailing");
static_assert(sizeof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing) == 0x000098, "Wrong size on BaseAnimatedQuestGiver_BP_C_TryPlayHailing");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, Voiceline) == 0x000000, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::Voiceline' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, Temp_bool_Variable) == 0x000008, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_GetLocalPawn_ReturnValue) == 0x000010, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_GetLocalPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_GetRBGameStateLobby_ReturnValue) == 0x000018, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_GetRBGameStateLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_GetRBGameStateLobby_ReturnValue_1) == 0x000020, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_GetRBGameStateLobby_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_GetElapsedTime_ReturnValue) == 0x00002C, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_GetElapsedTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_MeetRequirements_ReturnValue) == 0x000030, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_MeetRequirements_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_IsMetaNPCUnlocked_ReturnValue) == 0x000031, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_IsMetaNPCUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_Map_Find_Value) == 0x000038, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_Map_Find_ReturnValue) == 0x000070, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, K2Node_Select_Default) == 0x000074, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000078, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_IsValid_ReturnValue_1) == 0x000079, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00007A, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_BooleanAND_ReturnValue) == 0x00007B, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_BooleanAND_ReturnValue_1) == 0x00007C, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, Temp_bool_Variable_1) == 0x00007D, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_BooleanAND_ReturnValue_2) == 0x00007E, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, K2Node_Select_Default_1) == 0x000080, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_GetGameTime_ReturnValue) == 0x000088, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_GetGameTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_BP_IsPlaying_ReturnValue) == 0x00008C, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_BP_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_IsValid_ReturnValue_2) == 0x00008D, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_TryPlayHailing, CallFunc_PlayAkEvent_ReturnValue) == 0x000090, "Member 'BaseAnimatedQuestGiver_BP_C_TryPlayHailing::CallFunc_PlayAkEvent_ReturnValue' has a wrong offset!");

// Function BaseAnimatedQuestGiver_BP.BaseAnimatedQuestGiver_BP_C.UserConstructionScript
// 0x0100 (0x0100 - 0x0000)
struct BaseAnimatedQuestGiver_BP_C_UserConstructionScript final
{
public:
	EMetaNPCType                                  Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38B8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0080(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
};
static_assert(alignof(BaseAnimatedQuestGiver_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on BaseAnimatedQuestGiver_BP_C_UserConstructionScript");
static_assert(sizeof(BaseAnimatedQuestGiver_BP_C_UserConstructionScript) == 0x000100, "Wrong size on BaseAnimatedQuestGiver_BP_C_UserConstructionScript");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_UserConstructionScript, Temp_byte_Variable) == 0x000000, "Member 'BaseAnimatedQuestGiver_BP_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_UserConstructionScript, Temp_text_Variable) == 0x000008, "Member 'BaseAnimatedQuestGiver_BP_C_UserConstructionScript::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_UserConstructionScript, Temp_text_Variable_1) == 0x000020, "Member 'BaseAnimatedQuestGiver_BP_C_UserConstructionScript::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_UserConstructionScript, Temp_text_Variable_2) == 0x000038, "Member 'BaseAnimatedQuestGiver_BP_C_UserConstructionScript::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_UserConstructionScript, Temp_text_Variable_3) == 0x000050, "Member 'BaseAnimatedQuestGiver_BP_C_UserConstructionScript::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_UserConstructionScript, Temp_text_Variable_4) == 0x000068, "Member 'BaseAnimatedQuestGiver_BP_C_UserConstructionScript::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_UserConstructionScript, K2Node_Select_Default) == 0x000080, "Member 'BaseAnimatedQuestGiver_BP_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_UserConstructionScript, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'BaseAnimatedQuestGiver_BP_C_UserConstructionScript::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x0000D8, "Member 'BaseAnimatedQuestGiver_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_UserConstructionScript, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'BaseAnimatedQuestGiver_BP_C_UserConstructionScript::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BaseAnimatedQuestGiver_BP.BaseAnimatedQuestGiver_BP_C.BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38B9[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BaseAnimatedQuestGiver_BP.BaseAnimatedQuestGiver_BP_C.BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BaseAnimatedQuestGiver_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BaseAnimatedQuestGiver_BP.BaseAnimatedQuestGiver_BP_C.OnPawnPlaySpecialMoveAnimation
// 0x0010 (0x0010 - 0x0000)
struct BaseAnimatedQuestGiver_BP_C_OnPawnPlaySpecialMoveAnimation final
{
public:
	const class ARBPawn*                          Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  SpecialMove;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseAnimatedQuestGiver_BP_C_OnPawnPlaySpecialMoveAnimation) == 0x000008, "Wrong alignment on BaseAnimatedQuestGiver_BP_C_OnPawnPlaySpecialMoveAnimation");
static_assert(sizeof(BaseAnimatedQuestGiver_BP_C_OnPawnPlaySpecialMoveAnimation) == 0x000010, "Wrong size on BaseAnimatedQuestGiver_BP_C_OnPawnPlaySpecialMoveAnimation");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_OnPawnPlaySpecialMoveAnimation, Pawn) == 0x000000, "Member 'BaseAnimatedQuestGiver_BP_C_OnPawnPlaySpecialMoveAnimation::Pawn' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_OnPawnPlaySpecialMoveAnimation, SpecialMove) == 0x000008, "Member 'BaseAnimatedQuestGiver_BP_C_OnPawnPlaySpecialMoveAnimation::SpecialMove' has a wrong offset!");

// Function BaseAnimatedQuestGiver_BP.BaseAnimatedQuestGiver_BP_C.OnItemPurchased
// 0x0010 (0x0010 - 0x0000)
struct BaseAnimatedQuestGiver_BP_C_OnItemPurchased final
{
public:
	class ARBController*                          RBController;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemId;                                            // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseAnimatedQuestGiver_BP_C_OnItemPurchased) == 0x000008, "Wrong alignment on BaseAnimatedQuestGiver_BP_C_OnItemPurchased");
static_assert(sizeof(BaseAnimatedQuestGiver_BP_C_OnItemPurchased) == 0x000010, "Wrong size on BaseAnimatedQuestGiver_BP_C_OnItemPurchased");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_OnItemPurchased, RBController) == 0x000000, "Member 'BaseAnimatedQuestGiver_BP_C_OnItemPurchased::RBController' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_OnItemPurchased, ItemId) == 0x000008, "Member 'BaseAnimatedQuestGiver_BP_C_OnItemPurchased::ItemId' has a wrong offset!");

// Function BaseAnimatedQuestGiver_BP.BaseAnimatedQuestGiver_BP_C.VOEnded
// 0x0004 (0x0004 - 0x0000)
struct BaseAnimatedQuestGiver_BP_C_VOEnded final
{
public:
	int32                                         PlayingId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseAnimatedQuestGiver_BP_C_VOEnded) == 0x000004, "Wrong alignment on BaseAnimatedQuestGiver_BP_C_VOEnded");
static_assert(sizeof(BaseAnimatedQuestGiver_BP_C_VOEnded) == 0x000004, "Wrong size on BaseAnimatedQuestGiver_BP_C_VOEnded");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_VOEnded, PlayingId) == 0x000000, "Member 'BaseAnimatedQuestGiver_BP_C_VOEnded::PlayingId' has a wrong offset!");

// Function BaseAnimatedQuestGiver_BP.BaseAnimatedQuestGiver_BP_C.PlayBlockingDialogue
// 0x0008 (0x0008 - 0x0000)
struct BaseAnimatedQuestGiver_BP_C_PlayBlockingDialogue final
{
public:
	class UAkAudioEvent*                          AudioEvent;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseAnimatedQuestGiver_BP_C_PlayBlockingDialogue) == 0x000008, "Wrong alignment on BaseAnimatedQuestGiver_BP_C_PlayBlockingDialogue");
static_assert(sizeof(BaseAnimatedQuestGiver_BP_C_PlayBlockingDialogue) == 0x000008, "Wrong size on BaseAnimatedQuestGiver_BP_C_PlayBlockingDialogue");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_PlayBlockingDialogue, AudioEvent) == 0x000000, "Member 'BaseAnimatedQuestGiver_BP_C_PlayBlockingDialogue::AudioEvent' has a wrong offset!");

// Function BaseAnimatedQuestGiver_BP.BaseAnimatedQuestGiver_BP_C.ExecuteUbergraph_BaseAnimatedQuestGiver_BP
// 0x0330 (0x0330 - 0x0000)
struct BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38BA[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 PlayingId)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuest_AnimBP_C*                        K2Node_DynamicCast_AsQuest_Anim_BP;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38BB[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38BC[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0050(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38BD[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38BE[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuest_AnimBP_C*                        K2Node_DynamicCast_AsQuest_Anim_BP_1;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38BF[0x6];                                     // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuest_AnimBP_C*                        K2Node_DynamicCast_AsQuest_Anim_BP_2;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38C0[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class ARBPawn*                          K2Node_Event_pawn;                                 // 0x0138(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  K2Node_Event_specialMove;                          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C1[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuest_AnimBP_C*                        K2Node_DynamicCast_AsQuest_Anim_BP_3;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38C2[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer_BP_C*                         K2Node_DynamicCast_AsRB_Player_BP;                 // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38C3[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue_1;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38C4[0x6];                                     // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBController*                          K2Node_CustomEvent_rbController;                   // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_itemId;                         // 0x0180(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue_2;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C5[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue_3;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer_BP_C*                         K2Node_DynamicCast_AsRB_Player_BP_1;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38C6[0xF];                                     // 0x01B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x01C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C7[0x4];                                     // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_3;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C8[0x4];                                     // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestFace_animBP_C*                    K2Node_DynamicCast_AsQuest_Face_Anim_BP;           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38C9[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBMenuPlayerController*                CallFunc_GetLocalMenuController_ReturnValue;       // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_4;            // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuWidget*                          CallFunc_Create_ReturnValue;                       // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestFace_animBP_C*                    K2Node_DynamicCast_AsQuest_Face_Anim_BP_1;         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38CA[0x7];                                     // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_5;            // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuest_AnimBP_C*                        K2Node_DynamicCast_AsQuest_Anim_BP_4;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38CB[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_6;            // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestFace_animBP_C*                    K2Node_DynamicCast_AsQuest_Face_Anim_BP_2;         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38CC[0x3];                                     // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_7;            // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNPCMenu_C*                             K2Node_DynamicCast_AsNPC_Menu;                     // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38CD[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestFace_animBP_C*                    K2Node_DynamicCast_AsQuest_Face_Anim_BP_3;         // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38CE[0x3];                                     // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_playingId;                      // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayStoryLine_ReturnValue;                // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38CF[0x3];                                     // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D0[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_CustomEvent_audioEvent;                     // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayAkEvent_ReturnValue;                  // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38D1[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_8;            // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuest_AnimBP_C*                        K2Node_DynamicCast_AsQuest_Anim_BP_5;              // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38D2[0x3];                                     // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0304(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0314(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP) == 0x000010, "Wrong alignment on BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP");
static_assert(sizeof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP) == 0x000330, "Wrong size on BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, EntryPoint) == 0x000000, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, Temp_bool_Variable) == 0x000004, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_DynamicCast_AsQuest_Anim_BP) == 0x000020, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_DynamicCast_AsQuest_Anim_BP' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000030, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000038, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000040, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000048, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_ComponentBoundEvent_bFromSweep) == 0x00004C, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_ComponentBoundEvent_SweepResult) == 0x000050, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, CallFunc_GetLocalPawn_ReturnValue) == 0x0000D8, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::CallFunc_GetLocalPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000E0, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, CallFunc_GetAnimInstance_ReturnValue_1) == 0x0000E8, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000F0, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_ComponentBoundEvent_OtherActor) == 0x0000F8, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_ComponentBoundEvent_OtherComp) == 0x000100, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000108, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_DynamicCast_AsQuest_Anim_BP_1) == 0x000110, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_DynamicCast_AsQuest_Anim_BP_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000119, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_DynamicCast_AsQuest_Anim_BP_2) == 0x000120, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_DynamicCast_AsQuest_Anim_BP_2' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000130, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_Event_pawn) == 0x000138, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_Event_pawn' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_Event_specialMove) == 0x000140, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_Event_specialMove' has a wrong offset!");
static_assert(offsetof(BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP, K2Node_DynamicCast_AsQuest_Anim_BP_3) == 0x000148, "Member 'BaseAnimatedQuestGiver_BP_C_ExecuteUbergraph_BaseAnimatedQuestGiver_BP::K2Node_DynamicCast_AsQuest_Anim_BP_3' has a wrong offset!");
