#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseConfirmCancelPopupWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BaseConfirmCancelPopupWidget.BaseConfirmCancelPopupWidget_C.ExecuteUbergraph_BaseConfirmCancelPopupWidget
// 0x00A8 (0x00A8 - 0x0000)
struct BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2A[0x4];                                      // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_TitleText;                            // 0x0008(0x0018)(ConstParm)
	class FText                                   K2Node_Event_MainText;                             // 0x0020(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ConfirmText;                          // 0x0038(0x0018)(ConstParm)
	class FText                                   K2Node_Event_CancelText;                           // 0x0050(0x0018)(ConstParm)
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button_1;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_2;                // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2B[0x5];                                      // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue_1;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2C[0x3];                                      // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget) == 0x000008, "Wrong alignment on BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget");
static_assert(sizeof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget) == 0x0000A8, "Wrong size on BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget, EntryPoint) == 0x000000, "Member 'BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget, K2Node_Event_TitleText) == 0x000008, "Member 'BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget::K2Node_Event_TitleText' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget, K2Node_Event_MainText) == 0x000020, "Member 'BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget::K2Node_Event_MainText' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget, K2Node_Event_ConfirmText) == 0x000038, "Member 'BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget::K2Node_Event_ConfirmText' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget, K2Node_Event_CancelText) == 0x000050, "Member 'BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget::K2Node_Event_CancelText' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget, K2Node_ComponentBoundEvent_Button_1) == 0x000068, "Member 'BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget, CallFunc_TextIsEmpty_ReturnValue) == 0x000070, "Member 'BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000071, "Member 'BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget, CallFunc_TextIsEmpty_ReturnValue_2) == 0x000072, "Member 'BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget::CallFunc_TextIsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget, K2Node_ComponentBoundEvent_Button) == 0x000078, "Member 'BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget, CallFunc_GetMenuManager_ReturnValue) == 0x000080, "Member 'BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget, CallFunc_GetMenuManager_ReturnValue_1) == 0x000088, "Member 'BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget::CallFunc_GetMenuManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget, K2Node_Event_IsDesignTime) == 0x000090, "Member 'BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'BaseConfirmCancelPopupWidget_C_ExecuteUbergraph_BaseConfirmCancelPopupWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BaseConfirmCancelPopupWidget.BaseConfirmCancelPopupWidget_C.BndEvt__CancelMenuButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BaseConfirmCancelPopupWidget_C_BndEvt__CancelMenuButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseConfirmCancelPopupWidget_C_BndEvt__CancelMenuButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BaseConfirmCancelPopupWidget_C_BndEvt__CancelMenuButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature");
static_assert(sizeof(BaseConfirmCancelPopupWidget_C_BndEvt__CancelMenuButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BaseConfirmCancelPopupWidget_C_BndEvt__CancelMenuButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_BndEvt__CancelMenuButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'BaseConfirmCancelPopupWidget_C_BndEvt__CancelMenuButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function BaseConfirmCancelPopupWidget.BaseConfirmCancelPopupWidget_C.BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BaseConfirmCancelPopupWidget_C_BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseConfirmCancelPopupWidget_C_BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on BaseConfirmCancelPopupWidget_C_BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(sizeof(BaseConfirmCancelPopupWidget_C_BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong size on BaseConfirmCancelPopupWidget_C_BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'BaseConfirmCancelPopupWidget_C_BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function BaseConfirmCancelPopupWidget.BaseConfirmCancelPopupWidget_C.Event_InitializePopup
// 0x0060 (0x0060 - 0x0000)
struct BaseConfirmCancelPopupWidget_C_Event_InitializePopup final
{
public:
	class FText                                   TitleText;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   MainText;                                          // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   ConfirmText;                                       // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   CancelText;                                        // 0x0048(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BaseConfirmCancelPopupWidget_C_Event_InitializePopup) == 0x000008, "Wrong alignment on BaseConfirmCancelPopupWidget_C_Event_InitializePopup");
static_assert(sizeof(BaseConfirmCancelPopupWidget_C_Event_InitializePopup) == 0x000060, "Wrong size on BaseConfirmCancelPopupWidget_C_Event_InitializePopup");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_Event_InitializePopup, TitleText) == 0x000000, "Member 'BaseConfirmCancelPopupWidget_C_Event_InitializePopup::TitleText' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_Event_InitializePopup, MainText) == 0x000018, "Member 'BaseConfirmCancelPopupWidget_C_Event_InitializePopup::MainText' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_Event_InitializePopup, ConfirmText) == 0x000030, "Member 'BaseConfirmCancelPopupWidget_C_Event_InitializePopup::ConfirmText' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_Event_InitializePopup, CancelText) == 0x000048, "Member 'BaseConfirmCancelPopupWidget_C_Event_InitializePopup::CancelText' has a wrong offset!");

// Function BaseConfirmCancelPopupWidget.BaseConfirmCancelPopupWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BaseConfirmCancelPopupWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BaseConfirmCancelPopupWidget_C_PreConstruct) == 0x000001, "Wrong alignment on BaseConfirmCancelPopupWidget_C_PreConstruct");
static_assert(sizeof(BaseConfirmCancelPopupWidget_C_PreConstruct) == 0x000001, "Wrong size on BaseConfirmCancelPopupWidget_C_PreConstruct");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BaseConfirmCancelPopupWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BaseConfirmCancelPopupWidget.BaseConfirmCancelPopupWidget_C.SetConfrmSound
// 0x0008 (0x0008 - 0x0000)
struct BaseConfirmCancelPopupWidget_C_SetConfrmSound final
{
public:
	class UAkAudioEvent*                          Sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseConfirmCancelPopupWidget_C_SetConfrmSound) == 0x000008, "Wrong alignment on BaseConfirmCancelPopupWidget_C_SetConfrmSound");
static_assert(sizeof(BaseConfirmCancelPopupWidget_C_SetConfrmSound) == 0x000008, "Wrong size on BaseConfirmCancelPopupWidget_C_SetConfrmSound");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_SetConfrmSound, Sound) == 0x000000, "Member 'BaseConfirmCancelPopupWidget_C_SetConfrmSound::Sound' has a wrong offset!");

// Function BaseConfirmCancelPopupWidget.BaseConfirmCancelPopupWidget_C.SetCancelSound
// 0x0008 (0x0008 - 0x0000)
struct BaseConfirmCancelPopupWidget_C_SetCancelSound final
{
public:
	class UAkAudioEvent*                          Sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BaseConfirmCancelPopupWidget_C_SetCancelSound) == 0x000008, "Wrong alignment on BaseConfirmCancelPopupWidget_C_SetCancelSound");
static_assert(sizeof(BaseConfirmCancelPopupWidget_C_SetCancelSound) == 0x000008, "Wrong size on BaseConfirmCancelPopupWidget_C_SetCancelSound");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_SetCancelSound, Sound) == 0x000000, "Member 'BaseConfirmCancelPopupWidget_C_SetCancelSound::Sound' has a wrong offset!");

// Function BaseConfirmCancelPopupWidget.BaseConfirmCancelPopupWidget_C.OnPreviewMouseButtonDown
// 0x02D8 (0x02D8 - 0x0000)
struct BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2D[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0220(0x00B8)()
};
static_assert(alignof(BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown) == 0x000008, "Wrong alignment on BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown");
static_assert(sizeof(BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown) == 0x0002D8, "Wrong size on BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown, MyGeometry) == 0x000000, "Member 'BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown, MouseEvent) == 0x000038, "Member 'BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000218, "Member 'BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000220, "Member 'BaseConfirmCancelPopupWidget_C_OnPreviewMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

}

