#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlindFogger_SkillItem_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BlindFogger_SkillItem_BP.BlindFogger_SkillItem_BP_C.ExecuteUbergraph_BlindFogger_SkillItem_BP
// 0x0058 (0x0058 - 0x0000)
struct BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsInZone;                       // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP) == 0x000008, "Wrong alignment on BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP");
static_assert(sizeof(BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP) == 0x000058, "Wrong size on BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP, EntryPoint) == 0x000000, "Member 'BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP, Temp_struct_Variable) == 0x000008, "Member 'BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP, Temp_delegate_Variable) == 0x000018, "Member 'BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP, Temp_struct_Variable_1) == 0x000028, "Member 'BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP, Temp_delegate_Variable_1) == 0x000038, "Member 'BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP, CallFunc_PostAkEvent_ReturnValue) == 0x000048, "Member 'BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP, K2Node_CustomEvent_IsInZone) == 0x00004C, "Member 'BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP::K2Node_CustomEvent_IsInZone' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP, CallFunc_PostAkEvent_ReturnValue_1) == 0x000050, "Member 'BlindFogger_SkillItem_BP_C_ExecuteUbergraph_BlindFogger_SkillItem_BP::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

// Function BlindFogger_SkillItem_BP.BlindFogger_SkillItem_BP_C.On Skill Deactivate FX
// 0x0001 (0x0001 - 0x0000)
struct BlindFogger_SkillItem_BP_C_On_Skill_Deactivate_FX final
{
public:
	bool                                          IsInZone;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BlindFogger_SkillItem_BP_C_On_Skill_Deactivate_FX) == 0x000001, "Wrong alignment on BlindFogger_SkillItem_BP_C_On_Skill_Deactivate_FX");
static_assert(sizeof(BlindFogger_SkillItem_BP_C_On_Skill_Deactivate_FX) == 0x000001, "Wrong size on BlindFogger_SkillItem_BP_C_On_Skill_Deactivate_FX");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_On_Skill_Deactivate_FX, IsInZone) == 0x000000, "Member 'BlindFogger_SkillItem_BP_C_On_Skill_Deactivate_FX::IsInZone' has a wrong offset!");

// Function BlindFogger_SkillItem_BP.BlindFogger_SkillItem_BP_C.SpawnAndExplodeBomb_Client
// 0x0080 (0x0080 - 0x0000)
struct BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client final
{
public:
	class AActor*                                 BombActor;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APaintBombMinus01_BP_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetImpactRadius_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetZoneDuration_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0068(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client) == 0x000010, "Wrong alignment on BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client");
static_assert(sizeof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client) == 0x000080, "Wrong size on BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client, BombActor) == 0x000000, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client::BombActor' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client, Temp_delegate_Variable) == 0x000008, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client, CallFunc_GetImpactRadius_ReturnValue) == 0x000060, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client::CallFunc_GetImpactRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client, CallFunc_GetZoneDuration_ReturnValue) == 0x000064, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client::CallFunc_GetZoneDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client, Temp_struct_Variable) == 0x000068, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client, CallFunc_PostAkEvent_ReturnValue) == 0x000078, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Client::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function BlindFogger_SkillItem_BP.BlindFogger_SkillItem_BP_C.SpawnAndExplodeBomb_Server
// 0x0050 (0x0050 - 0x0000)
struct BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server final
{
public:
	class AActor*                                 BombActor;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetImpactRadius_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetZoneDuration_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APaintBomb_ServerMinus01_BP1_C*         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server) == 0x000010, "Wrong alignment on BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server");
static_assert(sizeof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server) == 0x000050, "Wrong size on BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server, BombActor) == 0x000000, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server::BombActor' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server, CallFunc_GetImpactRadius_ReturnValue) == 0x000008, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server::CallFunc_GetImpactRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server, CallFunc_GetZoneDuration_ReturnValue) == 0x00000C, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server::CallFunc_GetZoneDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'BlindFogger_SkillItem_BP_C_SpawnAndExplodeBomb_Server::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

