#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FX_ItemConsume_Heal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FX_ItemConsume_Heal.BP_FX_ItemConsume_Heal_C.ExecuteUbergraph_BP_FX_ItemConsume_Heal
// 0x0050 (0x0050 - 0x0000)
struct BP_FX_ItemConsume_Heal_C_ExecuteUbergraph_BP_FX_ItemConsume_Heal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA5[0xC];                                     // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UPostProcessComponent*                  CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FX_ItemConsume_Heal_C_ExecuteUbergraph_BP_FX_ItemConsume_Heal) == 0x000010, "Wrong alignment on BP_FX_ItemConsume_Heal_C_ExecuteUbergraph_BP_FX_ItemConsume_Heal");
static_assert(sizeof(BP_FX_ItemConsume_Heal_C_ExecuteUbergraph_BP_FX_ItemConsume_Heal) == 0x000050, "Wrong size on BP_FX_ItemConsume_Heal_C_ExecuteUbergraph_BP_FX_ItemConsume_Heal");
static_assert(offsetof(BP_FX_ItemConsume_Heal_C_ExecuteUbergraph_BP_FX_ItemConsume_Heal, EntryPoint) == 0x000000, "Member 'BP_FX_ItemConsume_Heal_C_ExecuteUbergraph_BP_FX_ItemConsume_Heal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FX_ItemConsume_Heal_C_ExecuteUbergraph_BP_FX_ItemConsume_Heal, Temp_struct_Variable) == 0x000010, "Member 'BP_FX_ItemConsume_Heal_C_ExecuteUbergraph_BP_FX_ItemConsume_Heal::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_FX_ItemConsume_Heal_C_ExecuteUbergraph_BP_FX_ItemConsume_Heal, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'BP_FX_ItemConsume_Heal_C_ExecuteUbergraph_BP_FX_ItemConsume_Heal::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_ItemConsume_Heal_C_ExecuteUbergraph_BP_FX_ItemConsume_Heal, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_FX_ItemConsume_Heal_C_ExecuteUbergraph_BP_FX_ItemConsume_Heal::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

