#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BrainAmp_SkillItem_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BrainAmp_SkillItem_BP.BrainAmp_SkillItem_BP_C.ExecuteUbergraph_BrainAmp_SkillItem_BP
// 0x00F0 (0x00F0 - 0x0000)
struct BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetImpactRadius_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A2[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0050(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_2;                            // 0x0060(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0070(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A3[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_3;                            // 0x0090(0x0010)(ConstParm, ReferenceParm)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A4[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FX_02_ExploLight_Amber_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP) == 0x000010, "Wrong alignment on BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP");
static_assert(sizeof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP) == 0x0000F0, "Wrong size on BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, EntryPoint) == 0x000000, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, CallFunc_GetImpactRadius_ReturnValue) == 0x000004, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::CallFunc_GetImpactRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, Temp_delegate_Variable) == 0x000008, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, Temp_struct_Variable) == 0x000020, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, Temp_delegate_Variable_1) == 0x000030, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, Temp_struct_Variable_1) == 0x000040, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, Temp_delegate_Variable_2) == 0x000050, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, Temp_struct_Variable_2) == 0x000060, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, Temp_delegate_Variable_3) == 0x000070, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, CallFunc_PostAkEvent_ReturnValue) == 0x000080, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, CallFunc_PostAkEvent_ReturnValue_1) == 0x000084, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, CallFunc_PostAkEvent_ReturnValue_2) == 0x000088, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, Temp_struct_Variable_3) == 0x000090, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, CallFunc_GetTransform_ReturnValue) == 0x0000A0, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, CallFunc_PostAkEvent_ReturnValue_3) == 0x0000D0, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000D8, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000E0, "Member 'BrainAmp_SkillItem_BP_C_ExecuteUbergraph_BrainAmp_SkillItem_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

