#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CellCustomization_TO_BundleMinus01_BP

#include "Basic.hpp"

#include "CellCustomizationBundleBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CellCustomization_TO_Bundle-01_BP.CellCustomization_TO_Bundle-01_BP_C
// 0x0190 (0x03E8 - 0x0258)
class ACellCustomization_TO_BundleMinus01_BP_C final : public ACellCustomizationBundleBase_C
{
public:
	class UStaticMeshComponent*                   Window1;                                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Window3;                                           // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Window2;                                           // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal9;                                            // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal8;                                            // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal7;                                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AntidoteMinusA;                                    // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AcidWarningSignMinus01;                            // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PropaneTankLong_01;                                // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AcidBucketMinus01;                                 // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LargeBottle_AcidMinus01;                           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LargeBottle_BleachMinus01;                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Wall1;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Floor;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sink;                                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Window;                                            // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Deadbody_Rat_01;                                   // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_Temp_Sys_31_Trap_GasCanister_Loop;             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BowlMinus01;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GasTankMinus01;                                    // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HazardCurtainMinus01;                              // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal6;                                            // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LargeBottle_AcidMinus04;                           // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LargeBottle_AcidMinus03;                           // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PropaneTankLong_02;                                // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AcidBucketMinus08;                                 // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AcidBucketMinus07;                                 // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AcidBucketMinus06;                                 // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AcidBucketMinus05;                                 // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AcidBucketMinus03;                                 // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AcidBucketMinus04;                                 // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AcidBucketMinus02;                                 // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LargeBottle_AcidMinus02;                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Deadbody_Rat_02;                                   // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Wall2;                                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Wall4;                                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Wall3;                                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DeadRatMinus02;                                    // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DeadRatMinus08;                                    // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DeadRatMinus07;                                    // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DeadRatMinus06;                                    // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DeadRatMinus05;                                    // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DeadRatMinus01;                                    // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DeadRatMinus04;                                    // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DeadRatMinus03;                                    // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal4;                                            // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal3;                                            // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal2;                                            // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal1;                                            // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CellCustomization_TO_Bundle-01_BP_C">();
	}
	static class ACellCustomization_TO_BundleMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACellCustomization_TO_BundleMinus01_BP_C>();
	}
};
static_assert(alignof(ACellCustomization_TO_BundleMinus01_BP_C) == 0x000008, "Wrong alignment on ACellCustomization_TO_BundleMinus01_BP_C");
static_assert(sizeof(ACellCustomization_TO_BundleMinus01_BP_C) == 0x0003E8, "Wrong size on ACellCustomization_TO_BundleMinus01_BP_C");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Window1) == 0x000258, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Window1' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Window3) == 0x000260, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Window3' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Window2) == 0x000268, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Window2' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Decal9) == 0x000270, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Decal9' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Decal8) == 0x000278, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Decal8' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Decal7) == 0x000280, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Decal7' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, AntidoteMinusA) == 0x000288, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::AntidoteMinusA' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, AcidWarningSignMinus01) == 0x000290, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::AcidWarningSignMinus01' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, PropaneTankLong_01) == 0x000298, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::PropaneTankLong_01' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, AcidBucketMinus01) == 0x0002A0, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::AcidBucketMinus01' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, LargeBottle_AcidMinus01) == 0x0002A8, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::LargeBottle_AcidMinus01' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, LargeBottle_BleachMinus01) == 0x0002B0, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::LargeBottle_BleachMinus01' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Wall1) == 0x0002B8, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Wall1' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Floor) == 0x0002C0, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Floor' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Sink) == 0x0002C8, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Sink' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Window) == 0x0002D0, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Window' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Deadbody_Rat_01) == 0x0002D8, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Deadbody_Rat_01' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Ngr_Temp_Sys_31_Trap_GasCanister_Loop) == 0x0002E0, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Ngr_Temp_Sys_31_Trap_GasCanister_Loop' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, BowlMinus01) == 0x0002E8, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::BowlMinus01' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, GasTankMinus01) == 0x0002F0, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::GasTankMinus01' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, HazardCurtainMinus01) == 0x0002F8, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::HazardCurtainMinus01' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Decal6) == 0x000300, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Decal6' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, LargeBottle_AcidMinus04) == 0x000308, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::LargeBottle_AcidMinus04' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, LargeBottle_AcidMinus03) == 0x000310, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::LargeBottle_AcidMinus03' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, PropaneTankLong_02) == 0x000318, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::PropaneTankLong_02' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, AcidBucketMinus08) == 0x000320, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::AcidBucketMinus08' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, AcidBucketMinus07) == 0x000328, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::AcidBucketMinus07' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, AcidBucketMinus06) == 0x000330, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::AcidBucketMinus06' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, AcidBucketMinus05) == 0x000338, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::AcidBucketMinus05' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, AcidBucketMinus03) == 0x000340, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::AcidBucketMinus03' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, AcidBucketMinus04) == 0x000348, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::AcidBucketMinus04' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, AcidBucketMinus02) == 0x000350, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::AcidBucketMinus02' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, LargeBottle_AcidMinus02) == 0x000358, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::LargeBottle_AcidMinus02' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Deadbody_Rat_02) == 0x000360, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Deadbody_Rat_02' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Wall2) == 0x000368, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Wall2' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Wall4) == 0x000370, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Wall4' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Wall3) == 0x000378, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Wall3' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, DeadRatMinus02) == 0x000380, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::DeadRatMinus02' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, DeadRatMinus08) == 0x000388, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::DeadRatMinus08' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, DeadRatMinus07) == 0x000390, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::DeadRatMinus07' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, DeadRatMinus06) == 0x000398, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::DeadRatMinus06' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, DeadRatMinus05) == 0x0003A0, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::DeadRatMinus05' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, DeadRatMinus01) == 0x0003A8, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::DeadRatMinus01' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, DeadRatMinus04) == 0x0003B0, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::DeadRatMinus04' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, DeadRatMinus03) == 0x0003B8, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::DeadRatMinus03' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Decal4) == 0x0003C0, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Decal4' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Decal3) == 0x0003C8, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Decal3' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Decal2) == 0x0003D0, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Decal2' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Decal) == 0x0003D8, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Decal' has a wrong offset!");
static_assert(offsetof(ACellCustomization_TO_BundleMinus01_BP_C, Decal1) == 0x0003E0, "Member 'ACellCustomization_TO_BundleMinus01_BP_C::Decal1' has a wrong offset!");

}

