#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSheet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterSheet.CharacterSheet_C
// 0x00D0 (0x0428 - 0x0358)
class UCharacterSheet_C final : public URBCharacterSheetMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         ActionButtonContainer;                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterSheetBadgesTab_C*             CharacterSheetBadgesTab;                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterSheetDocumentsTab_C*          CharacterSheetDocumentsTab;                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterSheetStatsTab_C*              CharacterSheetStatsTab;                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterSheetTabs_C*                  CharacterSheetTabs;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        ExitButton;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FullScreenFocusAnchor;                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FullScreenPopupAnchor;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULocalPlayerInfo_v2_C*                  LocalPlayerInfo;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuFocusActionButtonContainer_C*      MenuFocusActionButtonContainer;                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NavigationOverrideBox;                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PageSpecificButtonContainer;                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageSubTitle;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageSubTitleSeparator;                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageTitle;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkListTabs_C*                        PerkListTabs;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerLoadoutsTab_C*                   PlayerLoadoutsTab;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReplayMenuTutorialButton_C*            ReplayMenuTutorialButton;                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        SocialMenuButton;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        TabSwitch;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TrialBoardFocusAnchor01;                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TrialBoardPopupAnchor01;                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTrialBoardTab_C*                       TrialBoardTab;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CanShowTutorial;                                   // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPendingTutorialRequest;                           // 0x0421(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void TryShowBadgesTutorial(bool* IsShowingTutorial);
	void RefreshNewState();
	void TryShowStatsTutorial(bool* IsShowingTutorial);
	void Refresh();
	void UpdateTrialBoardTutorialAnchors();
	void GetSelfOverheadPosition(float* Left, float* Top);
	void TryShowTrialBoardTutorial(bool* IsShowingTutorial);
	void TryShowEvidenceTutorial(bool* IsShowingTutorial);
	void ChangeActiveSkill();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void TryShowLoadoutTutorial(bool* IsShowingTutorial);
	void TryStartNextMenuTutorial();
	void Construct();
	void Event_OnMenuTabSwitched(int32 PreviousIndex);
	void Event_UpdateNavigation(bool Param_CanExitMenu);
	void BndEvt__ExitButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void Event_OnPush();
	void Event_OnMenuTutorialSeen();
	void EventRequestTutorial_Event_0();
	void Event_StartTransitionOut();
	void BndEvt__ReplayMenuTutorialButton_K2Node_ComponentBoundEvent_0_Event_OnClicked__DelegateSignature();
	void Event_OnFocusMenu();
	void ShowSocialMenu();
	void Destruct();
	void BndEvt__CharacterSheet_SocialMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Event_MenuTabRight_Pressed();
	void Event_MenuTabLeft_Pressed();
	void BndEvt__CharacterSheet_CharacterSheetDocumentsTab_K2Node_ComponentBoundEvent_3_OnDocumentSeenEvent__DelegateSignature();
	void BndEvt__CharacterSheet_TrialBoardTab_K2Node_ComponentBoundEvent_4_OnCurrentSectionChanged__DelegateSignature();
	void OnUpdateNewStatus();
	void ExecuteUbergraph_CharacterSheet(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterSheet_C">();
	}
	static class UCharacterSheet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterSheet_C>();
	}
};
static_assert(alignof(UCharacterSheet_C) == 0x000008, "Wrong alignment on UCharacterSheet_C");
static_assert(sizeof(UCharacterSheet_C) == 0x000428, "Wrong size on UCharacterSheet_C");
static_assert(offsetof(UCharacterSheet_C, UberGraphFrame) == 0x000358, "Member 'UCharacterSheet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, ActionButtonContainer) == 0x000360, "Member 'UCharacterSheet_C::ActionButtonContainer' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, CanvasPanel_1) == 0x000368, "Member 'UCharacterSheet_C::CanvasPanel_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, CharacterSheetBadgesTab) == 0x000370, "Member 'UCharacterSheet_C::CharacterSheetBadgesTab' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, CharacterSheetDocumentsTab) == 0x000378, "Member 'UCharacterSheet_C::CharacterSheetDocumentsTab' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, CharacterSheetStatsTab) == 0x000380, "Member 'UCharacterSheet_C::CharacterSheetStatsTab' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, CharacterSheetTabs) == 0x000388, "Member 'UCharacterSheet_C::CharacterSheetTabs' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, ExitButton) == 0x000390, "Member 'UCharacterSheet_C::ExitButton' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, FullScreenFocusAnchor) == 0x000398, "Member 'UCharacterSheet_C::FullScreenFocusAnchor' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, FullScreenPopupAnchor) == 0x0003A0, "Member 'UCharacterSheet_C::FullScreenPopupAnchor' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, LocalPlayerInfo) == 0x0003A8, "Member 'UCharacterSheet_C::LocalPlayerInfo' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, MenuFocusActionButtonContainer) == 0x0003B0, "Member 'UCharacterSheet_C::MenuFocusActionButtonContainer' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, NavigationOverrideBox) == 0x0003B8, "Member 'UCharacterSheet_C::NavigationOverrideBox' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, PageSpecificButtonContainer) == 0x0003C0, "Member 'UCharacterSheet_C::PageSpecificButtonContainer' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, PageSubTitle) == 0x0003C8, "Member 'UCharacterSheet_C::PageSubTitle' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, PageSubTitleSeparator) == 0x0003D0, "Member 'UCharacterSheet_C::PageSubTitleSeparator' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, PageTitle) == 0x0003D8, "Member 'UCharacterSheet_C::PageTitle' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, PerkListTabs) == 0x0003E0, "Member 'UCharacterSheet_C::PerkListTabs' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, PlayerLoadoutsTab) == 0x0003E8, "Member 'UCharacterSheet_C::PlayerLoadoutsTab' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, ReplayMenuTutorialButton) == 0x0003F0, "Member 'UCharacterSheet_C::ReplayMenuTutorialButton' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, SocialMenuButton) == 0x0003F8, "Member 'UCharacterSheet_C::SocialMenuButton' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, TabSwitch) == 0x000400, "Member 'UCharacterSheet_C::TabSwitch' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, TrialBoardFocusAnchor01) == 0x000408, "Member 'UCharacterSheet_C::TrialBoardFocusAnchor01' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, TrialBoardPopupAnchor01) == 0x000410, "Member 'UCharacterSheet_C::TrialBoardPopupAnchor01' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, TrialBoardTab) == 0x000418, "Member 'UCharacterSheet_C::TrialBoardTab' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, CanShowTutorial) == 0x000420, "Member 'UCharacterSheet_C::CanShowTutorial' has a wrong offset!");
static_assert(offsetof(UCharacterSheet_C, bPendingTutorialRequest) == 0x000421, "Member 'UCharacterSheet_C::bPendingTutorialRequest' has a wrong offset!");

}

