#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSheet

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function CharacterSheet.CharacterSheet_C.TryShowBadgesTutorial
// 0x0018 (0x0018 - 0x0000)
struct CharacterSheet_C_TryShowBadgesTutorial final
{
public:
	bool                                          IsShowingTutorial;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayedMenuTutorial_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSheet_C_TryShowBadgesTutorial) == 0x000008, "Wrong alignment on CharacterSheet_C_TryShowBadgesTutorial");
static_assert(sizeof(CharacterSheet_C_TryShowBadgesTutorial) == 0x000018, "Wrong size on CharacterSheet_C_TryShowBadgesTutorial");
static_assert(offsetof(CharacterSheet_C_TryShowBadgesTutorial, IsShowingTutorial) == 0x000000, "Member 'CharacterSheet_C_TryShowBadgesTutorial::IsShowingTutorial' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowBadgesTutorial, CallFunc_ShowMenuTutorial_createdWidget) == 0x000008, "Member 'CharacterSheet_C_TryShowBadgesTutorial::CallFunc_ShowMenuTutorial_createdWidget' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowBadgesTutorial, CallFunc_HasPlayedMenuTutorial_ReturnValue) == 0x000010, "Member 'CharacterSheet_C_TryShowBadgesTutorial::CallFunc_HasPlayedMenuTutorial_ReturnValue' has a wrong offset!");

// Function CharacterSheet.CharacterSheet_C.RefreshNewState
// 0x0003 (0x0003 - 0x0000)
struct CharacterSheet_C_RefreshNewState final
{
public:
	bool                                          CallFunc_HasRecentlyBoughtAnyUpgrade_ReturnValue;  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasUnseenAcquiredDocument_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasClaimableBadgeReward_ReturnValue;      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSheet_C_RefreshNewState) == 0x000001, "Wrong alignment on CharacterSheet_C_RefreshNewState");
static_assert(sizeof(CharacterSheet_C_RefreshNewState) == 0x000003, "Wrong size on CharacterSheet_C_RefreshNewState");
static_assert(offsetof(CharacterSheet_C_RefreshNewState, CallFunc_HasRecentlyBoughtAnyUpgrade_ReturnValue) == 0x000000, "Member 'CharacterSheet_C_RefreshNewState::CallFunc_HasRecentlyBoughtAnyUpgrade_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_RefreshNewState, CallFunc_HasUnseenAcquiredDocument_ReturnValue) == 0x000001, "Member 'CharacterSheet_C_RefreshNewState::CallFunc_HasUnseenAcquiredDocument_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_RefreshNewState, CallFunc_HasClaimableBadgeReward_ReturnValue) == 0x000002, "Member 'CharacterSheet_C_RefreshNewState::CallFunc_HasClaimableBadgeReward_ReturnValue' has a wrong offset!");

// Function CharacterSheet.CharacterSheet_C.TryShowStatsTutorial
// 0x0018 (0x0018 - 0x0000)
struct CharacterSheet_C_TryShowStatsTutorial final
{
public:
	bool                                          IsShowingTutorial;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayedMenuTutorial_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSheet_C_TryShowStatsTutorial) == 0x000008, "Wrong alignment on CharacterSheet_C_TryShowStatsTutorial");
static_assert(sizeof(CharacterSheet_C_TryShowStatsTutorial) == 0x000018, "Wrong size on CharacterSheet_C_TryShowStatsTutorial");
static_assert(offsetof(CharacterSheet_C_TryShowStatsTutorial, IsShowingTutorial) == 0x000000, "Member 'CharacterSheet_C_TryShowStatsTutorial::IsShowingTutorial' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowStatsTutorial, CallFunc_ShowMenuTutorial_createdWidget) == 0x000008, "Member 'CharacterSheet_C_TryShowStatsTutorial::CallFunc_ShowMenuTutorial_createdWidget' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowStatsTutorial, CallFunc_HasPlayedMenuTutorial_ReturnValue) == 0x000010, "Member 'CharacterSheet_C_TryShowStatsTutorial::CallFunc_HasPlayedMenuTutorial_ReturnValue' has a wrong offset!");

// Function CharacterSheet.CharacterSheet_C.Refresh
// 0x0178 (0x0178 - 0x0000)
struct CharacterSheet_C_Refresh final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A0[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A1[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBCharacterSheetMenuTabWidget*         K2Node_DynamicCast_AsRB_Character_Sheet_Menu_Tab_Widget; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A2[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetNavigationOverrideWidget_ReturnValue;  // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMatchCurrentPlayerCount_ReturnValue;   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A3[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
	class FText                                   CallFunc_GetPageSubtitle_ReturnValue;              // 0x00E8(0x0018)()
	bool                                          CallFunc_ShouldShowPageTitle_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A4[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A5[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldShowNavigation_ReturnValue;         // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A6[0x6];                                     // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPageTitle_ReturnValue;                 // 0x0128(0x0018)()
	TArray<class UUserWidget*>                    CallFunc_GetPageSpecificButtons_outButtons;        // 0x0140(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_Variable_1;                              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A7[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item_1;                         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34A8[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSheet_C_Refresh) == 0x000008, "Wrong alignment on CharacterSheet_C_Refresh");
static_assert(sizeof(CharacterSheet_C_Refresh) == 0x000178, "Wrong size on CharacterSheet_C_Refresh");
static_assert(offsetof(CharacterSheet_C_Refresh, Temp_byte_Variable) == 0x000000, "Member 'CharacterSheet_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, Temp_bool_Variable) == 0x000001, "Member 'CharacterSheet_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, Temp_byte_Variable_1) == 0x000002, "Member 'CharacterSheet_C_Refresh::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, Temp_byte_Variable_2) == 0x000003, "Member 'CharacterSheet_C_Refresh::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, Temp_byte_Variable_3) == 0x000004, "Member 'CharacterSheet_C_Refresh::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, Temp_int_Array_Index_Variable) == 0x000008, "Member 'CharacterSheet_C_Refresh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'CharacterSheet_C_Refresh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'CharacterSheet_C_Refresh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'CharacterSheet_C_Refresh::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'CharacterSheet_C_Refresh::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_Array_Get_Item) == 0x000028, "Member 'CharacterSheet_C_Refresh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'CharacterSheet_C_Refresh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'CharacterSheet_C_Refresh::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'CharacterSheet_C_Refresh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'CharacterSheet_C_Refresh::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'CharacterSheet_C_Refresh::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_SelectString_ReturnValue) == 0x000048, "Member 'CharacterSheet_C_Refresh::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_GetActiveWidget_ReturnValue) == 0x000058, "Member 'CharacterSheet_C_Refresh::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, K2Node_DynamicCast_AsRB_Character_Sheet_Menu_Tab_Widget) == 0x000060, "Member 'CharacterSheet_C_Refresh::K2Node_DynamicCast_AsRB_Character_Sheet_Menu_Tab_Widget' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'CharacterSheet_C_Refresh::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_GetNavigationOverrideWidget_ReturnValue) == 0x000070, "Member 'CharacterSheet_C_Refresh::CallFunc_GetNavigationOverrideWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_GetMatchCurrentPlayerCount_ReturnValue) == 0x000078, "Member 'CharacterSheet_C_Refresh::CallFunc_GetMatchCurrentPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_IsValid_ReturnValue) == 0x00007C, "Member 'CharacterSheet_C_Refresh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'CharacterSheet_C_Refresh::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, K2Node_MakeArray_Array) == 0x0000C0, "Member 'CharacterSheet_C_Refresh::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'CharacterSheet_C_Refresh::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_GetPageSubtitle_ReturnValue) == 0x0000E8, "Member 'CharacterSheet_C_Refresh::CallFunc_GetPageSubtitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_ShouldShowPageTitle_ReturnValue) == 0x000100, "Member 'CharacterSheet_C_Refresh::CallFunc_ShouldShowPageTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_Conv_TextToString_ReturnValue) == 0x000108, "Member 'CharacterSheet_C_Refresh::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, K2Node_Select_Default) == 0x000118, "Member 'CharacterSheet_C_Refresh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_Len_ReturnValue) == 0x00011C, "Member 'CharacterSheet_C_Refresh::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_Greater_IntInt_ReturnValue) == 0x000120, "Member 'CharacterSheet_C_Refresh::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_ShouldShowNavigation_ReturnValue) == 0x000121, "Member 'CharacterSheet_C_Refresh::CallFunc_ShouldShowNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_GetPageTitle_ReturnValue) == 0x000128, "Member 'CharacterSheet_C_Refresh::CallFunc_GetPageTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_GetPageSpecificButtons_outButtons) == 0x000140, "Member 'CharacterSheet_C_Refresh::CallFunc_GetPageSpecificButtons_outButtons' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, Temp_bool_Variable_1) == 0x000150, "Member 'CharacterSheet_C_Refresh::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_Array_Get_Item_1) == 0x000158, "Member 'CharacterSheet_C_Refresh::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000160, "Member 'CharacterSheet_C_Refresh::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, K2Node_Select_Default_1) == 0x000168, "Member 'CharacterSheet_C_Refresh::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_Array_Length_ReturnValue_1) == 0x00016C, "Member 'CharacterSheet_C_Refresh::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_Refresh, CallFunc_Less_IntInt_ReturnValue_1) == 0x000170, "Member 'CharacterSheet_C_Refresh::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function CharacterSheet.CharacterSheet_C.UpdateTrialBoardTutorialAnchors
// 0x0028 (0x0028 - 0x0000)
struct CharacterSheet_C_UpdateTrialBoardTutorialAnchors final
{
public:
	float                                         CallFunc_GetSelfOverheadPosition_Left;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSelfOverheadPosition_Top;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterSheet_C_UpdateTrialBoardTutorialAnchors) == 0x000008, "Wrong alignment on CharacterSheet_C_UpdateTrialBoardTutorialAnchors");
static_assert(sizeof(CharacterSheet_C_UpdateTrialBoardTutorialAnchors) == 0x000028, "Wrong size on CharacterSheet_C_UpdateTrialBoardTutorialAnchors");
static_assert(offsetof(CharacterSheet_C_UpdateTrialBoardTutorialAnchors, CallFunc_GetSelfOverheadPosition_Left) == 0x000000, "Member 'CharacterSheet_C_UpdateTrialBoardTutorialAnchors::CallFunc_GetSelfOverheadPosition_Left' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_UpdateTrialBoardTutorialAnchors, CallFunc_GetSelfOverheadPosition_Top) == 0x000004, "Member 'CharacterSheet_C_UpdateTrialBoardTutorialAnchors::CallFunc_GetSelfOverheadPosition_Top' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_UpdateTrialBoardTutorialAnchors, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'CharacterSheet_C_UpdateTrialBoardTutorialAnchors::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_UpdateTrialBoardTutorialAnchors, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'CharacterSheet_C_UpdateTrialBoardTutorialAnchors::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_UpdateTrialBoardTutorialAnchors, CallFunc_MakeVector2D_ReturnValue_1) == 0x000018, "Member 'CharacterSheet_C_UpdateTrialBoardTutorialAnchors::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_UpdateTrialBoardTutorialAnchors, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000020, "Member 'CharacterSheet_C_UpdateTrialBoardTutorialAnchors::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");

// Function CharacterSheet.CharacterSheet_C.GetSelfOverheadPosition
// 0x0040 (0x0040 - 0x0000)
struct CharacterSheet_C_GetSelfOverheadPosition final
{
public:
	float                                         Left;                                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Top;                                               // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A9[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                CallFunc_GetOffsets_ReturnValue;                   // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSheet_C_GetSelfOverheadPosition) == 0x000008, "Wrong alignment on CharacterSheet_C_GetSelfOverheadPosition");
static_assert(sizeof(CharacterSheet_C_GetSelfOverheadPosition) == 0x000040, "Wrong size on CharacterSheet_C_GetSelfOverheadPosition");
static_assert(offsetof(CharacterSheet_C_GetSelfOverheadPosition, Left) == 0x000000, "Member 'CharacterSheet_C_GetSelfOverheadPosition::Left' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_GetSelfOverheadPosition, Top) == 0x000004, "Member 'CharacterSheet_C_GetSelfOverheadPosition::Top' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_GetSelfOverheadPosition, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'CharacterSheet_C_GetSelfOverheadPosition::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_GetSelfOverheadPosition, CallFunc_Array_IsEmpty_ReturnValue) == 0x000018, "Member 'CharacterSheet_C_GetSelfOverheadPosition::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_GetSelfOverheadPosition, CallFunc_Array_Get_Item) == 0x000020, "Member 'CharacterSheet_C_GetSelfOverheadPosition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_GetSelfOverheadPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'CharacterSheet_C_GetSelfOverheadPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_GetSelfOverheadPosition, CallFunc_GetOffsets_ReturnValue) == 0x000030, "Member 'CharacterSheet_C_GetSelfOverheadPosition::CallFunc_GetOffsets_ReturnValue' has a wrong offset!");

// Function CharacterSheet.CharacterSheet_C.TryShowTrialBoardTutorial
// 0x01B0 (0x01B0 - 0x0000)
struct CharacterSheet_C_TryShowTrialBoardTutorial final
{
public:
	bool                                          IsShowingTutorial;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAcquiredRig_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34AA[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34AB[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGameStructureConfig*                 CallFunc_GetGameStructureConfig_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayedMenuTutorial_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34AC[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayedMenuTutorial_ReturnValue_1;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34AD[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget_1;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget_2;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget_3;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBProgramInfoRow                      CallFunc_GetProgramInfo_ReturnValue;               // 0x0058(0x0148)(ConstParm)
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget_4;         // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayedMenuTutorial_ReturnValue_2;      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInTrialBoardPage_bIntrialBoardPage;     // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayedMenuTutorial_ReturnValue_3;      // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayedMenuTutorial_ReturnValue_4;      // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSheet_C_TryShowTrialBoardTutorial) == 0x000008, "Wrong alignment on CharacterSheet_C_TryShowTrialBoardTutorial");
static_assert(sizeof(CharacterSheet_C_TryShowTrialBoardTutorial) == 0x0001B0, "Wrong size on CharacterSheet_C_TryShowTrialBoardTutorial");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, IsShowingTutorial) == 0x000000, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::IsShowingTutorial' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_HasAcquiredRig_ReturnValue) == 0x000001, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_HasAcquiredRig_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_Array_IsEmpty_ReturnValue) == 0x000018, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_GetGameStructureConfig_ReturnValue) == 0x000020, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_GetGameStructureConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_HasPlayedMenuTutorial_ReturnValue) == 0x000029, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_HasPlayedMenuTutorial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_ShowMenuTutorial_createdWidget) == 0x000030, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_ShowMenuTutorial_createdWidget' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_HasPlayedMenuTutorial_ReturnValue_1) == 0x000038, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_HasPlayedMenuTutorial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_ShowMenuTutorial_createdWidget_1) == 0x000040, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_ShowMenuTutorial_createdWidget_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_ShowMenuTutorial_createdWidget_2) == 0x000048, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_ShowMenuTutorial_createdWidget_2' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_ShowMenuTutorial_createdWidget_3) == 0x000050, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_ShowMenuTutorial_createdWidget_3' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_GetProgramInfo_ReturnValue) == 0x000058, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_GetProgramInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_ShowMenuTutorial_createdWidget_4) == 0x0001A0, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_ShowMenuTutorial_createdWidget_4' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_HasPlayedMenuTutorial_ReturnValue_2) == 0x0001A8, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_HasPlayedMenuTutorial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001A9, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_IsInTrialBoardPage_bIntrialBoardPage) == 0x0001AA, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_IsInTrialBoardPage_bIntrialBoardPage' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_BooleanOR_ReturnValue) == 0x0001AB, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_HasPlayedMenuTutorial_ReturnValue_3) == 0x0001AC, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_HasPlayedMenuTutorial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowTrialBoardTutorial, CallFunc_HasPlayedMenuTutorial_ReturnValue_4) == 0x0001AD, "Member 'CharacterSheet_C_TryShowTrialBoardTutorial::CallFunc_HasPlayedMenuTutorial_ReturnValue_4' has a wrong offset!");

// Function CharacterSheet.CharacterSheet_C.TryShowEvidenceTutorial
// 0x0018 (0x0018 - 0x0000)
struct CharacterSheet_C_TryShowEvidenceTutorial final
{
public:
	bool                                          IsShowingTutorial;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34AE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayedMenuTutorial_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSheet_C_TryShowEvidenceTutorial) == 0x000008, "Wrong alignment on CharacterSheet_C_TryShowEvidenceTutorial");
static_assert(sizeof(CharacterSheet_C_TryShowEvidenceTutorial) == 0x000018, "Wrong size on CharacterSheet_C_TryShowEvidenceTutorial");
static_assert(offsetof(CharacterSheet_C_TryShowEvidenceTutorial, IsShowingTutorial) == 0x000000, "Member 'CharacterSheet_C_TryShowEvidenceTutorial::IsShowingTutorial' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowEvidenceTutorial, CallFunc_ShowMenuTutorial_createdWidget) == 0x000008, "Member 'CharacterSheet_C_TryShowEvidenceTutorial::CallFunc_ShowMenuTutorial_createdWidget' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowEvidenceTutorial, CallFunc_HasPlayedMenuTutorial_ReturnValue) == 0x000010, "Member 'CharacterSheet_C_TryShowEvidenceTutorial::CallFunc_HasPlayedMenuTutorial_ReturnValue' has a wrong offset!");

// Function CharacterSheet.CharacterSheet_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct CharacterSheet_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34AF[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0108(0x00B8)()
};
static_assert(alignof(CharacterSheet_C_OnFocusReceived) == 0x000008, "Wrong alignment on CharacterSheet_C_OnFocusReceived");
static_assert(sizeof(CharacterSheet_C_OnFocusReceived) == 0x0001C0, "Wrong size on CharacterSheet_C_OnFocusReceived");
static_assert(offsetof(CharacterSheet_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'CharacterSheet_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'CharacterSheet_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'CharacterSheet_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_OnFocusReceived, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x0000F8, "Member 'CharacterSheet_C_OnFocusReceived::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_OnFocusReceived, CallFunc_GetActiveWidget_ReturnValue) == 0x000100, "Member 'CharacterSheet_C_OnFocusReceived::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000108, "Member 'CharacterSheet_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function CharacterSheet.CharacterSheet_C.TryShowLoadoutTutorial
// 0x0038 (0x0038 - 0x0000)
struct CharacterSheet_C_TryShowLoadoutTutorial final
{
public:
	bool                                          IsShowingTutorial;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayedMenuTutorial_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B0[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayedMenuTutorial_ReturnValue_1;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B1[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget_1;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget_2;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget_3;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayedMenuTutorial_ReturnValue_2;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayedMenuTutorial_ReturnValue_3;      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSheet_C_TryShowLoadoutTutorial) == 0x000008, "Wrong alignment on CharacterSheet_C_TryShowLoadoutTutorial");
static_assert(sizeof(CharacterSheet_C_TryShowLoadoutTutorial) == 0x000038, "Wrong size on CharacterSheet_C_TryShowLoadoutTutorial");
static_assert(offsetof(CharacterSheet_C_TryShowLoadoutTutorial, IsShowingTutorial) == 0x000000, "Member 'CharacterSheet_C_TryShowLoadoutTutorial::IsShowingTutorial' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowLoadoutTutorial, CallFunc_HasPlayedMenuTutorial_ReturnValue) == 0x000001, "Member 'CharacterSheet_C_TryShowLoadoutTutorial::CallFunc_HasPlayedMenuTutorial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowLoadoutTutorial, CallFunc_ShowMenuTutorial_createdWidget) == 0x000008, "Member 'CharacterSheet_C_TryShowLoadoutTutorial::CallFunc_ShowMenuTutorial_createdWidget' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowLoadoutTutorial, CallFunc_HasPlayedMenuTutorial_ReturnValue_1) == 0x000010, "Member 'CharacterSheet_C_TryShowLoadoutTutorial::CallFunc_HasPlayedMenuTutorial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowLoadoutTutorial, CallFunc_ShowMenuTutorial_createdWidget_1) == 0x000018, "Member 'CharacterSheet_C_TryShowLoadoutTutorial::CallFunc_ShowMenuTutorial_createdWidget_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowLoadoutTutorial, CallFunc_ShowMenuTutorial_createdWidget_2) == 0x000020, "Member 'CharacterSheet_C_TryShowLoadoutTutorial::CallFunc_ShowMenuTutorial_createdWidget_2' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowLoadoutTutorial, CallFunc_ShowMenuTutorial_createdWidget_3) == 0x000028, "Member 'CharacterSheet_C_TryShowLoadoutTutorial::CallFunc_ShowMenuTutorial_createdWidget_3' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowLoadoutTutorial, CallFunc_HasPlayedMenuTutorial_ReturnValue_2) == 0x000030, "Member 'CharacterSheet_C_TryShowLoadoutTutorial::CallFunc_HasPlayedMenuTutorial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowLoadoutTutorial, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'CharacterSheet_C_TryShowLoadoutTutorial::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryShowLoadoutTutorial, CallFunc_HasPlayedMenuTutorial_ReturnValue_3) == 0x000032, "Member 'CharacterSheet_C_TryShowLoadoutTutorial::CallFunc_HasPlayedMenuTutorial_ReturnValue_3' has a wrong offset!");

// Function CharacterSheet.CharacterSheet_C.TryStartNextMenuTutorial
// 0x0118 (0x0118 - 0x0000)
struct CharacterSheet_C_TryStartNextMenuTutorial final
{
public:
	bool                                          CallFunc_TryShowBadgesTutorial_isShowingTutorial;  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B3[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B4[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryShowStatsTutorial_isShowingTutorial;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B5[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x002C(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B6[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B7[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue_1;          // 0x008C(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition_1;          // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition_1;       // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShowingMenuTutorial_isShowingTutorial;  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryShowTrialBoardTutorial_isShowingTutorial; // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B8[0x5];                                     // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_2;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryShowEvidenceTutorial_isShowingTutorial; // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34B9[0x6];                                     // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_3;            // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryShowLoadoutTutorial_isShowingTutorial; // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34BA[0x6];                                     // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_4;            // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSheet_C_TryStartNextMenuTutorial) == 0x000008, "Wrong alignment on CharacterSheet_C_TryStartNextMenuTutorial");
static_assert(sizeof(CharacterSheet_C_TryStartNextMenuTutorial) == 0x000118, "Wrong size on CharacterSheet_C_TryStartNextMenuTutorial");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_TryShowBadgesTutorial_isShowingTutorial) == 0x000000, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_TryShowBadgesTutorial_isShowingTutorial' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_GetChildrenCount_ReturnValue) == 0x000014, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_TryShowStatsTutorial_isShowingTutorial) == 0x000028, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_TryShowStatsTutorial_isShowingTutorial' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_GetCachedGeometry_ReturnValue) == 0x00002C, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_LocalToViewport_PixelPosition) == 0x000064, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_LocalToViewport_PixelPosition' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_LocalToViewport_ViewportPosition) == 0x00006C, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_LocalToViewport_ViewportPosition' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_BreakVector2D_X) == 0x000074, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_BreakVector2D_Y) == 0x000078, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00007C, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000080, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000088, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_GetCachedGeometry_ReturnValue_1) == 0x00008C, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_GetCachedGeometry_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_LocalToViewport_PixelPosition_1) == 0x0000C4, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_LocalToViewport_PixelPosition_1' has a wrong offset!");
static_assert(offsetof(CharacterSheet_C_TryStartNextMenuTutorial, CallFunc_LocalToViewport_ViewportPosition_1) == 0x0000CC, "Member 'CharacterSheet_C_TryStartNextMenuTutorial::CallFunc_LocalToViewport_ViewportPosition_1' has a wrong offset!");
