#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSheetTabs

#include "Basic.hpp"


namespace SDK::Params
{

// Function CharacterSheetTabs.CharacterSheetTabs_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CharacterSheetTabs_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSheetTabs_C_PreConstruct) == 0x000001, "Wrong alignment on CharacterSheetTabs_C_PreConstruct");
static_assert(sizeof(CharacterSheetTabs_C_PreConstruct) == 0x000001, "Wrong size on CharacterSheetTabs_C_PreConstruct");
static_assert(offsetof(CharacterSheetTabs_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CharacterSheetTabs_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CharacterSheetTabs.CharacterSheetTabs_C.ExecuteUbergraph_CharacterSheetTabs
// 0x0008 (0x0008 - 0x0000)
struct CharacterSheetTabs_C_ExecuteUbergraph_CharacterSheetTabs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharacterSheetTabs_C_ExecuteUbergraph_CharacterSheetTabs) == 0x000004, "Wrong alignment on CharacterSheetTabs_C_ExecuteUbergraph_CharacterSheetTabs");
static_assert(sizeof(CharacterSheetTabs_C_ExecuteUbergraph_CharacterSheetTabs) == 0x000008, "Wrong size on CharacterSheetTabs_C_ExecuteUbergraph_CharacterSheetTabs");
static_assert(offsetof(CharacterSheetTabs_C_ExecuteUbergraph_CharacterSheetTabs, EntryPoint) == 0x000000, "Member 'CharacterSheetTabs_C_ExecuteUbergraph_CharacterSheetTabs::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharacterSheetTabs_C_ExecuteUbergraph_CharacterSheetTabs, K2Node_Event_IsDesignTime) == 0x000004, "Member 'CharacterSheetTabs_C_ExecuteUbergraph_CharacterSheetTabs::K2Node_Event_IsDesignTime' has a wrong offset!");

}

