#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSheetDocumentsTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterSheetDocumentsTab.CharacterSheetDocumentsTab_C
// 0x02B8 (0x0548 - 0x0290)
class UCharacterSheetDocumentsTab_C final : public URBDocumentsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BottomBorder;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomBorder_1;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ContentLines;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDocumentButton_C*                      DocumentButton;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDocumentButton_C*                      DocumentButton_1;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDocumentButton_C*                      DocumentButton_2;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDocumentButton_C*                      DocumentButton_3;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDocumentButton_C*                      DocumentButton_4;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDocumentButton_C*                      DocumentButton_5;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDocumentButton_C*                      DocumentButton_6;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDocumentButton_C*                      DocumentButton_7;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDocumentGroupButton_C*                 DocumentGroupButton;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDocumentGroupButton_C*                 DocumentGroupButton_1;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDocumentGroupButton_C*                 DocumentGroupButton_2;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDocumentGroupButton_C*                 DocumentGroupButton_3;                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDocumentGroupButton_C*                 DocumentGroupButton_4;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDocumentGroupButton_C*                 DocumentGroupButton_5;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DocumentGroupsContainer;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               DocumentGroupsGamepadPageNav;                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           DocumentGroupsMainContainer;                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           DocumentPanel;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DocumentsBox;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               DocumentsGamepadPageNav;                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      DocumentsGrid;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      DocumentsGroupsGrid;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             DocumentsGroupsScrollBox;                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ExitDocumentButton;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        GamepadLeftPageButton;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        GamepadLeftPageButton_1;                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        GamepadRightPageButton;                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        GamepadRightPageButton_1;                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_89;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MainBackground;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                NextDocumentGroupPageButton;                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                NextDocumentPageButton;                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageNavText;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageNavText_1;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PreviousDocumentGroupPageButton;                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PreviousDocumentPageButton;                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Separator;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StorylineDescription;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         StorylineTitle;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBorder;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBorder_1;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   ActiveDocumentGroupId;                             // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DocumentGroupPageIndex;                            // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DocumentPageIndex;                                 // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DocumentPageCount;                                 // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DocumentsDisplayedCount;                           // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBCollectibleDocumentDefinitionRow    ActiveDocument;                                    // 0x0418(0x00E8)(Edit, BlueprintVisible)
	struct FVector2D                              DragOffset;                                        // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDragging;                                         // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3508[0x3];                                     // 0x0509(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastFocusedGroupIndex;                             // 0x050C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DocumentGroupsPerPage;                             // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DocumentGroupMaxPageIndex;                         // 0x0514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DocumentMaxPageIndex;                              // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3509[0x4];                                     // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRBCollectibleDocumentGroupRow> DocumentGroups;                                    // 0x0520(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnDocumentSeenEvent;                               // 0x0530(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         LastFocusDocumentIndex;                            // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void HandleInputSourceChanged();
	void SetPage(int32 NewPageIndex);
	void UpdateGamepadPageNav();
	void NextPage();
	void PreviousPage();
	void GetDocumentIndexFromId(class FName ID, int32* Param_Index);
	void GetGroupIndexFromId(class FName ID, int32* Param_Index);
	void HandleFocusTransmission();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	bool IsReadyToClose();
	void OnDocumentSeen();
	void OnDocumentUnselected();
	void OnDocumentSelected(const struct FRBCollectibleDocumentDefinitionRow& Document);
	void OnDocumentGroupHovered(class UWidget* HoveredWidget);
	void OnDocumentGroupSelected(class FName DocumentGroupId);
	void SetupDocumentGroupDetails();
	void SetupDocuments();
	void SetupDocumentGroups();
	void Refresh();
	void OnBackRequested();
	void Construct();
	void BndEvt__CharacterSheetDocumentsTab_NextPageButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CharacterSheetDocumentsTab_PreviousPageButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CharacterSheetDocumentsTab_ExitDocumentButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Event_OnTabUnselected();
	void BndEvt__CharacterSheetDocumentsTab_PreviousDocumentGroupPageButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CharacterSheetDocumentsTab_NextDocumentGroupPageButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void OnGamepadPageLeft();
	void OnGamepadPageRight();
	void Destruct();
	void Event_OnTabSelected();
	void Event_InputSourceChanged(bool bIsGamepad);
	void ExecuteUbergraph_CharacterSheetDocumentsTab(int32 EntryPoint);
	void OnDocumentSeenEvent__DelegateSignature();

	class FText GetPageTitle() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterSheetDocumentsTab_C">();
	}
	static class UCharacterSheetDocumentsTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterSheetDocumentsTab_C>();
	}
};
static_assert(alignof(UCharacterSheetDocumentsTab_C) == 0x000008, "Wrong alignment on UCharacterSheetDocumentsTab_C");
static_assert(sizeof(UCharacterSheetDocumentsTab_C) == 0x000548, "Wrong size on UCharacterSheetDocumentsTab_C");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, UberGraphFrame) == 0x000290, "Member 'UCharacterSheetDocumentsTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, BottomBorder) == 0x000298, "Member 'UCharacterSheetDocumentsTab_C::BottomBorder' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, BottomBorder_1) == 0x0002A0, "Member 'UCharacterSheetDocumentsTab_C::BottomBorder_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, ContentLines) == 0x0002A8, "Member 'UCharacterSheetDocumentsTab_C::ContentLines' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentButton) == 0x0002B0, "Member 'UCharacterSheetDocumentsTab_C::DocumentButton' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentButton_1) == 0x0002B8, "Member 'UCharacterSheetDocumentsTab_C::DocumentButton_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentButton_2) == 0x0002C0, "Member 'UCharacterSheetDocumentsTab_C::DocumentButton_2' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentButton_3) == 0x0002C8, "Member 'UCharacterSheetDocumentsTab_C::DocumentButton_3' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentButton_4) == 0x0002D0, "Member 'UCharacterSheetDocumentsTab_C::DocumentButton_4' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentButton_5) == 0x0002D8, "Member 'UCharacterSheetDocumentsTab_C::DocumentButton_5' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentButton_6) == 0x0002E0, "Member 'UCharacterSheetDocumentsTab_C::DocumentButton_6' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentButton_7) == 0x0002E8, "Member 'UCharacterSheetDocumentsTab_C::DocumentButton_7' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentGroupButton) == 0x0002F0, "Member 'UCharacterSheetDocumentsTab_C::DocumentGroupButton' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentGroupButton_1) == 0x0002F8, "Member 'UCharacterSheetDocumentsTab_C::DocumentGroupButton_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentGroupButton_2) == 0x000300, "Member 'UCharacterSheetDocumentsTab_C::DocumentGroupButton_2' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentGroupButton_3) == 0x000308, "Member 'UCharacterSheetDocumentsTab_C::DocumentGroupButton_3' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentGroupButton_4) == 0x000310, "Member 'UCharacterSheetDocumentsTab_C::DocumentGroupButton_4' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentGroupButton_5) == 0x000318, "Member 'UCharacterSheetDocumentsTab_C::DocumentGroupButton_5' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentGroupsContainer) == 0x000320, "Member 'UCharacterSheetDocumentsTab_C::DocumentGroupsContainer' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentGroupsGamepadPageNav) == 0x000328, "Member 'UCharacterSheetDocumentsTab_C::DocumentGroupsGamepadPageNav' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentGroupsMainContainer) == 0x000330, "Member 'UCharacterSheetDocumentsTab_C::DocumentGroupsMainContainer' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentPanel) == 0x000338, "Member 'UCharacterSheetDocumentsTab_C::DocumentPanel' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentsBox) == 0x000340, "Member 'UCharacterSheetDocumentsTab_C::DocumentsBox' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentsGamepadPageNav) == 0x000348, "Member 'UCharacterSheetDocumentsTab_C::DocumentsGamepadPageNav' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentsGrid) == 0x000350, "Member 'UCharacterSheetDocumentsTab_C::DocumentsGrid' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentsGroupsGrid) == 0x000358, "Member 'UCharacterSheetDocumentsTab_C::DocumentsGroupsGrid' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentsGroupsScrollBox) == 0x000360, "Member 'UCharacterSheetDocumentsTab_C::DocumentsGroupsScrollBox' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, ExitDocumentButton) == 0x000368, "Member 'UCharacterSheetDocumentsTab_C::ExitDocumentButton' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, GamepadLeftPageButton) == 0x000370, "Member 'UCharacterSheetDocumentsTab_C::GamepadLeftPageButton' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, GamepadLeftPageButton_1) == 0x000378, "Member 'UCharacterSheetDocumentsTab_C::GamepadLeftPageButton_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, GamepadRightPageButton) == 0x000380, "Member 'UCharacterSheetDocumentsTab_C::GamepadRightPageButton' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, GamepadRightPageButton_1) == 0x000388, "Member 'UCharacterSheetDocumentsTab_C::GamepadRightPageButton_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, Image) == 0x000390, "Member 'UCharacterSheetDocumentsTab_C::Image' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, Image_89) == 0x000398, "Member 'UCharacterSheetDocumentsTab_C::Image_89' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, MainBackground) == 0x0003A0, "Member 'UCharacterSheetDocumentsTab_C::MainBackground' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, NextDocumentGroupPageButton) == 0x0003A8, "Member 'UCharacterSheetDocumentsTab_C::NextDocumentGroupPageButton' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, NextDocumentPageButton) == 0x0003B0, "Member 'UCharacterSheetDocumentsTab_C::NextDocumentPageButton' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, PageNavText) == 0x0003B8, "Member 'UCharacterSheetDocumentsTab_C::PageNavText' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, PageNavText_1) == 0x0003C0, "Member 'UCharacterSheetDocumentsTab_C::PageNavText_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, PreviousDocumentGroupPageButton) == 0x0003C8, "Member 'UCharacterSheetDocumentsTab_C::PreviousDocumentGroupPageButton' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, PreviousDocumentPageButton) == 0x0003D0, "Member 'UCharacterSheetDocumentsTab_C::PreviousDocumentPageButton' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, Separator) == 0x0003D8, "Member 'UCharacterSheetDocumentsTab_C::Separator' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, StorylineDescription) == 0x0003E0, "Member 'UCharacterSheetDocumentsTab_C::StorylineDescription' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, StorylineTitle) == 0x0003E8, "Member 'UCharacterSheetDocumentsTab_C::StorylineTitle' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, TopBorder) == 0x0003F0, "Member 'UCharacterSheetDocumentsTab_C::TopBorder' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, TopBorder_1) == 0x0003F8, "Member 'UCharacterSheetDocumentsTab_C::TopBorder_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, ActiveDocumentGroupId) == 0x000400, "Member 'UCharacterSheetDocumentsTab_C::ActiveDocumentGroupId' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentGroupPageIndex) == 0x000408, "Member 'UCharacterSheetDocumentsTab_C::DocumentGroupPageIndex' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentPageIndex) == 0x00040C, "Member 'UCharacterSheetDocumentsTab_C::DocumentPageIndex' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentPageCount) == 0x000410, "Member 'UCharacterSheetDocumentsTab_C::DocumentPageCount' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentsDisplayedCount) == 0x000414, "Member 'UCharacterSheetDocumentsTab_C::DocumentsDisplayedCount' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, ActiveDocument) == 0x000418, "Member 'UCharacterSheetDocumentsTab_C::ActiveDocument' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DragOffset) == 0x000500, "Member 'UCharacterSheetDocumentsTab_C::DragOffset' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, bDragging) == 0x000508, "Member 'UCharacterSheetDocumentsTab_C::bDragging' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, LastFocusedGroupIndex) == 0x00050C, "Member 'UCharacterSheetDocumentsTab_C::LastFocusedGroupIndex' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentGroupsPerPage) == 0x000510, "Member 'UCharacterSheetDocumentsTab_C::DocumentGroupsPerPage' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentGroupMaxPageIndex) == 0x000514, "Member 'UCharacterSheetDocumentsTab_C::DocumentGroupMaxPageIndex' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentMaxPageIndex) == 0x000518, "Member 'UCharacterSheetDocumentsTab_C::DocumentMaxPageIndex' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, DocumentGroups) == 0x000520, "Member 'UCharacterSheetDocumentsTab_C::DocumentGroups' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, OnDocumentSeenEvent) == 0x000530, "Member 'UCharacterSheetDocumentsTab_C::OnDocumentSeenEvent' has a wrong offset!");
static_assert(offsetof(UCharacterSheetDocumentsTab_C, LastFocusDocumentIndex) == 0x000540, "Member 'UCharacterSheetDocumentsTab_C::LastFocusDocumentIndex' has a wrong offset!");

}

