#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cine_Futterman_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Cine_Futterman_AnimBP.Cine_Futterman_AnimBP_C
// 0x05F0 (0x08B0 - 0x02C0)
class UCine_Futterman_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2E32[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x02F8(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0378(0x00C0)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0438(0x01D8)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0610(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0630(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0650(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0758(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x07D8(0x00A8)()
	class UAnimSequence*                          AnimSequence;                                      // 0x0880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Position;                                          // 0x0888(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               HeadPosition;                                      // 0x088C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ResetRoot;                                         // 0x08A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_Cine_Futterman_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cine_Futterman_AnimBP_C">();
	}
	static class UCine_Futterman_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCine_Futterman_AnimBP_C>();
	}
};
static_assert(alignof(UCine_Futterman_AnimBP_C) == 0x000010, "Wrong alignment on UCine_Futterman_AnimBP_C");
static_assert(sizeof(UCine_Futterman_AnimBP_C) == 0x0008B0, "Wrong size on UCine_Futterman_AnimBP_C");
static_assert(offsetof(UCine_Futterman_AnimBP_C, UberGraphFrame) == 0x0002C0, "Member 'UCine_Futterman_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCine_Futterman_AnimBP_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UCine_Futterman_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UCine_Futterman_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x0002F8, "Member 'UCine_Futterman_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UCine_Futterman_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x000378, "Member 'UCine_Futterman_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UCine_Futterman_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000438, "Member 'UCine_Futterman_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UCine_Futterman_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000610, "Member 'UCine_Futterman_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UCine_Futterman_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000630, "Member 'UCine_Futterman_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UCine_Futterman_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000650, "Member 'UCine_Futterman_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UCine_Futterman_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x000758, "Member 'UCine_Futterman_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UCine_Futterman_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x0007D8, "Member 'UCine_Futterman_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UCine_Futterman_AnimBP_C, AnimSequence) == 0x000880, "Member 'UCine_Futterman_AnimBP_C::AnimSequence' has a wrong offset!");
static_assert(offsetof(UCine_Futterman_AnimBP_C, Position) == 0x000888, "Member 'UCine_Futterman_AnimBP_C::Position' has a wrong offset!");
static_assert(offsetof(UCine_Futterman_AnimBP_C, HeadPosition) == 0x00088C, "Member 'UCine_Futterman_AnimBP_C::HeadPosition' has a wrong offset!");
static_assert(offsetof(UCine_Futterman_AnimBP_C, Mesh) == 0x000898, "Member 'UCine_Futterman_AnimBP_C::Mesh' has a wrong offset!");
static_assert(offsetof(UCine_Futterman_AnimBP_C, ResetRoot) == 0x0008A0, "Member 'UCine_Futterman_AnimBP_C::ResetRoot' has a wrong offset!");

}

