#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CineGooseberryMinus01_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function CineGooseberry-01_BP.CineGooseberry-01_BP_C.GetFuttermanAnimation
// 0x0010 (0x0010 - 0x0000)
struct CineGooseberryMinus01_BP_C_GetFuttermanAnimation final
{
public:
	class USkeletalMeshComponent*                 NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Animation;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CineGooseberryMinus01_BP_C_GetFuttermanAnimation) == 0x000008, "Wrong alignment on CineGooseberryMinus01_BP_C_GetFuttermanAnimation");
static_assert(sizeof(CineGooseberryMinus01_BP_C_GetFuttermanAnimation) == 0x000010, "Wrong size on CineGooseberryMinus01_BP_C_GetFuttermanAnimation");
static_assert(offsetof(CineGooseberryMinus01_BP_C_GetFuttermanAnimation, NewParam) == 0x000000, "Member 'CineGooseberryMinus01_BP_C_GetFuttermanAnimation::NewParam' has a wrong offset!");
static_assert(offsetof(CineGooseberryMinus01_BP_C_GetFuttermanAnimation, Animation) == 0x000008, "Member 'CineGooseberryMinus01_BP_C_GetFuttermanAnimation::Animation' has a wrong offset!");

// Function CineGooseberry-01_BP.CineGooseberry-01_BP_C.GetCineFaceAnimBP
// 0x0020 (0x0020 - 0x0000)
struct CineGooseberryMinus01_BP_C_GetCineFaceAnimBP final
{
public:
	class UCineFace_AnimBP_C*                     CineFaceAnimBP;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCineFace_AnimBP_C*                     K2Node_DynamicCast_AsCine_Face_Anim_BP;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CineGooseberryMinus01_BP_C_GetCineFaceAnimBP) == 0x000008, "Wrong alignment on CineGooseberryMinus01_BP_C_GetCineFaceAnimBP");
static_assert(sizeof(CineGooseberryMinus01_BP_C_GetCineFaceAnimBP) == 0x000020, "Wrong size on CineGooseberryMinus01_BP_C_GetCineFaceAnimBP");
static_assert(offsetof(CineGooseberryMinus01_BP_C_GetCineFaceAnimBP, CineFaceAnimBP) == 0x000000, "Member 'CineGooseberryMinus01_BP_C_GetCineFaceAnimBP::CineFaceAnimBP' has a wrong offset!");
static_assert(offsetof(CineGooseberryMinus01_BP_C_GetCineFaceAnimBP, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'CineGooseberryMinus01_BP_C_GetCineFaceAnimBP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CineGooseberryMinus01_BP_C_GetCineFaceAnimBP, K2Node_DynamicCast_AsCine_Face_Anim_BP) == 0x000010, "Member 'CineGooseberryMinus01_BP_C_GetCineFaceAnimBP::K2Node_DynamicCast_AsCine_Face_Anim_BP' has a wrong offset!");
static_assert(offsetof(CineGooseberryMinus01_BP_C_GetCineFaceAnimBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CineGooseberryMinus01_BP_C_GetCineFaceAnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CineGooseberry-01_BP.CineGooseberry-01_BP_C.GetPoseAsset
// 0x0008 (0x0008 - 0x0000)
struct CineGooseberryMinus01_BP_C_GetPoseAsset final
{
public:
	class UPoseAsset*                             PoseAsset;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CineGooseberryMinus01_BP_C_GetPoseAsset) == 0x000008, "Wrong alignment on CineGooseberryMinus01_BP_C_GetPoseAsset");
static_assert(sizeof(CineGooseberryMinus01_BP_C_GetPoseAsset) == 0x000008, "Wrong size on CineGooseberryMinus01_BP_C_GetPoseAsset");
static_assert(offsetof(CineGooseberryMinus01_BP_C_GetPoseAsset, PoseAsset) == 0x000000, "Member 'CineGooseberryMinus01_BP_C_GetPoseAsset::PoseAsset' has a wrong offset!");

}

