#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CineCoyleMinus01_BP

#include "Basic.hpp"

#include "CineCharacterBase_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CineCoyle-01_BP.CineCoyle-01_BP_C
// 0x0038 (0x02B0 - 0x0278)
class ACineCoyleMinus01_BP_C final : public ACineCharacterBase_BP_C
{
public:
	class URBSoundComponent*                      RBSound;                                           // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head;                                              // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BatonElectric_Impact;                              // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BatonElectric;                                     // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   BatonElectric_Light;                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Weapon;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Body;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CineCoyle-01_BP_C">();
	}
	static class ACineCoyleMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACineCoyleMinus01_BP_C>();
	}
};
static_assert(alignof(ACineCoyleMinus01_BP_C) == 0x000008, "Wrong alignment on ACineCoyleMinus01_BP_C");
static_assert(sizeof(ACineCoyleMinus01_BP_C) == 0x0002B0, "Wrong size on ACineCoyleMinus01_BP_C");
static_assert(offsetof(ACineCoyleMinus01_BP_C, RBSound) == 0x000278, "Member 'ACineCoyleMinus01_BP_C::RBSound' has a wrong offset!");
static_assert(offsetof(ACineCoyleMinus01_BP_C, Head) == 0x000280, "Member 'ACineCoyleMinus01_BP_C::Head' has a wrong offset!");
static_assert(offsetof(ACineCoyleMinus01_BP_C, BatonElectric_Impact) == 0x000288, "Member 'ACineCoyleMinus01_BP_C::BatonElectric_Impact' has a wrong offset!");
static_assert(offsetof(ACineCoyleMinus01_BP_C, BatonElectric) == 0x000290, "Member 'ACineCoyleMinus01_BP_C::BatonElectric' has a wrong offset!");
static_assert(offsetof(ACineCoyleMinus01_BP_C, BatonElectric_Light) == 0x000298, "Member 'ACineCoyleMinus01_BP_C::BatonElectric_Light' has a wrong offset!");
static_assert(offsetof(ACineCoyleMinus01_BP_C, Weapon) == 0x0002A0, "Member 'ACineCoyleMinus01_BP_C::Weapon' has a wrong offset!");
static_assert(offsetof(ACineCoyleMinus01_BP_C, Body) == 0x0002A8, "Member 'ACineCoyleMinus01_BP_C::Body' has a wrong offset!");

}

