#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Client_InGameMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Client_InGameMenu.Client_InGameMenu_C.ExecuteUbergraph_Client_InGameMenu
// 0x0100 (0x0100 - 0x0000)
struct Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F48[0x4];                                      // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F49[0x3];                                      // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F4A[0x1];                                      // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreCheatsEnabled_ReturnValue;             // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F4B[0x3];                                      // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuTabButton*                       K2Node_ComponentBoundEvent_Button_3;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuTabButton*                       K2Node_ComponentBoundEvent_Button_2;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBSocialMenuManager*                   CallFunc_GetSocialMenuManager_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuitMenu_C*                            CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBackToLobbyMenu_C*                     CallFunc_Create_ReturnValue_1;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBController*                          CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F4C[0x6];                                      // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F4D[0x6];                                      // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPopUpConfirmCancelWidget*            CallFunc_CreatePopUpConfirmCancel_ReturnValue;     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F4E[0x7];                                      // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBController*                          CallFunc_GetLocalPlayerController_ReturnValue_1;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOptionsMenu_C*                         CallFunc_Create_ReturnValue_2;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F4F[0x7];                                      // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue_1;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShouldHide;                          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F50[0x5];                                      // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button_1;               // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBUserWidget*                          CallFunc_GetCurrentFocusedWidget_FocusedWidget;    // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F51[0x5];                                      // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Select_Default_1;                           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsGamepad;                           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFeatureSwitch_ReturnValue;           // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F52[0x1];                                      // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu) == 0x000008, "Wrong alignment on Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu");
static_assert(sizeof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu) == 0x000100, "Wrong size on Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, EntryPoint) == 0x000000, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_bool_Variable) == 0x000010, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_byte_Variable) == 0x000024, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_byte_Variable_1) == 0x000025, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_bool_Variable_1) == 0x000026, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_bool_Variable_2) == 0x000038, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_byte_Variable_2) == 0x000039, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_byte_Variable_3) == 0x00003A, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_AreCheatsEnabled_ReturnValue) == 0x00003B, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_AreCheatsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_Event_IsDesignTime) == 0x00003C, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_ComponentBoundEvent_Button_3) == 0x000040, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_ComponentBoundEvent_Button_2) == 0x000048, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetSocialMenuManager_ReturnValue) == 0x000050, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetSocialMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_Create_ReturnValue) == 0x000058, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_Create_ReturnValue_1) == 0x000060, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000068, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000070, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsConsole_ReturnValue) == 0x000079, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetRBGameStateLobby_ReturnValue) == 0x000080, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetRBGameStateLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000088, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsValid_ReturnValue_1) == 0x000089, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_CreatePopUpConfirmCancel_ReturnValue) == 0x000090, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_CreatePopUpConfirmCancel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_BooleanAND_ReturnValue) == 0x000098, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetLocalPlayerController_ReturnValue_1) == 0x0000A0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetLocalPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_Create_ReturnValue_2) == 0x0000A8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsValid_ReturnValue_2) == 0x0000B0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetRBGameStateLobby_ReturnValue_1) == 0x0000B8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetRBGameStateLobby_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsValid_ReturnValue_3) == 0x0000C0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_Event_bShouldHide) == 0x0000C1, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_Event_bShouldHide' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_Select_Default) == 0x0000C2, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_ComponentBoundEvent_Button_1) == 0x0000C8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetCurrentFocusedWidget_FocusedWidget) == 0x0000D0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetCurrentFocusedWidget_FocusedWidget' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsVisible_ReturnValue) == 0x0000D8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsVisible_ReturnValue_1) == 0x0000D9, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsValid_ReturnValue_4) == 0x0000DA, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_Select_Default_1) == 0x0000E0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_Event_bIsGamepad) == 0x0000E8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_Event_bIsGamepad' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsVisible_ReturnValue_2) == 0x0000E9, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_CheckFeatureSwitch_ReturnValue) == 0x0000EA, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_CheckFeatureSwitch_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000EC, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_Select_Default_2) == 0x0000FC, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_Select_Default_2' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature");
static_assert(sizeof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature) == 0x000008, "Wrong size on Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature");
static_assert(offsetof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.Event_InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct Client_InGameMenu_C_Event_InputSourceChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_Event_InputSourceChanged) == 0x000001, "Wrong alignment on Client_InGameMenu_C_Event_InputSourceChanged");
static_assert(sizeof(Client_InGameMenu_C_Event_InputSourceChanged) == 0x000001, "Wrong size on Client_InGameMenu_C_Event_InputSourceChanged");
static_assert(offsetof(Client_InGameMenu_C_Event_InputSourceChanged, bIsGamepad) == 0x000000, "Member 'Client_InGameMenu_C_Event_InputSourceChanged::bIsGamepad' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Client_InGameMenu_C_BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on Client_InGameMenu_C_BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(sizeof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong size on Client_InGameMenu_C_BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(offsetof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'Client_InGameMenu_C_BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.Event_OnUnfocusMenu
// 0x0001 (0x0001 - 0x0000)
struct Client_InGameMenu_C_Event_OnUnfocusMenu final
{
public:
	bool                                          bShouldHide;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_Event_OnUnfocusMenu) == 0x000001, "Wrong alignment on Client_InGameMenu_C_Event_OnUnfocusMenu");
static_assert(sizeof(Client_InGameMenu_C_Event_OnUnfocusMenu) == 0x000001, "Wrong size on Client_InGameMenu_C_Event_OnUnfocusMenu");
static_assert(offsetof(Client_InGameMenu_C_Event_OnUnfocusMenu, bShouldHide) == 0x000000, "Member 'Client_InGameMenu_C_Event_OnUnfocusMenu::bShouldHide' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature final
{
public:
	class URBMenuTabButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature");
static_assert(sizeof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature");
static_assert(offsetof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Client_InGameMenu_C_BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature final
{
public:
	class URBMenuTabButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Client_InGameMenu_C_BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature");
static_assert(sizeof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Client_InGameMenu_C_BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature");
static_assert(offsetof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Client_InGameMenu_C_BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Client_InGameMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_PreConstruct) == 0x000001, "Wrong alignment on Client_InGameMenu_C_PreConstruct");
static_assert(sizeof(Client_InGameMenu_C_PreConstruct) == 0x000001, "Wrong size on Client_InGameMenu_C_PreConstruct");
static_assert(offsetof(Client_InGameMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Client_InGameMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.GetDevOptionsBtnVisibility
// 0x0002 (0x0002 - 0x0000)
struct Client_InGameMenu_C_GetDevOptionsBtnVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreCheatsEnabled_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_GetDevOptionsBtnVisibility) == 0x000001, "Wrong alignment on Client_InGameMenu_C_GetDevOptionsBtnVisibility");
static_assert(sizeof(Client_InGameMenu_C_GetDevOptionsBtnVisibility) == 0x000002, "Wrong size on Client_InGameMenu_C_GetDevOptionsBtnVisibility");
static_assert(offsetof(Client_InGameMenu_C_GetDevOptionsBtnVisibility, ReturnValue) == 0x000000, "Member 'Client_InGameMenu_C_GetDevOptionsBtnVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_GetDevOptionsBtnVisibility, CallFunc_AreCheatsEnabled_ReturnValue) == 0x000001, "Member 'Client_InGameMenu_C_GetDevOptionsBtnVisibility::CallFunc_AreCheatsEnabled_ReturnValue' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.GetReturnToLobbyBtnVisibility
// 0x0018 (0x0018 - 0x0000)
struct Client_InGameMenu_C_GetReturnToLobbyBtnVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F53[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_GetReturnToLobbyBtnVisibility) == 0x000008, "Wrong alignment on Client_InGameMenu_C_GetReturnToLobbyBtnVisibility");
static_assert(sizeof(Client_InGameMenu_C_GetReturnToLobbyBtnVisibility) == 0x000018, "Wrong size on Client_InGameMenu_C_GetReturnToLobbyBtnVisibility");
static_assert(offsetof(Client_InGameMenu_C_GetReturnToLobbyBtnVisibility, ReturnValue) == 0x000000, "Member 'Client_InGameMenu_C_GetReturnToLobbyBtnVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_GetReturnToLobbyBtnVisibility, CallFunc_GetRBGameStateLobby_ReturnValue) == 0x000008, "Member 'Client_InGameMenu_C_GetReturnToLobbyBtnVisibility::CallFunc_GetRBGameStateLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_GetReturnToLobbyBtnVisibility, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Client_InGameMenu_C_GetReturnToLobbyBtnVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.GetReturnToLobbyBtnIsEnabled
// 0x0018 (0x0018 - 0x0000)
struct Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F54[0x7];                                      // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBController*                          CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLeaving_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled) == 0x000008, "Wrong alignment on Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled");
static_assert(sizeof(Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled) == 0x000018, "Wrong size on Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled");
static_assert(offsetof(Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled, ReturnValue) == 0x000000, "Member 'Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000008, "Member 'Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled, CallFunc_IsLeaving_ReturnValue) == 0x000010, "Member 'Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled::CallFunc_IsLeaving_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.GetQuitFacilityButtonsEnabled
// 0x0001 (0x0001 - 0x0000)
struct Client_InGameMenu_C_GetQuitFacilityButtonsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_GetQuitFacilityButtonsEnabled) == 0x000001, "Wrong alignment on Client_InGameMenu_C_GetQuitFacilityButtonsEnabled");
static_assert(sizeof(Client_InGameMenu_C_GetQuitFacilityButtonsEnabled) == 0x000001, "Wrong size on Client_InGameMenu_C_GetQuitFacilityButtonsEnabled");
static_assert(offsetof(Client_InGameMenu_C_GetQuitFacilityButtonsEnabled, ReturnValue) == 0x000000, "Member 'Client_InGameMenu_C_GetQuitFacilityButtonsEnabled::ReturnValue' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.SetupVariators
// 0x0258 (0x0258 - 0x0000)
struct Client_InGameMenu_C_SetupVariators final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F55[0x4];                                      // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInGameMenuVariatorEntry_C*             CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F56[0x4];                                      // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F57[0x4];                                      // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGameStructureConfig*                 CallFunc_GetGameStructureConfig_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBVariatorManager*                     CallFunc_GetVariatorManager_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVariatorUniqueTypeActive_ReturnValue;   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVariatorUniqueTypeActive_ReturnValue_1; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F58[0x4];                                      // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGameStructureConfig*                 CallFunc_GetGameStructureConfig_ReturnValue_1;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBVariatorManager*                     CallFunc_GetVariatorManager_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class URBVariatorInfo*>                CallFunc_GetCurrentVariatorConfigs_ReturnValue;    // 0x0070(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F59[0x7];                                      // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBVariatorInfo*                        CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5A[0x3];                                      // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTrialId_ReturnValue;                   // 0x0098(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5B[0x7];                                      // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBTrialInfoRow                        CallFunc_GetTrialInfo_ReturnValue;                 // 0x00A8(0x0158)(ConstParm)
	TArray<class URBVariatorInfo*>                CallFunc_GetVariatorInfos_ReturnValue;             // 0x0200(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5C[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBVariatorInfo*                        CallFunc_Array_Get_Item_1;                         // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5D[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URBVariatorAction*>              CallFunc_GetActions_ReturnValue;                   // 0x0228(0x0010)(ConstParm, ReferenceParm)
	class URBVariatorAction*                      CallFunc_Array_Get_Item_2;                         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5E[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBVariatorAction_UniqueVariatorType*   K2Node_DynamicCast_AsUnique_Variator_Type;         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_SetupVariators) == 0x000008, "Wrong alignment on Client_InGameMenu_C_SetupVariators");
static_assert(sizeof(Client_InGameMenu_C_SetupVariators) == 0x000258, "Wrong size on Client_InGameMenu_C_SetupVariators");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Client_InGameMenu_C_SetupVariators::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Client_InGameMenu_C_SetupVariators::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'Client_InGameMenu_C_SetupVariators::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'Client_InGameMenu_C_SetupVariators::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, Temp_int_Array_Index_Variable_2) == 0x000018, "Member 'Client_InGameMenu_C_SetupVariators::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Create_ReturnValue) == 0x000020, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, Temp_int_Loop_Counter_Variable_2) == 0x000028, "Member 'Client_InGameMenu_C_SetupVariators::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000030, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Add_IntInt_ReturnValue_2) == 0x000038, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_GetGameStructureConfig_ReturnValue) == 0x000040, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_GetGameStructureConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_GetVariatorManager_ReturnValue) == 0x000048, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_GetVariatorManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_IsVariatorUniqueTypeActive_ReturnValue) == 0x000050, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_IsVariatorUniqueTypeActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_IsVariatorUniqueTypeActive_ReturnValue_1) == 0x000051, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_IsVariatorUniqueTypeActive_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Not_PreBool_ReturnValue) == 0x000052, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Not_PreBool_ReturnValue_1) == 0x000053, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_GetGameStructureConfig_ReturnValue_1) == 0x000058, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_GetGameStructureConfig_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_GetVariatorManager_ReturnValue_1) == 0x000060, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_GetVariatorManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_GetRBGameState_ReturnValue) == 0x000068, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_GetRBGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_GetCurrentVariatorConfigs_ReturnValue) == 0x000070, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_GetCurrentVariatorConfigs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Array_Get_Item) == 0x000088, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_GetTrialId_ReturnValue) == 0x000098, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_GetTrialId_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_GetTrialInfo_ReturnValue) == 0x0000A8, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_GetTrialInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_GetVariatorInfos_ReturnValue) == 0x000200, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_GetVariatorInfos_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Array_Length_ReturnValue_1) == 0x000210, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Array_Get_Item_1) == 0x000218, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Less_IntInt_ReturnValue_1) == 0x000220, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_GetActions_ReturnValue) == 0x000228, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_GetActions_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Array_Get_Item_2) == 0x000238, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Array_Length_ReturnValue_2) == 0x000240, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, K2Node_DynamicCast_AsUnique_Variator_Type) == 0x000248, "Member 'Client_InGameMenu_C_SetupVariators::K2Node_DynamicCast_AsUnique_Variator_Type' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, K2Node_DynamicCast_bSuccess) == 0x000250, "Member 'Client_InGameMenu_C_SetupVariators::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, CallFunc_Less_IntInt_ReturnValue_2) == 0x000251, "Member 'Client_InGameMenu_C_SetupVariators::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_SetupVariators, K2Node_SwitchEnum_CmpSuccess) == 0x000252, "Member 'Client_InGameMenu_C_SetupVariators::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.OnMouseButtonDown
// 0x0220 (0x0220 - 0x0000)
struct Client_InGameMenu_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0160(0x00B8)()
	class URBSocialMenuManager*                   CallFunc_GetSocialMenuManager_ReturnValue;         // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Client_InGameMenu_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on Client_InGameMenu_C_OnMouseButtonDown");
static_assert(sizeof(Client_InGameMenu_C_OnMouseButtonDown) == 0x000220, "Wrong size on Client_InGameMenu_C_OnMouseButtonDown");
static_assert(offsetof(Client_InGameMenu_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'Client_InGameMenu_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'Client_InGameMenu_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'Client_InGameMenu_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000160, "Member 'Client_InGameMenu_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_OnMouseButtonDown, CallFunc_GetSocialMenuManager_ReturnValue) == 0x000218, "Member 'Client_InGameMenu_C_OnMouseButtonDown::CallFunc_GetSocialMenuManager_ReturnValue' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.Setup Loadout
// 0x0538 (0x0538 - 0x0000)
struct Client_InGameMenu_C_Setup_Loadout final
{
public:
	TArray<class FName>                           CurrentPerkCategoryEquippedPerks;                  // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         CurrentPerkCategoryIndex;                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPerkCategory                                 CurrentPerkCategory;                               // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5F[0x3];                                      // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AvailablePerkSlots;                                // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F60[0x3];                                      // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F61[0x3];                                      // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
