#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonMenuLibrary

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CommonMenuLibrary.CommonMenuLibrary_C.GetNPCColors
// 0x00E0 (0x00E0 - 0x0000)
struct CommonMenuLibrary_C_GetNPCColors final
{
public:
	EMetaNPCType                                  NPCType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIColors                              Colors;                                            // 0x0010(0x0040)(Parm, OutParm, NoDestructor)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMetaNPCSettings                       CallFunc_GetNPCSettings_ReturnValue;               // 0x0058(0x0088)(ConstParm)
};
static_assert(alignof(CommonMenuLibrary_C_GetNPCColors) == 0x000008, "Wrong alignment on CommonMenuLibrary_C_GetNPCColors");
static_assert(sizeof(CommonMenuLibrary_C_GetNPCColors) == 0x0000E0, "Wrong size on CommonMenuLibrary_C_GetNPCColors");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCColors, NPCType) == 0x000000, "Member 'CommonMenuLibrary_C_GetNPCColors::NPCType' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCColors, __WorldContext) == 0x000008, "Member 'CommonMenuLibrary_C_GetNPCColors::__WorldContext' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCColors, Colors) == 0x000010, "Member 'CommonMenuLibrary_C_GetNPCColors::Colors' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCColors, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000050, "Member 'CommonMenuLibrary_C_GetNPCColors::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCColors, CallFunc_GetNPCSettings_ReturnValue) == 0x000058, "Member 'CommonMenuLibrary_C_GetNPCColors::CallFunc_GetNPCSettings_ReturnValue' has a wrong offset!");

// Function CommonMenuLibrary.CommonMenuLibrary_C.ShowMenuTutorial
// 0x0080 (0x0080 - 0x0000)
struct CommonMenuLibrary_C_ShowMenuTutorial final
{
public:
	class FName                                   TutorialId;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TutorialText;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWidget*                                PopUpAnchorInfo;                                   // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuPlacement                                PopupPlacement;                                    // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                FocusAnchorInfo;                                   // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowBorder;                                        // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuTutorials_C*                       CreatedWidget;                                     // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TutorialMenuClass;                                 // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuTutorials_C*                       CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuWidget*                          CallFunc_BP_GetMenuPage_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuTutorials_C*                       K2Node_DynamicCast_AsMenu_Tutorials;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonMenuLibrary_C_ShowMenuTutorial) == 0x000008, "Wrong alignment on CommonMenuLibrary_C_ShowMenuTutorial");
static_assert(sizeof(CommonMenuLibrary_C_ShowMenuTutorial) == 0x000080, "Wrong size on CommonMenuLibrary_C_ShowMenuTutorial");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, TutorialId) == 0x000000, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::TutorialId' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, TutorialText) == 0x000008, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::TutorialText' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, PopUpAnchorInfo) == 0x000020, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::PopUpAnchorInfo' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, PopupPlacement) == 0x000028, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::PopupPlacement' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, FocusAnchorInfo) == 0x000030, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::FocusAnchorInfo' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, ShowBorder) == 0x000038, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::ShowBorder' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, __WorldContext) == 0x000040, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::__WorldContext' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, CreatedWidget) == 0x000048, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::CreatedWidget' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, TutorialMenuClass) == 0x000050, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::TutorialMenuClass' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, CallFunc_Create_ReturnValue) == 0x000058, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, CallFunc_GetMenuManager_ReturnValue) == 0x000060, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, CallFunc_BP_GetMenuPage_ReturnValue) == 0x000068, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::CallFunc_BP_GetMenuPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, K2Node_DynamicCast_AsMenu_Tutorials) == 0x000070, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::K2Node_DynamicCast_AsMenu_Tutorials' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_ShowMenuTutorial, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'CommonMenuLibrary_C_ShowMenuTutorial::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CommonMenuLibrary.CommonMenuLibrary_C.GetScreenPosition
// 0x0060 (0x0060 - 0x0000)
struct CommonMenuLibrary_C_GetScreenPosition final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Position;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0018(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonMenuLibrary_C_GetScreenPosition) == 0x000008, "Wrong alignment on CommonMenuLibrary_C_GetScreenPosition");
static_assert(sizeof(CommonMenuLibrary_C_GetScreenPosition) == 0x000060, "Wrong size on CommonMenuLibrary_C_GetScreenPosition");
static_assert(offsetof(CommonMenuLibrary_C_GetScreenPosition, Widget) == 0x000000, "Member 'CommonMenuLibrary_C_GetScreenPosition::Widget' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetScreenPosition, __WorldContext) == 0x000008, "Member 'CommonMenuLibrary_C_GetScreenPosition::__WorldContext' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetScreenPosition, Position) == 0x000010, "Member 'CommonMenuLibrary_C_GetScreenPosition::Position' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetScreenPosition, CallFunc_GetCachedGeometry_ReturnValue) == 0x000018, "Member 'CommonMenuLibrary_C_GetScreenPosition::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetScreenPosition, CallFunc_LocalToViewport_PixelPosition) == 0x000050, "Member 'CommonMenuLibrary_C_GetScreenPosition::CallFunc_LocalToViewport_PixelPosition' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetScreenPosition, CallFunc_LocalToViewport_ViewportPosition) == 0x000058, "Member 'CommonMenuLibrary_C_GetScreenPosition::CallFunc_LocalToViewport_ViewportPosition' has a wrong offset!");

// Function CommonMenuLibrary.CommonMenuLibrary_C.HideMenuTutorial
// 0x0030 (0x0030 - 0x0000)
struct CommonMenuLibrary_C_HideMenuTutorial final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TutorialMenuClass;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuWidget*                          CallFunc_BP_GetMenuPage_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuTutorials_C*                       K2Node_DynamicCast_AsMenu_Tutorials;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonMenuLibrary_C_HideMenuTutorial) == 0x000008, "Wrong alignment on CommonMenuLibrary_C_HideMenuTutorial");
static_assert(sizeof(CommonMenuLibrary_C_HideMenuTutorial) == 0x000030, "Wrong size on CommonMenuLibrary_C_HideMenuTutorial");
static_assert(offsetof(CommonMenuLibrary_C_HideMenuTutorial, __WorldContext) == 0x000000, "Member 'CommonMenuLibrary_C_HideMenuTutorial::__WorldContext' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_HideMenuTutorial, TutorialMenuClass) == 0x000008, "Member 'CommonMenuLibrary_C_HideMenuTutorial::TutorialMenuClass' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_HideMenuTutorial, CallFunc_GetMenuManager_ReturnValue) == 0x000010, "Member 'CommonMenuLibrary_C_HideMenuTutorial::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_HideMenuTutorial, CallFunc_BP_GetMenuPage_ReturnValue) == 0x000018, "Member 'CommonMenuLibrary_C_HideMenuTutorial::CallFunc_BP_GetMenuPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_HideMenuTutorial, K2Node_DynamicCast_AsMenu_Tutorials) == 0x000020, "Member 'CommonMenuLibrary_C_HideMenuTutorial::K2Node_DynamicCast_AsMenu_Tutorials' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_HideMenuTutorial, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CommonMenuLibrary_C_HideMenuTutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_HideMenuTutorial, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'CommonMenuLibrary_C_HideMenuTutorial::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CommonMenuLibrary.CommonMenuLibrary_C.IsShowingMenuTutorial
// 0x0038 (0x0038 - 0x0000)
struct CommonMenuLibrary_C_IsShowingMenuTutorial final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShowingTutorial;                                 // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 TutorialMenuClass;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuWidget*                          CallFunc_BP_GetMenuPage_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuTutorials_C*                       K2Node_DynamicCast_AsMenu_Tutorials;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowingTutorial_isShowingTutorial;      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonMenuLibrary_C_IsShowingMenuTutorial) == 0x000008, "Wrong alignment on CommonMenuLibrary_C_IsShowingMenuTutorial");
static_assert(sizeof(CommonMenuLibrary_C_IsShowingMenuTutorial) == 0x000038, "Wrong size on CommonMenuLibrary_C_IsShowingMenuTutorial");
static_assert(offsetof(CommonMenuLibrary_C_IsShowingMenuTutorial, __WorldContext) == 0x000000, "Member 'CommonMenuLibrary_C_IsShowingMenuTutorial::__WorldContext' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_IsShowingMenuTutorial, IsShowingTutorial) == 0x000008, "Member 'CommonMenuLibrary_C_IsShowingMenuTutorial::IsShowingTutorial' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_IsShowingMenuTutorial, TutorialMenuClass) == 0x000010, "Member 'CommonMenuLibrary_C_IsShowingMenuTutorial::TutorialMenuClass' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_IsShowingMenuTutorial, CallFunc_GetMenuManager_ReturnValue) == 0x000018, "Member 'CommonMenuLibrary_C_IsShowingMenuTutorial::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_IsShowingMenuTutorial, CallFunc_BP_GetMenuPage_ReturnValue) == 0x000020, "Member 'CommonMenuLibrary_C_IsShowingMenuTutorial::CallFunc_BP_GetMenuPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_IsShowingMenuTutorial, K2Node_DynamicCast_AsMenu_Tutorials) == 0x000028, "Member 'CommonMenuLibrary_C_IsShowingMenuTutorial::K2Node_DynamicCast_AsMenu_Tutorials' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_IsShowingMenuTutorial, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'CommonMenuLibrary_C_IsShowingMenuTutorial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_IsShowingMenuTutorial, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'CommonMenuLibrary_C_IsShowingMenuTutorial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_IsShowingMenuTutorial, CallFunc_IsShowingTutorial_isShowingTutorial) == 0x000032, "Member 'CommonMenuLibrary_C_IsShowingMenuTutorial::CallFunc_IsShowingTutorial_isShowingTutorial' has a wrong offset!");

// Function CommonMenuLibrary.CommonMenuLibrary_C.GetNPCBlason
// 0x0050 (0x0050 - 0x0000)
struct CommonMenuLibrary_C_GetNPCBlason final
{
public:
	EMetaNPCType                                  Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             blason;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMetaNPCType                                  Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonMenuLibrary_C_GetNPCBlason) == 0x000008, "Wrong alignment on CommonMenuLibrary_C_GetNPCBlason");
static_assert(sizeof(CommonMenuLibrary_C_GetNPCBlason) == 0x000050, "Wrong size on CommonMenuLibrary_C_GetNPCBlason");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCBlason, Type) == 0x000000, "Member 'CommonMenuLibrary_C_GetNPCBlason::Type' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCBlason, __WorldContext) == 0x000008, "Member 'CommonMenuLibrary_C_GetNPCBlason::__WorldContext' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCBlason, blason) == 0x000010, "Member 'CommonMenuLibrary_C_GetNPCBlason::blason' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCBlason, Temp_byte_Variable) == 0x000018, "Member 'CommonMenuLibrary_C_GetNPCBlason::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCBlason, Temp_object_Variable) == 0x000020, "Member 'CommonMenuLibrary_C_GetNPCBlason::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCBlason, Temp_object_Variable_1) == 0x000028, "Member 'CommonMenuLibrary_C_GetNPCBlason::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCBlason, Temp_object_Variable_2) == 0x000030, "Member 'CommonMenuLibrary_C_GetNPCBlason::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCBlason, Temp_object_Variable_3) == 0x000038, "Member 'CommonMenuLibrary_C_GetNPCBlason::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCBlason, Temp_object_Variable_4) == 0x000040, "Member 'CommonMenuLibrary_C_GetNPCBlason::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCBlason, K2Node_Select_Default) == 0x000048, "Member 'CommonMenuLibrary_C_GetNPCBlason::K2Node_Select_Default' has a wrong offset!");

// Function CommonMenuLibrary.CommonMenuLibrary_C.GetRecipeCategoryIcon
// 0x0050 (0x0050 - 0x0000)
struct CommonMenuLibrary_C_GetRecipeCategoryIcon final
{
public:
	uint8                                         RecipeCategory;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonMenuLibrary_C_GetRecipeCategoryIcon) == 0x000008, "Wrong alignment on CommonMenuLibrary_C_GetRecipeCategoryIcon");
static_assert(sizeof(CommonMenuLibrary_C_GetRecipeCategoryIcon) == 0x000050, "Wrong size on CommonMenuLibrary_C_GetRecipeCategoryIcon");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryIcon, RecipeCategory) == 0x000000, "Member 'CommonMenuLibrary_C_GetRecipeCategoryIcon::RecipeCategory' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryIcon, __WorldContext) == 0x000008, "Member 'CommonMenuLibrary_C_GetRecipeCategoryIcon::__WorldContext' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryIcon, Icon) == 0x000010, "Member 'CommonMenuLibrary_C_GetRecipeCategoryIcon::Icon' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryIcon, Temp_byte_Variable) == 0x000018, "Member 'CommonMenuLibrary_C_GetRecipeCategoryIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryIcon, Temp_object_Variable) == 0x000020, "Member 'CommonMenuLibrary_C_GetRecipeCategoryIcon::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryIcon, Temp_object_Variable_1) == 0x000028, "Member 'CommonMenuLibrary_C_GetRecipeCategoryIcon::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryIcon, Temp_object_Variable_2) == 0x000030, "Member 'CommonMenuLibrary_C_GetRecipeCategoryIcon::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryIcon, Temp_object_Variable_3) == 0x000038, "Member 'CommonMenuLibrary_C_GetRecipeCategoryIcon::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryIcon, Temp_object_Variable_4) == 0x000040, "Member 'CommonMenuLibrary_C_GetRecipeCategoryIcon::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryIcon, K2Node_Select_Default) == 0x000048, "Member 'CommonMenuLibrary_C_GetRecipeCategoryIcon::K2Node_Select_Default' has a wrong offset!");

// Function CommonMenuLibrary.CommonMenuLibrary_C.GetRecipeCategoryColor
// 0x0130 (0x0130 - 0x0000)
struct CommonMenuLibrary_C_GetRecipeCategoryColor final
{
public:
	uint8                                         RecipeCategory;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            Color;                                             // 0x0010(0x0028)(Parm, OutParm)
	uint8                                         Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            Temp_struct_Variable;                              // 0x0040(0x0028)()
	struct FSlateColor                            Temp_struct_Variable_1;                            // 0x0068(0x0028)()
	struct FSlateColor                            Temp_struct_Variable_2;                            // 0x0090(0x0028)()
	struct FSlateColor                            Temp_struct_Variable_3;                            // 0x00B8(0x0028)()
	struct FSlateColor                            Temp_struct_Variable_4;                            // 0x00E0(0x0028)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0108(0x0028)()
};
static_assert(alignof(CommonMenuLibrary_C_GetRecipeCategoryColor) == 0x000008, "Wrong alignment on CommonMenuLibrary_C_GetRecipeCategoryColor");
static_assert(sizeof(CommonMenuLibrary_C_GetRecipeCategoryColor) == 0x000130, "Wrong size on CommonMenuLibrary_C_GetRecipeCategoryColor");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryColor, RecipeCategory) == 0x000000, "Member 'CommonMenuLibrary_C_GetRecipeCategoryColor::RecipeCategory' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryColor, __WorldContext) == 0x000008, "Member 'CommonMenuLibrary_C_GetRecipeCategoryColor::__WorldContext' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryColor, Color) == 0x000010, "Member 'CommonMenuLibrary_C_GetRecipeCategoryColor::Color' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryColor, Temp_byte_Variable) == 0x000038, "Member 'CommonMenuLibrary_C_GetRecipeCategoryColor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryColor, Temp_struct_Variable) == 0x000040, "Member 'CommonMenuLibrary_C_GetRecipeCategoryColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryColor, Temp_struct_Variable_1) == 0x000068, "Member 'CommonMenuLibrary_C_GetRecipeCategoryColor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryColor, Temp_struct_Variable_2) == 0x000090, "Member 'CommonMenuLibrary_C_GetRecipeCategoryColor::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryColor, Temp_struct_Variable_3) == 0x0000B8, "Member 'CommonMenuLibrary_C_GetRecipeCategoryColor::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryColor, Temp_struct_Variable_4) == 0x0000E0, "Member 'CommonMenuLibrary_C_GetRecipeCategoryColor::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRecipeCategoryColor, K2Node_Select_Default) == 0x000108, "Member 'CommonMenuLibrary_C_GetRecipeCategoryColor::K2Node_Select_Default' has a wrong offset!");

// Function CommonMenuLibrary.CommonMenuLibrary_C.GetRankTextFromLevel
// 0x0150 (0x0150 - 0x0000)
struct CommonMenuLibrary_C_GetRankTextFromLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   RankText;                                          // 0x0010(0x0018)(Parm, OutParm)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00C0(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00D8(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00F0(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x0108(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x0120(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0138(0x0018)()
};
static_assert(alignof(CommonMenuLibrary_C_GetRankTextFromLevel) == 0x000008, "Wrong alignment on CommonMenuLibrary_C_GetRankTextFromLevel");
static_assert(sizeof(CommonMenuLibrary_C_GetRankTextFromLevel) == 0x000150, "Wrong size on CommonMenuLibrary_C_GetRankTextFromLevel");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, Level) == 0x000000, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::Level' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, __WorldContext) == 0x000008, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::__WorldContext' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, RankText) == 0x000010, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::RankText' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, Temp_int_Variable) == 0x000028, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, Temp_text_Variable) == 0x000030, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, Temp_text_Variable_1) == 0x000048, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, Temp_text_Variable_2) == 0x000060, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, Temp_text_Variable_3) == 0x000078, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, Temp_text_Variable_4) == 0x000090, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, Temp_text_Variable_5) == 0x0000A8, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, Temp_text_Variable_6) == 0x0000C0, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, Temp_text_Variable_7) == 0x0000D8, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, Temp_text_Variable_8) == 0x0000F0, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, Temp_text_Variable_9) == 0x000108, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, Temp_text_Variable_10) == 0x000120, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetRankTextFromLevel, K2Node_Select_Default) == 0x000138, "Member 'CommonMenuLibrary_C_GetRankTextFromLevel::K2Node_Select_Default' has a wrong offset!");

// Function CommonMenuLibrary.CommonMenuLibrary_C.GetNPCName
// 0x00B8 (0x00B8 - 0x0000)
struct CommonMenuLibrary_C_GetNPCName final
{
public:
	EMetaNPCType                                  NPCType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Colors;                                            // 0x0010(0x0018)(Parm, OutParm)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMetaNPCSettings                       CallFunc_GetNPCSettings_ReturnValue;               // 0x0030(0x0088)(ConstParm)
};
static_assert(alignof(CommonMenuLibrary_C_GetNPCName) == 0x000008, "Wrong alignment on CommonMenuLibrary_C_GetNPCName");
static_assert(sizeof(CommonMenuLibrary_C_GetNPCName) == 0x0000B8, "Wrong size on CommonMenuLibrary_C_GetNPCName");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCName, NPCType) == 0x000000, "Member 'CommonMenuLibrary_C_GetNPCName::NPCType' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCName, __WorldContext) == 0x000008, "Member 'CommonMenuLibrary_C_GetNPCName::__WorldContext' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCName, Colors) == 0x000010, "Member 'CommonMenuLibrary_C_GetNPCName::Colors' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCName, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000028, "Member 'CommonMenuLibrary_C_GetNPCName::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetNPCName, CallFunc_GetNPCSettings_ReturnValue) == 0x000030, "Member 'CommonMenuLibrary_C_GetNPCName::CallFunc_GetNPCSettings_ReturnValue' has a wrong offset!");

// Function CommonMenuLibrary.CommonMenuLibrary_C.GetImageStringForCurrency
// 0x0160 (0x0160 - 0x0000)
struct CommonMenuLibrary_C_GetImageStringForCurrency final
{
public:
	ECurrencyType                                 Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
	ECurrencyType                                 Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_4;                            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_5;                            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_6;                            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_7;                            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_8;                            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_9;                            // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00F8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0148(0x0018)()
};
static_assert(alignof(CommonMenuLibrary_C_GetImageStringForCurrency) == 0x000008, "Wrong alignment on CommonMenuLibrary_C_GetImageStringForCurrency");
static_assert(sizeof(CommonMenuLibrary_C_GetImageStringForCurrency) == 0x000160, "Wrong size on CommonMenuLibrary_C_GetImageStringForCurrency");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, Type) == 0x000000, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::Type' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, __WorldContext) == 0x000008, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::__WorldContext' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, ReturnValue) == 0x000010, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, Temp_byte_Variable) == 0x000028, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, Temp_string_Variable) == 0x000030, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, Temp_string_Variable_1) == 0x000040, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, Temp_string_Variable_2) == 0x000050, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, Temp_string_Variable_3) == 0x000060, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, Temp_string_Variable_4) == 0x000070, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::Temp_string_Variable_4' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, Temp_string_Variable_5) == 0x000080, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::Temp_string_Variable_5' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, Temp_string_Variable_6) == 0x000090, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::Temp_string_Variable_6' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, Temp_string_Variable_7) == 0x0000A0, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::Temp_string_Variable_7' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, Temp_string_Variable_8) == 0x0000B0, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::Temp_string_Variable_8' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, Temp_string_Variable_9) == 0x0000C0, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::Temp_string_Variable_9' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, K2Node_Select_Default) == 0x0000D0, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, CallFunc_Conv_StringToText_ReturnValue) == 0x0000E0, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, K2Node_MakeStruct_FormatArgumentData) == 0x0000F8, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, K2Node_MakeArray_Array) == 0x000138, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_GetImageStringForCurrency, CallFunc_Format_ReturnValue) == 0x000148, "Member 'CommonMenuLibrary_C_GetImageStringForCurrency::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function CommonMenuLibrary.CommonMenuLibrary_C.FormatPlayerDisplayName
// 0x0060 (0x0060 - 0x0000)
struct CommonMenuLibrary_C_FormatPlayerDisplayName final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         MaxLength;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 FormatedDisplayName;                               // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonMenuLibrary_C_FormatPlayerDisplayName) == 0x000008, "Wrong alignment on CommonMenuLibrary_C_FormatPlayerDisplayName");
static_assert(sizeof(CommonMenuLibrary_C_FormatPlayerDisplayName) == 0x000060, "Wrong size on CommonMenuLibrary_C_FormatPlayerDisplayName");
static_assert(offsetof(CommonMenuLibrary_C_FormatPlayerDisplayName, DisplayName) == 0x000000, "Member 'CommonMenuLibrary_C_FormatPlayerDisplayName::DisplayName' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_FormatPlayerDisplayName, MaxLength) == 0x000010, "Member 'CommonMenuLibrary_C_FormatPlayerDisplayName::MaxLength' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_FormatPlayerDisplayName, __WorldContext) == 0x000018, "Member 'CommonMenuLibrary_C_FormatPlayerDisplayName::__WorldContext' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_FormatPlayerDisplayName, FormatedDisplayName) == 0x000020, "Member 'CommonMenuLibrary_C_FormatPlayerDisplayName::FormatedDisplayName' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_FormatPlayerDisplayName, CallFunc_Len_ReturnValue) == 0x000030, "Member 'CommonMenuLibrary_C_FormatPlayerDisplayName::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_FormatPlayerDisplayName, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'CommonMenuLibrary_C_FormatPlayerDisplayName::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_FormatPlayerDisplayName, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'CommonMenuLibrary_C_FormatPlayerDisplayName::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_FormatPlayerDisplayName, CallFunc_Left_ReturnValue) == 0x000040, "Member 'CommonMenuLibrary_C_FormatPlayerDisplayName::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_FormatPlayerDisplayName, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'CommonMenuLibrary_C_FormatPlayerDisplayName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function CommonMenuLibrary.CommonMenuLibrary_C.FocusNavTestCheck
// 0x0020 (0x0020 - 0x0000)
struct CommonMenuLibrary_C_FocusNavTestCheck final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FocusCheck;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBMenuPlayerController*                CallFunc_GetLocalMenuController_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamePad_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonMenuLibrary_C_FocusNavTestCheck) == 0x000008, "Wrong alignment on CommonMenuLibrary_C_FocusNavTestCheck");
static_assert(sizeof(CommonMenuLibrary_C_FocusNavTestCheck) == 0x000020, "Wrong size on CommonMenuLibrary_C_FocusNavTestCheck");
static_assert(offsetof(CommonMenuLibrary_C_FocusNavTestCheck, __WorldContext) == 0x000000, "Member 'CommonMenuLibrary_C_FocusNavTestCheck::__WorldContext' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_FocusNavTestCheck, FocusCheck) == 0x000008, "Member 'CommonMenuLibrary_C_FocusNavTestCheck::FocusCheck' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_FocusNavTestCheck, CallFunc_GetLocalMenuController_ReturnValue) == 0x000010, "Member 'CommonMenuLibrary_C_FocusNavTestCheck::CallFunc_GetLocalMenuController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonMenuLibrary_C_FocusNavTestCheck, CallFunc_IsUsingGamePad_ReturnValue) == 0x000018, "Member 'CommonMenuLibrary_C_FocusNavTestCheck::CallFunc_IsUsingGamePad_ReturnValue' has a wrong offset!");

// Function CommonMenuLibrary.CommonMenuLibrary_C.GamepadNav_HandleUniformGridNavigation
// 0x00B8 (0x00B8 - 0x0000)
struct CommonMenuLibrary_C_GamepadNav_HandleUniformGridNavigation final
{
public:
	class UUniformGridPanel*                      InputGrid;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINavigation                                 Navigation;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InputItemsPerRow;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InputItemCount;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemCount;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemsPerRow;                                       // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridPanel*                      Grid;                                              // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CandidateIndex;                                    // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FocusedItemRow;                                    // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FocusedItemColumn;                                 // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FocusedItemIndex;                                  // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
