#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonHudCountdown

#include "Basic.hpp"

#include "OPP_classes.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonHudCountdown.CommonHudCountdown_C
// 0x0048 (0x02B0 - 0x0268)
class UCommonHudCountdown_C final : public URBUserWidget
{
public:
	class UWidgetAnimation*                       ShowPoints;                                        // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AddPoints;                                         // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CountdownOverlay;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CountdownText;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_CommonHudCountdown;                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              LoadingVideoContainer;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingVideoWidget_C*                  LoadingVideoWidget;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Message;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetMessage(const class FText& Text);
	void SetCountdownValueInSeconds(float Seconds);
	void ShowCountdownText(bool Show);
	void SetIsRightAligned(bool IsRightAligned);
	void ShowSpinner(bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CommonHudCountdown_C">();
	}
	static class UCommonHudCountdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonHudCountdown_C>();
	}
};
static_assert(alignof(UCommonHudCountdown_C) == 0x000008, "Wrong alignment on UCommonHudCountdown_C");
static_assert(sizeof(UCommonHudCountdown_C) == 0x0002B0, "Wrong size on UCommonHudCountdown_C");
static_assert(offsetof(UCommonHudCountdown_C, ShowPoints) == 0x000268, "Member 'UCommonHudCountdown_C::ShowPoints' has a wrong offset!");
static_assert(offsetof(UCommonHudCountdown_C, AddPoints) == 0x000270, "Member 'UCommonHudCountdown_C::AddPoints' has a wrong offset!");
static_assert(offsetof(UCommonHudCountdown_C, Background) == 0x000278, "Member 'UCommonHudCountdown_C::Background' has a wrong offset!");
static_assert(offsetof(UCommonHudCountdown_C, CountdownOverlay) == 0x000280, "Member 'UCommonHudCountdown_C::CountdownOverlay' has a wrong offset!");
static_assert(offsetof(UCommonHudCountdown_C, CountdownText) == 0x000288, "Member 'UCommonHudCountdown_C::CountdownText' has a wrong offset!");
static_assert(offsetof(UCommonHudCountdown_C, InvalidationBox_CommonHudCountdown) == 0x000290, "Member 'UCommonHudCountdown_C::InvalidationBox_CommonHudCountdown' has a wrong offset!");
static_assert(offsetof(UCommonHudCountdown_C, LoadingVideoContainer) == 0x000298, "Member 'UCommonHudCountdown_C::LoadingVideoContainer' has a wrong offset!");
static_assert(offsetof(UCommonHudCountdown_C, LoadingVideoWidget) == 0x0002A0, "Member 'UCommonHudCountdown_C::LoadingVideoWidget' has a wrong offset!");
static_assert(offsetof(UCommonHudCountdown_C, Message) == 0x0002A8, "Member 'UCommonHudCountdown_C::Message' has a wrong offset!");

}

