#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControllerMappingEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ControllerMappingEntry.ControllerMappingEntry_C
// 0x0048 (0x02B0 - 0x0268)
class UControllerMappingEntry_C final : public URBGamepadControlSchemeLayerEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Caption;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CaptionBox;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             IconTexture;                                       // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   CaptionText;                                       // 0x0290(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          LeftFacing;                                        // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          ForceCenter;                                       // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ControllerMappingEntry(int32 EntryPoint);
	void Construct();
	void UpdateIcon(class UTexture2D* NewIcon);
	void Event_UpdateDescription(const class FText& NewDescription);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ControllerMappingEntry_C">();
	}
	static class UControllerMappingEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControllerMappingEntry_C>();
	}
};
static_assert(alignof(UControllerMappingEntry_C) == 0x000008, "Wrong alignment on UControllerMappingEntry_C");
static_assert(sizeof(UControllerMappingEntry_C) == 0x0002B0, "Wrong size on UControllerMappingEntry_C");
static_assert(offsetof(UControllerMappingEntry_C, UberGraphFrame) == 0x000268, "Member 'UControllerMappingEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UControllerMappingEntry_C, Caption) == 0x000270, "Member 'UControllerMappingEntry_C::Caption' has a wrong offset!");
static_assert(offsetof(UControllerMappingEntry_C, CaptionBox) == 0x000278, "Member 'UControllerMappingEntry_C::CaptionBox' has a wrong offset!");
static_assert(offsetof(UControllerMappingEntry_C, Icon) == 0x000280, "Member 'UControllerMappingEntry_C::Icon' has a wrong offset!");
static_assert(offsetof(UControllerMappingEntry_C, IconTexture) == 0x000288, "Member 'UControllerMappingEntry_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UControllerMappingEntry_C, CaptionText) == 0x000290, "Member 'UControllerMappingEntry_C::CaptionText' has a wrong offset!");
static_assert(offsetof(UControllerMappingEntry_C, LeftFacing) == 0x0002A8, "Member 'UControllerMappingEntry_C::LeftFacing' has a wrong offset!");
static_assert(offsetof(UControllerMappingEntry_C, ForceCenter) == 0x0002A9, "Member 'UControllerMappingEntry_C::ForceCenter' has a wrong offset!");

}

