#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControllerMappingMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ControllerMappingMenu.ControllerMappingMenu_C
// 0x0058 (0x0370 - 0x0318)
class UControllerMappingMenu_C final : public URBMenuGamepadControlScheme
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBMenuButton_C*                        ApplyChangeBtn;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg;                                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        Blur;                                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Darkness;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        ExitBtn;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_143;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuFocusActionButtonContainer_C*      MenuFocusActionButtonContainer;                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        ResetDefaultsBtn;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBPopUpConfirmCancelWidget*            CurrentApplyChangesPopup;                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ApplyChanges;                                      // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ControllerMappingMenu(int32 EntryPoint);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void Construct();
	void OnGamepadTypeChanged(EGamepadType NewGamepadType);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__BrightnessCalibrationMenu_ExitBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void Event_MenuCancel_Pressed();
	void OnResetKeyPressed();
	void OnReleasedApply();
	void UpdateApplyBtnVisibility(bool HasValueChanged);
	void BndEvt__ControllerMappingMenu_ApplyChangeBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void OnPopupPop();
	void OnPopupConfirm();
	void BndEvt__ControllerMappingMenu_ResetDefaultsBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void RefreshGamepadType();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ControllerMappingMenu_C">();
	}
	static class UControllerMappingMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControllerMappingMenu_C>();
	}
};
static_assert(alignof(UControllerMappingMenu_C) == 0x000008, "Wrong alignment on UControllerMappingMenu_C");
static_assert(sizeof(UControllerMappingMenu_C) == 0x000370, "Wrong size on UControllerMappingMenu_C");
static_assert(offsetof(UControllerMappingMenu_C, UberGraphFrame) == 0x000318, "Member 'UControllerMappingMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UControllerMappingMenu_C, ApplyChangeBtn) == 0x000320, "Member 'UControllerMappingMenu_C::ApplyChangeBtn' has a wrong offset!");
static_assert(offsetof(UControllerMappingMenu_C, bg) == 0x000328, "Member 'UControllerMappingMenu_C::bg' has a wrong offset!");
static_assert(offsetof(UControllerMappingMenu_C, Blur) == 0x000330, "Member 'UControllerMappingMenu_C::Blur' has a wrong offset!");
static_assert(offsetof(UControllerMappingMenu_C, Darkness) == 0x000338, "Member 'UControllerMappingMenu_C::Darkness' has a wrong offset!");
static_assert(offsetof(UControllerMappingMenu_C, ExitBtn) == 0x000340, "Member 'UControllerMappingMenu_C::ExitBtn' has a wrong offset!");
static_assert(offsetof(UControllerMappingMenu_C, Image_143) == 0x000348, "Member 'UControllerMappingMenu_C::Image_143' has a wrong offset!");
static_assert(offsetof(UControllerMappingMenu_C, MenuFocusActionButtonContainer) == 0x000350, "Member 'UControllerMappingMenu_C::MenuFocusActionButtonContainer' has a wrong offset!");
static_assert(offsetof(UControllerMappingMenu_C, ResetDefaultsBtn) == 0x000358, "Member 'UControllerMappingMenu_C::ResetDefaultsBtn' has a wrong offset!");
static_assert(offsetof(UControllerMappingMenu_C, CurrentApplyChangesPopup) == 0x000360, "Member 'UControllerMappingMenu_C::CurrentApplyChangesPopup' has a wrong offset!");
static_assert(offsetof(UControllerMappingMenu_C, ApplyChanges) == 0x000368, "Member 'UControllerMappingMenu_C::ApplyChanges' has a wrong offset!");

}

