#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControllerMappingMenu

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ControllerMappingMenu.ControllerMappingMenu_C.ExecuteUbergraph_ControllerMappingMenu
// 0x0098 (0x0098 - 0x0000)
struct ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC3[0x1];                                     // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button_2;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBPopUpConfirmCancelWidget*            CallFunc_CreatePopUpConfirmCancel_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button_1;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_hasValueChanged;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC4[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGamepadType                                  K2Node_CustomEvent_newGamepadType;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC5[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC6[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0078(0x0018)()
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0090(0x0008)(NoDestructor)
};
static_assert(alignof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu) == 0x000008, "Wrong alignment on ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu");
static_assert(sizeof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu) == 0x000098, "Wrong size on ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, EntryPoint) == 0x000000, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, Temp_bool_Variable) == 0x000024, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, Temp_byte_Variable) == 0x000025, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, Temp_byte_Variable_1) == 0x000026, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000038, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, K2Node_ComponentBoundEvent_Button_2) == 0x000040, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, CallFunc_CreatePopUpConfirmCancel_ReturnValue) == 0x000048, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::CallFunc_CreatePopUpConfirmCancel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, K2Node_ComponentBoundEvent_Button_1) == 0x000050, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, K2Node_Event_hasValueChanged) == 0x000058, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::K2Node_Event_hasValueChanged' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, K2Node_Select_Default) == 0x000059, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, K2Node_ComponentBoundEvent_Button) == 0x000060, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, K2Node_Event_IsDesignTime) == 0x000068, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, K2Node_CustomEvent_newGamepadType) == 0x000069, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::K2Node_CustomEvent_newGamepadType' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, CallFunc_MakeLiteralName_ReturnValue) == 0x00006C, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, CallFunc_MakeLiteralText_ReturnValue) == 0x000078, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu, K2Node_Event_InFocusEvent) == 0x000090, "Member 'ControllerMappingMenu_C_ExecuteUbergraph_ControllerMappingMenu::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function ControllerMappingMenu.ControllerMappingMenu_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct ControllerMappingMenu_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(ControllerMappingMenu_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on ControllerMappingMenu_C_OnRemovedFromFocusPath");
static_assert(sizeof(ControllerMappingMenu_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on ControllerMappingMenu_C_OnRemovedFromFocusPath");
static_assert(offsetof(ControllerMappingMenu_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'ControllerMappingMenu_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function ControllerMappingMenu.ControllerMappingMenu_C.OnGamepadTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct ControllerMappingMenu_C_OnGamepadTypeChanged final
{
public:
	EGamepadType                                  NewGamepadType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ControllerMappingMenu_C_OnGamepadTypeChanged) == 0x000001, "Wrong alignment on ControllerMappingMenu_C_OnGamepadTypeChanged");
static_assert(sizeof(ControllerMappingMenu_C_OnGamepadTypeChanged) == 0x000001, "Wrong size on ControllerMappingMenu_C_OnGamepadTypeChanged");
static_assert(offsetof(ControllerMappingMenu_C_OnGamepadTypeChanged, NewGamepadType) == 0x000000, "Member 'ControllerMappingMenu_C_OnGamepadTypeChanged::NewGamepadType' has a wrong offset!");

// Function ControllerMappingMenu.ControllerMappingMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ControllerMappingMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ControllerMappingMenu_C_PreConstruct) == 0x000001, "Wrong alignment on ControllerMappingMenu_C_PreConstruct");
static_assert(sizeof(ControllerMappingMenu_C_PreConstruct) == 0x000001, "Wrong size on ControllerMappingMenu_C_PreConstruct");
static_assert(offsetof(ControllerMappingMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ControllerMappingMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ControllerMappingMenu.ControllerMappingMenu_C.BndEvt__BrightnessCalibrationMenu_ExitBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ControllerMappingMenu_C_BndEvt__BrightnessCalibrationMenu_ExitBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ControllerMappingMenu_C_BndEvt__BrightnessCalibrationMenu_ExitBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on ControllerMappingMenu_C_BndEvt__BrightnessCalibrationMenu_ExitBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(ControllerMappingMenu_C_BndEvt__BrightnessCalibrationMenu_ExitBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on ControllerMappingMenu_C_BndEvt__BrightnessCalibrationMenu_ExitBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(ControllerMappingMenu_C_BndEvt__BrightnessCalibrationMenu_ExitBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'ControllerMappingMenu_C_BndEvt__BrightnessCalibrationMenu_ExitBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function ControllerMappingMenu.ControllerMappingMenu_C.UpdateApplyBtnVisibility
// 0x0001 (0x0001 - 0x0000)
struct ControllerMappingMenu_C_UpdateApplyBtnVisibility final
{
public:
	bool                                          HasValueChanged;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ControllerMappingMenu_C_UpdateApplyBtnVisibility) == 0x000001, "Wrong alignment on ControllerMappingMenu_C_UpdateApplyBtnVisibility");
static_assert(sizeof(ControllerMappingMenu_C_UpdateApplyBtnVisibility) == 0x000001, "Wrong size on ControllerMappingMenu_C_UpdateApplyBtnVisibility");
static_assert(offsetof(ControllerMappingMenu_C_UpdateApplyBtnVisibility, HasValueChanged) == 0x000000, "Member 'ControllerMappingMenu_C_UpdateApplyBtnVisibility::HasValueChanged' has a wrong offset!");

// Function ControllerMappingMenu.ControllerMappingMenu_C.BndEvt__ControllerMappingMenu_ApplyChangeBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ControllerMappingMenu_C_BndEvt__ControllerMappingMenu_ApplyChangeBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ControllerMappingMenu_C_BndEvt__ControllerMappingMenu_ApplyChangeBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on ControllerMappingMenu_C_BndEvt__ControllerMappingMenu_ApplyChangeBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(sizeof(ControllerMappingMenu_C_BndEvt__ControllerMappingMenu_ApplyChangeBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong size on ControllerMappingMenu_C_BndEvt__ControllerMappingMenu_ApplyChangeBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(offsetof(ControllerMappingMenu_C_BndEvt__ControllerMappingMenu_ApplyChangeBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'ControllerMappingMenu_C_BndEvt__ControllerMappingMenu_ApplyChangeBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function ControllerMappingMenu.ControllerMappingMenu_C.BndEvt__ControllerMappingMenu_ResetDefaultsBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ControllerMappingMenu_C_BndEvt__ControllerMappingMenu_ResetDefaultsBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ControllerMappingMenu_C_BndEvt__ControllerMappingMenu_ResetDefaultsBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on ControllerMappingMenu_C_BndEvt__ControllerMappingMenu_ResetDefaultsBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(ControllerMappingMenu_C_BndEvt__ControllerMappingMenu_ResetDefaultsBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong size on ControllerMappingMenu_C_BndEvt__ControllerMappingMenu_ResetDefaultsBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(ControllerMappingMenu_C_BndEvt__ControllerMappingMenu_ResetDefaultsBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'ControllerMappingMenu_C_BndEvt__ControllerMappingMenu_ResetDefaultsBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function ControllerMappingMenu.ControllerMappingMenu_C.RefreshGamepadType
// 0x0010 (0x0010 - 0x0000)
struct ControllerMappingMenu_C_RefreshGamepadType final
{
public:
	class UControlSchemeLayer_C*                  K2Node_DynamicCast_AsControl_Scheme_Layer;         // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ControllerMappingMenu_C_RefreshGamepadType) == 0x000008, "Wrong alignment on ControllerMappingMenu_C_RefreshGamepadType");
static_assert(sizeof(ControllerMappingMenu_C_RefreshGamepadType) == 0x000010, "Wrong size on ControllerMappingMenu_C_RefreshGamepadType");
static_assert(offsetof(ControllerMappingMenu_C_RefreshGamepadType, K2Node_DynamicCast_AsControl_Scheme_Layer) == 0x000000, "Member 'ControllerMappingMenu_C_RefreshGamepadType::K2Node_DynamicCast_AsControl_Scheme_Layer' has a wrong offset!");
static_assert(offsetof(ControllerMappingMenu_C_RefreshGamepadType, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'ControllerMappingMenu_C_RefreshGamepadType::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

