#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlSchemeLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ControlSchemeLayer.ControlSchemeLayer_C
// 0x0030 (0x0380 - 0x0350)
class UControlSchemeLayer_C final : public URBGamepadControlSchemeLayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           DownLeft;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Dpad;                                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           LeftSide;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lineart;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           LS;                                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ControlSchemeLayer(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateGamepadType();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ControlSchemeLayer_C">();
	}
	static class UControlSchemeLayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlSchemeLayer_C>();
	}
};
static_assert(alignof(UControlSchemeLayer_C) == 0x000008, "Wrong alignment on UControlSchemeLayer_C");
static_assert(sizeof(UControlSchemeLayer_C) == 0x000380, "Wrong size on UControlSchemeLayer_C");
static_assert(offsetof(UControlSchemeLayer_C, UberGraphFrame) == 0x000350, "Member 'UControlSchemeLayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UControlSchemeLayer_C, DownLeft) == 0x000358, "Member 'UControlSchemeLayer_C::DownLeft' has a wrong offset!");
static_assert(offsetof(UControlSchemeLayer_C, Dpad) == 0x000360, "Member 'UControlSchemeLayer_C::Dpad' has a wrong offset!");
static_assert(offsetof(UControlSchemeLayer_C, LeftSide) == 0x000368, "Member 'UControlSchemeLayer_C::LeftSide' has a wrong offset!");
static_assert(offsetof(UControlSchemeLayer_C, Lineart) == 0x000370, "Member 'UControlSchemeLayer_C::Lineart' has a wrong offset!");
static_assert(offsetof(UControlSchemeLayer_C, LS) == 0x000378, "Member 'UControlSchemeLayer_C::LS' has a wrong offset!");

}

