#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CountdownConfirmCancelPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CountdownConfirmCancelPopup.CountdownConfirmCancelPopup_C.ExecuteUbergraph_CountdownConfirmCancelPopup
// 0x00B8 (0x00B8 - 0x0000)
struct CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F7D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F7E[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_TitleText;                            // 0x0018(0x0018)(ConstParm)
	class FText                                   K2Node_Event_MainText;                             // 0x0030(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ConfirmText;                          // 0x0048(0x0018)(ConstParm)
	class FText                                   K2Node_Event_CancelText;                           // 0x0060(0x0018)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0078(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup) == 0x000008, "Wrong alignment on CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup");
static_assert(sizeof(CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup) == 0x0000B8, "Wrong size on CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup");
static_assert(offsetof(CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup, EntryPoint) == 0x000000, "Member 'CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000004, "Member 'CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000008, "Member 'CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup, CallFunc_Round_ReturnValue) == 0x00000C, "Member 'CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup, K2Node_Event_TitleText) == 0x000018, "Member 'CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup::K2Node_Event_TitleText' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup, K2Node_Event_MainText) == 0x000030, "Member 'CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup::K2Node_Event_MainText' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup, K2Node_Event_ConfirmText) == 0x000048, "Member 'CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup::K2Node_Event_ConfirmText' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup, K2Node_Event_CancelText) == 0x000060, "Member 'CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup::K2Node_Event_CancelText' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup, K2Node_Event_MyGeometry) == 0x000078, "Member 'CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup, K2Node_Event_InDeltaTime) == 0x0000B0, "Member 'CountdownConfirmCancelPopup_C_ExecuteUbergraph_CountdownConfirmCancelPopup::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function CountdownConfirmCancelPopup.CountdownConfirmCancelPopup_C.Tick
// 0x003C (0x003C - 0x0000)
struct CountdownConfirmCancelPopup_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CountdownConfirmCancelPopup_C_Tick) == 0x000004, "Wrong alignment on CountdownConfirmCancelPopup_C_Tick");
static_assert(sizeof(CountdownConfirmCancelPopup_C_Tick) == 0x00003C, "Wrong size on CountdownConfirmCancelPopup_C_Tick");
static_assert(offsetof(CountdownConfirmCancelPopup_C_Tick, MyGeometry) == 0x000000, "Member 'CountdownConfirmCancelPopup_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_Tick, InDeltaTime) == 0x000038, "Member 'CountdownConfirmCancelPopup_C_Tick::InDeltaTime' has a wrong offset!");

// Function CountdownConfirmCancelPopup.CountdownConfirmCancelPopup_C.StartCountdown
// 0x0030 (0x0030 - 0x0000)
struct CountdownConfirmCancelPopup_C_StartCountdown final
{
public:
	int32                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F7F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CountdownConfirmCancelPopup_C_StartCountdown) == 0x000008, "Wrong alignment on CountdownConfirmCancelPopup_C_StartCountdown");
static_assert(sizeof(CountdownConfirmCancelPopup_C_StartCountdown) == 0x000030, "Wrong size on CountdownConfirmCancelPopup_C_StartCountdown");
static_assert(offsetof(CountdownConfirmCancelPopup_C_StartCountdown, Time) == 0x000000, "Member 'CountdownConfirmCancelPopup_C_StartCountdown::Time' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_StartCountdown, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'CountdownConfirmCancelPopup_C_StartCountdown::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_StartCountdown, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CountdownConfirmCancelPopup_C_StartCountdown::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_StartCountdown, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'CountdownConfirmCancelPopup_C_StartCountdown::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_StartCountdown, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00001C, "Member 'CountdownConfirmCancelPopup_C_StartCountdown::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_StartCountdown, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'CountdownConfirmCancelPopup_C_StartCountdown::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_StartCountdown, CallFunc_TextIsEmpty_ReturnValue) == 0x000028, "Member 'CountdownConfirmCancelPopup_C_StartCountdown::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_StartCountdown, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'CountdownConfirmCancelPopup_C_StartCountdown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_StartCountdown, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'CountdownConfirmCancelPopup_C_StartCountdown::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CountdownConfirmCancelPopup.CountdownConfirmCancelPopup_C.Update Countdown Text
// 0x0070 (0x0070 - 0x0000)
struct CountdownConfirmCancelPopup_C_Update_Countdown_Text final
{
public:
	int32                                         Countdown;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F80[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0058(0x0018)()
};
static_assert(alignof(CountdownConfirmCancelPopup_C_Update_Countdown_Text) == 0x000008, "Wrong alignment on CountdownConfirmCancelPopup_C_Update_Countdown_Text");
static_assert(sizeof(CountdownConfirmCancelPopup_C_Update_Countdown_Text) == 0x000070, "Wrong size on CountdownConfirmCancelPopup_C_Update_Countdown_Text");
static_assert(offsetof(CountdownConfirmCancelPopup_C_Update_Countdown_Text, Countdown) == 0x000000, "Member 'CountdownConfirmCancelPopup_C_Update_Countdown_Text::Countdown' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_Update_Countdown_Text, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'CountdownConfirmCancelPopup_C_Update_Countdown_Text::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_Update_Countdown_Text, K2Node_MakeArray_Array) == 0x000048, "Member 'CountdownConfirmCancelPopup_C_Update_Countdown_Text::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_Update_Countdown_Text, CallFunc_Format_ReturnValue) == 0x000058, "Member 'CountdownConfirmCancelPopup_C_Update_Countdown_Text::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function CountdownConfirmCancelPopup.CountdownConfirmCancelPopup_C.Event_InitializePopup
// 0x0060 (0x0060 - 0x0000)
struct CountdownConfirmCancelPopup_C_Event_InitializePopup final
{
public:
	class FText                                   TitleText;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   MainText;                                          // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   ConfirmText;                                       // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   CancelText;                                        // 0x0048(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CountdownConfirmCancelPopup_C_Event_InitializePopup) == 0x000008, "Wrong alignment on CountdownConfirmCancelPopup_C_Event_InitializePopup");
static_assert(sizeof(CountdownConfirmCancelPopup_C_Event_InitializePopup) == 0x000060, "Wrong size on CountdownConfirmCancelPopup_C_Event_InitializePopup");
static_assert(offsetof(CountdownConfirmCancelPopup_C_Event_InitializePopup, TitleText) == 0x000000, "Member 'CountdownConfirmCancelPopup_C_Event_InitializePopup::TitleText' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_Event_InitializePopup, MainText) == 0x000018, "Member 'CountdownConfirmCancelPopup_C_Event_InitializePopup::MainText' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_Event_InitializePopup, ConfirmText) == 0x000030, "Member 'CountdownConfirmCancelPopup_C_Event_InitializePopup::ConfirmText' has a wrong offset!");
static_assert(offsetof(CountdownConfirmCancelPopup_C_Event_InitializePopup, CancelText) == 0x000048, "Member 'CountdownConfirmCancelPopup_C_Event_InitializePopup::CancelText' has a wrong offset!");

}

