#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreditsMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function CreditsMenu.CreditsMenu_C.ExecuteUbergraph_CreditsMenu
// 0x0168 (0x0168 - 0x0000)
struct CreditsMenu_C_ExecuteUbergraph_CreditsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3179[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBMainMenuPlayerController*            CallFunc_GetLocalMainMenuPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_317A[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_317B[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0078(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_317C[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0098(0x0018)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00B0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue_1;       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_317D[0x3];                                     // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_317E[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0138(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x014C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bShouldStartHideTimer;                // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_317F[0x3];                                     // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventGlobal_ReturnValue_1;            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetLooping_ReturnValue;                   // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenUrl_ReturnValue;                      // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu) == 0x000008, "Wrong alignment on CreditsMenu_C_ExecuteUbergraph_CreditsMenu");
static_assert(sizeof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu) == 0x000168, "Wrong size on CreditsMenu_C_ExecuteUbergraph_CreditsMenu");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, EntryPoint) == 0x000000, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_GetLocalMainMenuPlayerController_ReturnValue) == 0x000008, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_GetLocalMainMenuPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, Temp_bool_Variable) == 0x000044, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000048, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000058, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, Temp_text_Variable) == 0x000060, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, Temp_text_Variable_1) == 0x000078, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, K2Node_Event_IsDesignTime) == 0x000090, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, K2Node_Select_Default) == 0x000098, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, K2Node_Event_MyGeometry) == 0x0000B0, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, K2Node_Event_InDeltaTime) == 0x0000E8, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x0000EC, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_GetScrollOffsetOfEnd_ReturnValue_1) == 0x0000F0, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_GetScrollOffsetOfEnd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_GetScrollOffset_ReturnValue) == 0x0000F4, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000F8, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_PlayAnimationForward_ReturnValue) == 0x000100, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000108, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00010C, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_MakeVector2D_ReturnValue) == 0x000110, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000118, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000120, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_IsValid_ReturnValue_1) == 0x000128, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000130, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, Temp_delegate_Variable) == 0x000138, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_PostEventGlobal_ReturnValue) == 0x000148, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, Temp_delegate_Variable_1) == 0x00014C, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, K2Node_Event_bShouldStartHideTimer) == 0x00015C, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::K2Node_Event_bShouldStartHideTimer' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_PostEventGlobal_ReturnValue_1) == 0x000160, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_PostEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_Play_ReturnValue) == 0x000164, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_SetLooping_ReturnValue) == 0x000165, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_SetLooping_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_ExecuteUbergraph_CreditsMenu, CallFunc_OpenUrl_ReturnValue) == 0x000166, "Member 'CreditsMenu_C_ExecuteUbergraph_CreditsMenu::CallFunc_OpenUrl_ReturnValue' has a wrong offset!");

// Function CreditsMenu.CreditsMenu_C.Event_ShowSkipPrompt
// 0x0001 (0x0001 - 0x0000)
struct CreditsMenu_C_Event_ShowSkipPrompt final
{
public:
	bool                                          bShouldStartHideTimer;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreditsMenu_C_Event_ShowSkipPrompt) == 0x000001, "Wrong alignment on CreditsMenu_C_Event_ShowSkipPrompt");
static_assert(sizeof(CreditsMenu_C_Event_ShowSkipPrompt) == 0x000001, "Wrong size on CreditsMenu_C_Event_ShowSkipPrompt");
static_assert(offsetof(CreditsMenu_C_Event_ShowSkipPrompt, bShouldStartHideTimer) == 0x000000, "Member 'CreditsMenu_C_Event_ShowSkipPrompt::bShouldStartHideTimer' has a wrong offset!");

// Function CreditsMenu.CreditsMenu_C.Tick
// 0x003C (0x003C - 0x0000)
struct CreditsMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreditsMenu_C_Tick) == 0x000004, "Wrong alignment on CreditsMenu_C_Tick");
static_assert(sizeof(CreditsMenu_C_Tick) == 0x00003C, "Wrong size on CreditsMenu_C_Tick");
static_assert(offsetof(CreditsMenu_C_Tick, MyGeometry) == 0x000000, "Member 'CreditsMenu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(CreditsMenu_C_Tick, InDeltaTime) == 0x000038, "Member 'CreditsMenu_C_Tick::InDeltaTime' has a wrong offset!");

// Function CreditsMenu.CreditsMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CreditsMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreditsMenu_C_PreConstruct) == 0x000001, "Wrong alignment on CreditsMenu_C_PreConstruct");
static_assert(sizeof(CreditsMenu_C_PreConstruct) == 0x000001, "Wrong size on CreditsMenu_C_PreConstruct");
static_assert(offsetof(CreditsMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CreditsMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

