#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CustomizationMenu.CustomizationMenu_C
// 0x00C8 (0x03D8 - 0x0310)
class UCustomizationMenu_C final : public URBCharacterCustomizationMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CellTitle;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CharacterTitle;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CustoDescription;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CustoDetails;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationColorPalette_C*           CustomizationColorPalette;                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         CustoName;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CustoRarity;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EmptyText;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        ExitButton;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        HairColorButton;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULocalPlayerInfo_v2_C*                  LocalPlayerInfo_v2;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PageSpecificButtonContainer;                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Rotate_Button;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TutorialFocusAnchor;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TutorialPopupAnchor;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TutorialText;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AMenuCharacter_C*                       MenuCharacter;                                     // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCellCustomization;                              // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPendingTutorialRequest;                           // 0x03A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_332A[0x6];                                     // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACellCustomizationCameraActor_C*        CellCustomizationActor;                            // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimpleActionTooltip_C*                 RotateToolTip;                                     // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotateFactorX;                                     // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotateFactorY;                                     // 0x03BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           GamepadNav_RotateTimerHandle;                      // 0x03C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCustomizationOptionThumbnail_C*        HairHovered;                                       // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTutorial;                                       // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsRelease;                                        // 0x03D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShownReleaseTutorial;                             // 0x03D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UpdateHairColorNavigation();
	void TryStartNextMenuTutorial();
	void UpdateFTUESpecificElements();
	void UpdateListScrollBehaviour(bool Param_Index);
	void UpdatePageSpecificButtons();
	void GamepadNav_TryToggleHairPalette();
	void TransmitFocusToCustoContent();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void CreateRotateTooltip();
	void PreviewCosts(const struct FUICustomizationItem& Custo_Item);
	void UpdateCustoDetails(const struct FUICustomizationItem& Custo_Item);
	void SetupForCellCustomization(bool bNewIsCellCustomization);
	void SetupForTutorial();
	void UpdateNavigation(bool CanExitMenu);
	void BndEvt__ExitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void BndEvt__Rotate_Button_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__Rotate_Button_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature();
	void Initialize(bool IsTutorial, class AMenuCharacter_C* Param_MenuCharacter, class ACellCustomizationCameraActor_C* CellCustomization);
	void Destruct();
	void Construct();
	void OnNavigationChangedEvent_Event_0(bool CanExitMenu);
	void OnItemPreviewed(const struct FUICustomizationItem& CustoItem);
	void OnStoppedPreview();
	void UpdatePaletteDisplay(bool ShouldShowPalette);
	void HairColorClicked(const struct FRBHairColorOption& NewHairColor);
	void OnHairColorHovered(const struct FRBHairColorOption& HoveredHairColor);
	void BndEvt__CustomizationMenu_Rotate_Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__CustomizationMenu_Rotate_Button_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void GamepadNav_RotateCharacter();
	void GamepadNav_StartRotation();
	void GamepadNav_StopRotation();
	void OnCategoryChangeRequested();
	void GamepadNav_ToggleHairPalette();
	void BndEvt__CustomizationMenu_ColorPaletteButton_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void Event_InputSourceChanged(bool bIsGamepad);
	void BndEvt__CustomizationMenu_CustomizationContent_K2Node_ComponentBoundEvent_8_OnItemEquippedEvent__DelegateSignature(const struct FUICustomizationItem& Item);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Event_OnMenuTutorialSeen();
	void Event_SetupPostRelease();
	void Event_MenuCancel_Pressed();
	void SetupPostRelease();
	void BndEvt__CustomizationMenu_CustomizationContent_K2Node_ComponentBoundEvent_1_OnItemsAdded__DelegateSignature(int32 Amount);
	void ToggleCellCustomization();
	void SetGamepadRotateX(float FactorX);
	void SetGamepadRotateY(float FactorY);
	void Event_OnPop();
	void ExecuteUbergraph_CustomizationMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomizationMenu_C">();
	}
	static class UCustomizationMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizationMenu_C>();
	}
};
static_assert(alignof(UCustomizationMenu_C) == 0x000008, "Wrong alignment on UCustomizationMenu_C");
static_assert(sizeof(UCustomizationMenu_C) == 0x0003D8, "Wrong size on UCustomizationMenu_C");
static_assert(offsetof(UCustomizationMenu_C, UberGraphFrame) == 0x000310, "Member 'UCustomizationMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CellTitle) == 0x000318, "Member 'UCustomizationMenu_C::CellTitle' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CharacterTitle) == 0x000320, "Member 'UCustomizationMenu_C::CharacterTitle' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustoDescription) == 0x000328, "Member 'UCustomizationMenu_C::CustoDescription' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustoDetails) == 0x000330, "Member 'UCustomizationMenu_C::CustoDetails' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustomizationColorPalette) == 0x000338, "Member 'UCustomizationMenu_C::CustomizationColorPalette' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustoName) == 0x000340, "Member 'UCustomizationMenu_C::CustoName' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustoRarity) == 0x000348, "Member 'UCustomizationMenu_C::CustoRarity' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, EmptyText) == 0x000350, "Member 'UCustomizationMenu_C::EmptyText' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, ExitButton) == 0x000358, "Member 'UCustomizationMenu_C::ExitButton' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, HairColorButton) == 0x000360, "Member 'UCustomizationMenu_C::HairColorButton' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, LocalPlayerInfo_v2) == 0x000368, "Member 'UCustomizationMenu_C::LocalPlayerInfo_v2' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, PageSpecificButtonContainer) == 0x000370, "Member 'UCustomizationMenu_C::PageSpecificButtonContainer' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, Rotate_Button) == 0x000378, "Member 'UCustomizationMenu_C::Rotate_Button' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, TutorialFocusAnchor) == 0x000380, "Member 'UCustomizationMenu_C::TutorialFocusAnchor' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, TutorialPopupAnchor) == 0x000388, "Member 'UCustomizationMenu_C::TutorialPopupAnchor' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, TutorialText) == 0x000390, "Member 'UCustomizationMenu_C::TutorialText' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, MenuCharacter) == 0x000398, "Member 'UCustomizationMenu_C::MenuCharacter' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, bIsCellCustomization) == 0x0003A0, "Member 'UCustomizationMenu_C::bIsCellCustomization' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, bPendingTutorialRequest) == 0x0003A1, "Member 'UCustomizationMenu_C::bPendingTutorialRequest' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CellCustomizationActor) == 0x0003A8, "Member 'UCustomizationMenu_C::CellCustomizationActor' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, RotateToolTip) == 0x0003B0, "Member 'UCustomizationMenu_C::RotateToolTip' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, RotateFactorX) == 0x0003B8, "Member 'UCustomizationMenu_C::RotateFactorX' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, RotateFactorY) == 0x0003BC, "Member 'UCustomizationMenu_C::RotateFactorY' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, GamepadNav_RotateTimerHandle) == 0x0003C0, "Member 'UCustomizationMenu_C::GamepadNav_RotateTimerHandle' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, HairHovered) == 0x0003C8, "Member 'UCustomizationMenu_C::HairHovered' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, bIsTutorial) == 0x0003D0, "Member 'UCustomizationMenu_C::bIsTutorial' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, bIsRelease) == 0x0003D1, "Member 'UCustomizationMenu_C::bIsRelease' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, bShownReleaseTutorial) == 0x0003D2, "Member 'UCustomizationMenu_C::bShownReleaseTutorial' has a wrong offset!");

}

