#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationContentWidget_V2

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.Event_ItemBought
// 0x0038 (0x0038 - 0x0000)
struct CustomizationContentWidget_V2_C_Event_ItemBought final
{
public:
	struct FUICustomizationItem                   Item;                                              // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_Event_ItemBought) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_Event_ItemBought");
static_assert(sizeof(CustomizationContentWidget_V2_C_Event_ItemBought) == 0x000038, "Wrong size on CustomizationContentWidget_V2_C_Event_ItemBought");
static_assert(offsetof(CustomizationContentWidget_V2_C_Event_ItemBought, Item) == 0x000000, "Member 'CustomizationContentWidget_V2_C_Event_ItemBought::Item' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_Event_ItemBought, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'CustomizationContentWidget_V2_C_Event_ItemBought::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.SetMenuCharacterCusto
// 0x0040 (0x0040 - 0x0000)
struct CustomizationContentWidget_V2_C_SetMenuCharacterCusto final
{
public:
	struct FRBPlayerCustomizationInfo             Custo;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_SetMenuCharacterCusto) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_SetMenuCharacterCusto");
static_assert(sizeof(CustomizationContentWidget_V2_C_SetMenuCharacterCusto) == 0x000040, "Wrong size on CustomizationContentWidget_V2_C_SetMenuCharacterCusto");
static_assert(offsetof(CustomizationContentWidget_V2_C_SetMenuCharacterCusto, Custo) == 0x000000, "Member 'CustomizationContentWidget_V2_C_SetMenuCharacterCusto::Custo' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_SetMenuCharacterCusto, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'CustomizationContentWidget_V2_C_SetMenuCharacterCusto::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.NotifyMenuCharacterCategoryClicked
// 0x0002 (0x0002 - 0x0000)
struct CustomizationContentWidget_V2_C_NotifyMenuCharacterCategoryClicked final
{
public:
	ECustomizationMenuCategory                    Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_NotifyMenuCharacterCategoryClicked) == 0x000001, "Wrong alignment on CustomizationContentWidget_V2_C_NotifyMenuCharacterCategoryClicked");
static_assert(sizeof(CustomizationContentWidget_V2_C_NotifyMenuCharacterCategoryClicked) == 0x000002, "Wrong size on CustomizationContentWidget_V2_C_NotifyMenuCharacterCategoryClicked");
static_assert(offsetof(CustomizationContentWidget_V2_C_NotifyMenuCharacterCategoryClicked, Category) == 0x000000, "Member 'CustomizationContentWidget_V2_C_NotifyMenuCharacterCategoryClicked::Category' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_NotifyMenuCharacterCategoryClicked, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'CustomizationContentWidget_V2_C_NotifyMenuCharacterCategoryClicked::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct CustomizationContentWidget_V2_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(CustomizationContentWidget_V2_C_OnFocusReceived) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_OnFocusReceived");
static_assert(sizeof(CustomizationContentWidget_V2_C_OnFocusReceived) == 0x0001B0, "Wrong size on CustomizationContentWidget_V2_C_OnFocusReceived");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'CustomizationContentWidget_V2_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'CustomizationContentWidget_V2_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'CustomizationContentWidget_V2_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'CustomizationContentWidget_V2_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.TransmitFocusToCustoOption
// 0x0010 (0x0010 - 0x0000)
struct CustomizationContentWidget_V2_C_TransmitFocusToCustoOption final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_TransmitFocusToCustoOption) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_TransmitFocusToCustoOption");
static_assert(sizeof(CustomizationContentWidget_V2_C_TransmitFocusToCustoOption) == 0x000010, "Wrong size on CustomizationContentWidget_V2_C_TransmitFocusToCustoOption");
static_assert(offsetof(CustomizationContentWidget_V2_C_TransmitFocusToCustoOption, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'CustomizationContentWidget_V2_C_TransmitFocusToCustoOption::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_TransmitFocusToCustoOption, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'CustomizationContentWidget_V2_C_TransmitFocusToCustoOption::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_TransmitFocusToCustoOption, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'CustomizationContentWidget_V2_C_TransmitFocusToCustoOption::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.CycleCategories
// 0x0088 (0x0088 - 0x0000)
struct CustomizationContentWidget_V2_C_CycleCategories final
{
public:
	bool                                          CycleRight;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37E4[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CandidateIndex;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37E5[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ECustomizationMenuCategory>            CallFunc_GetCurrentCategoryList_CategoryList;      // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37E6[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECustomizationMenuCategory                    CallFunc_Array_Get_Item;                           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37E7[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECustomizationMenuCategory>            CallFunc_GetCurrentCategoryList_CategoryList_1;    // 0x0030(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetIsCustomizingFemale_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECustomizationMenuCategory                    CallFunc_Array_Get_Item_1;                         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37E8[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemCountForCategory_ReturnValue;      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CallFunc_GetButtonFromCategory_Button;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37E9[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECustomizationMenuCategory>            CallFunc_GetCurrentCategoryList_CategoryList_2;    // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37EA[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37EB[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationContentWidget_V2_C_CycleCategories) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_CycleCategories");
static_assert(sizeof(CustomizationContentWidget_V2_C_CycleCategories) == 0x000088, "Wrong size on CustomizationContentWidget_V2_C_CycleCategories");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CycleRight) == 0x000000, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CycleRight' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CandidateIndex) == 0x000004, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CandidateIndex' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, Temp_bool_Variable) == 0x000008, "Member 'CustomizationContentWidget_V2_C_CycleCategories::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_GetCurrentCategoryList_CategoryList) == 0x000010, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_GetCurrentCategoryList_CategoryList' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, Temp_int_Variable) == 0x000028, "Member 'CustomizationContentWidget_V2_C_CycleCategories::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_Array_Get_Item) == 0x00002C, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, Temp_bool_Variable_1) == 0x00002D, "Member 'CustomizationContentWidget_V2_C_CycleCategories::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_GetCurrentCategoryList_CategoryList_1) == 0x000030, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_GetCurrentCategoryList_CategoryList_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_GetIsCustomizingFemale_ReturnValue) == 0x000040, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_GetIsCustomizingFemale_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_Array_Get_Item_1) == 0x000041, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_GetItemCountForCategory_ReturnValue) == 0x000044, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_GetItemCountForCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_GetButtonFromCategory_Button) == 0x000048, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_GetButtonFromCategory_Button' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_GetCurrentCategoryList_CategoryList_2) == 0x000058, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_GetCurrentCategoryList_CategoryList_2' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_Array_Find_ReturnValue) == 0x000068, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000074, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, K2Node_Select_Default) == 0x000078, "Member 'CustomizationContentWidget_V2_C_CycleCategories::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, K2Node_Select_Default_1) == 0x00007C, "Member 'CustomizationContentWidget_V2_C_CycleCategories::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000080, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleCategories, CallFunc_SelectInt_ReturnValue) == 0x000084, "Member 'CustomizationContentWidget_V2_C_CycleCategories::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.GetCellCustomizationActor
// 0x0040 (0x0040 - 0x0000)
struct CustomizationContentWidget_V2_C_GetCellCustomizationActor final
{
public:
	class ACellCustomizationCameraActor_C*        NewParam;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLobbyPlayerState*                    K2Node_DynamicCast_AsRB_Lobby_Player_State;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37EC[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerCell*                          CallFunc_GetPlayerCell_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetCellCustomizationCamera_ReturnValue;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACellCustomizationCameraActor_C*        K2Node_DynamicCast_AsCell_Customization_Camera_Actor; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_GetCellCustomizationActor) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_GetCellCustomizationActor");
static_assert(sizeof(CustomizationContentWidget_V2_C_GetCellCustomizationActor) == 0x000040, "Wrong size on CustomizationContentWidget_V2_C_GetCellCustomizationActor");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetCellCustomizationActor, NewParam) == 0x000000, "Member 'CustomizationContentWidget_V2_C_GetCellCustomizationActor::NewParam' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetCellCustomizationActor, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000008, "Member 'CustomizationContentWidget_V2_C_GetCellCustomizationActor::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetCellCustomizationActor, K2Node_DynamicCast_AsRB_Lobby_Player_State) == 0x000010, "Member 'CustomizationContentWidget_V2_C_GetCellCustomizationActor::K2Node_DynamicCast_AsRB_Lobby_Player_State' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetCellCustomizationActor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CustomizationContentWidget_V2_C_GetCellCustomizationActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetCellCustomizationActor, CallFunc_GetPlayerCell_ReturnValue) == 0x000020, "Member 'CustomizationContentWidget_V2_C_GetCellCustomizationActor::CallFunc_GetPlayerCell_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetCellCustomizationActor, CallFunc_GetCellCustomizationCamera_ReturnValue) == 0x000028, "Member 'CustomizationContentWidget_V2_C_GetCellCustomizationActor::CallFunc_GetCellCustomizationCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetCellCustomizationActor, K2Node_DynamicCast_AsCell_Customization_Camera_Actor) == 0x000030, "Member 'CustomizationContentWidget_V2_C_GetCellCustomizationActor::K2Node_DynamicCast_AsCell_Customization_Camera_Actor' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetCellCustomizationActor, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'CustomizationContentWidget_V2_C_GetCellCustomizationActor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.PreviewCellItem
// 0x0030 (0x0030 - 0x0000)
struct CustomizationContentWidget_V2_C_PreviewCellItem final
{
public:
	ECustomizationMenuCategory                    Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37ED[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerCellItemDefinition*            ItemDefinition;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLobbyPlayerState*                    K2Node_DynamicCast_AsRB_Lobby_Player_State;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37EE[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerCell*                          CallFunc_GetPlayerCell_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationContentWidget_V2_C_PreviewCellItem) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_PreviewCellItem");
static_assert(sizeof(CustomizationContentWidget_V2_C_PreviewCellItem) == 0x000030, "Wrong size on CustomizationContentWidget_V2_C_PreviewCellItem");
static_assert(offsetof(CustomizationContentWidget_V2_C_PreviewCellItem, Category) == 0x000000, "Member 'CustomizationContentWidget_V2_C_PreviewCellItem::Category' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_PreviewCellItem, ItemDefinition) == 0x000008, "Member 'CustomizationContentWidget_V2_C_PreviewCellItem::ItemDefinition' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_PreviewCellItem, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000010, "Member 'CustomizationContentWidget_V2_C_PreviewCellItem::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_PreviewCellItem, K2Node_DynamicCast_AsRB_Lobby_Player_State) == 0x000018, "Member 'CustomizationContentWidget_V2_C_PreviewCellItem::K2Node_DynamicCast_AsRB_Lobby_Player_State' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_PreviewCellItem, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CustomizationContentWidget_V2_C_PreviewCellItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_PreviewCellItem, CallFunc_GetPlayerCell_ReturnValue) == 0x000028, "Member 'CustomizationContentWidget_V2_C_PreviewCellItem::CallFunc_GetPlayerCell_ReturnValue' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.CycleFocus
// 0x0001 (0x0001 - 0x0000)
struct CustomizationContentWidget_V2_C_CycleFocus final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_CycleFocus) == 0x000001, "Wrong alignment on CustomizationContentWidget_V2_C_CycleFocus");
static_assert(sizeof(CustomizationContentWidget_V2_C_CycleFocus) == 0x000001, "Wrong size on CustomizationContentWidget_V2_C_CycleFocus");
static_assert(offsetof(CustomizationContentWidget_V2_C_CycleFocus, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CustomizationContentWidget_V2_C_CycleFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.Event_ItemEquipped
// 0x0038 (0x0038 - 0x0000)
struct CustomizationContentWidget_V2_C_Event_ItemEquipped final
{
public:
	struct FUICustomizationItem                   Item;                                              // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_Event_ItemEquipped) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_Event_ItemEquipped");
static_assert(sizeof(CustomizationContentWidget_V2_C_Event_ItemEquipped) == 0x000038, "Wrong size on CustomizationContentWidget_V2_C_Event_ItemEquipped");
static_assert(offsetof(CustomizationContentWidget_V2_C_Event_ItemEquipped, Item) == 0x000000, "Member 'CustomizationContentWidget_V2_C_Event_ItemEquipped::Item' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_Event_ItemEquipped, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'CustomizationContentWidget_V2_C_Event_ItemEquipped::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.PlayPreviewVoiceline
// 0x0020 (0x0020 - 0x0000)
struct CustomizationContentWidget_V2_C_PlayPreviewVoiceline final
{
public:
	class URBVoiceCustomizationOption*            VoiceOption;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetNarrator_ClientOnly_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationContentWidget_V2_C_PlayPreviewVoiceline) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_PlayPreviewVoiceline");
static_assert(sizeof(CustomizationContentWidget_V2_C_PlayPreviewVoiceline) == 0x000020, "Wrong size on CustomizationContentWidget_V2_C_PlayPreviewVoiceline");
static_assert(offsetof(CustomizationContentWidget_V2_C_PlayPreviewVoiceline, VoiceOption) == 0x000000, "Member 'CustomizationContentWidget_V2_C_PlayPreviewVoiceline::VoiceOption' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_PlayPreviewVoiceline, CallFunc_GetNarrator_ClientOnly_ReturnValue) == 0x000008, "Member 'CustomizationContentWidget_V2_C_PlayPreviewVoiceline::CallFunc_GetNarrator_ClientOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_PlayPreviewVoiceline, CallFunc_Conv_StringToName_ReturnValue) == 0x000010, "Member 'CustomizationContentWidget_V2_C_PlayPreviewVoiceline::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_PlayPreviewVoiceline, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000018, "Member 'CustomizationContentWidget_V2_C_PlayPreviewVoiceline::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.AddCategoriesItems
// 0x0014 (0x0014 - 0x0000)
struct CustomizationContentWidget_V2_C_AddCategoriesItems final
{
public:
	TDelegate<void(ECustomizationMenuCategory CustoCategory)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetIsCustomizingFemale_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_AddCategoriesItems) == 0x000004, "Wrong alignment on CustomizationContentWidget_V2_C_AddCategoriesItems");
static_assert(sizeof(CustomizationContentWidget_V2_C_AddCategoriesItems) == 0x000014, "Wrong size on CustomizationContentWidget_V2_C_AddCategoriesItems");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCategoriesItems, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'CustomizationContentWidget_V2_C_AddCategoriesItems::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCategoriesItems, CallFunc_GetIsCustomizingFemale_ReturnValue) == 0x000010, "Member 'CustomizationContentWidget_V2_C_AddCategoriesItems::CallFunc_GetIsCustomizingFemale_ReturnValue' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.AddCustomizationItems
// 0x0090 (0x0090 - 0x0000)
struct CustomizationContentWidget_V2_C_AddCustomizationItems final
{
public:
	TArray<struct FUICustomizationItem>           Items;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37EF[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37F0[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37F1[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue_1;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37F2[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FUICustomizationItem& Item)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FUICustomizationItem& Item)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FUICustomizationItem& Item)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FUICustomizationItem& Item)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FUICustomizationItem& Item)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_AddCustomizationItems) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_AddCustomizationItems");
static_assert(sizeof(CustomizationContentWidget_V2_C_AddCustomizationItems) == 0x000090, "Wrong size on CustomizationContentWidget_V2_C_AddCustomizationItems");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, Items) == 0x000000, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::Items' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000010, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, CallFunc_GetRenderOpacity_ReturnValue) == 0x000014, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, CallFunc_BooleanAND_ReturnValue) == 0x000018, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000019, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000020, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000028, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, CallFunc_GetRenderOpacity_ReturnValue_1) == 0x000034, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::CallFunc_GetRenderOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, CallFunc_NotEqual_FloatFloat_ReturnValue_1) == 0x000038, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::CallFunc_NotEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, K2Node_CreateDelegate_OutputDelegate_1) == 0x00004C, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, K2Node_CreateDelegate_OutputDelegate_2) == 0x00005C, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, K2Node_CreateDelegate_OutputDelegate_3) == 0x00006C, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_AddCustomizationItems, K2Node_CreateDelegate_OutputDelegate_4) == 0x00007C, "Member 'CustomizationContentWidget_V2_C_AddCustomizationItems::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.ChangeCategory
// 0x0048 (0x0048 - 0x0000)
struct CustomizationContentWidget_V2_C_ChangeCategory final
{
public:
	ECustomizationMenuCategory                    CustoCategory;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37F3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACellCustomizationCameraActor_C*        CallFunc_GetCellCustomizationActor_NewParam;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37F4[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSettings_Gameplay*                   CallFunc_GetRBSettings_Gameplay_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCustomizationMenuCategoryParams       CallFunc_Map_Find_Value;                           // 0x0020(0x0020)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_ChangeCategory) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_ChangeCategory");
static_assert(sizeof(CustomizationContentWidget_V2_C_ChangeCategory) == 0x000048, "Wrong size on CustomizationContentWidget_V2_C_ChangeCategory");
static_assert(offsetof(CustomizationContentWidget_V2_C_ChangeCategory, CustoCategory) == 0x000000, "Member 'CustomizationContentWidget_V2_C_ChangeCategory::CustoCategory' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ChangeCategory, CallFunc_GetCellCustomizationActor_NewParam) == 0x000008, "Member 'CustomizationContentWidget_V2_C_ChangeCategory::CallFunc_GetCellCustomizationActor_NewParam' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ChangeCategory, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000010, "Member 'CustomizationContentWidget_V2_C_ChangeCategory::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ChangeCategory, CallFunc_GetRBSettings_Gameplay_ReturnValue) == 0x000018, "Member 'CustomizationContentWidget_V2_C_ChangeCategory::CallFunc_GetRBSettings_Gameplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ChangeCategory, CallFunc_Map_Find_Value) == 0x000020, "Member 'CustomizationContentWidget_V2_C_ChangeCategory::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ChangeCategory, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'CustomizationContentWidget_V2_C_ChangeCategory::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.GetPageSpecificButtons
// 0x0060 (0x0060 - 0x0000)
struct CustomizationContentWidget_V2_C_GetPageSpecificButtons final
{
public:
	TArray<class UUserWidget*>                    OutButtons;                                        // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UUserWidget*>                    FinalButtons;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37F5[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37F6[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37F7[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_DynamicCast_AsRB_Menu_Button;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37F8[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_GetPageSpecificButtons) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_GetPageSpecificButtons");
static_assert(sizeof(CustomizationContentWidget_V2_C_GetPageSpecificButtons) == 0x000060, "Wrong size on CustomizationContentWidget_V2_C_GetPageSpecificButtons");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, OutButtons) == 0x000000, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::OutButtons' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, FinalButtons) == 0x000010, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::FinalButtons' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, Temp_int_Array_Index_Variable) == 0x000020, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x00002C, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, CallFunc_Array_Get_Item) == 0x000038, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, K2Node_DynamicCast_AsRB_Menu_Button) == 0x000048, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::K2Node_DynamicCast_AsRB_Menu_Button' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, CallFunc_Contains_ReturnValue) == 0x000058, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, CallFunc_Not_PreBool_ReturnValue) == 0x000059, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_GetPageSpecificButtons, CallFunc_BooleanOR_ReturnValue) == 0x00005A, "Member 'CustomizationContentWidget_V2_C_GetPageSpecificButtons::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.OnCategoryClicked
// 0x001C (0x001C - 0x0000)
struct CustomizationContentWidget_V2_C_OnCategoryClicked final
{
public:
	ECustomizationMenuCategory                    CustoCategory;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_OnCategoryClicked) == 0x000004, "Wrong alignment on CustomizationContentWidget_V2_C_OnCategoryClicked");
static_assert(sizeof(CustomizationContentWidget_V2_C_OnCategoryClicked) == 0x00001C, "Wrong size on CustomizationContentWidget_V2_C_OnCategoryClicked");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnCategoryClicked, CustoCategory) == 0x000000, "Member 'CustomizationContentWidget_V2_C_OnCategoryClicked::CustoCategory' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnCategoryClicked, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'CustomizationContentWidget_V2_C_OnCategoryClicked::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnCategoryClicked, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000002, "Member 'CustomizationContentWidget_V2_C_OnCategoryClicked::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnCategoryClicked, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'CustomizationContentWidget_V2_C_OnCategoryClicked::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnCategoryClicked, Temp_delegate_Variable) == 0x000004, "Member 'CustomizationContentWidget_V2_C_OnCategoryClicked::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnCategoryClicked, CallFunc_PostEventGlobal_ReturnValue) == 0x000014, "Member 'CustomizationContentWidget_V2_C_OnCategoryClicked::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnCategoryClicked, CallFunc_BooleanOR_ReturnValue) == 0x000018, "Member 'CustomizationContentWidget_V2_C_OnCategoryClicked::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.OnItemUnhovered
// 0x0040 (0x0040 - 0x0000)
struct CustomizationContentWidget_V2_C_OnItemUnhovered final
{
public:
	struct FUICustomizationItem                   CustoItem;                                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	TArray<class URBPlayerCustomizationOption*>   Options;                                           // 0x0030(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(CustomizationContentWidget_V2_C_OnItemUnhovered) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_OnItemUnhovered");
static_assert(sizeof(CustomizationContentWidget_V2_C_OnItemUnhovered) == 0x000040, "Wrong size on CustomizationContentWidget_V2_C_OnItemUnhovered");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnItemUnhovered, CustoItem) == 0x000000, "Member 'CustomizationContentWidget_V2_C_OnItemUnhovered::CustoItem' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnItemUnhovered, Options) == 0x000030, "Member 'CustomizationContentWidget_V2_C_OnItemUnhovered::Options' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.OnItemHovered
// 0x0078 (0x0078 - 0x0000)
struct CustomizationContentWidget_V2_C_OnItemHovered final
{
public:
	struct FUICustomizationItem                   CustoItem;                                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37F9[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBPlayerCustomizationInfo             CallFunc_BP_GetOptionsForPreview_ReturnValue;      // 0x0038(0x0038)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_OnItemHovered) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_OnItemHovered");
static_assert(sizeof(CustomizationContentWidget_V2_C_OnItemHovered) == 0x000078, "Wrong size on CustomizationContentWidget_V2_C_OnItemHovered");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnItemHovered, CustoItem) == 0x000000, "Member 'CustomizationContentWidget_V2_C_OnItemHovered::CustoItem' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnItemHovered, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'CustomizationContentWidget_V2_C_OnItemHovered::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnItemHovered, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000031, "Member 'CustomizationContentWidget_V2_C_OnItemHovered::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnItemHovered, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'CustomizationContentWidget_V2_C_OnItemHovered::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnItemHovered, CallFunc_IsValid_ReturnValue) == 0x000033, "Member 'CustomizationContentWidget_V2_C_OnItemHovered::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnItemHovered, CallFunc_BP_GetOptionsForPreview_ReturnValue) == 0x000038, "Member 'CustomizationContentWidget_V2_C_OnItemHovered::CallFunc_BP_GetOptionsForPreview_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnItemHovered, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'CustomizationContentWidget_V2_C_OnItemHovered::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
