#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationItemGrid

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CustomizationItemGrid.CustomizationItemGrid_C
// 0x0098 (0x0300 - 0x0268)
class UCustomizationItemGrid_C final : public URBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             CustomizationOptionsScrollBox;                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      ThumbnailGrid;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationOptionThumbnail_C*        EquippedOptionWidget;                              // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemsPerRow;                                       // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C1[0x4];                                     // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             EventOnItemClicked;                                // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventOnItemHovered;                                // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventOnItemUnhovered;                              // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventOnItemPressed;                                // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             EventOnItemReleased;                               // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         ItemCount;                                         // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCellCustomization;                              // 0x02E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34C2[0x3];                                     // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCustomizationOptionThumbnail_C*> ThumbnailWidgetsPool;                              // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	ECustomizationMenuCategory                    Category;                                          // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnInputSourceChanged(bool bIsGamepad);
	void GetThumbnailWidget(class UCustomizationOptionThumbnail_C** Thumbnail);
	void OnItemBought(struct FUICustomizationItem& ItemBought);
	void OnItemEquipped(struct FUICustomizationItem& New_Equipped_Item);
	void TryUpdateEquippedOptionWidget(class UCustomizationOptionThumbnail_C* New_Option);
	class UWidget* GamepadNav_HandleGridNavigation(EUINavigation Param_Navigation);
	void AddItems(TArray<struct FUICustomizationItem>& Items, ECustomizationMenuCategory Param_Category);
	void OnItemReleased(class UCustomizationOptionThumbnail_C* Button);
	void OnItemPressed(class UCustomizationOptionThumbnail_C* Button);
	void OnItemUnhovered(class UCustomizationOptionThumbnail_C* Widget);
	void OnItemHovered(class UCustomizationOptionThumbnail_C* Widget);
	void OnItemClicked(class UCustomizationOptionThumbnail_C* Widget);
	void RefreshItemInfos(TArray<struct FUICustomizationItem>& Items);
	void ManageEmptyThumbnails();
	void GetLastEmptyItemIndex(int32* Param_Index);
	void SetEquippedOptionWidget(class UCustomizationOptionThumbnail_C* Widget);
	void Construct();
	void Event_InputSourceChanged(bool bIsGamepad);
	void ExecuteUbergraph_CustomizationItemGrid(int32 EntryPoint);
	void EventOnItemReleased__DelegateSignature(const struct FUICustomizationItem& Item);
	void EventOnItemPressed__DelegateSignature(const struct FUICustomizationItem& Item);
	void EventOnItemUnhovered__DelegateSignature(const struct FUICustomizationItem& Item);
	void EventOnItemHovered__DelegateSignature(const struct FUICustomizationItem& Item);
	void EventOnItemClicked__DelegateSignature(const struct FUICustomizationItem& Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomizationItemGrid_C">();
	}
	static class UCustomizationItemGrid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizationItemGrid_C>();
	}
};
static_assert(alignof(UCustomizationItemGrid_C) == 0x000008, "Wrong alignment on UCustomizationItemGrid_C");
static_assert(sizeof(UCustomizationItemGrid_C) == 0x000300, "Wrong size on UCustomizationItemGrid_C");
static_assert(offsetof(UCustomizationItemGrid_C, UberGraphFrame) == 0x000268, "Member 'UCustomizationItemGrid_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomizationItemGrid_C, CustomizationOptionsScrollBox) == 0x000270, "Member 'UCustomizationItemGrid_C::CustomizationOptionsScrollBox' has a wrong offset!");
static_assert(offsetof(UCustomizationItemGrid_C, ThumbnailGrid) == 0x000278, "Member 'UCustomizationItemGrid_C::ThumbnailGrid' has a wrong offset!");
static_assert(offsetof(UCustomizationItemGrid_C, EquippedOptionWidget) == 0x000280, "Member 'UCustomizationItemGrid_C::EquippedOptionWidget' has a wrong offset!");
static_assert(offsetof(UCustomizationItemGrid_C, ItemsPerRow) == 0x000288, "Member 'UCustomizationItemGrid_C::ItemsPerRow' has a wrong offset!");
static_assert(offsetof(UCustomizationItemGrid_C, EventOnItemClicked) == 0x000290, "Member 'UCustomizationItemGrid_C::EventOnItemClicked' has a wrong offset!");
static_assert(offsetof(UCustomizationItemGrid_C, EventOnItemHovered) == 0x0002A0, "Member 'UCustomizationItemGrid_C::EventOnItemHovered' has a wrong offset!");
static_assert(offsetof(UCustomizationItemGrid_C, EventOnItemUnhovered) == 0x0002B0, "Member 'UCustomizationItemGrid_C::EventOnItemUnhovered' has a wrong offset!");
static_assert(offsetof(UCustomizationItemGrid_C, EventOnItemPressed) == 0x0002C0, "Member 'UCustomizationItemGrid_C::EventOnItemPressed' has a wrong offset!");
static_assert(offsetof(UCustomizationItemGrid_C, EventOnItemReleased) == 0x0002D0, "Member 'UCustomizationItemGrid_C::EventOnItemReleased' has a wrong offset!");
static_assert(offsetof(UCustomizationItemGrid_C, ItemCount) == 0x0002E0, "Member 'UCustomizationItemGrid_C::ItemCount' has a wrong offset!");
static_assert(offsetof(UCustomizationItemGrid_C, bIsCellCustomization) == 0x0002E4, "Member 'UCustomizationItemGrid_C::bIsCellCustomization' has a wrong offset!");
static_assert(offsetof(UCustomizationItemGrid_C, ThumbnailWidgetsPool) == 0x0002E8, "Member 'UCustomizationItemGrid_C::ThumbnailWidgetsPool' has a wrong offset!");
static_assert(offsetof(UCustomizationItemGrid_C, Category) == 0x0002F8, "Member 'UCustomizationItemGrid_C::Category' has a wrong offset!");

}

