#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationCategoryWidget_V2

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CustomizationCategoryWidget_V2.CustomizationCategoryWidget_V2_C.GetToolTipWidget_0
// 0x0088 (0x0088 - 0x0000)
struct CustomizationCategoryWidget_V2_C_GetToolTipWidget_0 final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimpleTextTooltip_C*                   CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBSettings_Gameplay*                   CallFunc_GetRBSettings_Gameplay_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3842[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizationMenuCategoryParams       CallFunc_Map_Find_Value;                           // 0x0020(0x0020)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3843[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0070(0x0018)()
};
static_assert(alignof(CustomizationCategoryWidget_V2_C_GetToolTipWidget_0) == 0x000008, "Wrong alignment on CustomizationCategoryWidget_V2_C_GetToolTipWidget_0");
static_assert(sizeof(CustomizationCategoryWidget_V2_C_GetToolTipWidget_0) == 0x000088, "Wrong size on CustomizationCategoryWidget_V2_C_GetToolTipWidget_0");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_GetToolTipWidget_0, ReturnValue) == 0x000000, "Member 'CustomizationCategoryWidget_V2_C_GetToolTipWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_GetToolTipWidget_0, CallFunc_Create_ReturnValue) == 0x000008, "Member 'CustomizationCategoryWidget_V2_C_GetToolTipWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_GetToolTipWidget_0, CallFunc_GetRBSettings_Gameplay_ReturnValue) == 0x000010, "Member 'CustomizationCategoryWidget_V2_C_GetToolTipWidget_0::CallFunc_GetRBSettings_Gameplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_GetToolTipWidget_0, Temp_bool_Variable) == 0x000018, "Member 'CustomizationCategoryWidget_V2_C_GetToolTipWidget_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_GetToolTipWidget_0, CallFunc_Map_Find_Value) == 0x000020, "Member 'CustomizationCategoryWidget_V2_C_GetToolTipWidget_0::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_GetToolTipWidget_0, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'CustomizationCategoryWidget_V2_C_GetToolTipWidget_0::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_GetToolTipWidget_0, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000048, "Member 'CustomizationCategoryWidget_V2_C_GetToolTipWidget_0::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_GetToolTipWidget_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'CustomizationCategoryWidget_V2_C_GetToolTipWidget_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_GetToolTipWidget_0, K2Node_Select_Default) == 0x000070, "Member 'CustomizationCategoryWidget_V2_C_GetToolTipWidget_0::K2Node_Select_Default' has a wrong offset!");

// Function CustomizationCategoryWidget_V2.CustomizationCategoryWidget_V2_C.UpdateNewStatus
// 0x0004 (0x0004 - 0x0000)
struct CustomizationCategoryWidget_V2_C_UpdateNewStatus final
{
public:
	bool                                          CallFunc_IsInTutorialStage_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasNewShopItem_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationCategoryWidget_V2_C_UpdateNewStatus) == 0x000001, "Wrong alignment on CustomizationCategoryWidget_V2_C_UpdateNewStatus");
static_assert(sizeof(CustomizationCategoryWidget_V2_C_UpdateNewStatus) == 0x000004, "Wrong size on CustomizationCategoryWidget_V2_C_UpdateNewStatus");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_UpdateNewStatus, CallFunc_IsInTutorialStage_ReturnValue) == 0x000000, "Member 'CustomizationCategoryWidget_V2_C_UpdateNewStatus::CallFunc_IsInTutorialStage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_UpdateNewStatus, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'CustomizationCategoryWidget_V2_C_UpdateNewStatus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_UpdateNewStatus, CallFunc_HasNewShopItem_ReturnValue) == 0x000002, "Member 'CustomizationCategoryWidget_V2_C_UpdateNewStatus::CallFunc_HasNewShopItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_UpdateNewStatus, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'CustomizationCategoryWidget_V2_C_UpdateNewStatus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CustomizationCategoryWidget_V2.CustomizationCategoryWidget_V2_C.SetSelected
// 0x0003 (0x0003 - 0x0000)
struct CustomizationCategoryWidget_V2_C_SetSelected final
{
public:
	bool                                          Param_IsSelected;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationCategoryWidget_V2_C_SetSelected) == 0x000001, "Wrong alignment on CustomizationCategoryWidget_V2_C_SetSelected");
static_assert(sizeof(CustomizationCategoryWidget_V2_C_SetSelected) == 0x000003, "Wrong size on CustomizationCategoryWidget_V2_C_SetSelected");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_SetSelected, Param_IsSelected) == 0x000000, "Member 'CustomizationCategoryWidget_V2_C_SetSelected::Param_IsSelected' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_SetSelected, CallFunc_IsHovered_ReturnValue) == 0x000001, "Member 'CustomizationCategoryWidget_V2_C_SetSelected::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_SetSelected, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'CustomizationCategoryWidget_V2_C_SetSelected::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function CustomizationCategoryWidget_V2.CustomizationCategoryWidget_V2_C.ExecuteUbergraph_CustomizationCategoryWidget_V2
// 0x0060 (0x0060 - 0x0000)
struct CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3844[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3845[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSettings_Gameplay*                   CallFunc_GetRBSettings_Gameplay_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCustomizationMenuCategoryParams       CallFunc_Map_Find_Value;                           // 0x0038(0x0020)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2) == 0x000008, "Wrong alignment on CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2");
static_assert(sizeof(CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2) == 0x000060, "Wrong size on CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2, EntryPoint) == 0x000000, "Member 'CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2, Temp_bool_Variable) == 0x000014, "Member 'CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2, Temp_byte_Variable) == 0x000028, "Member 'CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2, Temp_byte_Variable_1) == 0x000029, "Member 'CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2, CallFunc_GetRBSettings_Gameplay_ReturnValue) == 0x000030, "Member 'CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2::CallFunc_GetRBSettings_Gameplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2, CallFunc_Map_Find_Value) == 0x000038, "Member 'CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2, CallFunc_Map_Find_ReturnValue) == 0x000058, "Member 'CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2, K2Node_Select_Default) == 0x000059, "Member 'CustomizationCategoryWidget_V2_C_ExecuteUbergraph_CustomizationCategoryWidget_V2::K2Node_Select_Default' has a wrong offset!");

// Function CustomizationCategoryWidget_V2.CustomizationCategoryWidget_V2_C.Event_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CustomizationCategoryWidget_V2_C_Event_OnClicked__DelegateSignature final
{
public:
	class UCustomizationCategoryWidget_V2_C*      buttonClicked;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationCategoryWidget_V2_C_Event_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on CustomizationCategoryWidget_V2_C_Event_OnClicked__DelegateSignature");
static_assert(sizeof(CustomizationCategoryWidget_V2_C_Event_OnClicked__DelegateSignature) == 0x000008, "Wrong size on CustomizationCategoryWidget_V2_C_Event_OnClicked__DelegateSignature");
static_assert(offsetof(CustomizationCategoryWidget_V2_C_Event_OnClicked__DelegateSignature, buttonClicked) == 0x000000, "Member 'CustomizationCategoryWidget_V2_C_Event_OnClicked__DelegateSignature::buttonClicked' has a wrong offset!");

}

