#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationMenu

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CustomizationMenu.CustomizationMenu_C.UpdateHairColorNavigation
// 0x0060 (0x0060 - 0x0000)
struct CustomizationMenu_C_UpdateHairColorNavigation final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_332B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	const class UWidget*                          CallFunc_GetFocusedChild_ReturnValue;              // 0x0038(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_332C[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0048(0x0018)()
};
static_assert(alignof(CustomizationMenu_C_UpdateHairColorNavigation) == 0x000008, "Wrong alignment on CustomizationMenu_C_UpdateHairColorNavigation");
static_assert(sizeof(CustomizationMenu_C_UpdateHairColorNavigation) == 0x000060, "Wrong size on CustomizationMenu_C_UpdateHairColorNavigation");
static_assert(offsetof(CustomizationMenu_C_UpdateHairColorNavigation, Temp_bool_Variable) == 0x000000, "Member 'CustomizationMenu_C_UpdateHairColorNavigation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateHairColorNavigation, Temp_text_Variable) == 0x000008, "Member 'CustomizationMenu_C_UpdateHairColorNavigation::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateHairColorNavigation, Temp_text_Variable_1) == 0x000020, "Member 'CustomizationMenu_C_UpdateHairColorNavigation::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateHairColorNavigation, CallFunc_GetFocusedChild_ReturnValue) == 0x000038, "Member 'CustomizationMenu_C_UpdateHairColorNavigation::CallFunc_GetFocusedChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateHairColorNavigation, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'CustomizationMenu_C_UpdateHairColorNavigation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateHairColorNavigation, K2Node_Select_Default) == 0x000048, "Member 'CustomizationMenu_C_UpdateHairColorNavigation::K2Node_Select_Default' has a wrong offset!");

// Function CustomizationMenu.CustomizationMenu_C.TryStartNextMenuTutorial
// 0x0080 (0x0080 - 0x0000)
struct CustomizationMenu_C_TryStartNextMenuTutorial final
{
public:
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_332D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x000C(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayedMenuTutorial_ReturnValue;        // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_332E[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget_1;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayedMenuTutorial_ReturnValue_1;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_332F[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuTutorials_C*                       CallFunc_ShowMenuTutorial_createdWidget_2;         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShowingMenuTutorial_isShowingTutorial;  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationMenu_C_TryStartNextMenuTutorial) == 0x000008, "Wrong alignment on CustomizationMenu_C_TryStartNextMenuTutorial");
static_assert(sizeof(CustomizationMenu_C_TryStartNextMenuTutorial) == 0x000080, "Wrong size on CustomizationMenu_C_TryStartNextMenuTutorial");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_ShowMenuTutorial_createdWidget) == 0x000000, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_ShowMenuTutorial_createdWidget' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_GetCachedGeometry_ReturnValue) == 0x00000C, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_LocalToViewport_PixelPosition) == 0x000044, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_LocalToViewport_PixelPosition' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_LocalToViewport_ViewportPosition) == 0x00004C, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_LocalToViewport_ViewportPosition' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_BreakVector2D_X) == 0x000054, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_BreakVector2D_Y) == 0x000058, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00005C, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_HasPlayedMenuTutorial_ReturnValue) == 0x00005D, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_HasPlayedMenuTutorial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_ShowMenuTutorial_createdWidget_1) == 0x000060, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_ShowMenuTutorial_createdWidget_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_HasPlayedMenuTutorial_ReturnValue_1) == 0x000068, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_HasPlayedMenuTutorial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_ShowMenuTutorial_createdWidget_2) == 0x000070, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_ShowMenuTutorial_createdWidget_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_IsShowingMenuTutorial_isShowingTutorial) == 0x000078, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_IsShowingMenuTutorial_isShowingTutorial' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_Not_PreBool_ReturnValue_1) == 0x000079, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_BooleanAND_ReturnValue) == 0x00007A, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_BooleanAND_ReturnValue_1) == 0x00007B, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TryStartNextMenuTutorial, CallFunc_BooleanAND_ReturnValue_2) == 0x00007C, "Member 'CustomizationMenu_C_TryStartNextMenuTutorial::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function CustomizationMenu.CustomizationMenu_C.UpdateFTUESpecificElements
// 0x0018 (0x0018 - 0x0000)
struct CustomizationMenu_C_UpdateFTUESpecificElements final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3330[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationContentWidget_V2_C*       K2Node_DynamicCast_AsCustomization_Content_Widget_V2; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationMenu_C_UpdateFTUESpecificElements) == 0x000008, "Wrong alignment on CustomizationMenu_C_UpdateFTUESpecificElements");
static_assert(sizeof(CustomizationMenu_C_UpdateFTUESpecificElements) == 0x000018, "Wrong size on CustomizationMenu_C_UpdateFTUESpecificElements");
static_assert(offsetof(CustomizationMenu_C_UpdateFTUESpecificElements, Temp_bool_Variable) == 0x000000, "Member 'CustomizationMenu_C_UpdateFTUESpecificElements::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateFTUESpecificElements, Temp_byte_Variable) == 0x000001, "Member 'CustomizationMenu_C_UpdateFTUESpecificElements::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateFTUESpecificElements, Temp_byte_Variable_1) == 0x000002, "Member 'CustomizationMenu_C_UpdateFTUESpecificElements::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateFTUESpecificElements, K2Node_DynamicCast_AsCustomization_Content_Widget_V2) == 0x000008, "Member 'CustomizationMenu_C_UpdateFTUESpecificElements::K2Node_DynamicCast_AsCustomization_Content_Widget_V2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateFTUESpecificElements, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'CustomizationMenu_C_UpdateFTUESpecificElements::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateFTUESpecificElements, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'CustomizationMenu_C_UpdateFTUESpecificElements::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateFTUESpecificElements, K2Node_Select_Default) == 0x000012, "Member 'CustomizationMenu_C_UpdateFTUESpecificElements::K2Node_Select_Default' has a wrong offset!");

// Function CustomizationMenu.CustomizationMenu_C.UpdateListScrollBehaviour
// 0x0018 (0x0018 - 0x0000)
struct CustomizationMenu_C_UpdateListScrollBehaviour final
{
public:
	bool                                          Param_Index;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EScrollWhenFocusChanges                       Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EScrollWhenFocusChanges                       Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3331[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationContentWidget_V2_C*       K2Node_DynamicCast_AsCustomization_Content_Widget_V2; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EScrollWhenFocusChanges                       K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationMenu_C_UpdateListScrollBehaviour) == 0x000008, "Wrong alignment on CustomizationMenu_C_UpdateListScrollBehaviour");
static_assert(sizeof(CustomizationMenu_C_UpdateListScrollBehaviour) == 0x000018, "Wrong size on CustomizationMenu_C_UpdateListScrollBehaviour");
static_assert(offsetof(CustomizationMenu_C_UpdateListScrollBehaviour, Param_Index) == 0x000000, "Member 'CustomizationMenu_C_UpdateListScrollBehaviour::Param_Index' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateListScrollBehaviour, Temp_bool_Variable) == 0x000001, "Member 'CustomizationMenu_C_UpdateListScrollBehaviour::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateListScrollBehaviour, Temp_byte_Variable) == 0x000002, "Member 'CustomizationMenu_C_UpdateListScrollBehaviour::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateListScrollBehaviour, Temp_byte_Variable_1) == 0x000003, "Member 'CustomizationMenu_C_UpdateListScrollBehaviour::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateListScrollBehaviour, K2Node_DynamicCast_AsCustomization_Content_Widget_V2) == 0x000008, "Member 'CustomizationMenu_C_UpdateListScrollBehaviour::K2Node_DynamicCast_AsCustomization_Content_Widget_V2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateListScrollBehaviour, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'CustomizationMenu_C_UpdateListScrollBehaviour::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateListScrollBehaviour, K2Node_Select_Default) == 0x000011, "Member 'CustomizationMenu_C_UpdateListScrollBehaviour::K2Node_Select_Default' has a wrong offset!");

// Function CustomizationMenu.CustomizationMenu_C.UpdatePageSpecificButtons
// 0x0048 (0x0048 - 0x0000)
struct CustomizationMenu_C_UpdatePageSpecificButtons final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3332[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationContentWidget_V2_C*       K2Node_DynamicCast_AsCustomization_Content_Widget_V2; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3333[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetPageSpecificButtons_outButtons;        // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationMenu_C_UpdatePageSpecificButtons) == 0x000008, "Wrong alignment on CustomizationMenu_C_UpdatePageSpecificButtons");
static_assert(sizeof(CustomizationMenu_C_UpdatePageSpecificButtons) == 0x000048, "Wrong size on CustomizationMenu_C_UpdatePageSpecificButtons");
static_assert(offsetof(CustomizationMenu_C_UpdatePageSpecificButtons, Temp_int_Array_Index_Variable) == 0x000000, "Member 'CustomizationMenu_C_UpdatePageSpecificButtons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdatePageSpecificButtons, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CustomizationMenu_C_UpdatePageSpecificButtons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdatePageSpecificButtons, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CustomizationMenu_C_UpdatePageSpecificButtons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdatePageSpecificButtons, K2Node_DynamicCast_AsCustomization_Content_Widget_V2) == 0x000010, "Member 'CustomizationMenu_C_UpdatePageSpecificButtons::K2Node_DynamicCast_AsCustomization_Content_Widget_V2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdatePageSpecificButtons, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CustomizationMenu_C_UpdatePageSpecificButtons::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdatePageSpecificButtons, CallFunc_GetPageSpecificButtons_outButtons) == 0x000020, "Member 'CustomizationMenu_C_UpdatePageSpecificButtons::CallFunc_GetPageSpecificButtons_outButtons' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdatePageSpecificButtons, CallFunc_Array_Get_Item) == 0x000030, "Member 'CustomizationMenu_C_UpdatePageSpecificButtons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdatePageSpecificButtons, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000038, "Member 'CustomizationMenu_C_UpdatePageSpecificButtons::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdatePageSpecificButtons, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'CustomizationMenu_C_UpdatePageSpecificButtons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdatePageSpecificButtons, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'CustomizationMenu_C_UpdatePageSpecificButtons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function CustomizationMenu.CustomizationMenu_C.GamepadNav_TryToggleHairPalette
// 0x0048 (0x0048 - 0x0000)
struct CustomizationMenu_C_GamepadNav_TryToggleHairPalette final
{
public:
	class ARBMenuPlayerController*                CallFunc_GetLocalMenuController_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamePad_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3334[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationContentWidget_V2_C*       K2Node_DynamicCast_AsCustomization_Content_Widget_V2; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3335[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidget*                          CallFunc_GetFocusedChild_ReturnValue;              // 0x0020(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomizationOptionThumbnail_C*        K2Node_DynamicCast_AsCustomization_Option_Thumbnail; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3336[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidget*                          CallFunc_GetFocusedChild_ReturnValue_1;            // 0x0038(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette) == 0x000008, "Wrong alignment on CustomizationMenu_C_GamepadNav_TryToggleHairPalette");
static_assert(sizeof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette) == 0x000048, "Wrong size on CustomizationMenu_C_GamepadNav_TryToggleHairPalette");
static_assert(offsetof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette, CallFunc_GetLocalMenuController_ReturnValue) == 0x000000, "Member 'CustomizationMenu_C_GamepadNav_TryToggleHairPalette::CallFunc_GetLocalMenuController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette, CallFunc_IsUsingGamePad_ReturnValue) == 0x000008, "Member 'CustomizationMenu_C_GamepadNav_TryToggleHairPalette::CallFunc_IsUsingGamePad_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette, K2Node_DynamicCast_AsCustomization_Content_Widget_V2) == 0x000010, "Member 'CustomizationMenu_C_GamepadNav_TryToggleHairPalette::K2Node_DynamicCast_AsCustomization_Content_Widget_V2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CustomizationMenu_C_GamepadNav_TryToggleHairPalette::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette, CallFunc_GetFocusedChild_ReturnValue) == 0x000020, "Member 'CustomizationMenu_C_GamepadNav_TryToggleHairPalette::CallFunc_GetFocusedChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette, K2Node_DynamicCast_AsCustomization_Option_Thumbnail) == 0x000028, "Member 'CustomizationMenu_C_GamepadNav_TryToggleHairPalette::K2Node_DynamicCast_AsCustomization_Option_Thumbnail' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'CustomizationMenu_C_GamepadNav_TryToggleHairPalette::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'CustomizationMenu_C_GamepadNav_TryToggleHairPalette::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000032, "Member 'CustomizationMenu_C_GamepadNav_TryToggleHairPalette::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette, CallFunc_BooleanAND_ReturnValue) == 0x000033, "Member 'CustomizationMenu_C_GamepadNav_TryToggleHairPalette::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette, CallFunc_IsValid_ReturnValue_1) == 0x000034, "Member 'CustomizationMenu_C_GamepadNav_TryToggleHairPalette::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette, CallFunc_GetFocusedChild_ReturnValue_1) == 0x000038, "Member 'CustomizationMenu_C_GamepadNav_TryToggleHairPalette::CallFunc_GetFocusedChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_GamepadNav_TryToggleHairPalette, CallFunc_IsValid_ReturnValue_2) == 0x000040, "Member 'CustomizationMenu_C_GamepadNav_TryToggleHairPalette::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function CustomizationMenu.CustomizationMenu_C.TransmitFocusToCustoContent
// 0x0010 (0x0010 - 0x0000)
struct CustomizationMenu_C_TransmitFocusToCustoContent final
{
public:
	class UCustomizationContentWidget_V2_C*       K2Node_DynamicCast_AsCustomization_Content_Widget_V2; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationMenu_C_TransmitFocusToCustoContent) == 0x000008, "Wrong alignment on CustomizationMenu_C_TransmitFocusToCustoContent");
static_assert(sizeof(CustomizationMenu_C_TransmitFocusToCustoContent) == 0x000010, "Wrong size on CustomizationMenu_C_TransmitFocusToCustoContent");
static_assert(offsetof(CustomizationMenu_C_TransmitFocusToCustoContent, K2Node_DynamicCast_AsCustomization_Content_Widget_V2) == 0x000000, "Member 'CustomizationMenu_C_TransmitFocusToCustoContent::K2Node_DynamicCast_AsCustomization_Content_Widget_V2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_TransmitFocusToCustoContent, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'CustomizationMenu_C_TransmitFocusToCustoContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CustomizationMenu.CustomizationMenu_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct CustomizationMenu_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(CustomizationMenu_C_OnFocusReceived) == 0x000008, "Wrong alignment on CustomizationMenu_C_OnFocusReceived");
static_assert(sizeof(CustomizationMenu_C_OnFocusReceived) == 0x0001B0, "Wrong size on CustomizationMenu_C_OnFocusReceived");
static_assert(offsetof(CustomizationMenu_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'CustomizationMenu_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'CustomizationMenu_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'CustomizationMenu_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'CustomizationMenu_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function CustomizationMenu.CustomizationMenu_C.CreateRotateTooltip
// 0x0058 (0x0058 - 0x0000)
struct CustomizationMenu_C_CreateRotateTooltip final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0018)()
	class USimpleActionTooltip_C*                 CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressed_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3337[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0040(0x0018)()
};
static_assert(alignof(CustomizationMenu_C_CreateRotateTooltip) == 0x000008, "Wrong alignment on CustomizationMenu_C_CreateRotateTooltip");
static_assert(sizeof(CustomizationMenu_C_CreateRotateTooltip) == 0x000058, "Wrong size on CustomizationMenu_C_CreateRotateTooltip");
static_assert(offsetof(CustomizationMenu_C_CreateRotateTooltip, Temp_text_Variable) == 0x000000, "Member 'CustomizationMenu_C_CreateRotateTooltip::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_CreateRotateTooltip, Temp_text_Variable_1) == 0x000018, "Member 'CustomizationMenu_C_CreateRotateTooltip::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_CreateRotateTooltip, CallFunc_Create_ReturnValue) == 0x000030, "Member 'CustomizationMenu_C_CreateRotateTooltip::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_CreateRotateTooltip, CallFunc_IsPressed_ReturnValue) == 0x000038, "Member 'CustomizationMenu_C_CreateRotateTooltip::CallFunc_IsPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_CreateRotateTooltip, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'CustomizationMenu_C_CreateRotateTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_CreateRotateTooltip, Temp_bool_Variable) == 0x00003A, "Member 'CustomizationMenu_C_CreateRotateTooltip::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_CreateRotateTooltip, K2Node_Select_Default) == 0x000040, "Member 'CustomizationMenu_C_CreateRotateTooltip::K2Node_Select_Default' has a wrong offset!");

// Function CustomizationMenu.CustomizationMenu_C.PreviewCosts
// 0x01B8 (0x01B8 - 0x0000)
struct CustomizationMenu_C_PreviewCosts final
{
public:
	struct FUICustomizationItem                   Custo_Item;                                        // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3338[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3339[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBCustomizationOption*                 CallFunc_GetValidCustomizationOption_ReturnValue;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAcquired_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_333A[0x6];                                     // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBCustomizationOutfit*                 K2Node_DynamicCast_AsRB_Customization_Outfit;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_333B[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ECurrencyType, int32>                    CallFunc_BP_GetCost_ReturnValue;                   // 0x0070(0x0050)()
	bool                                          CallFunc_IsAcquired_ReturnValue_1;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_333C[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBItemProgressionData                 CallFunc_GetItemProgressionData_ReturnValue;       // 0x00D0(0x00E8)(ConstParm)
};
static_assert(alignof(CustomizationMenu_C_PreviewCosts) == 0x000008, "Wrong alignment on CustomizationMenu_C_PreviewCosts");
static_assert(sizeof(CustomizationMenu_C_PreviewCosts) == 0x0001B8, "Wrong size on CustomizationMenu_C_PreviewCosts");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, Custo_Item) == 0x000000, "Member 'CustomizationMenu_C_PreviewCosts::Custo_Item' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000030, "Member 'CustomizationMenu_C_PreviewCosts::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'CustomizationMenu_C_PreviewCosts::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000039, "Member 'CustomizationMenu_C_PreviewCosts::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00003A, "Member 'CustomizationMenu_C_PreviewCosts::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, CallFunc_GetLocalPlayerState_ReturnValue_1) == 0x000040, "Member 'CustomizationMenu_C_PreviewCosts::CallFunc_GetLocalPlayerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, CallFunc_BooleanOR_ReturnValue) == 0x000048, "Member 'CustomizationMenu_C_PreviewCosts::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, CallFunc_BooleanOR_ReturnValue_1) == 0x000049, "Member 'CustomizationMenu_C_PreviewCosts::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, CallFunc_GetValidCustomizationOption_ReturnValue) == 0x000050, "Member 'CustomizationMenu_C_PreviewCosts::CallFunc_GetValidCustomizationOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'CustomizationMenu_C_PreviewCosts::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, CallFunc_IsAcquired_ReturnValue) == 0x000059, "Member 'CustomizationMenu_C_PreviewCosts::CallFunc_IsAcquired_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, K2Node_DynamicCast_AsRB_Customization_Outfit) == 0x000060, "Member 'CustomizationMenu_C_PreviewCosts::K2Node_DynamicCast_AsRB_Customization_Outfit' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'CustomizationMenu_C_PreviewCosts::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, CallFunc_BP_GetCost_ReturnValue) == 0x000070, "Member 'CustomizationMenu_C_PreviewCosts::CallFunc_BP_GetCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, CallFunc_IsAcquired_ReturnValue_1) == 0x0000C0, "Member 'CustomizationMenu_C_PreviewCosts::CallFunc_IsAcquired_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x0000C8, "Member 'CustomizationMenu_C_PreviewCosts::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_PreviewCosts, CallFunc_GetItemProgressionData_ReturnValue) == 0x0000D0, "Member 'CustomizationMenu_C_PreviewCosts::CallFunc_GetItemProgressionData_ReturnValue' has a wrong offset!");

// Function CustomizationMenu.CustomizationMenu_C.UpdateCustoDetails
// 0x0198 (0x0198 - 0x0000)
struct CustomizationMenu_C_UpdateCustoDetails final
{
public:
	struct FUICustomizationItem                   Custo_Item;                                        // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FItemUnlockInfo                        NewLocalVar_0;                                     // 0x0030(0x0020)(Edit, BlueprintVisible)
	EPlayerCustomizationRarity                    Rarity;                                            // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_333D[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Description;                                       // 0x0058(0x0018)(Edit, BlueprintVisible)
	class FText                                   Param_Name;                                        // 0x0070(0x0018)(Edit, BlueprintVisible)
	class FText                                   Temp_text_Variable;                                // 0x0088(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_333E[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerCustomizationConfig*           CallFunc_GetPlayerCustomizationConfig_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_333F[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizationRarityUIInfo             CallFunc_Map_Find_Value;                           // 0x00B8(0x0068)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3340[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBCustomizationOption*                 CallFunc_GetValidCustomizationOption_ReturnValue;  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3341[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBCustomizationOption*                 CallFunc_GetValidCustomizationOption_ReturnValue_1; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3342[0x6];                                     // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0148(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0160(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x017B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3343[0x3];                                     // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0180(0x0018)()
};
static_assert(alignof(CustomizationMenu_C_UpdateCustoDetails) == 0x000008, "Wrong alignment on CustomizationMenu_C_UpdateCustoDetails");
static_assert(sizeof(CustomizationMenu_C_UpdateCustoDetails) == 0x000198, "Wrong size on CustomizationMenu_C_UpdateCustoDetails");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, Custo_Item) == 0x000000, "Member 'CustomizationMenu_C_UpdateCustoDetails::Custo_Item' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, NewLocalVar_0) == 0x000030, "Member 'CustomizationMenu_C_UpdateCustoDetails::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, Rarity) == 0x000050, "Member 'CustomizationMenu_C_UpdateCustoDetails::Rarity' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, Description) == 0x000058, "Member 'CustomizationMenu_C_UpdateCustoDetails::Description' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, Param_Name) == 0x000070, "Member 'CustomizationMenu_C_UpdateCustoDetails::Param_Name' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, Temp_text_Variable) == 0x000088, "Member 'CustomizationMenu_C_UpdateCustoDetails::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_IsValid_ReturnValue_1) == 0x0000A1, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_IsValid_ReturnValue_2) == 0x0000A2, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_IsValid_ReturnValue_3) == 0x0000A3, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_IsValid_ReturnValue_4) == 0x0000A4, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_GetPlayerCustomizationConfig_ReturnValue) == 0x0000A8, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_GetPlayerCustomizationConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_BooleanOR_ReturnValue) == 0x0000B0, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_BooleanOR_ReturnValue_1) == 0x0000B1, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_BooleanOR_ReturnValue_2) == 0x0000B2, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_BooleanOR_ReturnValue_3) == 0x0000B3, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, Temp_bool_Variable) == 0x0000B4, "Member 'CustomizationMenu_C_UpdateCustoDetails::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_Map_Find_Value) == 0x0000B8, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_Map_Find_ReturnValue) == 0x000120, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_GetValidCustomizationOption_ReturnValue) == 0x000128, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_GetValidCustomizationOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_IsValid_ReturnValue_5) == 0x000130, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_GetValidCustomizationOption_ReturnValue_1) == 0x000138, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_GetValidCustomizationOption_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_IsValid_ReturnValue_6) == 0x000140, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_TextIsEmpty_ReturnValue) == 0x000141, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, K2Node_Select_Default) == 0x000148, "Member 'CustomizationMenu_C_UpdateCustoDetails::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, Temp_text_Variable_1) == 0x000160, "Member 'CustomizationMenu_C_UpdateCustoDetails::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_IsValid_ReturnValue_7) == 0x000178, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_IsValid_ReturnValue_8) == 0x000179, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_IsValid_ReturnValue_9) == 0x00017A, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, CallFunc_IsValid_ReturnValue_10) == 0x00017B, "Member 'CustomizationMenu_C_UpdateCustoDetails::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, Temp_bool_Variable_1) == 0x00017C, "Member 'CustomizationMenu_C_UpdateCustoDetails::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_UpdateCustoDetails, K2Node_Select_Default_1) == 0x000180, "Member 'CustomizationMenu_C_UpdateCustoDetails::K2Node_Select_Default_1' has a wrong offset!");

// Function CustomizationMenu.CustomizationMenu_C.SetupForCellCustomization
// 0x0038 (0x0038 - 0x0000)
struct CustomizationMenu_C_SetupForCellCustomization final
{
public:
	bool                                          bNewIsCellCustomization;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3344[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetLocalCellMenuCharacter_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMenuCharacter_C*                       K2Node_DynamicCast_AsMenu_Character;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3345[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationContentWidget_V2_C*       K2Node_DynamicCast_AsCustomization_Content_Widget_V2; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
