#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationCategories_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CustomizationCategories_V2.CustomizationCategories_V2_C
// 0x0120 (0x0388 - 0x0268)
class UCustomizationCategories_V2_C final : public URBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CycleRightButtonPress;                             // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CycleLeftButtonPress;                              // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             ButtonGrid;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CustomizationCategoryWidget_V2;                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CustomizationCategoryWidget_V2_1;                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CustomizationCategoryWidget_V2_2;                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CustomizationCategoryWidget_V2_3;                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CustomizationCategoryWidget_V2_4;                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CustomizationCategoryWidget_V2_5;                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CustomizationCategoryWidget_V2_6;                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CustomizationCategoryWidget_V2_7;                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CustomizationCategoryWidget_V2_8;                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CustomizationCategoryWidget_V2_9;                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CustomizationCategoryWidget_V2_10;                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CustomizationCategoryWidget_V2_11;                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CustomizationCategoryWidget_V2_12;                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CycleLeftButton;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UActionIconWidget_C*                    CycleLeftPrompt;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CycleRightButton;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UActionIconWidget_C*                    CycleRightPrompt;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_310;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_399;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AMenuCharacter_C*                       MenuCharacter;                                     // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      SelectedCategoryWidget;                            // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ECustomizationMenuCategory>            CharacterTutoCategories;                           // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<ECustomizationMenuCategory>            CharacterCategories;                               // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsTutorial;                                        // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_37CD[0x3];                                     // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FirstValidCategoryIndex;                           // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMetaNPCType                                  Shop_Type;                                         // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_37CE[0x3];                                     // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemsPerColumn;                                    // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             EventOnCategoryClicked;                            // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsCustomizingFemale;                               // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bIsPlayerCellCustomization;                        // 0x0371(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37CF[0x6];                                     // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECustomizationMenuCategory>            CellCategories;                                    // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateNewStatus(ECustomizationMenuCategory Category);
	void OnCategoryCycled(class UCustomizationCategoryWidget_V2_C* CategoryButton);
	void OnCategoryClicked(class UCustomizationCategoryWidget_V2_C* buttonClicked);
	void GetButtonFromCategory(ECustomizationMenuCategory Category, class UCustomizationCategoryWidget_V2_C** Button);
	void GetCurrentCategoryList(TArray<ECustomizationMenuCategory>* CategoryList);
	void Init(bool Param_IsTutorial, EMetaNPCType ShopType, bool Param_IsCustomizingFemale);
	void SelectCategory(class UCustomizationCategoryWidget_V2_C* buttonClicked);
	void CreateCategoryButtons(bool Param_IsTutorial);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__CustomizationCategories_V2_CycleLeftButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CustomizationCategories_V2_CycleRightButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void DisplayCategories();
	void ExecuteUbergraph_CustomizationCategories_V2(int32 EntryPoint);
	void EventOnCategoryClicked__DelegateSignature(ECustomizationMenuCategory CustoCategory);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomizationCategories_V2_C">();
	}
	static class UCustomizationCategories_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizationCategories_V2_C>();
	}
};
static_assert(alignof(UCustomizationCategories_V2_C) == 0x000008, "Wrong alignment on UCustomizationCategories_V2_C");
static_assert(sizeof(UCustomizationCategories_V2_C) == 0x000388, "Wrong size on UCustomizationCategories_V2_C");
static_assert(offsetof(UCustomizationCategories_V2_C, UberGraphFrame) == 0x000268, "Member 'UCustomizationCategories_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CycleRightButtonPress) == 0x000270, "Member 'UCustomizationCategories_V2_C::CycleRightButtonPress' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CycleLeftButtonPress) == 0x000278, "Member 'UCustomizationCategories_V2_C::CycleLeftButtonPress' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, ButtonGrid) == 0x000280, "Member 'UCustomizationCategories_V2_C::ButtonGrid' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CustomizationCategoryWidget_V2) == 0x000288, "Member 'UCustomizationCategories_V2_C::CustomizationCategoryWidget_V2' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CustomizationCategoryWidget_V2_1) == 0x000290, "Member 'UCustomizationCategories_V2_C::CustomizationCategoryWidget_V2_1' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CustomizationCategoryWidget_V2_2) == 0x000298, "Member 'UCustomizationCategories_V2_C::CustomizationCategoryWidget_V2_2' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CustomizationCategoryWidget_V2_3) == 0x0002A0, "Member 'UCustomizationCategories_V2_C::CustomizationCategoryWidget_V2_3' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CustomizationCategoryWidget_V2_4) == 0x0002A8, "Member 'UCustomizationCategories_V2_C::CustomizationCategoryWidget_V2_4' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CustomizationCategoryWidget_V2_5) == 0x0002B0, "Member 'UCustomizationCategories_V2_C::CustomizationCategoryWidget_V2_5' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CustomizationCategoryWidget_V2_6) == 0x0002B8, "Member 'UCustomizationCategories_V2_C::CustomizationCategoryWidget_V2_6' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CustomizationCategoryWidget_V2_7) == 0x0002C0, "Member 'UCustomizationCategories_V2_C::CustomizationCategoryWidget_V2_7' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CustomizationCategoryWidget_V2_8) == 0x0002C8, "Member 'UCustomizationCategories_V2_C::CustomizationCategoryWidget_V2_8' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CustomizationCategoryWidget_V2_9) == 0x0002D0, "Member 'UCustomizationCategories_V2_C::CustomizationCategoryWidget_V2_9' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CustomizationCategoryWidget_V2_10) == 0x0002D8, "Member 'UCustomizationCategories_V2_C::CustomizationCategoryWidget_V2_10' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CustomizationCategoryWidget_V2_11) == 0x0002E0, "Member 'UCustomizationCategories_V2_C::CustomizationCategoryWidget_V2_11' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CustomizationCategoryWidget_V2_12) == 0x0002E8, "Member 'UCustomizationCategories_V2_C::CustomizationCategoryWidget_V2_12' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CycleLeftButton) == 0x0002F0, "Member 'UCustomizationCategories_V2_C::CycleLeftButton' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CycleLeftPrompt) == 0x0002F8, "Member 'UCustomizationCategories_V2_C::CycleLeftPrompt' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CycleRightButton) == 0x000300, "Member 'UCustomizationCategories_V2_C::CycleRightButton' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CycleRightPrompt) == 0x000308, "Member 'UCustomizationCategories_V2_C::CycleRightPrompt' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, Image_310) == 0x000310, "Member 'UCustomizationCategories_V2_C::Image_310' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, Image_399) == 0x000318, "Member 'UCustomizationCategories_V2_C::Image_399' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, MenuCharacter) == 0x000320, "Member 'UCustomizationCategories_V2_C::MenuCharacter' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, SelectedCategoryWidget) == 0x000328, "Member 'UCustomizationCategories_V2_C::SelectedCategoryWidget' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CharacterTutoCategories) == 0x000330, "Member 'UCustomizationCategories_V2_C::CharacterTutoCategories' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CharacterCategories) == 0x000340, "Member 'UCustomizationCategories_V2_C::CharacterCategories' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, IsTutorial) == 0x000350, "Member 'UCustomizationCategories_V2_C::IsTutorial' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, FirstValidCategoryIndex) == 0x000354, "Member 'UCustomizationCategories_V2_C::FirstValidCategoryIndex' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, Shop_Type) == 0x000358, "Member 'UCustomizationCategories_V2_C::Shop_Type' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, ItemsPerColumn) == 0x00035C, "Member 'UCustomizationCategories_V2_C::ItemsPerColumn' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, EventOnCategoryClicked) == 0x000360, "Member 'UCustomizationCategories_V2_C::EventOnCategoryClicked' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, IsCustomizingFemale) == 0x000370, "Member 'UCustomizationCategories_V2_C::IsCustomizingFemale' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, bIsPlayerCellCustomization) == 0x000371, "Member 'UCustomizationCategories_V2_C::bIsPlayerCellCustomization' has a wrong offset!");
static_assert(offsetof(UCustomizationCategories_V2_C, CellCategories) == 0x000378, "Member 'UCustomizationCategories_V2_C::CellCategories' has a wrong offset!");

}

