#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizableCellObject

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CellCustomizableDecal_structs.hpp"
#include "CellCustomizableStaticMesh_structs.hpp"
#include "CellCustomizationObjectType_structs.hpp"


namespace SDK::Params
{

// Function CustomizableCellObject.CustomizableCellObject_C.SelectNonCollidingNextObject
// 0x0070 (0x0070 - 0x0000)
struct CustomizableCellObject_C_SelectNonCollidingNextObject final
{
public:
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3456[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         CallFunc_ComponentOverlapActors_OutActors;         // 0x0050(0x0010)(ReferenceParm)
	bool                                          CallFunc_ComponentOverlapActors_ReturnValue;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3457[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizableCellObject_C_SelectNonCollidingNextObject) == 0x000010, "Wrong alignment on CustomizableCellObject_C_SelectNonCollidingNextObject");
static_assert(sizeof(CustomizableCellObject_C_SelectNonCollidingNextObject) == 0x000070, "Wrong size on CustomizableCellObject_C_SelectNonCollidingNextObject");
static_assert(offsetof(CustomizableCellObject_C_SelectNonCollidingNextObject, Temp_object_Variable) == 0x000000, "Member 'CustomizableCellObject_C_SelectNonCollidingNextObject::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SelectNonCollidingNextObject, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'CustomizableCellObject_C_SelectNonCollidingNextObject::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SelectNonCollidingNextObject, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'CustomizableCellObject_C_SelectNonCollidingNextObject::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SelectNonCollidingNextObject, CallFunc_Percent_IntInt_ReturnValue) == 0x000018, "Member 'CustomizableCellObject_C_SelectNonCollidingNextObject::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SelectNonCollidingNextObject, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000020, "Member 'CustomizableCellObject_C_SelectNonCollidingNextObject::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SelectNonCollidingNextObject, CallFunc_ComponentOverlapActors_OutActors) == 0x000050, "Member 'CustomizableCellObject_C_SelectNonCollidingNextObject::CallFunc_ComponentOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SelectNonCollidingNextObject, CallFunc_ComponentOverlapActors_ReturnValue) == 0x000060, "Member 'CustomizableCellObject_C_SelectNonCollidingNextObject::CallFunc_ComponentOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SelectNonCollidingNextObject, CallFunc_Array_Length_ReturnValue_1) == 0x000064, "Member 'CustomizableCellObject_C_SelectNonCollidingNextObject::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SelectNonCollidingNextObject, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'CustomizableCellObject_C_SelectNonCollidingNextObject::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.ShouldSnapCurrentGizmo
// 0x0006 (0x0006 - 0x0000)
struct CustomizableCellObject_C_ShouldSnapCurrentGizmo final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizableCellObject_C_ShouldSnapCurrentGizmo) == 0x000001, "Wrong alignment on CustomizableCellObject_C_ShouldSnapCurrentGizmo");
static_assert(sizeof(CustomizableCellObject_C_ShouldSnapCurrentGizmo) == 0x000006, "Wrong size on CustomizableCellObject_C_ShouldSnapCurrentGizmo");
static_assert(offsetof(CustomizableCellObject_C_ShouldSnapCurrentGizmo, NewParam) == 0x000000, "Member 'CustomizableCellObject_C_ShouldSnapCurrentGizmo::NewParam' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ShouldSnapCurrentGizmo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'CustomizableCellObject_C_ShouldSnapCurrentGizmo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ShouldSnapCurrentGizmo, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000002, "Member 'CustomizableCellObject_C_ShouldSnapCurrentGizmo::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ShouldSnapCurrentGizmo, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000003, "Member 'CustomizableCellObject_C_ShouldSnapCurrentGizmo::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ShouldSnapCurrentGizmo, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'CustomizableCellObject_C_ShouldSnapCurrentGizmo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ShouldSnapCurrentGizmo, CallFunc_BooleanAND_ReturnValue_1) == 0x000005, "Member 'CustomizableCellObject_C_ShouldSnapCurrentGizmo::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.ActivateGizmoHelper
// 0x00B0 (0x00B0 - 0x0000)
struct CustomizableCellObject_C_ActivateGizmoHelper final
{
public:
	bool                                          CallFunc_ShouldSnapCurrentGizmo_NewParam;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3458[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3459[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCellCustomizableDecal                 CallFunc_Array_Get_Item;                           // 0x0010(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_345A[0xF];                                     // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCellCustomizableStaticMesh            CallFunc_Array_Get_Item_1;                         // 0x0060(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizableCellObject_C_ActivateGizmoHelper) == 0x000010, "Wrong alignment on CustomizableCellObject_C_ActivateGizmoHelper");
static_assert(sizeof(CustomizableCellObject_C_ActivateGizmoHelper) == 0x0000B0, "Wrong size on CustomizableCellObject_C_ActivateGizmoHelper");
static_assert(offsetof(CustomizableCellObject_C_ActivateGizmoHelper, CallFunc_ShouldSnapCurrentGizmo_NewParam) == 0x000000, "Member 'CustomizableCellObject_C_ActivateGizmoHelper::CallFunc_ShouldSnapCurrentGizmo_NewParam' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ActivateGizmoHelper, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'CustomizableCellObject_C_ActivateGizmoHelper::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ActivateGizmoHelper, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'CustomizableCellObject_C_ActivateGizmoHelper::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ActivateGizmoHelper, CallFunc_Array_Get_Item) == 0x000010, "Member 'CustomizableCellObject_C_ActivateGizmoHelper::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ActivateGizmoHelper, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000050, "Member 'CustomizableCellObject_C_ActivateGizmoHelper::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ActivateGizmoHelper, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'CustomizableCellObject_C_ActivateGizmoHelper::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ActivateGizmoHelper, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'CustomizableCellObject_C_ActivateGizmoHelper::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ActivateGizmoHelper, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000A4, "Member 'CustomizableCellObject_C_ActivateGizmoHelper::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ActivateGizmoHelper, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000A8, "Member 'CustomizableCellObject_C_ActivateGizmoHelper::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ActivateGizmoHelper, K2Node_SwitchEnum_CmpSuccess) == 0x0000A9, "Member 'CustomizableCellObject_C_ActivateGizmoHelper::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.VisualizeDecalComponents
// 0x0060 (0x0060 - 0x0000)
struct CustomizableCellObject_C_VisualizeDecalComponents final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCellCustomizableDecal                 CallFunc_Array_Get_Item;                           // 0x0010(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_345B[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_AddComponent_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizableCellObject_C_VisualizeDecalComponents) == 0x000010, "Wrong alignment on CustomizableCellObject_C_VisualizeDecalComponents");
static_assert(sizeof(CustomizableCellObject_C_VisualizeDecalComponents) == 0x000060, "Wrong size on CustomizableCellObject_C_VisualizeDecalComponents");
static_assert(offsetof(CustomizableCellObject_C_VisualizeDecalComponents, Temp_int_Array_Index_Variable) == 0x000000, "Member 'CustomizableCellObject_C_VisualizeDecalComponents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_VisualizeDecalComponents, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CustomizableCellObject_C_VisualizeDecalComponents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_VisualizeDecalComponents, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CustomizableCellObject_C_VisualizeDecalComponents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_VisualizeDecalComponents, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'CustomizableCellObject_C_VisualizeDecalComponents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_VisualizeDecalComponents, CallFunc_Array_Get_Item) == 0x000010, "Member 'CustomizableCellObject_C_VisualizeDecalComponents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_VisualizeDecalComponents, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'CustomizableCellObject_C_VisualizeDecalComponents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_VisualizeDecalComponents, CallFunc_AddComponent_ReturnValue) == 0x000058, "Member 'CustomizableCellObject_C_VisualizeDecalComponents::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.VisualizeAllStaticmeshes
// 0x0070 (0x0070 - 0x0000)
struct CustomizableCellObject_C_VisualizeAllStaticmeshes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCellCustomizableStaticMesh            CallFunc_Array_Get_Item;                           // 0x0010(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_345D[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizableCellObject_C_VisualizeAllStaticmeshes) == 0x000010, "Wrong alignment on CustomizableCellObject_C_VisualizeAllStaticmeshes");
static_assert(sizeof(CustomizableCellObject_C_VisualizeAllStaticmeshes) == 0x000070, "Wrong size on CustomizableCellObject_C_VisualizeAllStaticmeshes");
static_assert(offsetof(CustomizableCellObject_C_VisualizeAllStaticmeshes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'CustomizableCellObject_C_VisualizeAllStaticmeshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_VisualizeAllStaticmeshes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CustomizableCellObject_C_VisualizeAllStaticmeshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_VisualizeAllStaticmeshes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CustomizableCellObject_C_VisualizeAllStaticmeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_VisualizeAllStaticmeshes, CallFunc_Array_Get_Item) == 0x000010, "Member 'CustomizableCellObject_C_VisualizeAllStaticmeshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_VisualizeAllStaticmeshes, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'CustomizableCellObject_C_VisualizeAllStaticmeshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_VisualizeAllStaticmeshes, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'CustomizableCellObject_C_VisualizeAllStaticmeshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_VisualizeAllStaticmeshes, CallFunc_AddComponent_ReturnValue) == 0x000058, "Member 'CustomizableCellObject_C_VisualizeAllStaticmeshes::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_VisualizeAllStaticmeshes, CallFunc_SetStaticMesh_ReturnValue) == 0x000060, "Member 'CustomizableCellObject_C_VisualizeAllStaticmeshes::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.SetStructProperties
// 0x0240 (0x0240 - 0x0000)
struct CustomizableCellObject_C_SetStructProperties final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345E[0xC];                                     // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCellCustomizableDecal                 CallFunc_Array_Get_Item;                           // 0x0020(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_345F[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3460[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCellCustomizableDecal                 K2Node_MakeStruct_CellCustomizableDecal;           // 0x0070(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldSnapCurrentGizmo_NewParam;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3461[0xE];                                     // 0x00B2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FCellCustomizableDecal                 K2Node_MakeStruct_CellCustomizableDecal_1;         // 0x00F0(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldSnapCurrentGizmo_NewParam_1;        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3462[0xC];                                     // 0x0134(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Array_Get_Item_2;                         // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	struct FCellCustomizableStaticMesh            CallFunc_Array_Get_Item_3;                         // 0x0170(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3463[0xB];                                     // 0x01B5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCellCustomizableStaticMesh            K2Node_MakeStruct_CellCustomizableStaticMesh;      // 0x01C0(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCellCustomizableStaticMesh            K2Node_MakeStruct_CellCustomizableStaticMesh_1;    // 0x0200(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizableCellObject_C_SetStructProperties) == 0x000010, "Wrong alignment on CustomizableCellObject_C_SetStructProperties");
static_assert(sizeof(CustomizableCellObject_C_SetStructProperties) == 0x000240, "Wrong size on CustomizableCellObject_C_SetStructProperties");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'CustomizableCellObject_C_SetStructProperties::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, Temp_int_Array_Index_Variable) == 0x000008, "Member 'CustomizableCellObject_C_SetStructProperties::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'CustomizableCellObject_C_SetStructProperties::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'CustomizableCellObject_C_SetStructProperties::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_Array_Get_Item) == 0x000020, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, K2Node_MakeStruct_CellCustomizableDecal) == 0x000070, "Member 'CustomizableCellObject_C_SetStructProperties::K2Node_MakeStruct_CellCustomizableDecal' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B0, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_ShouldSnapCurrentGizmo_NewParam) == 0x0000B1, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_ShouldSnapCurrentGizmo_NewParam' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_Array_Get_Item_1) == 0x0000C0, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, K2Node_MakeStruct_CellCustomizableDecal_1) == 0x0000F0, "Member 'CustomizableCellObject_C_SetStructProperties::K2Node_MakeStruct_CellCustomizableDecal_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_ShouldSnapCurrentGizmo_NewParam_1) == 0x000130, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_ShouldSnapCurrentGizmo_NewParam_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000131, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000132, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, K2Node_SwitchEnum_CmpSuccess) == 0x000133, "Member 'CustomizableCellObject_C_SetStructProperties::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_Array_Get_Item_2) == 0x000140, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_Array_Get_Item_3) == 0x000170, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_Array_Length_ReturnValue_1) == 0x0001B0, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001B4, "Member 'CustomizableCellObject_C_SetStructProperties::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, K2Node_MakeStruct_CellCustomizableStaticMesh) == 0x0001C0, "Member 'CustomizableCellObject_C_SetStructProperties::K2Node_MakeStruct_CellCustomizableStaticMesh' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetStructProperties, K2Node_MakeStruct_CellCustomizableStaticMesh_1) == 0x000200, "Member 'CustomizableCellObject_C_SetStructProperties::K2Node_MakeStruct_CellCustomizableStaticMesh_1' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.AddGizmos
// 0x00F0 (0x00F0 - 0x0000)
struct CustomizableCellObject_C_AddGizmos final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3464[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3465[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3466[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3467[0xC];                                     // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCellCustomizableDecal                 CallFunc_Array_Get_Item;                           // 0x0040(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3468[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3469[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_346A[0xC];                                     // 0x0094(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCellCustomizableStaticMesh            CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_346B[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizableCellObject_C_AddGizmos) == 0x000010, "Wrong alignment on CustomizableCellObject_C_AddGizmos");
static_assert(sizeof(CustomizableCellObject_C_AddGizmos) == 0x0000F0, "Wrong size on CustomizableCellObject_C_AddGizmos");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, Temp_int_Variable) == 0x000000, "Member 'CustomizableCellObject_C_AddGizmos::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Array_Length_ReturnValue_1) == 0x000010, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Array_Length_ReturnValue_2) == 0x000014, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Array_Length_ReturnValue_3) == 0x00001C, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Array_Length_ReturnValue_4) == 0x000020, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000024, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000025, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Array_Length_ReturnValue_5) == 0x000028, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Subtract_IntInt_ReturnValue) == 0x00002C, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, Temp_int_Variable_1) == 0x000030, "Member 'CustomizableCellObject_C_AddGizmos::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Array_Get_Item) == 0x000040, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, K2Node_SwitchEnum_CmpSuccess) == 0x000080, "Member 'CustomizableCellObject_C_AddGizmos::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Array_Add_ReturnValue) == 0x000084, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000088, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Add_IntInt_ReturnValue_1) == 0x00008C, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Array_Length_ReturnValue_6) == 0x000090, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000E0, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000E4, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_AddGizmos, CallFunc_Array_Add_ReturnValue_1) == 0x0000E8, "Member 'CustomizableCellObject_C_AddGizmos::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.SetNewStaticMesh
// 0x00D0 (0x00D0 - 0x0000)
struct CustomizableCellObject_C_SetNewStaticMesh final
{
public:
	struct FCellCustomizableStaticMesh            CallFunc_Array_Get_Item;                           // 0x0000(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_346C[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0044(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CustomizableCellObject_C_SetNewStaticMesh) == 0x000010, "Wrong alignment on CustomizableCellObject_C_SetNewStaticMesh");
static_assert(sizeof(CustomizableCellObject_C_SetNewStaticMesh) == 0x0000D0, "Wrong size on CustomizableCellObject_C_SetNewStaticMesh");
static_assert(offsetof(CustomizableCellObject_C_SetNewStaticMesh, CallFunc_Array_Get_Item) == 0x000000, "Member 'CustomizableCellObject_C_SetNewStaticMesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetNewStaticMesh, CallFunc_SetStaticMesh_ReturnValue) == 0x000040, "Member 'CustomizableCellObject_C_SetNewStaticMesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetNewStaticMesh, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000044, "Member 'CustomizableCellObject_C_SetNewStaticMesh::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.SetPreviousItemIndex
// 0x0010 (0x0010 - 0x0000)
struct CustomizableCellObject_C_SetPreviousItemIndex final
{
public:
	int32                                         ArrayLength;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizableCellObject_C_SetPreviousItemIndex) == 0x000004, "Wrong alignment on CustomizableCellObject_C_SetPreviousItemIndex");
static_assert(sizeof(CustomizableCellObject_C_SetPreviousItemIndex) == 0x000010, "Wrong size on CustomizableCellObject_C_SetPreviousItemIndex");
static_assert(offsetof(CustomizableCellObject_C_SetPreviousItemIndex, ArrayLength) == 0x000000, "Member 'CustomizableCellObject_C_SetPreviousItemIndex::ArrayLength' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetPreviousItemIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'CustomizableCellObject_C_SetPreviousItemIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetPreviousItemIndex, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000008, "Member 'CustomizableCellObject_C_SetPreviousItemIndex::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetPreviousItemIndex, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'CustomizableCellObject_C_SetPreviousItemIndex::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.SetNextItemIndex
// 0x0010 (0x0010 - 0x0000)
struct CustomizableCellObject_C_SetNextItemIndex final
{
public:
	int32                                         ArrayLength;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_346D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizableCellObject_C_SetNextItemIndex) == 0x000004, "Wrong alignment on CustomizableCellObject_C_SetNextItemIndex");
static_assert(sizeof(CustomizableCellObject_C_SetNextItemIndex) == 0x000010, "Wrong size on CustomizableCellObject_C_SetNextItemIndex");
static_assert(offsetof(CustomizableCellObject_C_SetNextItemIndex, ArrayLength) == 0x000000, "Member 'CustomizableCellObject_C_SetNextItemIndex::ArrayLength' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetNextItemIndex, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'CustomizableCellObject_C_SetNextItemIndex::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetNextItemIndex, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'CustomizableCellObject_C_SetNextItemIndex::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetNextItemIndex, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CustomizableCellObject_C_SetNextItemIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.SetNewDecal
// 0x0110 (0x0110 - 0x0000)
struct CustomizableCellObject_C_SetNewDecal final
{
public:
	struct FTransform                             CallFunc_Array_Get_Item;                           // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0030(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_346E[0x8];                                     // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCellCustomizableDecal                 CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizableCellObject_C_SetNewDecal) == 0x000010, "Wrong alignment on CustomizableCellObject_C_SetNewDecal");
static_assert(sizeof(CustomizableCellObject_C_SetNewDecal) == 0x000110, "Wrong size on CustomizableCellObject_C_SetNewDecal");
static_assert(offsetof(CustomizableCellObject_C_SetNewDecal, CallFunc_Array_Get_Item) == 0x000000, "Member 'CustomizableCellObject_C_SetNewDecal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetNewDecal, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000030, "Member 'CustomizableCellObject_C_SetNewDecal::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetNewDecal, CallFunc_Array_Get_Item_1) == 0x0000C0, "Member 'CustomizableCellObject_C_SetNewDecal::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_SetNewDecal, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'CustomizableCellObject_C_SetNewDecal::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.UserConstructionScript
// 0x00A0 (0x00A0 - 0x0000)
struct CustomizableCellObject_C_UserConstructionScript final
{
public:
	struct FCellCustomizableStaticMesh            K2Node_MakeStruct_CellCustomizableStaticMesh;      // 0x0000(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_346F[0x8];                                     // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCellCustomizableStaticMesh            CallFunc_Array_Get_Item;                           // 0x0050(0x0040)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizableCellObject_C_UserConstructionScript) == 0x000010, "Wrong alignment on CustomizableCellObject_C_UserConstructionScript");
static_assert(sizeof(CustomizableCellObject_C_UserConstructionScript) == 0x0000A0, "Wrong size on CustomizableCellObject_C_UserConstructionScript");
static_assert(offsetof(CustomizableCellObject_C_UserConstructionScript, K2Node_MakeStruct_CellCustomizableStaticMesh) == 0x000000, "Member 'CustomizableCellObject_C_UserConstructionScript::K2Node_MakeStruct_CellCustomizableStaticMesh' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'CustomizableCellObject_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'CustomizableCellObject_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000050, "Member 'CustomizableCellObject_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'CustomizableCellObject_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x000091, "Member 'CustomizableCellObject_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.Event_OnInteract
// 0x0008 (0x0008 - 0x0000)
struct CustomizableCellObject_C_Event_OnInteract final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizableCellObject_C_Event_OnInteract) == 0x000008, "Wrong alignment on CustomizableCellObject_C_Event_OnInteract");
static_assert(sizeof(CustomizableCellObject_C_Event_OnInteract) == 0x000008, "Wrong size on CustomizableCellObject_C_Event_OnInteract");
static_assert(offsetof(CustomizableCellObject_C_Event_OnInteract, Pawn) == 0x000000, "Member 'CustomizableCellObject_C_Event_OnInteract::Pawn' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.BindEventOnWidget
// 0x0008 (0x0008 - 0x0000)
struct CustomizableCellObject_C_BindEventOnWidget final
{
public:
	class ULobbyCustomSelectionButtonsUI_C*       Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizableCellObject_C_BindEventOnWidget) == 0x000008, "Wrong alignment on CustomizableCellObject_C_BindEventOnWidget");
static_assert(sizeof(CustomizableCellObject_C_BindEventOnWidget) == 0x000008, "Wrong size on CustomizableCellObject_C_BindEventOnWidget");
static_assert(offsetof(CustomizableCellObject_C_BindEventOnWidget, Widget) == 0x000000, "Member 'CustomizableCellObject_C_BindEventOnWidget::Widget' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.MulticastSetNewVisual
// 0x0008 (0x0008 - 0x0000)
struct CustomizableCellObject_C_MulticastSetNewVisual final
{
public:
	ECellCustomizationObjectType                  Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3470[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizableCellObject_C_MulticastSetNewVisual) == 0x000004, "Wrong alignment on CustomizableCellObject_C_MulticastSetNewVisual");
static_assert(sizeof(CustomizableCellObject_C_MulticastSetNewVisual) == 0x000008, "Wrong size on CustomizableCellObject_C_MulticastSetNewVisual");
static_assert(offsetof(CustomizableCellObject_C_MulticastSetNewVisual, Selection) == 0x000000, "Member 'CustomizableCellObject_C_MulticastSetNewVisual::Selection' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_MulticastSetNewVisual, Param_Index) == 0x000004, "Member 'CustomizableCellObject_C_MulticastSetNewVisual::Param_Index' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.ServerSetNewVisual
// 0x0008 (0x0008 - 0x0000)
struct CustomizableCellObject_C_ServerSetNewVisual final
{
public:
	ECellCustomizationObjectType                  Param_ObjectType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3471[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizableCellObject_C_ServerSetNewVisual) == 0x000004, "Wrong alignment on CustomizableCellObject_C_ServerSetNewVisual");
static_assert(sizeof(CustomizableCellObject_C_ServerSetNewVisual) == 0x000008, "Wrong size on CustomizableCellObject_C_ServerSetNewVisual");
static_assert(offsetof(CustomizableCellObject_C_ServerSetNewVisual, Param_ObjectType) == 0x000000, "Member 'CustomizableCellObject_C_ServerSetNewVisual::Param_ObjectType' has a wrong offset!");
static_assert(offsetof(CustomizableCellObject_C_ServerSetNewVisual, Param_Index) == 0x000004, "Member 'CustomizableCellObject_C_ServerSetNewVisual::Param_Index' has a wrong offset!");

// Function CustomizableCellObject.CustomizableCellObject_C.ExecuteUbergraph_CustomizableCellObject
// 0x02A0 (0x02A0 - 0x0000)
struct CustomizableCellObject_C_ExecuteUbergraph_CustomizableCellObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3472[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLobbyPlayerController*               CallFunc_GetLocalLobbyPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULobbyCustomSelectionButtonsUI_C*       CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLobbyPlayerController_BP_C*          K2Node_DynamicCast_AsRB_Lobby_Player_Controller_BP; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
