#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationContentWidget_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CustomizationContentWidget_V2.CustomizationContentWidget_V2_C
// 0x0158 (0x05A8 - 0x0450)
class UCustomizationContentWidget_V2_C final : public URBCharacterCustomizationContent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutContent;                                    // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Content;                                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategories_V2_C*          CustomizationCategories;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationItemGrid_C*               CustomizationItemGrid;                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingVideoWidget_C*                  LoadingVideoWidget;                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCategoryTitle_C*                       PageTitle;                                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AMenuCharacter_C*                       MenuCharacter;                                     // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreviousXMousePos;                                 // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShowingItems;                                    // 0x049C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37E0[0x3];                                     // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 NPCActor;                                          // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    ActionButtons;                                     // 0x04A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	ECustomizationMenuCategory                    WantedCategory;                                    // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCellCustomization;                              // 0x04B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37E1[0x6];                                     // 0x04BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACellCustomizationCameraActor_C*        CellCustomizationActor;                            // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnItemPreviewed;                                   // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnItemHoveredEvent;                                // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnStoppedPreview;                                  // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             UpdatePaletteDisplay;                              // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCategoryChangeRequested;                         // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FUICustomizationItem                   InteractedItem;                                    // 0x0518(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	FMulticastInlineDelegateProperty_             OnItemEquippedEvent;                               // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         PreviousYMousePos;                                 // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37E2[0x4];                                     // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnItemsAdded;                                      // 0x0560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bLeftInitialCategory;                              // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37E3[0x7];                                     // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUICustomizationItem                   PreviewedItem;                                     // 0x0578(0x0030)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor)

public:
	void Event_ItemBought(const struct FUICustomizationItem& Item);
	void SetMenuCharacterCusto(const struct FRBPlayerCustomizationInfo& Custo);
	void NotifyMenuCharacterCategoryClicked(ECustomizationMenuCategory Category);
	void RefreshBoughtItem();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void TransmitFocusToCustoOption();
	void CycleCategories(bool CycleRight);
	void GetCellCustomizationActor(class ACellCustomizationCameraActor_C** NewParam);
	void PreviewCellItem(ECustomizationMenuCategory Category, class URBPlayerCellItemDefinition* ItemDefinition);
	void UpdateCategories();
	void CycleFocus();
	void Event_ItemEquipped(const struct FUICustomizationItem& Item);
	void PlayPreviewVoiceline(class URBVoiceCustomizationOption* VoiceOption);
	void AddCategoriesItems();
	void AddCustomizationItems(TArray<struct FUICustomizationItem>& Items);
	void ChangeCategory(ECustomizationMenuCategory CustoCategory);
	void GetPageSpecificButtons(TArray<class UUserWidget*>* OutButtons);
	void OnCategoryClicked(ECustomizationMenuCategory CustoCategory);
	void OnItemUnhovered(const struct FUICustomizationItem& CustoItem);
	void OnItemHovered(const struct FUICustomizationItem& CustoItem);
	void Finished_21144A754E101553B7E45DA67E7780FE();
	void RotateViewer();
	void Initialize(EMetaNPCType ShopType, bool IsTutorial, class AMenuCharacter_C* _MenuCharacter, class AActor* ViewerReturnTarget, class ACellCustomizationCameraActor_C* Param_CellCustomizationActor);
	void RotateButtonPressed();
	void RotateButtonReleased();
	void Event_OnTabUnselected();
	void Event_LoadingStarted();
	void Event_OnTabSelected();
	void Event_AddCustomizationItems(const TArray<struct FUICustomizationItem>& Items);
	void Event_OnItemClicked(const struct FUICustomizationItem& Item);
	void Destruct();
	void Construct();
	void EventOnItemPressed_Event_0(const struct FUICustomizationItem& Item);
	void EventOnItemReleased_Event_0(const struct FUICustomizationItem& Item);
	void StartTransition();
	void Event_PlayerCustomizationUpdated();
	void Event_OnParentFocused();
	void OnChangeFocusRequested();
	void Event_RefreshItemInfos(const TArray<struct FUICustomizationItem>& Items);
	void Event_CycleFocus(class URBMenuButton_C* Button);
	void CycleCategoriesRight();
	void CycleCategoriesLeft();
	void Event_OnParentPopped();
	void OnInputSourceChanged();
	void UpdatePageSpecificButtons();
	void ResetPreview();
	void ExecuteUbergraph_CustomizationContentWidget_V2(int32 EntryPoint);
	void OnItemHoveredEvent__DelegateSignature(const struct FUICustomizationItem& CustoItem);
	void OnItemsAdded__DelegateSignature(int32 Amount);
	void OnItemEquippedEvent__DelegateSignature(const struct FUICustomizationItem& Item);
	void OnCategoryChangeRequested__DelegateSignature();
	void UpdatePaletteDisplay__DelegateSignature(bool ShouldShowPalette);
	void OnStoppedPreview__DelegateSignature();
	void OnItemPreviewed__DelegateSignature(const struct FUICustomizationItem& Custo_Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomizationContentWidget_V2_C">();
	}
	static class UCustomizationContentWidget_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizationContentWidget_V2_C>();
	}
};
static_assert(alignof(UCustomizationContentWidget_V2_C) == 0x000008, "Wrong alignment on UCustomizationContentWidget_V2_C");
static_assert(sizeof(UCustomizationContentWidget_V2_C) == 0x0005A8, "Wrong size on UCustomizationContentWidget_V2_C");
static_assert(offsetof(UCustomizationContentWidget_V2_C, UberGraphFrame) == 0x000450, "Member 'UCustomizationContentWidget_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, FadeOutContent) == 0x000458, "Member 'UCustomizationContentWidget_V2_C::FadeOutContent' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, BackgroundImage) == 0x000460, "Member 'UCustomizationContentWidget_V2_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, Content) == 0x000468, "Member 'UCustomizationContentWidget_V2_C::Content' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, CustomizationCategories) == 0x000470, "Member 'UCustomizationContentWidget_V2_C::CustomizationCategories' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, CustomizationItemGrid) == 0x000478, "Member 'UCustomizationContentWidget_V2_C::CustomizationItemGrid' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, LoadingVideoWidget) == 0x000480, "Member 'UCustomizationContentWidget_V2_C::LoadingVideoWidget' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, PageTitle) == 0x000488, "Member 'UCustomizationContentWidget_V2_C::PageTitle' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, MenuCharacter) == 0x000490, "Member 'UCustomizationContentWidget_V2_C::MenuCharacter' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, PreviousXMousePos) == 0x000498, "Member 'UCustomizationContentWidget_V2_C::PreviousXMousePos' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, IsShowingItems) == 0x00049C, "Member 'UCustomizationContentWidget_V2_C::IsShowingItems' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, NPCActor) == 0x0004A0, "Member 'UCustomizationContentWidget_V2_C::NPCActor' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, ActionButtons) == 0x0004A8, "Member 'UCustomizationContentWidget_V2_C::ActionButtons' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, WantedCategory) == 0x0004B8, "Member 'UCustomizationContentWidget_V2_C::WantedCategory' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, bIsCellCustomization) == 0x0004B9, "Member 'UCustomizationContentWidget_V2_C::bIsCellCustomization' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, CellCustomizationActor) == 0x0004C0, "Member 'UCustomizationContentWidget_V2_C::CellCustomizationActor' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, OnItemPreviewed) == 0x0004C8, "Member 'UCustomizationContentWidget_V2_C::OnItemPreviewed' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, OnItemHoveredEvent) == 0x0004D8, "Member 'UCustomizationContentWidget_V2_C::OnItemHoveredEvent' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, OnStoppedPreview) == 0x0004E8, "Member 'UCustomizationContentWidget_V2_C::OnStoppedPreview' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, UpdatePaletteDisplay) == 0x0004F8, "Member 'UCustomizationContentWidget_V2_C::UpdatePaletteDisplay' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, OnCategoryChangeRequested) == 0x000508, "Member 'UCustomizationContentWidget_V2_C::OnCategoryChangeRequested' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, InteractedItem) == 0x000518, "Member 'UCustomizationContentWidget_V2_C::InteractedItem' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, OnItemEquippedEvent) == 0x000548, "Member 'UCustomizationContentWidget_V2_C::OnItemEquippedEvent' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, PreviousYMousePos) == 0x000558, "Member 'UCustomizationContentWidget_V2_C::PreviousYMousePos' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, OnItemsAdded) == 0x000560, "Member 'UCustomizationContentWidget_V2_C::OnItemsAdded' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, bLeftInitialCategory) == 0x000570, "Member 'UCustomizationContentWidget_V2_C::bLeftInitialCategory' has a wrong offset!");
static_assert(offsetof(UCustomizationContentWidget_V2_C, PreviewedItem) == 0x000578, "Member 'UCustomizationContentWidget_V2_C::PreviewedItem' has a wrong offset!");

}

