#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DocumentButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DocumentButton.DocumentButton_C
// 0x0150 (0x03B0 - 0x0260)
class UDocumentButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                ContentBorder;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DevText;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DocumentButton;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MainImage;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewImage;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UnknownTextWidget;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsGamepad;                                        // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHovered;                                          // 0x0299(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFocused;                                          // 0x029A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37A7[0x5];                                     // 0x029B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSelected;                                        // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FRBCollectibleDocumentDefinitionRow    Document;                                          // 0x02B0(0x00E8)(Edit, BlueprintVisible)
	bool                                          bAcquired;                                         // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37A8[0x7];                                     // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSeen;                                            // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void IsElementEmpty(bool* bIsEmpty);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void HideTooltip();
	void TryShowTooltip();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetSeen();
	void IsConsideredHovered(bool* bConsideredHovered);
	void SetFocused(bool bInFocused);
	void SetHovered(bool bInHovered);
	void Refresh();
	void UpdateFocus();
	void OnLoaded_400D3A6F46134D64437AC5B163287479(class UObject* Loaded);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__DocumentGroupButton_DocumentButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__DocumentGroupButton_DocumentButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__DocumentGroupButton_DocumentButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Setup(const struct FRBCollectibleDocumentDefinitionRow& Param_Document);
	void Construct();
	void Destruct();
	void OnMenuInputSourceChanged();
	void ExecuteUbergraph_DocumentButton(int32 EntryPoint);
	void OnSeen__DelegateSignature();
	void OnSelected__DelegateSignature(const struct FRBCollectibleDocumentDefinitionRow& Param_Document);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DocumentButton_C">();
	}
	static class UDocumentButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDocumentButton_C>();
	}
};
static_assert(alignof(UDocumentButton_C) == 0x000008, "Wrong alignment on UDocumentButton_C");
static_assert(sizeof(UDocumentButton_C) == 0x0003B0, "Wrong size on UDocumentButton_C");
static_assert(offsetof(UDocumentButton_C, UberGraphFrame) == 0x000260, "Member 'UDocumentButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDocumentButton_C, ContentBorder) == 0x000268, "Member 'UDocumentButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UDocumentButton_C, DevText) == 0x000270, "Member 'UDocumentButton_C::DevText' has a wrong offset!");
static_assert(offsetof(UDocumentButton_C, DocumentButton) == 0x000278, "Member 'UDocumentButton_C::DocumentButton' has a wrong offset!");
static_assert(offsetof(UDocumentButton_C, MainImage) == 0x000280, "Member 'UDocumentButton_C::MainImage' has a wrong offset!");
static_assert(offsetof(UDocumentButton_C, NewImage) == 0x000288, "Member 'UDocumentButton_C::NewImage' has a wrong offset!");
static_assert(offsetof(UDocumentButton_C, UnknownTextWidget) == 0x000290, "Member 'UDocumentButton_C::UnknownTextWidget' has a wrong offset!");
static_assert(offsetof(UDocumentButton_C, bIsGamepad) == 0x000298, "Member 'UDocumentButton_C::bIsGamepad' has a wrong offset!");
static_assert(offsetof(UDocumentButton_C, bHovered) == 0x000299, "Member 'UDocumentButton_C::bHovered' has a wrong offset!");
static_assert(offsetof(UDocumentButton_C, bFocused) == 0x00029A, "Member 'UDocumentButton_C::bFocused' has a wrong offset!");
static_assert(offsetof(UDocumentButton_C, OnSelected) == 0x0002A0, "Member 'UDocumentButton_C::OnSelected' has a wrong offset!");
static_assert(offsetof(UDocumentButton_C, Document) == 0x0002B0, "Member 'UDocumentButton_C::Document' has a wrong offset!");
static_assert(offsetof(UDocumentButton_C, bAcquired) == 0x000398, "Member 'UDocumentButton_C::bAcquired' has a wrong offset!");
static_assert(offsetof(UDocumentButton_C, OnSeen) == 0x0003A0, "Member 'UDocumentButton_C::OnSeen' has a wrong offset!");

}

