#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DocumentGroupButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DocumentGroupButton.DocumentGroupButton_C
// 0x0070 (0x02D0 - 0x0260)
class UDocumentGroupButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                ContentBorder;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Counter;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DocumentButton;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Header1;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Header2;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MainImage;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewImage;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsGamepad;                                        // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHovered;                                          // 0x02A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFocused;                                          // 0x02A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B1[0x5];                                     // 0x02A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSelected;                                        // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   DocumentGroupId;                                   // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnHovered;                                         // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void IsElementEmpty(bool* bIsEmpty);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void IsConsideredHovered(bool* bConsideredHovered);
	void SetFocused(bool bInFocused);
	void SetHovered(bool bInHovered);
	void Setup(const struct FRBCollectibleDocumentGroupRow& DocumentGroupRow, int32 Param_Index);
	void UpdateFocus();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__DocumentGroupButton_DocumentButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__DocumentGroupButton_DocumentButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__DocumentGroupButton_DocumentButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void Destruct();
	void OnMenuInputSourceChanged();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void ExecuteUbergraph_DocumentGroupButton(int32 EntryPoint);
	void OnHovered__DelegateSignature(class UWidget* NewParam);
	void OnSelected__DelegateSignature(class FName Param_DocumentGroupId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DocumentGroupButton_C">();
	}
	static class UDocumentGroupButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDocumentGroupButton_C>();
	}
};
static_assert(alignof(UDocumentGroupButton_C) == 0x000008, "Wrong alignment on UDocumentGroupButton_C");
static_assert(sizeof(UDocumentGroupButton_C) == 0x0002D0, "Wrong size on UDocumentGroupButton_C");
static_assert(offsetof(UDocumentGroupButton_C, UberGraphFrame) == 0x000260, "Member 'UDocumentGroupButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDocumentGroupButton_C, ContentBorder) == 0x000268, "Member 'UDocumentGroupButton_C::ContentBorder' has a wrong offset!");
static_assert(offsetof(UDocumentGroupButton_C, Counter) == 0x000270, "Member 'UDocumentGroupButton_C::Counter' has a wrong offset!");
static_assert(offsetof(UDocumentGroupButton_C, DocumentButton) == 0x000278, "Member 'UDocumentGroupButton_C::DocumentButton' has a wrong offset!");
static_assert(offsetof(UDocumentGroupButton_C, Header1) == 0x000280, "Member 'UDocumentGroupButton_C::Header1' has a wrong offset!");
static_assert(offsetof(UDocumentGroupButton_C, Header2) == 0x000288, "Member 'UDocumentGroupButton_C::Header2' has a wrong offset!");
static_assert(offsetof(UDocumentGroupButton_C, MainImage) == 0x000290, "Member 'UDocumentGroupButton_C::MainImage' has a wrong offset!");
static_assert(offsetof(UDocumentGroupButton_C, NewImage) == 0x000298, "Member 'UDocumentGroupButton_C::NewImage' has a wrong offset!");
static_assert(offsetof(UDocumentGroupButton_C, bIsGamepad) == 0x0002A0, "Member 'UDocumentGroupButton_C::bIsGamepad' has a wrong offset!");
static_assert(offsetof(UDocumentGroupButton_C, bHovered) == 0x0002A1, "Member 'UDocumentGroupButton_C::bHovered' has a wrong offset!");
static_assert(offsetof(UDocumentGroupButton_C, bFocused) == 0x0002A2, "Member 'UDocumentGroupButton_C::bFocused' has a wrong offset!");
static_assert(offsetof(UDocumentGroupButton_C, OnSelected) == 0x0002A8, "Member 'UDocumentGroupButton_C::OnSelected' has a wrong offset!");
static_assert(offsetof(UDocumentGroupButton_C, DocumentGroupId) == 0x0002B8, "Member 'UDocumentGroupButton_C::DocumentGroupId' has a wrong offset!");
static_assert(offsetof(UDocumentGroupButton_C, OnHovered) == 0x0002C0, "Member 'UDocumentGroupButton_C::OnHovered' has a wrong offset!");

}

