#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DoorMetalWindowMinus01_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function DoorMetalWindow-01_BP.DoorMetalWindow-01_BP_C.BP_OnDoorInteract
// 0x0008 (0x0008 - 0x0000)
struct DoorMetalWindowMinus01_BP_C_BP_OnDoorInteract final
{
public:
	class ARBPawn*                                Interactor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorMetalWindowMinus01_BP_C_BP_OnDoorInteract) == 0x000008, "Wrong alignment on DoorMetalWindowMinus01_BP_C_BP_OnDoorInteract");
static_assert(sizeof(DoorMetalWindowMinus01_BP_C_BP_OnDoorInteract) == 0x000008, "Wrong size on DoorMetalWindowMinus01_BP_C_BP_OnDoorInteract");
static_assert(offsetof(DoorMetalWindowMinus01_BP_C_BP_OnDoorInteract, Interactor) == 0x000000, "Member 'DoorMetalWindowMinus01_BP_C_BP_OnDoorInteract::Interactor' has a wrong offset!");

// Function DoorMetalWindow-01_BP.DoorMetalWindow-01_BP_C.ExecuteUbergraph_DoorMetalWindow-01_BP
// 0x0018 (0x0018 - 0x0000)
struct DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentValue_ScheduledFloat_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_Event_interactor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP) == 0x000008, "Wrong alignment on DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP");
static_assert(sizeof(DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP) == 0x000018, "Wrong size on DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP");
static_assert(offsetof(DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP, EntryPoint) == 0x000000, "Member 'DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP, CallFunc_GetCurrentValue_ScheduledFloat_ReturnValue) == 0x000004, "Member 'DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP::CallFunc_GetCurrentValue_ScheduledFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP, K2Node_Event_interactor) == 0x000008, "Member 'DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP::K2Node_Event_interactor' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'DoorMetalWindowMinus01_BP_C_ExecuteUbergraph_DoorMetalWindowMinus01_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function DoorMetalWindow-01_BP.DoorMetalWindow-01_BP_C.DoorInteracted__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct DoorMetalWindowMinus01_BP_C_DoorInteracted__DelegateSignature final
{
public:
	bool                                          Param_bOpen;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorMetalWindowMinus01_BP_C_DoorInteracted__DelegateSignature) == 0x000001, "Wrong alignment on DoorMetalWindowMinus01_BP_C_DoorInteracted__DelegateSignature");
static_assert(sizeof(DoorMetalWindowMinus01_BP_C_DoorInteracted__DelegateSignature) == 0x000001, "Wrong size on DoorMetalWindowMinus01_BP_C_DoorInteracted__DelegateSignature");
static_assert(offsetof(DoorMetalWindowMinus01_BP_C_DoorInteracted__DelegateSignature, Param_bOpen) == 0x000000, "Member 'DoorMetalWindowMinus01_BP_C_DoorInteracted__DelegateSignature::Param_bOpen' has a wrong offset!");

}

