#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DoorMetalWindowMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DoorBase_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DoorMetalWindow-01_BP.DoorMetalWindow-01_BP_C
// 0x0020 (0x1030 - 0x1010)
class ADoorMetalWindowMinus01_BP_C final : public ADoorBase_BP_C
{
public:
	uint8                                         Pad_342C[0x3];                                     // 0x1005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_DoorMetalWindowMinus01_BP_C;        // 0x1008(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Window;                                         // 0x1010(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasOpen;                                          // 0x1018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342D[0x7];                                     // 0x1019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             DoorInteracted;                                    // 0x1020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnDoorInteract(class ARBPawn* Interactor);
	void ExecuteUbergraph_DoorMetalWindowMinus01_BP(int32 EntryPoint);
	void DoorInteracted__DelegateSignature(bool Param_bOpen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DoorMetalWindow-01_BP_C">();
	}
	static class ADoorMetalWindowMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADoorMetalWindowMinus01_BP_C>();
	}
};
static_assert(alignof(ADoorMetalWindowMinus01_BP_C) == 0x000010, "Wrong alignment on ADoorMetalWindowMinus01_BP_C");
static_assert(sizeof(ADoorMetalWindowMinus01_BP_C) == 0x001030, "Wrong size on ADoorMetalWindowMinus01_BP_C");
static_assert(offsetof(ADoorMetalWindowMinus01_BP_C, UberGraphFrame_DoorMetalWindowMinus01_BP_C) == 0x001008, "Member 'ADoorMetalWindowMinus01_BP_C::UberGraphFrame_DoorMetalWindowMinus01_BP_C' has a wrong offset!");
static_assert(offsetof(ADoorMetalWindowMinus01_BP_C, SM_Window) == 0x001010, "Member 'ADoorMetalWindowMinus01_BP_C::SM_Window' has a wrong offset!");
static_assert(offsetof(ADoorMetalWindowMinus01_BP_C, bWasOpen) == 0x001018, "Member 'ADoorMetalWindowMinus01_BP_C::bWasOpen' has a wrong offset!");
static_assert(offsetof(ADoorMetalWindowMinus01_BP_C, DoorInteracted) == 0x001020, "Member 'ADoorMetalWindowMinus01_BP_C::DoorInteracted' has a wrong offset!");

}

