#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EastermanRadio_Interact_BP

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function EastermanRadio_Interact_BP.EastermanRadio_Interact_BP_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct EastermanRadio_Interact_BP_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EastermanRadio_Interact_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on EastermanRadio_Interact_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(EastermanRadio_Interact_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on EastermanRadio_Interact_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(EastermanRadio_Interact_BP_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'EastermanRadio_Interact_BP_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

// Function EastermanRadio_Interact_BP.EastermanRadio_Interact_BP_C.UserConstructionScript
// 0x0080 (0x0080 - 0x0000)
struct EastermanRadio_Interact_BP_C_UserConstructionScript final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0018)()
};
static_assert(alignof(EastermanRadio_Interact_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on EastermanRadio_Interact_BP_C_UserConstructionScript");
static_assert(sizeof(EastermanRadio_Interact_BP_C_UserConstructionScript) == 0x000080, "Wrong size on EastermanRadio_Interact_BP_C_UserConstructionScript");
static_assert(offsetof(EastermanRadio_Interact_BP_C_UserConstructionScript, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'EastermanRadio_Interact_BP_C_UserConstructionScript::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EastermanRadio_Interact_BP_C_UserConstructionScript, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'EastermanRadio_Interact_BP_C_UserConstructionScript::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(EastermanRadio_Interact_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000058, "Member 'EastermanRadio_Interact_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EastermanRadio_Interact_BP_C_UserConstructionScript, CallFunc_Format_ReturnValue) == 0x000068, "Member 'EastermanRadio_Interact_BP_C_UserConstructionScript::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function EastermanRadio_Interact_BP.EastermanRadio_Interact_BP_C.VOEnded
// 0x0004 (0x0004 - 0x0000)
struct EastermanRadio_Interact_BP_C_VOEnded final
{
public:
	int32                                         PlayingId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EastermanRadio_Interact_BP_C_VOEnded) == 0x000004, "Wrong alignment on EastermanRadio_Interact_BP_C_VOEnded");
static_assert(sizeof(EastermanRadio_Interact_BP_C_VOEnded) == 0x000004, "Wrong size on EastermanRadio_Interact_BP_C_VOEnded");
static_assert(offsetof(EastermanRadio_Interact_BP_C_VOEnded, PlayingId) == 0x000000, "Member 'EastermanRadio_Interact_BP_C_VOEnded::PlayingId' has a wrong offset!");

// Function EastermanRadio_Interact_BP.EastermanRadio_Interact_BP_C.ExecuteUbergraph_EastermanRadio_Interact_BP
// 0x0030 (0x0030 - 0x0000)
struct EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 PlayingId)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_33AD[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayStoryLine_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33AE[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_playingId;                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP) == 0x000008, "Wrong alignment on EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP");
static_assert(sizeof(EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP) == 0x000030, "Wrong size on EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP");
static_assert(offsetof(EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP, EntryPoint) == 0x000000, "Member 'EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP, CallFunc_GetLocalPawn_ReturnValue) == 0x000018, "Member 'EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP::CallFunc_GetLocalPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP, CallFunc_PlayStoryLine_ReturnValue) == 0x000020, "Member 'EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP::CallFunc_PlayStoryLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000024, "Member 'EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP, K2Node_CustomEvent_playingId) == 0x000028, "Member 'EastermanRadio_Interact_BP_C_ExecuteUbergraph_EastermanRadio_Interact_BP::K2Node_CustomEvent_playingId' has a wrong offset!");

// Function EastermanRadio_Interact_BP.EastermanRadio_Interact_BP_C.GetInteractionPawnLocation
// 0x0028 (0x0028 - 0x0000)
struct EastermanRadio_Interact_BP_C_GetInteractionPawnLocation final
{
public:
	const class ARBPawn*                          Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  SpecialMove;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33AF[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutLocation;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutDirection;                                      // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EastermanRadio_Interact_BP_C_GetInteractionPawnLocation) == 0x000008, "Wrong alignment on EastermanRadio_Interact_BP_C_GetInteractionPawnLocation");
static_assert(sizeof(EastermanRadio_Interact_BP_C_GetInteractionPawnLocation) == 0x000028, "Wrong size on EastermanRadio_Interact_BP_C_GetInteractionPawnLocation");
static_assert(offsetof(EastermanRadio_Interact_BP_C_GetInteractionPawnLocation, Pawn) == 0x000000, "Member 'EastermanRadio_Interact_BP_C_GetInteractionPawnLocation::Pawn' has a wrong offset!");
static_assert(offsetof(EastermanRadio_Interact_BP_C_GetInteractionPawnLocation, SpecialMove) == 0x000008, "Member 'EastermanRadio_Interact_BP_C_GetInteractionPawnLocation::SpecialMove' has a wrong offset!");
static_assert(offsetof(EastermanRadio_Interact_BP_C_GetInteractionPawnLocation, OutLocation) == 0x00000C, "Member 'EastermanRadio_Interact_BP_C_GetInteractionPawnLocation::OutLocation' has a wrong offset!");
static_assert(offsetof(EastermanRadio_Interact_BP_C_GetInteractionPawnLocation, OutDirection) == 0x000018, "Member 'EastermanRadio_Interact_BP_C_GetInteractionPawnLocation::OutDirection' has a wrong offset!");
static_assert(offsetof(EastermanRadio_Interact_BP_C_GetInteractionPawnLocation, ReturnValue) == 0x000024, "Member 'EastermanRadio_Interact_BP_C_GetInteractionPawnLocation::ReturnValue' has a wrong offset!");

}

