#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Enemy_Face_Expression_State

#include "Basic.hpp"

#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function Enemy_Face_Expression_State.Enemy_Face_Expression_State_C.ExpressionOverride
// 0x0038 (0x0038 - 0x0000)
struct Enemy_Face_Expression_State_C_ExpressionOverride final
{
public:
	class USkeletalMeshComponent*                 Mesh_Comp;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENPCSpecificGesture                           Which_Anim;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExpressing;                                      // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D14[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNPC_BP_C*                            K2Node_DynamicCast_AsRB_NPC_BP;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D15[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnemyFace_AnimBlueprint_C*             CallFunc_GetFaceAnimBP_EnemyFaceAnimBP;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Enemy_Face_Expression_State_C_ExpressionOverride) == 0x000008, "Wrong alignment on Enemy_Face_Expression_State_C_ExpressionOverride");
static_assert(sizeof(Enemy_Face_Expression_State_C_ExpressionOverride) == 0x000038, "Wrong size on Enemy_Face_Expression_State_C_ExpressionOverride");
static_assert(offsetof(Enemy_Face_Expression_State_C_ExpressionOverride, Mesh_Comp) == 0x000000, "Member 'Enemy_Face_Expression_State_C_ExpressionOverride::Mesh_Comp' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_ExpressionOverride, Which_Anim) == 0x000008, "Member 'Enemy_Face_Expression_State_C_ExpressionOverride::Which_Anim' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_ExpressionOverride, IsExpressing) == 0x000009, "Member 'Enemy_Face_Expression_State_C_ExpressionOverride::IsExpressing' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_ExpressionOverride, ReturnValue) == 0x00000A, "Member 'Enemy_Face_Expression_State_C_ExpressionOverride::ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_ExpressionOverride, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'Enemy_Face_Expression_State_C_ExpressionOverride::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_ExpressionOverride, K2Node_DynamicCast_AsRB_NPC_BP) == 0x000018, "Member 'Enemy_Face_Expression_State_C_ExpressionOverride::K2Node_DynamicCast_AsRB_NPC_BP' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_ExpressionOverride, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Enemy_Face_Expression_State_C_ExpressionOverride::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_ExpressionOverride, CallFunc_GetFaceAnimBP_EnemyFaceAnimBP) == 0x000028, "Member 'Enemy_Face_Expression_State_C_ExpressionOverride::CallFunc_GetFaceAnimBP_EnemyFaceAnimBP' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_ExpressionOverride, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Enemy_Face_Expression_State_C_ExpressionOverride::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Enemy_Face_Expression_State.Enemy_Face_Expression_State_C.Received_NotifyEnd
// 0x0018 (0x0018 - 0x0000)
struct Enemy_Face_Expression_State_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimDeltaTime;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ExpressionOverride_ReturnValue;           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Enemy_Face_Expression_State_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on Enemy_Face_Expression_State_C_Received_NotifyEnd");
static_assert(sizeof(Enemy_Face_Expression_State_C_Received_NotifyEnd) == 0x000018, "Wrong size on Enemy_Face_Expression_State_C_Received_NotifyEnd");
static_assert(offsetof(Enemy_Face_Expression_State_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'Enemy_Face_Expression_State_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'Enemy_Face_Expression_State_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_Received_NotifyEnd, AnimDeltaTime) == 0x000010, "Member 'Enemy_Face_Expression_State_C_Received_NotifyEnd::AnimDeltaTime' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_Received_NotifyEnd, ReturnValue) == 0x000014, "Member 'Enemy_Face_Expression_State_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_Received_NotifyEnd, CallFunc_ExpressionOverride_ReturnValue) == 0x000015, "Member 'Enemy_Face_Expression_State_C_Received_NotifyEnd::CallFunc_ExpressionOverride_ReturnValue' has a wrong offset!");

// Function Enemy_Face_Expression_State.Enemy_Face_Expression_State_C.Received_NotifyBegin
// 0x0020 (0x0020 - 0x0000)
struct Enemy_Face_Expression_State_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimDeltaTime;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ExpressionOverride_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Enemy_Face_Expression_State_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on Enemy_Face_Expression_State_C_Received_NotifyBegin");
static_assert(sizeof(Enemy_Face_Expression_State_C_Received_NotifyBegin) == 0x000020, "Wrong size on Enemy_Face_Expression_State_C_Received_NotifyBegin");
static_assert(offsetof(Enemy_Face_Expression_State_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'Enemy_Face_Expression_State_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'Enemy_Face_Expression_State_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_Received_NotifyBegin, AnimDeltaTime) == 0x000010, "Member 'Enemy_Face_Expression_State_C_Received_NotifyBegin::AnimDeltaTime' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_Received_NotifyBegin, TotalDuration) == 0x000014, "Member 'Enemy_Face_Expression_State_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_Received_NotifyBegin, ReturnValue) == 0x000018, "Member 'Enemy_Face_Expression_State_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Expression_State_C_Received_NotifyBegin, CallFunc_ExpressionOverride_ReturnValue) == 0x000019, "Member 'Enemy_Face_Expression_State_C_Received_NotifyBegin::CallFunc_ExpressionOverride_ReturnValue' has a wrong offset!");

// Function Enemy_Face_Expression_State.Enemy_Face_Expression_State_C.GetNotifyName
// 0x0010 (0x0010 - 0x0000)
struct Enemy_Face_Expression_State_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Enemy_Face_Expression_State_C_GetNotifyName) == 0x000008, "Wrong alignment on Enemy_Face_Expression_State_C_GetNotifyName");
static_assert(sizeof(Enemy_Face_Expression_State_C_GetNotifyName) == 0x000010, "Wrong size on Enemy_Face_Expression_State_C_GetNotifyName");
static_assert(offsetof(Enemy_Face_Expression_State_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'Enemy_Face_Expression_State_C_GetNotifyName::ReturnValue' has a wrong offset!");

}

