#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnemyFace_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function enemyFace_AnimBlueprint.enemyFace_AnimBlueprint_C.ExecuteUbergraph_enemyFace_AnimBlueprint
// 0x0170 (0x0170 - 0x0000)
struct EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D4[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_1;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D5[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_2;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D6[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_3;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D7[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_4;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_4;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D8[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_5;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_5;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D9[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_6;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_6;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30DA[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_7;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_7;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30DB[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_8;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_8;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30DC[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_9;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_9;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30DD[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_10;                        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_10;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30DE[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30DF[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_DynamicCast_AsRB_Pawn;                      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E0[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPoseAsset*                             CallFunc_GetFacePoseAsset_ReturnValue;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E1[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_Map_Find_Value_11;                        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_11;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E2[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_12;                        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_12;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E3[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_13;                        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_13;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E4[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_14;                        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_14;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E5[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Map_Find_Value_15;                        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_15;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E6[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_1; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNPC*                                 K2Node_DynamicCast_AsRB_NPC;                       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E7[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_2; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint) == 0x000008, "Wrong alignment on EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint");
static_assert(sizeof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint) == 0x000170, "Wrong size on EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, EntryPoint) == 0x000000, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value) == 0x000008, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue) == 0x000010, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_1) == 0x000018, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_1) == 0x000020, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_2) == 0x000028, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_2) == 0x000030, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_3) == 0x000038, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_3) == 0x000040, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_4) == 0x000048, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_4' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_4) == 0x000050, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_5) == 0x000058, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_5' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_5) == 0x000060, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_6) == 0x000068, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_6' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_6) == 0x000070, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_7) == 0x000078, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_7' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_7) == 0x000080, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_8) == 0x000088, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_8' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_8) == 0x000090, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_9) == 0x000098, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_9' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_9) == 0x0000A0, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_10) == 0x0000A8, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_10' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_10) == 0x0000B0, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue) == 0x0000B8, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x0000C0, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, K2Node_DynamicCast_AsRB_Pawn) == 0x0000C8, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::K2Node_DynamicCast_AsRB_Pawn' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_GetFacePoseAsset_ReturnValue) == 0x0000D8, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_GetFacePoseAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue) == 0x0000E8, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_11) == 0x0000F0, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_11' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_11) == 0x0000F8, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_12) == 0x000100, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_12' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_12) == 0x000108, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_13) == 0x000110, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_13' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_13) == 0x000118, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_14) == 0x000120, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_14' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_14) == 0x000128, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_Value_15) == 0x000130, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_Value_15' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_Map_Find_ReturnValue_15) == 0x000138, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_Map_Find_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_1) == 0x000140, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_GetOwningActor_ReturnValue) == 0x000148, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, K2Node_DynamicCast_AsRB_NPC) == 0x000150, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::K2Node_DynamicCast_AsRB_NPC' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, K2Node_SwitchEnum_CmpSuccess) == 0x000159, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, Temp_bool_IsClosed_Variable) == 0x00015A, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, Temp_bool_Has_Been_Initd_Variable) == 0x00015B, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_2) == 0x000160, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000168, "Member 'EnemyFace_AnimBlueprint_C_ExecuteUbergraph_enemyFace_AnimBlueprint::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function enemyFace_AnimBlueprint.enemyFace_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct EnemyFace_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EnemyFace_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on EnemyFace_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(EnemyFace_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on EnemyFace_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'EnemyFace_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function enemyFace_AnimBlueprint.enemyFace_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct EnemyFace_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(EnemyFace_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on EnemyFace_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(EnemyFace_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on EnemyFace_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(EnemyFace_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'EnemyFace_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

