#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Engineer_QuestGiver_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Engineer_QuestGiver_BP.Engineer_QuestGiver_BP_C.ExecuteUbergraph_Engineer_QuestGiver_BP
// 0x0020 (0x0020 - 0x0000)
struct Engineer_QuestGiver_BP_C_ExecuteUbergraph_Engineer_QuestGiver_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38AB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNoakes_flipbook_animbp_C*              K2Node_DynamicCast_AsNoakes_Flipbook_Animbp;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Engineer_QuestGiver_BP_C_ExecuteUbergraph_Engineer_QuestGiver_BP) == 0x000008, "Wrong alignment on Engineer_QuestGiver_BP_C_ExecuteUbergraph_Engineer_QuestGiver_BP");
static_assert(sizeof(Engineer_QuestGiver_BP_C_ExecuteUbergraph_Engineer_QuestGiver_BP) == 0x000020, "Wrong size on Engineer_QuestGiver_BP_C_ExecuteUbergraph_Engineer_QuestGiver_BP");
static_assert(offsetof(Engineer_QuestGiver_BP_C_ExecuteUbergraph_Engineer_QuestGiver_BP, EntryPoint) == 0x000000, "Member 'Engineer_QuestGiver_BP_C_ExecuteUbergraph_Engineer_QuestGiver_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Engineer_QuestGiver_BP_C_ExecuteUbergraph_Engineer_QuestGiver_BP, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'Engineer_QuestGiver_BP_C_ExecuteUbergraph_Engineer_QuestGiver_BP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Engineer_QuestGiver_BP_C_ExecuteUbergraph_Engineer_QuestGiver_BP, K2Node_DynamicCast_AsNoakes_Flipbook_Animbp) == 0x000010, "Member 'Engineer_QuestGiver_BP_C_ExecuteUbergraph_Engineer_QuestGiver_BP::K2Node_DynamicCast_AsNoakes_Flipbook_Animbp' has a wrong offset!");
static_assert(offsetof(Engineer_QuestGiver_BP_C_ExecuteUbergraph_Engineer_QuestGiver_BP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Engineer_QuestGiver_BP_C_ExecuteUbergraph_Engineer_QuestGiver_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

