#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Error_ConfirmPopup

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Error_ConfirmPopup.Error_ConfirmPopup_C.ExecuteUbergraph_Error_ConfirmPopup
// 0x0090 (0x0090 - 0x0000)
struct Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_TitleText;                            // 0x0008(0x0018)(ConstParm)
	class FText                                   K2Node_Event_MainText;                             // 0x0020(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ConfirmText;                          // 0x0038(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_2;                // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsGamepad;                           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup) == 0x000008, "Wrong alignment on Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup");
static_assert(sizeof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup) == 0x000090, "Wrong size on Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup");
static_assert(offsetof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup, EntryPoint) == 0x000000, "Member 'Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup, K2Node_Event_IsDesignTime) == 0x000004, "Member 'Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup, K2Node_Event_TitleText) == 0x000008, "Member 'Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup::K2Node_Event_TitleText' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup, K2Node_Event_MainText) == 0x000020, "Member 'Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup::K2Node_Event_MainText' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup, K2Node_Event_ConfirmText) == 0x000038, "Member 'Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup::K2Node_Event_ConfirmText' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup, CallFunc_TextIsEmpty_ReturnValue) == 0x000050, "Member 'Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000051, "Member 'Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup, CallFunc_TextIsEmpty_ReturnValue_2) == 0x000052, "Member 'Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup::CallFunc_TextIsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup, K2Node_ComponentBoundEvent_Button) == 0x000070, "Member 'Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup, K2Node_Event_bIsGamepad) == 0x000078, "Member 'Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup::K2Node_Event_bIsGamepad' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup, CallFunc_GetMenuManager_ReturnValue) == 0x000080, "Member 'Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000088, "Member 'Error_ConfirmPopup_C_ExecuteUbergraph_Error_ConfirmPopup::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");

// Function Error_ConfirmPopup.Error_ConfirmPopup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Error_ConfirmPopup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Error_ConfirmPopup_C_PreConstruct) == 0x000001, "Wrong alignment on Error_ConfirmPopup_C_PreConstruct");
static_assert(sizeof(Error_ConfirmPopup_C_PreConstruct) == 0x000001, "Wrong size on Error_ConfirmPopup_C_PreConstruct");
static_assert(offsetof(Error_ConfirmPopup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Error_ConfirmPopup_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Error_ConfirmPopup.Error_ConfirmPopup_C.Event_InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct Error_ConfirmPopup_C_Event_InputSourceChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Error_ConfirmPopup_C_Event_InputSourceChanged) == 0x000001, "Wrong alignment on Error_ConfirmPopup_C_Event_InputSourceChanged");
static_assert(sizeof(Error_ConfirmPopup_C_Event_InputSourceChanged) == 0x000001, "Wrong size on Error_ConfirmPopup_C_Event_InputSourceChanged");
static_assert(offsetof(Error_ConfirmPopup_C_Event_InputSourceChanged, bIsGamepad) == 0x000000, "Member 'Error_ConfirmPopup_C_Event_InputSourceChanged::bIsGamepad' has a wrong offset!");

// Function Error_ConfirmPopup.Error_ConfirmPopup_C.BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Error_ConfirmPopup_C_BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Error_ConfirmPopup_C_BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on Error_ConfirmPopup_C_BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(Error_ConfirmPopup_C_BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on Error_ConfirmPopup_C_BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(Error_ConfirmPopup_C_BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'Error_ConfirmPopup_C_BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function Error_ConfirmPopup.Error_ConfirmPopup_C.Event_InitializePopup
// 0x0048 (0x0048 - 0x0000)
struct Error_ConfirmPopup_C_Event_InitializePopup final
{
public:
	class FText                                   TitleText;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   MainText;                                          // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   ConfirmText;                                       // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Error_ConfirmPopup_C_Event_InitializePopup) == 0x000008, "Wrong alignment on Error_ConfirmPopup_C_Event_InitializePopup");
static_assert(sizeof(Error_ConfirmPopup_C_Event_InitializePopup) == 0x000048, "Wrong size on Error_ConfirmPopup_C_Event_InitializePopup");
static_assert(offsetof(Error_ConfirmPopup_C_Event_InitializePopup, TitleText) == 0x000000, "Member 'Error_ConfirmPopup_C_Event_InitializePopup::TitleText' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_Event_InitializePopup, MainText) == 0x000018, "Member 'Error_ConfirmPopup_C_Event_InitializePopup::MainText' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_Event_InitializePopup, ConfirmText) == 0x000030, "Member 'Error_ConfirmPopup_C_Event_InitializePopup::ConfirmText' has a wrong offset!");

// Function Error_ConfirmPopup.Error_ConfirmPopup_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct Error_ConfirmPopup_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(Error_ConfirmPopup_C_OnFocusReceived) == 0x000008, "Wrong alignment on Error_ConfirmPopup_C_OnFocusReceived");
static_assert(sizeof(Error_ConfirmPopup_C_OnFocusReceived) == 0x0001B0, "Wrong size on Error_ConfirmPopup_C_OnFocusReceived");
static_assert(offsetof(Error_ConfirmPopup_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'Error_ConfirmPopup_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'Error_ConfirmPopup_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'Error_ConfirmPopup_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(Error_ConfirmPopup_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'Error_ConfirmPopup_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

