#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Error_ConfirmPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Error_ConfirmPopup.Error_ConfirmPopup_C
// 0x0088 (0x03D8 - 0x0350)
class UError_ConfirmPopup_C final : public URBErrorConfirmPopUpWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background_1;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        ConfirmMenuButton;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ErrorCodeText;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_128;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_173;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_2;                                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_3;                                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PopUpIconImage;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PopupSecondaryText;                                // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PopupText;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleTxt;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            HeaderColor;                                       // 0x03B0(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_Error_ConfirmPopup(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Event_InputSourceChanged(bool bIsGamepad);
	void Event_OnFocusMenu();
	void BndEvt__ConfirmMenuButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void Event_InitializePopup(const class FText& TitleText, const class FText& MainText, const class FText& ConfirmText);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Error_ConfirmPopup_C">();
	}
	static class UError_ConfirmPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UError_ConfirmPopup_C>();
	}
};
static_assert(alignof(UError_ConfirmPopup_C) == 0x000008, "Wrong alignment on UError_ConfirmPopup_C");
static_assert(sizeof(UError_ConfirmPopup_C) == 0x0003D8, "Wrong size on UError_ConfirmPopup_C");
static_assert(offsetof(UError_ConfirmPopup_C, UberGraphFrame) == 0x000350, "Member 'UError_ConfirmPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UError_ConfirmPopup_C, Background_1) == 0x000358, "Member 'UError_ConfirmPopup_C::Background_1' has a wrong offset!");
static_assert(offsetof(UError_ConfirmPopup_C, ConfirmMenuButton) == 0x000360, "Member 'UError_ConfirmPopup_C::ConfirmMenuButton' has a wrong offset!");
static_assert(offsetof(UError_ConfirmPopup_C, ErrorCodeText) == 0x000368, "Member 'UError_ConfirmPopup_C::ErrorCodeText' has a wrong offset!");
static_assert(offsetof(UError_ConfirmPopup_C, Image_128) == 0x000370, "Member 'UError_ConfirmPopup_C::Image_128' has a wrong offset!");
static_assert(offsetof(UError_ConfirmPopup_C, Image_173) == 0x000378, "Member 'UError_ConfirmPopup_C::Image_173' has a wrong offset!");
static_assert(offsetof(UError_ConfirmPopup_C, Line_2) == 0x000380, "Member 'UError_ConfirmPopup_C::Line_2' has a wrong offset!");
static_assert(offsetof(UError_ConfirmPopup_C, Line_3) == 0x000388, "Member 'UError_ConfirmPopup_C::Line_3' has a wrong offset!");
static_assert(offsetof(UError_ConfirmPopup_C, PopUpIconImage) == 0x000390, "Member 'UError_ConfirmPopup_C::PopUpIconImage' has a wrong offset!");
static_assert(offsetof(UError_ConfirmPopup_C, PopupSecondaryText) == 0x000398, "Member 'UError_ConfirmPopup_C::PopupSecondaryText' has a wrong offset!");
static_assert(offsetof(UError_ConfirmPopup_C, PopupText) == 0x0003A0, "Member 'UError_ConfirmPopup_C::PopupText' has a wrong offset!");
static_assert(offsetof(UError_ConfirmPopup_C, TitleTxt) == 0x0003A8, "Member 'UError_ConfirmPopup_C::TitleTxt' has a wrong offset!");
static_assert(offsetof(UError_ConfirmPopup_C, HeaderColor) == 0x0003B0, "Member 'UError_ConfirmPopup_C::HeaderColor' has a wrong offset!");

}

