#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EvaluationCorridorMinus01

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EvaluationCorridor-01.EvaluationCorridor-01_C.BndEvt__EvaluationCorridor-01_TriggerBox_1_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_TriggerBox_1_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_TriggerBox_1_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_TriggerBox_1_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_TriggerBox_1_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_TriggerBox_1_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_TriggerBox_1_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_TriggerBox_1_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_TriggerBox_1_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_TriggerBox_1_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function EvaluationCorridor-01.EvaluationCorridor-01_C.PlayEvalCorridorTVAnimation
// 0x0018 (0x0018 - 0x0000)
struct EvaluationCorridorMinus01_C_PlayEvalCorridorTVAnimation final
{
public:
	struct FNarrativeScreenAnimationData          AnimData;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(EvaluationCorridorMinus01_C_PlayEvalCorridorTVAnimation) == 0x000008, "Wrong alignment on EvaluationCorridorMinus01_C_PlayEvalCorridorTVAnimation");
static_assert(sizeof(EvaluationCorridorMinus01_C_PlayEvalCorridorTVAnimation) == 0x000018, "Wrong size on EvaluationCorridorMinus01_C_PlayEvalCorridorTVAnimation");
static_assert(offsetof(EvaluationCorridorMinus01_C_PlayEvalCorridorTVAnimation, AnimData) == 0x000000, "Member 'EvaluationCorridorMinus01_C_PlayEvalCorridorTVAnimation::AnimData' has a wrong offset!");

// Function EvaluationCorridor-01.EvaluationCorridor-01_C.BndEvt__EvaluationCorridor-01_RBPlayerTriggerVolume8_2_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_RBPlayerTriggerVolume8_2_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature final
{
public:
	class ARBPlayer*                              Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_RBPlayerTriggerVolume8_2_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature) == 0x000008, "Wrong alignment on EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_RBPlayerTriggerVolume8_2_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature");
static_assert(sizeof(EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_RBPlayerTriggerVolume8_2_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature) == 0x000008, "Wrong size on EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_RBPlayerTriggerVolume8_2_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature");
static_assert(offsetof(EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_RBPlayerTriggerVolume8_2_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature, Player) == 0x000000, "Member 'EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_RBPlayerTriggerVolume8_2_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature::Player' has a wrong offset!");

// Function EvaluationCorridor-01.EvaluationCorridor-01_C.Decontamination
// 0x0008 (0x0008 - 0x0000)
struct EvaluationCorridorMinus01_C_Decontamination final
{
public:
	class APawn*                                  Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EvaluationCorridorMinus01_C_Decontamination) == 0x000008, "Wrong alignment on EvaluationCorridorMinus01_C_Decontamination");
static_assert(sizeof(EvaluationCorridorMinus01_C_Decontamination) == 0x000008, "Wrong size on EvaluationCorridorMinus01_C_Decontamination");
static_assert(offsetof(EvaluationCorridorMinus01_C_Decontamination, Target) == 0x000000, "Member 'EvaluationCorridorMinus01_C_Decontamination::Target' has a wrong offset!");

// Function EvaluationCorridor-01.EvaluationCorridor-01_C.TurnOnUVLight
// 0x0001 (0x0001 - 0x0000)
struct EvaluationCorridorMinus01_C_TurnOnUVLight final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EvaluationCorridorMinus01_C_TurnOnUVLight) == 0x000001, "Wrong alignment on EvaluationCorridorMinus01_C_TurnOnUVLight");
static_assert(sizeof(EvaluationCorridorMinus01_C_TurnOnUVLight) == 0x000001, "Wrong size on EvaluationCorridorMinus01_C_TurnOnUVLight");
static_assert(offsetof(EvaluationCorridorMinus01_C_TurnOnUVLight, Condition) == 0x000000, "Member 'EvaluationCorridorMinus01_C_TurnOnUVLight::Condition' has a wrong offset!");

// Function EvaluationCorridor-01.EvaluationCorridor-01_C.BndEvt__EvaluationCorridor-01_DecontaminationExitTrigger2_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_DecontaminationExitTrigger2_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_DecontaminationExitTrigger2_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_DecontaminationExitTrigger2_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_DecontaminationExitTrigger2_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature) == 0x000010, "Wrong size on EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_DecontaminationExitTrigger2_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_DecontaminationExitTrigger2_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature, OverlappedActor) == 0x000000, "Member 'EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_DecontaminationExitTrigger2_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature::OverlappedActor' has a wrong offset!");
static_assert(offsetof(EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_DecontaminationExitTrigger2_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'EvaluationCorridorMinus01_C_BndEvt__EvaluationCorridorMinus01_DecontaminationExitTrigger2_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");

// Function EvaluationCorridor-01.EvaluationCorridor-01_C.QueueEastermanVO
// 0x0008 (0x0008 - 0x0000)
struct EvaluationCorridorMinus01_C_QueueEastermanVO final
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EvaluationCorridorMinus01_C_QueueEastermanVO) == 0x000008, "Wrong alignment on EvaluationCorridorMinus01_C_QueueEastermanVO");
static_assert(sizeof(EvaluationCorridorMinus01_C_QueueEastermanVO) == 0x000008, "Wrong size on EvaluationCorridorMinus01_C_QueueEastermanVO");
static_assert(offsetof(EvaluationCorridorMinus01_C_QueueEastermanVO, AkEvent) == 0x000000, "Member 'EvaluationCorridorMinus01_C_QueueEastermanVO::AkEvent' has a wrong offset!");

// Function EvaluationCorridor-01.EvaluationCorridor-01_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct EvaluationCorridorMinus01_C_CustomEvent_0 final
{
public:
	class ARBPlayer*                              Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EvaluationCorridorMinus01_C_CustomEvent_0) == 0x000008, "Wrong alignment on EvaluationCorridorMinus01_C_CustomEvent_0");
static_assert(sizeof(EvaluationCorridorMinus01_C_CustomEvent_0) == 0x000008, "Wrong size on EvaluationCorridorMinus01_C_CustomEvent_0");
static_assert(offsetof(EvaluationCorridorMinus01_C_CustomEvent_0, Player) == 0x000000, "Member 'EvaluationCorridorMinus01_C_CustomEvent_0::Player' has a wrong offset!");

// Function EvaluationCorridor-01.EvaluationCorridor-01_C.ExecuteUbergraph_EvaluationCorridor-01
// 0x03E0 (0x03E0 - 0x0000)
struct EvaluationCorridorMinus01_C_ExecuteUbergraph_EvaluationCorridorMinus01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D02[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMetaNPCUnlocked_ReturnValue;            // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayedNPCUnlockAnnouncement_ReturnValue; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D03[0x1];                                     // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ARBPlayer* Player)>      K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStageResetCount_ReturnValue;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_LastReset_Variable;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D04[0x1];                                     // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStageResetCount_ReturnValue_1;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D05[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_1;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_1;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_DynamicCast_AsRB_Pawn;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D06[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNarrativeScreenAnimationData          K2Node_CustomEvent_AnimData;                       // 0x00A8(0x0018)(NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_ActorBoundEvent_player;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D07[0x5];                                     // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_CustomEvent_Target;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Condition;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D08[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor;                 // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_DynamicCast_AsRB_Pawn_1;                    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0104(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_LastReset_Variable_1;                     // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D09[0x3];                                     // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x012C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBLocalProfile*                        CallFunc_GetProfile_ReturnValue;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D0A[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTrialEvaluationInfo                   CallFunc_GetLastTrialEvaluationInfo_ReturnValue;   // 0x014C(0x001C)(ConstParm, NoDestructor)
	class URBGameStructureConfig*                 CallFunc_GetGameStructureConfig_ReturnValue;       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBProgramInfoRow                      CallFunc_GetProgramInfo_ReturnValue;               // 0x0170(0x0148)(ConstParm)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerTrialRating                            CallFunc_NormalizedScoreToRating_ReturnValue;      // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D0B[0x6];                                     // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBLocalProfile*                        CallFunc_GetProfile_ReturnValue_1;                 // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D0C[0x2];                                     // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTrialEvaluationInfo                   CallFunc_GetLastTrialEvaluationInfo_ReturnValue_1; // 0x02CC(0x001C)(ConstParm, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D0D[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_CustomEvent_AkEvent;                        // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerTrialRating                            CallFunc_NormalizedScoreToRating_ReturnValue_1;    // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D0E[0x5];                                     // 0x02FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue;          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0308(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_1;            // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D0F[0x4];                                     // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue_1;        // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHUDTutorialTextData                   CallFunc_Map_Find_Value;                           // 0x0328(0x0040)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D10[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          CallFunc_Map_Find_Value_1;                         // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D11[0x6];                                     // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          CallFunc_Map_Find_Value_2;                         // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D12[0x6];                                     // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue_2;        // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNarrativeScreenAnimationData          CallFunc_Map_Find_Value_3;                         // 0x0398(0x0018)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D13[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetNarrator_ClientOnly_ReturnValue;       // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue;                 // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue_3;        // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_CustomEvent_player;                         // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EvaluationCorridorMinus01_C_ExecuteUbergraph_EvaluationCorridorMinus01) == 0x000008, "Wrong alignment on EvaluationCorridorMinus01_C_ExecuteUbergraph_EvaluationCorridorMinus01");
static_assert(sizeof(EvaluationCorridorMinus01_C_ExecuteUbergraph_EvaluationCorridorMinus01) == 0x0003E0, "Wrong size on EvaluationCorridorMinus01_C_ExecuteUbergraph_EvaluationCorridorMinus01");
static_assert(offsetof(EvaluationCorridorMinus01_C_ExecuteUbergraph_EvaluationCorridorMinus01, EntryPoint) == 0x000000, "Member 'EvaluationCorridorMinus01_C_ExecuteUbergraph_EvaluationCorridorMinus01::EntryPoint' has a wrong offset!");
static_assert(offsetof(EvaluationCorridorMinus01_C_ExecuteUbergraph_EvaluationCorridorMinus01, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'EvaluationCorridorMinus01_C_ExecuteUbergraph_EvaluationCorridorMinus01::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
