#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EvalCorridorDoorDetectorMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EvalCorridorDoorDetector-01_BP.EvalCorridorDoorDetector-01_BP_C
// 0x0028 (0x0270 - 0x0248)
class AEvalCorridorDoorDetectorMinus01_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEvalCorridorHelperComponent*         RBEvalCorridorHelper;                              // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ATriggerBase*                           Trigger;                                           // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnWorldPopulateFinishedTimeSliced();
	void UserConstructionScript();
	void OnWorldFullyLoaded();
	void OnWorldPopulateFinished();
	void SetOpenEvaluationCorridorDoor(class APawn* Target, bool bEnabled);
	void ExecuteUbergraph_EvalCorridorDoorDetectorMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EvalCorridorDoorDetector-01_BP_C">();
	}
	static class AEvalCorridorDoorDetectorMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEvalCorridorDoorDetectorMinus01_BP_C>();
	}
};
static_assert(alignof(AEvalCorridorDoorDetectorMinus01_BP_C) == 0x000008, "Wrong alignment on AEvalCorridorDoorDetectorMinus01_BP_C");
static_assert(sizeof(AEvalCorridorDoorDetectorMinus01_BP_C) == 0x000270, "Wrong size on AEvalCorridorDoorDetectorMinus01_BP_C");
static_assert(offsetof(AEvalCorridorDoorDetectorMinus01_BP_C, UberGraphFrame) == 0x000248, "Member 'AEvalCorridorDoorDetectorMinus01_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEvalCorridorDoorDetectorMinus01_BP_C, Box) == 0x000250, "Member 'AEvalCorridorDoorDetectorMinus01_BP_C::Box' has a wrong offset!");
static_assert(offsetof(AEvalCorridorDoorDetectorMinus01_BP_C, RBEvalCorridorHelper) == 0x000258, "Member 'AEvalCorridorDoorDetectorMinus01_BP_C::RBEvalCorridorHelper' has a wrong offset!");
static_assert(offsetof(AEvalCorridorDoorDetectorMinus01_BP_C, DefaultSceneRoot) == 0x000260, "Member 'AEvalCorridorDoorDetectorMinus01_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AEvalCorridorDoorDetectorMinus01_BP_C, Trigger) == 0x000268, "Member 'AEvalCorridorDoorDetectorMinus01_BP_C::Trigger' has a wrong offset!");

}

