#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExperimentBoardActionButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ExperimentBoardActionButton.ExperimentBoardActionButton_C.ExecuteUbergraph_ExperimentBoardActionButton
// 0x0148 (0x0148 - 0x0000)
struct ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9B[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0050(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C0(0x0070)(ConstParm)
	bool                                          K2Node_Event_bIsGamepad;                           // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9C[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0134(0x0008)(NoDestructor)
	uint8                                         Pad_2C9D[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton) == 0x000008, "Wrong alignment on ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton");
static_assert(sizeof(ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton) == 0x000148, "Wrong size on ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton");
static_assert(offsetof(ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton, EntryPoint) == 0x000000, "Member 'ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton, K2Node_Event_IsDesignTime) == 0x000014, "Member 'ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton, K2Node_Event_MyGeometry) == 0x000018, "Member 'ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton, K2Node_Event_MouseEvent_1) == 0x000050, "Member 'ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton, K2Node_Event_MouseEvent) == 0x0000C0, "Member 'ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton, K2Node_Event_bIsGamepad) == 0x000130, "Member 'ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton::K2Node_Event_bIsGamepad' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton, K2Node_Event_InFocusEvent) == 0x000134, "Member 'ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton, CallFunc_GetMenuManager_ReturnValue) == 0x000140, "Member 'ExperimentBoardActionButton_C_ExecuteUbergraph_ExperimentBoardActionButton::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");

// Function ExperimentBoardActionButton.ExperimentBoardActionButton_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct ExperimentBoardActionButton_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(ExperimentBoardActionButton_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on ExperimentBoardActionButton_C_OnRemovedFromFocusPath");
static_assert(sizeof(ExperimentBoardActionButton_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on ExperimentBoardActionButton_C_OnRemovedFromFocusPath");
static_assert(offsetof(ExperimentBoardActionButton_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'ExperimentBoardActionButton_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function ExperimentBoardActionButton.ExperimentBoardActionButton_C.Event_InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct ExperimentBoardActionButton_C_Event_InputSourceChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExperimentBoardActionButton_C_Event_InputSourceChanged) == 0x000001, "Wrong alignment on ExperimentBoardActionButton_C_Event_InputSourceChanged");
static_assert(sizeof(ExperimentBoardActionButton_C_Event_InputSourceChanged) == 0x000001, "Wrong size on ExperimentBoardActionButton_C_Event_InputSourceChanged");
static_assert(offsetof(ExperimentBoardActionButton_C_Event_InputSourceChanged, bIsGamepad) == 0x000000, "Member 'ExperimentBoardActionButton_C_Event_InputSourceChanged::bIsGamepad' has a wrong offset!");

// Function ExperimentBoardActionButton.ExperimentBoardActionButton_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct ExperimentBoardActionButton_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ExperimentBoardActionButton_C_OnMouseLeave) == 0x000008, "Wrong alignment on ExperimentBoardActionButton_C_OnMouseLeave");
static_assert(sizeof(ExperimentBoardActionButton_C_OnMouseLeave) == 0x000070, "Wrong size on ExperimentBoardActionButton_C_OnMouseLeave");
static_assert(offsetof(ExperimentBoardActionButton_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'ExperimentBoardActionButton_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function ExperimentBoardActionButton.ExperimentBoardActionButton_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct ExperimentBoardActionButton_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ExperimentBoardActionButton_C_OnMouseEnter) == 0x000008, "Wrong alignment on ExperimentBoardActionButton_C_OnMouseEnter");
static_assert(sizeof(ExperimentBoardActionButton_C_OnMouseEnter) == 0x0000A8, "Wrong size on ExperimentBoardActionButton_C_OnMouseEnter");
static_assert(offsetof(ExperimentBoardActionButton_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'ExperimentBoardActionButton_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'ExperimentBoardActionButton_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function ExperimentBoardActionButton.ExperimentBoardActionButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ExperimentBoardActionButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExperimentBoardActionButton_C_PreConstruct) == 0x000001, "Wrong alignment on ExperimentBoardActionButton_C_PreConstruct");
static_assert(sizeof(ExperimentBoardActionButton_C_PreConstruct) == 0x000001, "Wrong size on ExperimentBoardActionButton_C_PreConstruct");
static_assert(offsetof(ExperimentBoardActionButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ExperimentBoardActionButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ExperimentBoardActionButton.ExperimentBoardActionButton_C.UpdateState
// 0x01E8 (0x01E8 - 0x0000)
struct ExperimentBoardActionButton_C_UpdateState final
{
public:
	struct FSlateBrush                            NormalBrush;                                       // 0x0000(0x0088)(Edit, BlueprintVisible)
	struct FSlateBrush                            ActiveBrush;                                       // 0x0088(0x0088)(Edit, BlueprintVisible)
	struct FSlateColor                            NormalColor;                                       // 0x0110(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            SelectedColor;                                     // 0x0138(0x0028)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0167(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x0178(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_3;                           // 0x01A0(0x0028)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExperimentBoardActionButton_C_UpdateState) == 0x000008, "Wrong alignment on ExperimentBoardActionButton_C_UpdateState");
static_assert(sizeof(ExperimentBoardActionButton_C_UpdateState) == 0x0001E8, "Wrong size on ExperimentBoardActionButton_C_UpdateState");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, NormalBrush) == 0x000000, "Member 'ExperimentBoardActionButton_C_UpdateState::NormalBrush' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, ActiveBrush) == 0x000088, "Member 'ExperimentBoardActionButton_C_UpdateState::ActiveBrush' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, NormalColor) == 0x000110, "Member 'ExperimentBoardActionButton_C_UpdateState::NormalColor' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, SelectedColor) == 0x000138, "Member 'ExperimentBoardActionButton_C_UpdateState::SelectedColor' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, Temp_bool_Variable) == 0x000160, "Member 'ExperimentBoardActionButton_C_UpdateState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, Temp_byte_Variable) == 0x000161, "Member 'ExperimentBoardActionButton_C_UpdateState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, Temp_byte_Variable_1) == 0x000162, "Member 'ExperimentBoardActionButton_C_UpdateState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, Temp_bool_Variable_1) == 0x000163, "Member 'ExperimentBoardActionButton_C_UpdateState::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, Temp_bool_Variable_2) == 0x000164, "Member 'ExperimentBoardActionButton_C_UpdateState::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, Temp_bool_Variable_3) == 0x000165, "Member 'ExperimentBoardActionButton_C_UpdateState::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, CallFunc_BooleanAND_ReturnValue) == 0x000166, "Member 'ExperimentBoardActionButton_C_UpdateState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, K2Node_Select_Default) == 0x000167, "Member 'ExperimentBoardActionButton_C_UpdateState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, K2Node_Select_Default_1) == 0x000168, "Member 'ExperimentBoardActionButton_C_UpdateState::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, K2Node_Select_Default_2) == 0x000178, "Member 'ExperimentBoardActionButton_C_UpdateState::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, K2Node_Select_Default_3) == 0x0001A0, "Member 'ExperimentBoardActionButton_C_UpdateState::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, CallFunc_SelectColor_ReturnValue) == 0x0001C8, "Member 'ExperimentBoardActionButton_C_UpdateState::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, CallFunc_PlayAnimation_ReturnValue) == 0x0001D8, "Member 'ExperimentBoardActionButton_C_UpdateState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_UpdateState, CallFunc_BooleanAND_ReturnValue_1) == 0x0001E0, "Member 'ExperimentBoardActionButton_C_UpdateState::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function ExperimentBoardActionButton.ExperimentBoardActionButton_C.SetEnabled
// 0x0002 (0x0002 - 0x0000)
struct ExperimentBoardActionButton_C_SetEnabled final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExperimentBoardActionButton_C_SetEnabled) == 0x000001, "Wrong alignment on ExperimentBoardActionButton_C_SetEnabled");
static_assert(sizeof(ExperimentBoardActionButton_C_SetEnabled) == 0x000002, "Wrong size on ExperimentBoardActionButton_C_SetEnabled");
static_assert(offsetof(ExperimentBoardActionButton_C_SetEnabled, bInEnabled) == 0x000000, "Member 'ExperimentBoardActionButton_C_SetEnabled::bInEnabled' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_SetEnabled, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'ExperimentBoardActionButton_C_SetEnabled::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function ExperimentBoardActionButton.ExperimentBoardActionButton_C.SetButtonText
// 0x0020 (0x0020 - 0x0000)
struct ExperimentBoardActionButton_C_SetButtonText final
{
public:
	class FText                                   Param_ButtonText;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExperimentBoardActionButton_C_SetButtonText) == 0x000008, "Wrong alignment on ExperimentBoardActionButton_C_SetButtonText");
static_assert(sizeof(ExperimentBoardActionButton_C_SetButtonText) == 0x000020, "Wrong size on ExperimentBoardActionButton_C_SetButtonText");
static_assert(offsetof(ExperimentBoardActionButton_C_SetButtonText, Param_ButtonText) == 0x000000, "Member 'ExperimentBoardActionButton_C_SetButtonText::Param_ButtonText' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_SetButtonText, CallFunc_NotEqual_TextText_ReturnValue) == 0x000018, "Member 'ExperimentBoardActionButton_C_SetButtonText::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");

// Function ExperimentBoardActionButton.ExperimentBoardActionButton_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct ExperimentBoardActionButton_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(ExperimentBoardActionButton_C_OnFocusReceived) == 0x000008, "Wrong alignment on ExperimentBoardActionButton_C_OnFocusReceived");
static_assert(sizeof(ExperimentBoardActionButton_C_OnFocusReceived) == 0x0001B0, "Wrong size on ExperimentBoardActionButton_C_OnFocusReceived");
static_assert(offsetof(ExperimentBoardActionButton_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'ExperimentBoardActionButton_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'ExperimentBoardActionButton_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'ExperimentBoardActionButton_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'ExperimentBoardActionButton_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function ExperimentBoardActionButton.ExperimentBoardActionButton_C.SetHovered
// 0x0001 (0x0001 - 0x0000)
struct ExperimentBoardActionButton_C_SetHovered final
{
public:
	bool                                          Param_Hovered;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExperimentBoardActionButton_C_SetHovered) == 0x000001, "Wrong alignment on ExperimentBoardActionButton_C_SetHovered");
static_assert(sizeof(ExperimentBoardActionButton_C_SetHovered) == 0x000001, "Wrong size on ExperimentBoardActionButton_C_SetHovered");
static_assert(offsetof(ExperimentBoardActionButton_C_SetHovered, Param_Hovered) == 0x000000, "Member 'ExperimentBoardActionButton_C_SetHovered::Param_Hovered' has a wrong offset!");

// Function ExperimentBoardActionButton.ExperimentBoardActionButton_C.Setup
// 0x0090 (0x0090 - 0x0000)
struct ExperimentBoardActionButton_C_Setup final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9F[0x1];                                     // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_Select_Default;                             // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CA0[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionKeyMapping                 CallFunc_GetInputBinding_ReturnValue;              // 0x0050(0x0028)()
	bool                                          CallFunc_IsActionMappingValid_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CA1[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExperimentBoardActionButton_C_Setup) == 0x000008, "Wrong alignment on ExperimentBoardActionButton_C_Setup");
static_assert(sizeof(ExperimentBoardActionButton_C_Setup) == 0x000090, "Wrong size on ExperimentBoardActionButton_C_Setup");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, Temp_bool_Variable) == 0x000000, "Member 'ExperimentBoardActionButton_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, K2Node_MakeStruct_Margin) == 0x000004, "Member 'ExperimentBoardActionButton_C_Setup::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, K2Node_MakeStruct_Margin_1) == 0x000014, "Member 'ExperimentBoardActionButton_C_Setup::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, Temp_bool_Variable_1) == 0x000024, "Member 'ExperimentBoardActionButton_C_Setup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, Temp_byte_Variable) == 0x000025, "Member 'ExperimentBoardActionButton_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, Temp_byte_Variable_1) == 0x000026, "Member 'ExperimentBoardActionButton_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, CallFunc_SlotAsBorderSlot_ReturnValue) == 0x000028, "Member 'ExperimentBoardActionButton_C_Setup::CallFunc_SlotAsBorderSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, K2Node_Select_Default) == 0x000030, "Member 'ExperimentBoardActionButton_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'ExperimentBoardActionButton_C_Setup::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, CallFunc_IsEmpty_ReturnValue) == 0x000048, "Member 'ExperimentBoardActionButton_C_Setup::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, CallFunc_GetInputBinding_ReturnValue) == 0x000050, "Member 'ExperimentBoardActionButton_C_Setup::CallFunc_GetInputBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, CallFunc_IsActionMappingValid_ReturnValue) == 0x000078, "Member 'ExperimentBoardActionButton_C_Setup::CallFunc_IsActionMappingValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'ExperimentBoardActionButton_C_Setup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000080, "Member 'ExperimentBoardActionButton_C_Setup::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, CallFunc_BooleanOR_ReturnValue) == 0x000088, "Member 'ExperimentBoardActionButton_C_Setup::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_Setup, K2Node_Select_Default_1) == 0x000089, "Member 'ExperimentBoardActionButton_C_Setup::K2Node_Select_Default_1' has a wrong offset!");

// Function ExperimentBoardActionButton.ExperimentBoardActionButton_C.SetIsNew
// 0x0005 (0x0005 - 0x0000)
struct ExperimentBoardActionButton_C_SetIsNew final
{
public:
	bool                                          IsNew;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExperimentBoardActionButton_C_SetIsNew) == 0x000001, "Wrong alignment on ExperimentBoardActionButton_C_SetIsNew");
static_assert(sizeof(ExperimentBoardActionButton_C_SetIsNew) == 0x000005, "Wrong size on ExperimentBoardActionButton_C_SetIsNew");
static_assert(offsetof(ExperimentBoardActionButton_C_SetIsNew, IsNew) == 0x000000, "Member 'ExperimentBoardActionButton_C_SetIsNew::IsNew' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_SetIsNew, Temp_bool_Variable) == 0x000001, "Member 'ExperimentBoardActionButton_C_SetIsNew::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ExperimentBoardActionButton_C_SetIsNew, Temp_byte_Variable) == 0x000002, "Member 'ExperimentBoardActionButton_C_SetIsNew::Temp_byte_Variable' has a wrong offset!");
