#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Face_Player_StateControl

#include "Basic.hpp"


namespace SDK::Params
{

// Function Face_Player_StateControl.Face_Player_StateControl_C.Received_Notify
// 0x0058 (0x0058 - 0x0000)
struct Face_Player_StateControl_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3428[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerFace_AnimBlueprint_C*            PlayerFace;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3429[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer_BP_C*                         K2Node_DynamicCast_AsRB_Player_BP;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342A[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerFace_AnimBlueprint_C*            K2Node_DynamicCast_AsPlayer_Face_Anim_Blueprint;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Face_Player_StateControl_C_Received_Notify) == 0x000008, "Wrong alignment on Face_Player_StateControl_C_Received_Notify");
static_assert(sizeof(Face_Player_StateControl_C_Received_Notify) == 0x000058, "Wrong size on Face_Player_StateControl_C_Received_Notify");
static_assert(offsetof(Face_Player_StateControl_C_Received_Notify, MeshComp) == 0x000000, "Member 'Face_Player_StateControl_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(Face_Player_StateControl_C_Received_Notify, Animation) == 0x000008, "Member 'Face_Player_StateControl_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(Face_Player_StateControl_C_Received_Notify, ReturnValue) == 0x000010, "Member 'Face_Player_StateControl_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(Face_Player_StateControl_C_Received_Notify, PlayerFace) == 0x000018, "Member 'Face_Player_StateControl_C_Received_Notify::PlayerFace' has a wrong offset!");
static_assert(offsetof(Face_Player_StateControl_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'Face_Player_StateControl_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Face_Player_StateControl_C_Received_Notify, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'Face_Player_StateControl_C_Received_Notify::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Face_Player_StateControl_C_Received_Notify, K2Node_DynamicCast_AsRB_Player_BP) == 0x000030, "Member 'Face_Player_StateControl_C_Received_Notify::K2Node_DynamicCast_AsRB_Player_BP' has a wrong offset!");
static_assert(offsetof(Face_Player_StateControl_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Face_Player_StateControl_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Face_Player_StateControl_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'Face_Player_StateControl_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Face_Player_StateControl_C_Received_Notify, CallFunc_GetAnimInstance_ReturnValue) == 0x000040, "Member 'Face_Player_StateControl_C_Received_Notify::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Face_Player_StateControl_C_Received_Notify, K2Node_DynamicCast_AsPlayer_Face_Anim_Blueprint) == 0x000048, "Member 'Face_Player_StateControl_C_Received_Notify::K2Node_DynamicCast_AsPlayer_Face_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(Face_Player_StateControl_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'Face_Player_StateControl_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

