#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Face_Lobby_StaticCharacter_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Face_Lobby_StaticCharacter_AnimBlueprint.Face_Lobby_StaticCharacter_AnimBlueprint_C
// 0x0FD0 (0x1350 - 0x0380)
class UFace_Lobby_StaticCharacter_AnimBlueprint_C final : public URBFaceAnimInstancePlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x03B8(0x01D8)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0590(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x06E8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x0710(0x00C0)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode_1;                     // 0x07D0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0870(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0898(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x0918(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x09E0(0x00C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0AA0(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0B20(0x0048)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode;                       // 0x0B68(0x00A0)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_1;               // 0x0C08(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0C40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0C68(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0C90(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0CB0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0CF8(0x0158)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0E50(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0F18(0x0028)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive;                 // 0x0F40(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0F78(0x0028)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x0FA0(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1150(0x01B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1300(0x0020)()
	class UPoseAsset*                             PoseAsset;                                         // 0x1320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Lip_Sync_Anim;                                     // 0x1328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLookingAt;                                       // 0x1330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3387[0x3];                                     // 0x1331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LookAtAlpha;                                       // 0x1334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LookAtLocation;                                    // 0x1338(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3388[0x4];                                     // 0x1344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALobby_StationnaryCharacterBase_C*      StationaryCharacterBase;                           // 0x1348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void LipSyncFeed();
	void ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Face_Lobby_StaticCharacter_AnimBlueprint_C">();
	}
	static class UFace_Lobby_StaticCharacter_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFace_Lobby_StaticCharacter_AnimBlueprint_C>();
	}
};
static_assert(alignof(UFace_Lobby_StaticCharacter_AnimBlueprint_C) == 0x000010, "Wrong alignment on UFace_Lobby_StaticCharacter_AnimBlueprint_C");
static_assert(sizeof(UFace_Lobby_StaticCharacter_AnimBlueprint_C) == 0x001350, "Wrong size on UFace_Lobby_StaticCharacter_AnimBlueprint_C");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, UberGraphFrame) == 0x000380, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_Root) == 0x000388, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_CopyPoseFromMesh) == 0x0003B8, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_SaveCachedPose_1) == 0x000590, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_UseCachedPose_5) == 0x0006E8, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend_1) == 0x000710, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_PoseBlendNode_1) == 0x0007D0, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_PoseBlendNode_1' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_UseCachedPose_4) == 0x000870, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_SequencePlayer_1) == 0x000898, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_ApplyAdditive_1) == 0x000918, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_ApplyAdditive_1' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend) == 0x0009E0, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x000AA0, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_Slot_1) == 0x000B20, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_PoseBlendNode) == 0x000B68, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_PoseBlendNode' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_MakeDynamicAdditive_1) == 0x000C08, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_MakeDynamicAdditive_1' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_UseCachedPose_3) == 0x000C40, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_UseCachedPose_2) == 0x000C68, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x000C90, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_Slot) == 0x000CB0, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x000CF8, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_ApplyAdditive) == 0x000E50, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_UseCachedPose_1) == 0x000F18, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_MakeDynamicAdditive) == 0x000F40, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_MakeDynamicAdditive' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x000F78, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_LookAt_1) == 0x000FA0, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_LookAt) == 0x001150, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x001300, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, PoseAsset) == 0x001320, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::PoseAsset' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, Lip_Sync_Anim) == 0x001328, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::Lip_Sync_Anim' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, IsLookingAt) == 0x001330, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::IsLookingAt' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, LookAtAlpha) == 0x001334, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::LookAtAlpha' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, LookAtLocation) == 0x001338, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::LookAtLocation' has a wrong offset!");
static_assert(offsetof(UFace_Lobby_StaticCharacter_AnimBlueprint_C, StationaryCharacterBase) == 0x001348, "Member 'UFace_Lobby_StaticCharacter_AnimBlueprint_C::StationaryCharacterBase' has a wrong offset!");

}

