#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Floor_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "StaticmeshArray_Stuc_structs.hpp"
#include "ModuleMeshDataMinus02_structs.hpp"


namespace SDK::Params
{

// Function Floor_BP.Floor_BP_C.UserConstructionScript
// 0x00D0 (0x00D0 - 0x0000)
struct Floor_BP_C_UserConstructionScript final
{
public:
	struct FVector                                ShadowScale;                                       // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewSize;                                           // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3958[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3959[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_395A[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_PopulateSurface_LastLocation;             // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes;          // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize;        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395B[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModuleMeshDataMinus02>         K2Node_Select_Default_1;                           // 0x0088(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_PopulateSurface_LastLocation_1;           // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize_1;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale_1;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395C[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes_1;        // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize_1;      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale_1;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Floor_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on Floor_BP_C_UserConstructionScript");
static_assert(sizeof(Floor_BP_C_UserConstructionScript) == 0x0000D0, "Wrong size on Floor_BP_C_UserConstructionScript");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, ShadowScale) == 0x000000, "Member 'Floor_BP_C_UserConstructionScript::ShadowScale' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, NewSize) == 0x00000C, "Member 'Floor_BP_C_UserConstructionScript::NewSize' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, Temp_bool_Variable) == 0x000018, "Member 'Floor_BP_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, Temp_float_Variable) == 0x00001C, "Member 'Floor_BP_C_UserConstructionScript::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, Temp_float_Variable_1) == 0x000020, "Member 'Floor_BP_C_UserConstructionScript::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, Temp_bool_Variable_1) == 0x000024, "Member 'Floor_BP_C_UserConstructionScript::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue) == 0x000025, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, K2Node_Select_Default) == 0x000028, "Member 'Floor_BP_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x00002C, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000038, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation) == 0x00003C, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize) == 0x000048, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale) == 0x00004C, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes) == 0x000050, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount) == 0x000060, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize) == 0x000064, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale) == 0x000068, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x00006C, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000070, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000074, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000078, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, K2Node_Select_Default_1) == 0x000088, "Member 'Floor_BP_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation_1) == 0x000098, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation_1' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize_1) == 0x0000A4, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize_1' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale_1) == 0x0000A8, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale_1' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes_1) == 0x0000B0, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes_1' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount_1) == 0x0000C0, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount_1' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize_1) == 0x0000C4, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize_1' has a wrong offset!");
static_assert(offsetof(Floor_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale_1) == 0x0000C8, "Member 'Floor_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale_1' has a wrong offset!");

}

