#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlyingObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FlyingObject.FlyingObject_C
// 0x00D0 (0x0730 - 0x0660)
class AFlyingObject_C final : public ARBOperatable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             OriginalMaterials;                                 // 0x0670(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                Offset;                                            // 0x0680(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanBeDropped;                                      // 0x068C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_347E[0x3];                                     // 0x068D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             StaticMeshComponentOriginalTransform;              // 0x0690(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Length;                                            // 0x06C0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_347F[0x4];                                     // 0x06C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            StaticMesh;                                        // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             LatestTransform;                                   // 0x06D0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             InteractionBoxOriginalTransform;                   // 0x0700(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetFinalActorDestination(const struct FTransform& Transform);
	void GetOriginalMaterials();
	void ResetMaterials();
	void SetAllMaterialsRed();
	void UserConstructionScript();
	void CustomEvent_0();
	void CustomEvent_1(float Axis, bool Shift, bool Alt);
	void MoveObject(class ARBPawn* Pawn);
	void Event_OnStartOperating(class ARBPawn* Pawn);
	void Event_OnStopOperating(class ARBPawn* Pawn);
	void UnBindMouseWheelEvent();
	void BindMouseWheelEvent();
	void MulticastSetFinalDestination(const struct FTransform& Transform);
	void ExecuteUbergraph_FlyingObject(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FlyingObject_C">();
	}
	static class AFlyingObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFlyingObject_C>();
	}
};
static_assert(alignof(AFlyingObject_C) == 0x000010, "Wrong alignment on AFlyingObject_C");
static_assert(sizeof(AFlyingObject_C) == 0x000730, "Wrong size on AFlyingObject_C");
static_assert(offsetof(AFlyingObject_C, UberGraphFrame) == 0x000660, "Member 'AFlyingObject_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFlyingObject_C, StaticMeshComponent) == 0x000668, "Member 'AFlyingObject_C::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(AFlyingObject_C, OriginalMaterials) == 0x000670, "Member 'AFlyingObject_C::OriginalMaterials' has a wrong offset!");
static_assert(offsetof(AFlyingObject_C, Offset) == 0x000680, "Member 'AFlyingObject_C::Offset' has a wrong offset!");
static_assert(offsetof(AFlyingObject_C, CanBeDropped) == 0x00068C, "Member 'AFlyingObject_C::CanBeDropped' has a wrong offset!");
static_assert(offsetof(AFlyingObject_C, StaticMeshComponentOriginalTransform) == 0x000690, "Member 'AFlyingObject_C::StaticMeshComponentOriginalTransform' has a wrong offset!");
static_assert(offsetof(AFlyingObject_C, Length) == 0x0006C0, "Member 'AFlyingObject_C::Length' has a wrong offset!");
static_assert(offsetof(AFlyingObject_C, StaticMesh) == 0x0006C8, "Member 'AFlyingObject_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AFlyingObject_C, LatestTransform) == 0x0006D0, "Member 'AFlyingObject_C::LatestTransform' has a wrong offset!");
static_assert(offsetof(AFlyingObject_C, InteractionBoxOriginalTransform) == 0x000700, "Member 'AFlyingObject_C::InteractionBoxOriginalTransform' has a wrong offset!");

}

