#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FoamDoorBlocker_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "OPP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass FoamDoorBlocker_BP.FoamDoorBlocker_BP_C
// 0x0030 (0x0270 - 0x0240)
class AFoamDoorBlocker_BP_C final : public AStaticMeshActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      BreakBackVFX;                                      // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BreakForwardVFX;                                   // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBDamageableComponent*                 RBDamageable;                                      // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                DoorBlockablePawn;                                 // 0x0260(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              DoorBlockablePlayer;                               // 0x0268(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FoamDoorBlocker_BP(int32 EntryPoint);
	void OnRemoveDoorBlockable();
	void SetDoorBlockableOwner(class ARBPawn* Param_Owner);
	void BndEvt__FoamDoorBlocker_BP_RBDamageable_K2Node_ComponentBoundEvent_1_OnDamageableDestroyed__DelegateSignature(class URBDamageableComponent* DamageableComponent);
	void BndEvt__FoamDoorBlocker_BP_RBDamageable_K2Node_ComponentBoundEvent_0_OnDamageableDamaged__DelegateSignature(class URBDamageableComponent* DamageableComponent, bool IsDestroyed);
	void OnPreDestroyed();
	void ModulateBashDamage(const class ARBPawn* Pawn, float In_damage, float* Out_damage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FoamDoorBlocker_BP_C">();
	}
	static class AFoamDoorBlocker_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFoamDoorBlocker_BP_C>();
	}
};
static_assert(alignof(AFoamDoorBlocker_BP_C) == 0x000008, "Wrong alignment on AFoamDoorBlocker_BP_C");
static_assert(sizeof(AFoamDoorBlocker_BP_C) == 0x000270, "Wrong size on AFoamDoorBlocker_BP_C");
static_assert(offsetof(AFoamDoorBlocker_BP_C, UberGraphFrame) == 0x000240, "Member 'AFoamDoorBlocker_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFoamDoorBlocker_BP_C, BreakBackVFX) == 0x000248, "Member 'AFoamDoorBlocker_BP_C::BreakBackVFX' has a wrong offset!");
static_assert(offsetof(AFoamDoorBlocker_BP_C, BreakForwardVFX) == 0x000250, "Member 'AFoamDoorBlocker_BP_C::BreakForwardVFX' has a wrong offset!");
static_assert(offsetof(AFoamDoorBlocker_BP_C, RBDamageable) == 0x000258, "Member 'AFoamDoorBlocker_BP_C::RBDamageable' has a wrong offset!");
static_assert(offsetof(AFoamDoorBlocker_BP_C, DoorBlockablePawn) == 0x000260, "Member 'AFoamDoorBlocker_BP_C::DoorBlockablePawn' has a wrong offset!");
static_assert(offsetof(AFoamDoorBlocker_BP_C, DoorBlockablePlayer) == 0x000268, "Member 'AFoamDoorBlocker_BP_C::DoorBlockablePlayer' has a wrong offset!");

}

