#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fogger_Blind_ActiveSkill_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Fogger_Blind_ActiveSkill_BP.Fogger_Blind_ActiveSkill_BP_C.ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP
// 0x0018 (0x0018 - 0x0000)
struct Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABlindFogger_SkillItem_BP_C*            K2Node_DynamicCast_AsBlind_Fogger_Skill_Item_BP;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309D[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue;      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP) == 0x000008, "Wrong alignment on Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP");
static_assert(sizeof(Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP) == 0x000018, "Wrong size on Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP");
static_assert(offsetof(Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP, EntryPoint) == 0x000000, "Member 'Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP, K2Node_DynamicCast_AsBlind_Fogger_Skill_Item_BP) == 0x000008, "Member 'Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP::K2Node_DynamicCast_AsBlind_Fogger_Skill_Item_BP' has a wrong offset!");
static_assert(offsetof(Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP, CallFunc_PlayLoopingSoundOnActor_ReturnValue) == 0x000014, "Member 'Fogger_Blind_ActiveSkill_BP_C_ExecuteUbergraph_Fogger_Blind_ActiveSkill_BP::CallFunc_PlayLoopingSoundOnActor_ReturnValue' has a wrong offset!");

}

