#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FourLightSelector_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 4LightSelector_BP.4LightSelector_BP_C
// 0x0038 (0x0280 - 0x0248)
class AFourLightSelector_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   FourLightSelectorMinus01;                          // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynMat;                                            // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BreakLoop;                                         // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          StartOn;                                           // 0x0269(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33BB[0x2];                                     // 0x026A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SetTime;                                           // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CountdownStarted;                                  // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33BC[0x3];                                     // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Time_Length;                                       // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LightOn;                                           // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UpdateLight(int32 Value, bool IsGreen);
	void OnRep_BreakLoop();
	void SetAllLight(bool Light1, bool Light2, bool Light3, bool Light4);
	void SetSelectorNumber(int32 Value);
	void UpdateLoop(int32 SetNumber, float InitialDelay, int32 LoopNumberMin, int32 LoopNumberMax, float LoopDuration, bool OpenClose);
	void UpdateLoopCountdown(float TimeLength, float CounterDelay, bool OpenClose);
	void ExecuteUbergraph_4LightSelector_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"4LightSelector_BP_C">();
	}
	static class AFourLightSelector_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFourLightSelector_BP_C>();
	}
};
static_assert(alignof(AFourLightSelector_BP_C) == 0x000008, "Wrong alignment on AFourLightSelector_BP_C");
static_assert(sizeof(AFourLightSelector_BP_C) == 0x000280, "Wrong size on AFourLightSelector_BP_C");
static_assert(offsetof(AFourLightSelector_BP_C, UberGraphFrame) == 0x000248, "Member 'AFourLightSelector_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFourLightSelector_BP_C, FourLightSelectorMinus01) == 0x000250, "Member 'AFourLightSelector_BP_C::FourLightSelectorMinus01' has a wrong offset!");
static_assert(offsetof(AFourLightSelector_BP_C, DefaultSceneRoot) == 0x000258, "Member 'AFourLightSelector_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AFourLightSelector_BP_C, DynMat) == 0x000260, "Member 'AFourLightSelector_BP_C::DynMat' has a wrong offset!");
static_assert(offsetof(AFourLightSelector_BP_C, BreakLoop) == 0x000268, "Member 'AFourLightSelector_BP_C::BreakLoop' has a wrong offset!");
static_assert(offsetof(AFourLightSelector_BP_C, StartOn) == 0x000269, "Member 'AFourLightSelector_BP_C::StartOn' has a wrong offset!");
static_assert(offsetof(AFourLightSelector_BP_C, SetTime) == 0x00026C, "Member 'AFourLightSelector_BP_C::SetTime' has a wrong offset!");
static_assert(offsetof(AFourLightSelector_BP_C, CountdownStarted) == 0x000270, "Member 'AFourLightSelector_BP_C::CountdownStarted' has a wrong offset!");
static_assert(offsetof(AFourLightSelector_BP_C, Time_Length) == 0x000274, "Member 'AFourLightSelector_BP_C::Time_Length' has a wrong offset!");
static_assert(offsetof(AFourLightSelector_BP_C, LightOn) == 0x000278, "Member 'AFourLightSelector_BP_C::LightOn' has a wrong offset!");

}

