#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendInviteHudWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FriendInviteHudWidget.FriendInviteHudWidget_C
// 0x0028 (0x0300 - 0x02D8)
class UFriendInviteHudWidget_C final : public URBFriendInviteNotificationUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonNotificationWidget_C*            CommonNotificationWidget;                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalTime;                                         // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FriendInviteHudWidget(int32 EntryPoint);
	void BndEvt__FriendInviteHudWidget_CommonNotificationWidget_K2Node_ComponentBoundEvent_2_OnDeclinedButtonClicked__DelegateSignature();
	void BndEvt__FriendInviteHudWidget_CommonNotificationWidget_K2Node_ComponentBoundEvent_1_OnAcceptedButtonClicked__DelegateSignature();
	void BndEvt__FriendInviteHudWidget_CommonNotificationWidget_K2Node_ComponentBoundEvent_0_OnBlockButtonClicked__DelegateSignature();
	void Event_Blocked();
	void Event_Refused();
	void Event_Accepted();
	void Event_Hide();
	void Event_UpdateDisplayTime(float DisplayTime, float Param_TotalDisplayTime);
	void Event_Show();
	void Finished_26B0BE55452502A8206556BB17217B15();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FriendInviteHudWidget_C">();
	}
	static class UFriendInviteHudWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFriendInviteHudWidget_C>();
	}
};
static_assert(alignof(UFriendInviteHudWidget_C) == 0x000008, "Wrong alignment on UFriendInviteHudWidget_C");
static_assert(sizeof(UFriendInviteHudWidget_C) == 0x000300, "Wrong size on UFriendInviteHudWidget_C");
static_assert(offsetof(UFriendInviteHudWidget_C, UberGraphFrame) == 0x0002D8, "Member 'UFriendInviteHudWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFriendInviteHudWidget_C, HideAnim) == 0x0002E0, "Member 'UFriendInviteHudWidget_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UFriendInviteHudWidget_C, ShowAnim) == 0x0002E8, "Member 'UFriendInviteHudWidget_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UFriendInviteHudWidget_C, CommonNotificationWidget) == 0x0002F0, "Member 'UFriendInviteHudWidget_C::CommonNotificationWidget' has a wrong offset!");
static_assert(offsetof(UFriendInviteHudWidget_C, CurrentTime) == 0x0002F8, "Member 'UFriendInviteHudWidget_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(UFriendInviteHudWidget_C, TotalTime) == 0x0002FC, "Member 'UFriendInviteHudWidget_C::TotalTime' has a wrong offset!");

}

