#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendInviteHudWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FriendInviteHudWidget.FriendInviteHudWidget_C.ExecuteUbergraph_FriendInviteHudWidget
// 0x00C8 (0x00C8 - 0x0000)
struct FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_displayTime;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_totalDisplayTime;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_307A[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_307B[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_307C[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B0(0x0018)()
};
static_assert(alignof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget) == 0x000008, "Wrong alignment on FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget");
static_assert(sizeof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget) == 0x0000C8, "Wrong size on FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget");
static_assert(offsetof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget, EntryPoint) == 0x000000, "Member 'FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget, K2Node_Event_displayTime) == 0x000004, "Member 'FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget::K2Node_Event_displayTime' has a wrong offset!");
static_assert(offsetof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget, K2Node_Event_totalDisplayTime) == 0x000008, "Member 'FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget::K2Node_Event_totalDisplayTime' has a wrong offset!");
static_assert(offsetof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000020, "Member 'FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000028, "Member 'FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget, K2Node_MakeArray_Array) == 0x0000A0, "Member 'FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget, CallFunc_Format_ReturnValue) == 0x0000B0, "Member 'FriendInviteHudWidget_C_ExecuteUbergraph_FriendInviteHudWidget::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function FriendInviteHudWidget.FriendInviteHudWidget_C.Event_UpdateDisplayTime
// 0x0008 (0x0008 - 0x0000)
struct FriendInviteHudWidget_C_Event_UpdateDisplayTime final
{
public:
	float                                         DisplayTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_TotalDisplayTime;                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FriendInviteHudWidget_C_Event_UpdateDisplayTime) == 0x000004, "Wrong alignment on FriendInviteHudWidget_C_Event_UpdateDisplayTime");
static_assert(sizeof(FriendInviteHudWidget_C_Event_UpdateDisplayTime) == 0x000008, "Wrong size on FriendInviteHudWidget_C_Event_UpdateDisplayTime");
static_assert(offsetof(FriendInviteHudWidget_C_Event_UpdateDisplayTime, DisplayTime) == 0x000000, "Member 'FriendInviteHudWidget_C_Event_UpdateDisplayTime::DisplayTime' has a wrong offset!");
static_assert(offsetof(FriendInviteHudWidget_C_Event_UpdateDisplayTime, Param_TotalDisplayTime) == 0x000004, "Member 'FriendInviteHudWidget_C_Event_UpdateDisplayTime::Param_TotalDisplayTime' has a wrong offset!");

}

