#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendlyDeviceIcon

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FriendlyDeviceIcon.FriendlyDeviceIcon_C.ExecuteUbergraph_FriendlyDeviceIcon
// 0x0018 (0x0018 - 0x0000)
struct FriendlyDeviceIcon_C_ExecuteUbergraph_FriendlyDeviceIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FriendlyDeviceIcon_C_ExecuteUbergraph_FriendlyDeviceIcon) == 0x000008, "Wrong alignment on FriendlyDeviceIcon_C_ExecuteUbergraph_FriendlyDeviceIcon");
static_assert(sizeof(FriendlyDeviceIcon_C_ExecuteUbergraph_FriendlyDeviceIcon) == 0x000018, "Wrong size on FriendlyDeviceIcon_C_ExecuteUbergraph_FriendlyDeviceIcon");
static_assert(offsetof(FriendlyDeviceIcon_C_ExecuteUbergraph_FriendlyDeviceIcon, EntryPoint) == 0x000000, "Member 'FriendlyDeviceIcon_C_ExecuteUbergraph_FriendlyDeviceIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(FriendlyDeviceIcon_C_ExecuteUbergraph_FriendlyDeviceIcon, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'FriendlyDeviceIcon_C_ExecuteUbergraph_FriendlyDeviceIcon::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendlyDeviceIcon_C_ExecuteUbergraph_FriendlyDeviceIcon, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'FriendlyDeviceIcon_C_ExecuteUbergraph_FriendlyDeviceIcon::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function FriendlyDeviceIcon.FriendlyDeviceIcon_C.Event_DrawHudUpdate
// 0x0070 (0x0070 - 0x0000)
struct FriendlyDeviceIcon_C_Event_DrawHudUpdate final
{
public:
	struct FRBWorldIconUpdateContext              UpdateContext;                                     // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetHUDOpacity_ReturnValue;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FriendlyDeviceIcon_C_Event_DrawHudUpdate) == 0x000008, "Wrong alignment on FriendlyDeviceIcon_C_Event_DrawHudUpdate");
static_assert(sizeof(FriendlyDeviceIcon_C_Event_DrawHudUpdate) == 0x000070, "Wrong size on FriendlyDeviceIcon_C_Event_DrawHudUpdate");
static_assert(offsetof(FriendlyDeviceIcon_C_Event_DrawHudUpdate, UpdateContext) == 0x000000, "Member 'FriendlyDeviceIcon_C_Event_DrawHudUpdate::UpdateContext' has a wrong offset!");
static_assert(offsetof(FriendlyDeviceIcon_C_Event_DrawHudUpdate, CallFunc_GetHUDOpacity_ReturnValue) == 0x000060, "Member 'FriendlyDeviceIcon_C_Event_DrawHudUpdate::CallFunc_GetHUDOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendlyDeviceIcon_C_Event_DrawHudUpdate, CallFunc_MapRangeClamped_ReturnValue) == 0x000064, "Member 'FriendlyDeviceIcon_C_Event_DrawHudUpdate::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendlyDeviceIcon_C_Event_DrawHudUpdate, CallFunc_MakeVector2D_ReturnValue) == 0x000068, "Member 'FriendlyDeviceIcon_C_Event_DrawHudUpdate::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function FriendlyDeviceIcon.FriendlyDeviceIcon_C.ShouldShow
// 0x0003 (0x0003 - 0x0000)
struct FriendlyDeviceIcon_C_ShouldShow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FriendlyDeviceIcon_C_ShouldShow) == 0x000001, "Wrong alignment on FriendlyDeviceIcon_C_ShouldShow");
static_assert(sizeof(FriendlyDeviceIcon_C_ShouldShow) == 0x000003, "Wrong size on FriendlyDeviceIcon_C_ShouldShow");
static_assert(offsetof(FriendlyDeviceIcon_C_ShouldShow, ReturnValue) == 0x000000, "Member 'FriendlyDeviceIcon_C_ShouldShow::ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendlyDeviceIcon_C_ShouldShow, CallFunc_Less_FloatFloat_ReturnValue) == 0x000001, "Member 'FriendlyDeviceIcon_C_ShouldShow::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FriendlyDeviceIcon_C_ShouldShow, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'FriendlyDeviceIcon_C_ShouldShow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

