#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Futterman_Drill

#include "Basic.hpp"


namespace SDK::Params
{

// Function Futterman_Drill.Futterman_Drill_C.Received_NotifyBegin
// 0x0020 (0x0020 - 0x0000)
struct Futterman_Drill_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimDeltaTime;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSetFuttermanDrillVariable_Result;    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Futterman_Drill_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on Futterman_Drill_C_Received_NotifyBegin");
static_assert(sizeof(Futterman_Drill_C_Received_NotifyBegin) == 0x000020, "Wrong size on Futterman_Drill_C_Received_NotifyBegin");
static_assert(offsetof(Futterman_Drill_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'Futterman_Drill_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'Futterman_Drill_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_Received_NotifyBegin, AnimDeltaTime) == 0x000010, "Member 'Futterman_Drill_C_Received_NotifyBegin::AnimDeltaTime' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_Received_NotifyBegin, TotalDuration) == 0x000014, "Member 'Futterman_Drill_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_Received_NotifyBegin, ReturnValue) == 0x000018, "Member 'Futterman_Drill_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_Received_NotifyBegin, CallFunc_TryToSetFuttermanDrillVariable_Result) == 0x000019, "Member 'Futterman_Drill_C_Received_NotifyBegin::CallFunc_TryToSetFuttermanDrillVariable_Result' has a wrong offset!");

// Function Futterman_Drill.Futterman_Drill_C.Received_NotifyEnd
// 0x0018 (0x0018 - 0x0000)
struct Futterman_Drill_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimDeltaTime;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryToSetFuttermanDrillVariable_Result;    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Futterman_Drill_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on Futterman_Drill_C_Received_NotifyEnd");
static_assert(sizeof(Futterman_Drill_C_Received_NotifyEnd) == 0x000018, "Wrong size on Futterman_Drill_C_Received_NotifyEnd");
static_assert(offsetof(Futterman_Drill_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'Futterman_Drill_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'Futterman_Drill_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_Received_NotifyEnd, AnimDeltaTime) == 0x000010, "Member 'Futterman_Drill_C_Received_NotifyEnd::AnimDeltaTime' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_Received_NotifyEnd, ReturnValue) == 0x000014, "Member 'Futterman_Drill_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_Received_NotifyEnd, CallFunc_TryToSetFuttermanDrillVariable_Result) == 0x000015, "Member 'Futterman_Drill_C_Received_NotifyEnd::CallFunc_TryToSetFuttermanDrillVariable_Result' has a wrong offset!");

// Function Futterman_Drill.Futterman_Drill_C.TryToSetFuttermanDrillVariable
// 0x0038 (0x0038 - 0x0000)
struct Futterman_Drill_C_TryToSetFuttermanDrillVariable final
{
public:
	class USkeletalMeshComponent*                 Mesh_Comp;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Drill_Value;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_DrillManual;                                 // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Result;                                            // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30A2[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30A3[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFuttermanOwner_Interface_BP_C> K2Node_DynamicCast_AsFutterman_Owner_Interface_BP; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFuttermanDrillValue_Success;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Futterman_Drill_C_TryToSetFuttermanDrillVariable) == 0x000008, "Wrong alignment on Futterman_Drill_C_TryToSetFuttermanDrillVariable");
static_assert(sizeof(Futterman_Drill_C_TryToSetFuttermanDrillVariable) == 0x000038, "Wrong size on Futterman_Drill_C_TryToSetFuttermanDrillVariable");
static_assert(offsetof(Futterman_Drill_C_TryToSetFuttermanDrillVariable, Mesh_Comp) == 0x000000, "Member 'Futterman_Drill_C_TryToSetFuttermanDrillVariable::Mesh_Comp' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_TryToSetFuttermanDrillVariable, Drill_Value) == 0x000008, "Member 'Futterman_Drill_C_TryToSetFuttermanDrillVariable::Drill_Value' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_TryToSetFuttermanDrillVariable, Param_DrillManual) == 0x000009, "Member 'Futterman_Drill_C_TryToSetFuttermanDrillVariable::Param_DrillManual' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_TryToSetFuttermanDrillVariable, Result) == 0x00000A, "Member 'Futterman_Drill_C_TryToSetFuttermanDrillVariable::Result' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_TryToSetFuttermanDrillVariable, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'Futterman_Drill_C_TryToSetFuttermanDrillVariable::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_TryToSetFuttermanDrillVariable, CallFunc_DoesImplementInterface_ReturnValue) == 0x000018, "Member 'Futterman_Drill_C_TryToSetFuttermanDrillVariable::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_TryToSetFuttermanDrillVariable, K2Node_DynamicCast_AsFutterman_Owner_Interface_BP) == 0x000020, "Member 'Futterman_Drill_C_TryToSetFuttermanDrillVariable::K2Node_DynamicCast_AsFutterman_Owner_Interface_BP' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_TryToSetFuttermanDrillVariable, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Futterman_Drill_C_TryToSetFuttermanDrillVariable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Futterman_Drill_C_TryToSetFuttermanDrillVariable, CallFunc_SetFuttermanDrillValue_Success) == 0x000031, "Member 'Futterman_Drill_C_TryToSetFuttermanDrillVariable::CallFunc_SetFuttermanDrillValue_Success' has a wrong offset!");

// Function Futterman_Drill.Futterman_Drill_C.GetNotifyName
// 0x0010 (0x0010 - 0x0000)
struct Futterman_Drill_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Futterman_Drill_C_GetNotifyName) == 0x000008, "Wrong alignment on Futterman_Drill_C_GetNotifyName");
static_assert(sizeof(Futterman_Drill_C_GetNotifyName) == 0x000010, "Wrong size on Futterman_Drill_C_GetNotifyName");
static_assert(offsetof(Futterman_Drill_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'Futterman_Drill_C_GetNotifyName::ReturnValue' has a wrong offset!");

}

