#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GasCanister_NonPickable_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Base_NonPickable_RBPickup_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GasCanister_NonPickable_BP.GasCanister_NonPickable_BP_C
// 0x0070 (0x0AF0 - 0x0A80)
class AGasCanister_NonPickable_BP_C final : public ABase_NonPickable_RBPickup_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Ngr_Gas_NegY;                                      // 0x0A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_Gas_NegX;                                      // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_Gas_PosZ;                                      // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_Gas_PosX;                                      // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_Gas_PosY;                                      // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      SoundComponent;                                    // 0x0AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBPropOptimizerComponent*              RBPropOptimizer;                                   // 0x0AB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FX_Dummy;                                          // 0x0AB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         GasClearanceTestRadius;                            // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GasClearanceTestDistance;                          // 0x0AC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForwardTested;                                    // 0x0AC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bForwardClear;                                     // 0x0AC9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bLeftTested;                                       // 0x0ACA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bLeftClear;                                        // 0x0ACB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bRightClear;                                       // 0x0ACC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bRightTested;                                      // 0x0ACD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bBackwardTested;                                   // 0x0ACE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bBackwardClear;                                    // 0x0ACF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bUpTested;                                         // 0x0AD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bUpClear;                                          // 0x0AD1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD2[0x2];                                      // 0x0AD2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GasClearanceTestOffset;                            // 0x0AD4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTriggered;                                        // 0x0AE0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_GasCanister_NonPickable_BP(int32 EntryPoint);
	void Untrigger();
	void Trigger();
	void BndEvt__GasCanister_NonPickable_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature(bool bEnabled);
	void OnWorldPopulateFinished();
	void OnWorldFullyLoaded();
	void TestGasDirection(const struct FVector& Direction, bool* bClear);
	void OnRep_bTriggered();
	void RefreshVFXActive();
	bool OnWorldPopulateFinishedTimeSliced();

	bool IsTriggered() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GasCanister_NonPickable_BP_C">();
	}
	static class AGasCanister_NonPickable_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGasCanister_NonPickable_BP_C>();
	}
};
static_assert(alignof(AGasCanister_NonPickable_BP_C) == 0x000010, "Wrong alignment on AGasCanister_NonPickable_BP_C");
static_assert(sizeof(AGasCanister_NonPickable_BP_C) == 0x000AF0, "Wrong size on AGasCanister_NonPickable_BP_C");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, UberGraphFrame) == 0x000A78, "Member 'AGasCanister_NonPickable_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, Ngr_Gas_NegY) == 0x000A80, "Member 'AGasCanister_NonPickable_BP_C::Ngr_Gas_NegY' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, Ngr_Gas_NegX) == 0x000A88, "Member 'AGasCanister_NonPickable_BP_C::Ngr_Gas_NegX' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, Ngr_Gas_PosZ) == 0x000A90, "Member 'AGasCanister_NonPickable_BP_C::Ngr_Gas_PosZ' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, Ngr_Gas_PosX) == 0x000A98, "Member 'AGasCanister_NonPickable_BP_C::Ngr_Gas_PosX' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, Ngr_Gas_PosY) == 0x000AA0, "Member 'AGasCanister_NonPickable_BP_C::Ngr_Gas_PosY' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, SoundComponent) == 0x000AA8, "Member 'AGasCanister_NonPickable_BP_C::SoundComponent' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, RBPropOptimizer) == 0x000AB0, "Member 'AGasCanister_NonPickable_BP_C::RBPropOptimizer' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, FX_Dummy) == 0x000AB8, "Member 'AGasCanister_NonPickable_BP_C::FX_Dummy' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, GasClearanceTestRadius) == 0x000AC0, "Member 'AGasCanister_NonPickable_BP_C::GasClearanceTestRadius' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, GasClearanceTestDistance) == 0x000AC4, "Member 'AGasCanister_NonPickable_BP_C::GasClearanceTestDistance' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, bForwardTested) == 0x000AC8, "Member 'AGasCanister_NonPickable_BP_C::bForwardTested' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, bForwardClear) == 0x000AC9, "Member 'AGasCanister_NonPickable_BP_C::bForwardClear' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, bLeftTested) == 0x000ACA, "Member 'AGasCanister_NonPickable_BP_C::bLeftTested' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, bLeftClear) == 0x000ACB, "Member 'AGasCanister_NonPickable_BP_C::bLeftClear' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, bRightClear) == 0x000ACC, "Member 'AGasCanister_NonPickable_BP_C::bRightClear' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, bRightTested) == 0x000ACD, "Member 'AGasCanister_NonPickable_BP_C::bRightTested' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, bBackwardTested) == 0x000ACE, "Member 'AGasCanister_NonPickable_BP_C::bBackwardTested' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, bBackwardClear) == 0x000ACF, "Member 'AGasCanister_NonPickable_BP_C::bBackwardClear' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, bUpTested) == 0x000AD0, "Member 'AGasCanister_NonPickable_BP_C::bUpTested' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, bUpClear) == 0x000AD1, "Member 'AGasCanister_NonPickable_BP_C::bUpClear' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, GasClearanceTestOffset) == 0x000AD4, "Member 'AGasCanister_NonPickable_BP_C::GasClearanceTestOffset' has a wrong offset!");
static_assert(offsetof(AGasCanister_NonPickable_BP_C, bTriggered) == 0x000AE0, "Member 'AGasCanister_NonPickable_BP_C::bTriggered' has a wrong offset!");

}

