#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GlobalOverlayGroupStatusEntryWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function GlobalOverlayGroupStatusEntryWidget.GlobalOverlayGroupStatusEntryWidget_C.ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget
// 0x0088 (0x0088 - 0x0000)
struct GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelf_ReturnValue;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_307D[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_307E[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxDisplayNameLength_ReturnValue;      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FormatPlayerDisplayName_formatedDisplayName; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	class FString                                 CallFunc_FormatPlayerDisplayName_formatedDisplayName_1; // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpeaking_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_307F[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0068(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget) == 0x000008, "Wrong alignment on GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget");
static_assert(sizeof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget) == 0x000088, "Wrong size on GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, EntryPoint) == 0x000000, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, CallFunc_IsSelf_ReturnValue) == 0x000004, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::CallFunc_IsSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, Temp_bool_Variable) == 0x000005, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, Temp_byte_Variable) == 0x000007, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, Temp_byte_Variable_1) == 0x000008, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, K2Node_Event_IsDesignTime) == 0x000020, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, CallFunc_GetMaxDisplayNameLength_ReturnValue) == 0x000024, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::CallFunc_GetMaxDisplayNameLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, CallFunc_FormatPlayerDisplayName_formatedDisplayName) == 0x000028, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::CallFunc_FormatPlayerDisplayName_formatedDisplayName' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, CallFunc_FormatPlayerDisplayName_formatedDisplayName_1) == 0x000050, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::CallFunc_FormatPlayerDisplayName_formatedDisplayName_1' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, CallFunc_IsSpeaking_ReturnValue) == 0x000060, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::CallFunc_IsSpeaking_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000068, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, CallFunc_BooleanAND_ReturnValue) == 0x000080, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget, K2Node_Select_Default) == 0x000081, "Member 'GlobalOverlayGroupStatusEntryWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget::K2Node_Select_Default' has a wrong offset!");

// Function GlobalOverlayGroupStatusEntryWidget.GlobalOverlayGroupStatusEntryWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct GlobalOverlayGroupStatusEntryWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GlobalOverlayGroupStatusEntryWidget_C_PreConstruct) == 0x000001, "Wrong alignment on GlobalOverlayGroupStatusEntryWidget_C_PreConstruct");
static_assert(sizeof(GlobalOverlayGroupStatusEntryWidget_C_PreConstruct) == 0x000001, "Wrong size on GlobalOverlayGroupStatusEntryWidget_C_PreConstruct");
static_assert(offsetof(GlobalOverlayGroupStatusEntryWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'GlobalOverlayGroupStatusEntryWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

