#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GlobalOverlayGroupStatusWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function GlobalOverlayGroupStatusWidget.GlobalOverlayGroupStatusWidget_C.ExecuteUbergraph_GlobalOverlayGroupStatusWidget
// 0x0070 (0x0070 - 0x0000)
struct GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EBA[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EBB[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EBC[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EBD[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URBGroupStatusEntryWidget*>      CallFunc_GetEntries_ReturnValue;                   // 0x0038(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class URBGroupStatusEntryWidget*              CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGroupStatusEntryWidget*              CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget) == 0x000008, "Wrong alignment on GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget");
static_assert(sizeof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget) == 0x000070, "Wrong size on GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, EntryPoint) == 0x000000, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, Temp_int_Array_Index_Variable) == 0x000020, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, K2Node_Event_IsDesignTime) == 0x000024, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, Temp_int_Variable) == 0x000028, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, CallFunc_GetEntries_ReturnValue) == 0x000038, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::CallFunc_GetEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, CallFunc_Array_Get_Item) == 0x000048, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, CallFunc_Create_ReturnValue) == 0x000050, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000058, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000060, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'GlobalOverlayGroupStatusWidget_C_ExecuteUbergraph_GlobalOverlayGroupStatusWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GlobalOverlayGroupStatusWidget.GlobalOverlayGroupStatusWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct GlobalOverlayGroupStatusWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GlobalOverlayGroupStatusWidget_C_PreConstruct) == 0x000001, "Wrong alignment on GlobalOverlayGroupStatusWidget_C_PreConstruct");
static_assert(sizeof(GlobalOverlayGroupStatusWidget_C_PreConstruct) == 0x000001, "Wrong size on GlobalOverlayGroupStatusWidget_C_PreConstruct");
static_assert(offsetof(GlobalOverlayGroupStatusWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'GlobalOverlayGroupStatusWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

