#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GroupStatusWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function GroupStatusWidget.GroupStatusWidget_C.ExecuteUbergraph_GroupStatusWidget
// 0x0148 (0x0148 - 0x0000)
struct GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ARBPlayerState* RBPlayerState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_306E[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_306F[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URBGroupStatusEntryWidget*>      CallFunc_GetEntries_ReturnValue;                   // 0x0048(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class URBGroupStatusEntryWidget*              CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGroupStatusEntryWidget*              CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayerState*                         CallFunc_GetPlayerState_ReturnValue;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3070[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class URBGroupStatusEntryWidget*              CallFunc_Create_ReturnValue_1;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_2;      // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              CallFunc_GetWatchedPlayer_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3071[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetRBPlayerState_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3072[0x5];                                     // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_Event_oldPlayer;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_Event_newPlayer;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3073[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetRBPlayerState_ReturnValue_1;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3074[0x6];                                     // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetRBPlayerState_ReturnValue_2;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3075[0x2];                                     // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3076[0x2];                                     // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayerState*                         K2Node_CustomEvent_rbPlayerState;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget) == 0x000008, "Wrong alignment on GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget");
static_assert(sizeof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget) == 0x000148, "Wrong size on GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, EntryPoint) == 0x000000, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, Temp_int_Array_Index_Variable) == 0x000024, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, Temp_byte_Variable) == 0x000028, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, Temp_bool_Variable) == 0x000029, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, K2Node_MakeStruct_Margin) == 0x00002C, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, K2Node_Event_IsDesignTime) == 0x000044, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_GetEntries_ReturnValue) == 0x000048, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_GetEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_Array_Get_Item) == 0x000058, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_Create_ReturnValue) == 0x000060, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000068, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000070, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_GetPlayerState_ReturnValue) == 0x000078, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, K2Node_MakeStruct_Margin_1) == 0x000088, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, K2Node_MakeStruct_Margin_2) == 0x000098, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_Create_ReturnValue_1) == 0x0000A8, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_AddChildToVerticalBox_ReturnValue_2) == 0x0000B0, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_AddChildToVerticalBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_GetWatchedPlayer_ReturnValue) == 0x0000B8, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_GetWatchedPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_GetRBPlayerState_ReturnValue) == 0x0000C8, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_GetRBPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_IsValid_ReturnValue_1) == 0x0000D0, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000D1, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, Temp_byte_Variable_1) == 0x0000D2, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, K2Node_Event_oldPlayer) == 0x0000D8, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::K2Node_Event_oldPlayer' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, K2Node_Event_newPlayer) == 0x0000E0, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::K2Node_Event_newPlayer' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_IsValid_ReturnValue_2) == 0x0000E8, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_GetRBPlayerState_ReturnValue_1) == 0x0000F0, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_GetRBPlayerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_IsValid_ReturnValue_3) == 0x0000F8, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_IsValid_ReturnValue_4) == 0x0000F9, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_GetRBPlayerState_ReturnValue_2) == 0x000100, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_GetRBPlayerState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_IsValid_ReturnValue_5) == 0x000108, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_BooleanOR_ReturnValue) == 0x000109, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, Temp_int_Variable) == 0x00010C, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, K2Node_Select_Default) == 0x000110, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000111, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000114, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, K2Node_CustomEvent_rbPlayerState) == 0x000118, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::K2Node_CustomEvent_rbPlayerState' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_SelectFloat_ReturnValue) == 0x000120, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_SelectFloat_ReturnValue_1) == 0x000124, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_GetMenuManager_ReturnValue) == 0x000128, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000130, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000138, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000140, "Member 'GroupStatusWidget_C_ExecuteUbergraph_GroupStatusWidget::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");

// Function GroupStatusWidget.GroupStatusWidget_C.OnPlayerPartyStateUpdated
// 0x0008 (0x0008 - 0x0000)
struct GroupStatusWidget_C_OnPlayerPartyStateUpdated final
{
public:
	class ARBPlayerState*                         RBPlayerState;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GroupStatusWidget_C_OnPlayerPartyStateUpdated) == 0x000008, "Wrong alignment on GroupStatusWidget_C_OnPlayerPartyStateUpdated");
static_assert(sizeof(GroupStatusWidget_C_OnPlayerPartyStateUpdated) == 0x000008, "Wrong size on GroupStatusWidget_C_OnPlayerPartyStateUpdated");
static_assert(offsetof(GroupStatusWidget_C_OnPlayerPartyStateUpdated, RBPlayerState) == 0x000000, "Member 'GroupStatusWidget_C_OnPlayerPartyStateUpdated::RBPlayerState' has a wrong offset!");

// Function GroupStatusWidget.GroupStatusWidget_C.Event_OnWatchedPlayerChanged
// 0x0010 (0x0010 - 0x0000)
struct GroupStatusWidget_C_Event_OnWatchedPlayerChanged final
{
public:
	class ARBPlayer*                              OldPlayer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              NewPlayer;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GroupStatusWidget_C_Event_OnWatchedPlayerChanged) == 0x000008, "Wrong alignment on GroupStatusWidget_C_Event_OnWatchedPlayerChanged");
static_assert(sizeof(GroupStatusWidget_C_Event_OnWatchedPlayerChanged) == 0x000010, "Wrong size on GroupStatusWidget_C_Event_OnWatchedPlayerChanged");
static_assert(offsetof(GroupStatusWidget_C_Event_OnWatchedPlayerChanged, OldPlayer) == 0x000000, "Member 'GroupStatusWidget_C_Event_OnWatchedPlayerChanged::OldPlayer' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_Event_OnWatchedPlayerChanged, NewPlayer) == 0x000008, "Member 'GroupStatusWidget_C_Event_OnWatchedPlayerChanged::NewPlayer' has a wrong offset!");

// Function GroupStatusWidget.GroupStatusWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct GroupStatusWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GroupStatusWidget_C_PreConstruct) == 0x000001, "Wrong alignment on GroupStatusWidget_C_PreConstruct");
static_assert(sizeof(GroupStatusWidget_C_PreConstruct) == 0x000001, "Wrong size on GroupStatusWidget_C_PreConstruct");
static_assert(offsetof(GroupStatusWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'GroupStatusWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function GroupStatusWidget.GroupStatusWidget_C.ShouldShow
// 0x0040 (0x0040 - 0x0000)
struct GroupStatusWidget_C_ShouldShow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          bLoadoutRecapDisplayed;                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3077[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLobbyPlayerController*               CallFunc_GetLocalLobbyPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckFeatureSwitch_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3078[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGameUserPreferences*                 CallFunc_GetRBGameUserPreferences_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGroupStatusSelfEntryWidget_C*          K2Node_DynamicCast_AsGroup_Status_Self_Entry_Widget; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3079[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeammateStatusHUDDisplay_ReturnValue;  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldShow_ReturnValue;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GroupStatusWidget_C_ShouldShow) == 0x000008, "Wrong alignment on GroupStatusWidget_C_ShouldShow");
static_assert(sizeof(GroupStatusWidget_C_ShouldShow) == 0x000040, "Wrong size on GroupStatusWidget_C_ShouldShow");
static_assert(offsetof(GroupStatusWidget_C_ShouldShow, ReturnValue) == 0x000000, "Member 'GroupStatusWidget_C_ShouldShow::ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ShouldShow, bLoadoutRecapDisplayed) == 0x000001, "Member 'GroupStatusWidget_C_ShouldShow::bLoadoutRecapDisplayed' has a wrong offset!");
static_assert(offsetof(GroupStatusWidget_C_ShouldShow, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'GroupStatusWidget_C_ShouldShow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
