#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GroupStatusSelfEntryWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function GroupStatusSelfEntryWidget.GroupStatusSelfEntryWidget_C.ExecuteUbergraph_GroupStatusSelfEntryWidget
// 0x00C0 (0x00C0 - 0x0000)
struct GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxDisplayNameLength_ReturnValue;      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FormatPlayerDisplayName_formatedDisplayName; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	class FString                                 CallFunc_FormatPlayerDisplayName_formatedDisplayName_1; // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0060(0x0018)()
	bool                                          CallFunc_IsPartyOwner_ReturnValue;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpeaking_ReturnValue;                   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGloballyMuted_ReturnValue;              // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMuted_ReturnValue;                      // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBlocked_ReturnValue;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasVoiceChatEnabled_ReturnValue;          // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVoiceChatConnected_ReturnValue;         // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetPlayerState_ReturnValue;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_HasAcquiredActiveSkill_ReturnValue;    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBSAS*                                 CallFunc_GetCurrentSAS_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget) == 0x000008, "Wrong alignment on GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget");
static_assert(sizeof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget) == 0x0000C0, "Wrong size on GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, EntryPoint) == 0x000000, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, Temp_byte_Variable) == 0x000004, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, Temp_byte_Variable_1) == 0x000005, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, Temp_bool_Variable) == 0x000006, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, Temp_byte_Variable_2) == 0x000007, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, Temp_byte_Variable_3) == 0x000008, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, Temp_bool_Variable_1) == 0x000009, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, K2Node_Event_IsDesignTime) == 0x000020, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_GetMaxDisplayNameLength_ReturnValue) == 0x000024, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_GetMaxDisplayNameLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_FormatPlayerDisplayName_formatedDisplayName) == 0x000028, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_FormatPlayerDisplayName_formatedDisplayName' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_FormatPlayerDisplayName_formatedDisplayName_1) == 0x000050, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_FormatPlayerDisplayName_formatedDisplayName_1' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000060, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_IsPartyOwner_ReturnValue) == 0x000078, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_IsPartyOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000080, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, K2Node_Select_Default) == 0x000088, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_IsSpeaking_ReturnValue) == 0x000089, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_IsSpeaking_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_IsGloballyMuted_ReturnValue) == 0x00008A, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_IsGloballyMuted_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_IsMuted_ReturnValue) == 0x00008B, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_IsMuted_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_IsBlocked_ReturnValue) == 0x00008C, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_IsBlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_BooleanOR_ReturnValue) == 0x00008D, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_HasVoiceChatEnabled_ReturnValue) == 0x00008E, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_HasVoiceChatEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_IsVoiceChatConnected_ReturnValue) == 0x00008F, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_IsVoiceChatConnected_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_BooleanAND_ReturnValue) == 0x000090, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, K2Node_Select_Default_1) == 0x000091, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_GetPlayerState_ReturnValue) == 0x000098, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_GetRBGameStateLobby_ReturnValue) == 0x0000A0, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_GetRBGameStateLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_IsValid_ReturnValue_1) == 0x0000A9, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_BP_HasAcquiredActiveSkill_ReturnValue) == 0x0000AA, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_BP_HasAcquiredActiveSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_GetCurrentSAS_ReturnValue) == 0x0000B0, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_GetCurrentSAS_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_IsValid_ReturnValue_2) == 0x0000B8, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B9, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000BA, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget, CallFunc_BooleanOR_ReturnValue_1) == 0x0000BB, "Member 'GroupStatusSelfEntryWidget_C_ExecuteUbergraph_GroupStatusSelfEntryWidget::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function GroupStatusSelfEntryWidget.GroupStatusSelfEntryWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct GroupStatusSelfEntryWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GroupStatusSelfEntryWidget_C_PreConstruct) == 0x000001, "Wrong alignment on GroupStatusSelfEntryWidget_C_PreConstruct");
static_assert(sizeof(GroupStatusSelfEntryWidget_C_PreConstruct) == 0x000001, "Wrong size on GroupStatusSelfEntryWidget_C_PreConstruct");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'GroupStatusSelfEntryWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function GroupStatusSelfEntryWidget.GroupStatusSelfEntryWidget_C.SetupCharacterClass
// 0x00A8 (0x00A8 - 0x0000)
struct GroupStatusSelfEntryWidget_C_SetupCharacterClass final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	EActiveSkillType                              CallFunc_GetActiveSkillType_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveSkillCommonParams               CallFunc_GetActiveSkillCommonParams_ReturnValue;   // 0x0030(0x0078)(ConstParm)
};
static_assert(alignof(GroupStatusSelfEntryWidget_C_SetupCharacterClass) == 0x000008, "Wrong alignment on GroupStatusSelfEntryWidget_C_SetupCharacterClass");
static_assert(sizeof(GroupStatusSelfEntryWidget_C_SetupCharacterClass) == 0x0000A8, "Wrong size on GroupStatusSelfEntryWidget_C_SetupCharacterClass");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_SetupCharacterClass, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'GroupStatusSelfEntryWidget_C_SetupCharacterClass::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_SetupCharacterClass, CallFunc_GetActiveSkillType_ReturnValue) == 0x000028, "Member 'GroupStatusSelfEntryWidget_C_SetupCharacterClass::CallFunc_GetActiveSkillType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_SetupCharacterClass, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'GroupStatusSelfEntryWidget_C_SetupCharacterClass::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GroupStatusSelfEntryWidget_C_SetupCharacterClass, CallFunc_GetActiveSkillCommonParams_ReturnValue) == 0x000030, "Member 'GroupStatusSelfEntryWidget_C_SetupCharacterClass::CallFunc_GetActiveSkillCommonParams_ReturnValue' has a wrong offset!");

}

