#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealthBar6_Animated

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HealthBar6_Animated.HealthBar6_Animated_C
// 0x00B0 (0x0398 - 0x02E8)
class UHealthBar6_Animated_C final : public URBHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SlideInFifthBar;                                   // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInStatus;                                      // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInFadeOut;                                     // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInBar;                                         // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHudBarElement_Animated_C*              FifthBracket;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHudBarElement_Animated_C*              FirstBracket;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHudBarElement_Animated_C*              FourthBracket;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HealthBar;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_69;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerStatus_C*                        PlayerStatus;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHudBarElement_Animated_C*              SecondBracket;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               StatusBox;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHudBarElement_Animated_C*              ThirdBracket;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShouldShowEmpty;                                   // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D7D[0x3];                                     // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentHealth;                                     // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreviousHealth;                                    // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D7E[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               HealthBarMaterial;                                 // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHudBarElement_Animated_C*>      Brackets;                                          // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UHudBarElement_Animated_C*              CurrentAnimatedBracket;                            // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Starting_Bracket;                                  // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FinishingBracket;                                  // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasDown;                                           // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OngoingTweens;                                     // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D7F[0x2];                                     // 0x0392(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BleedingLeft;                                      // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HealthBar6_Animated(int32 EntryPoint);
	void OnBleedingLeftChanged(float NewBleedingLeft, float NewHealth);
	void Destruct();
	void Construct();
	void OnMaxHealthChanged(float MaxHealth);
	void OnAutoHealthRegenEnded();
	void OnPlayerIndicatorTypeChanged(EPlayerIndicatorType PlayerIndicatorType);
	void OnHealthUpdated(float NewHealth, bool bIncreased);
	void Event_OnWatchedPlayerChanged(class ARBPlayer* OldPlayer, class ARBPlayer* NewPlayer);
	void PreConstruct(bool IsDesignTime);
	void Event_Hide();
	void Event_Show();
	void ProcessHealthEvent(float NewHealth, bool Increased, bool SkipAnims);
	void ChainTweens();
	void ProcessPlayerStatusChange(EPlayerIndicatorType NewStatus);
	void InitHealthBars(bool AnimateShow);
	void UpdateFifthBarVisibility(bool Show, bool AnimateShow);
	void UpdateBracketValues();
	void ProcessBleedingChangedEvent(float NewBleedingLeft, float HealthValue);

	bool ShouldShow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HealthBar6_Animated_C">();
	}
	static class UHealthBar6_Animated_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHealthBar6_Animated_C>();
	}
};
static_assert(alignof(UHealthBar6_Animated_C) == 0x000008, "Wrong alignment on UHealthBar6_Animated_C");
static_assert(sizeof(UHealthBar6_Animated_C) == 0x000398, "Wrong size on UHealthBar6_Animated_C");
static_assert(offsetof(UHealthBar6_Animated_C, UberGraphFrame) == 0x0002E8, "Member 'UHealthBar6_Animated_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, SlideInFifthBar) == 0x0002F0, "Member 'UHealthBar6_Animated_C::SlideInFifthBar' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, FadeInStatus) == 0x0002F8, "Member 'UHealthBar6_Animated_C::FadeInStatus' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, FadeInFadeOut) == 0x000300, "Member 'UHealthBar6_Animated_C::FadeInFadeOut' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, FadeInBar) == 0x000308, "Member 'UHealthBar6_Animated_C::FadeInBar' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, FifthBracket) == 0x000310, "Member 'UHealthBar6_Animated_C::FifthBracket' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, FirstBracket) == 0x000318, "Member 'UHealthBar6_Animated_C::FirstBracket' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, FourthBracket) == 0x000320, "Member 'UHealthBar6_Animated_C::FourthBracket' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, HealthBar) == 0x000328, "Member 'UHealthBar6_Animated_C::HealthBar' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, Image_69) == 0x000330, "Member 'UHealthBar6_Animated_C::Image_69' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, PlayerStatus) == 0x000338, "Member 'UHealthBar6_Animated_C::PlayerStatus' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, SecondBracket) == 0x000340, "Member 'UHealthBar6_Animated_C::SecondBracket' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, StatusBox) == 0x000348, "Member 'UHealthBar6_Animated_C::StatusBox' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, ThirdBracket) == 0x000350, "Member 'UHealthBar6_Animated_C::ThirdBracket' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, ShouldShowEmpty) == 0x000358, "Member 'UHealthBar6_Animated_C::ShouldShowEmpty' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, CurrentHealth) == 0x00035C, "Member 'UHealthBar6_Animated_C::CurrentHealth' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, PreviousHealth) == 0x000360, "Member 'UHealthBar6_Animated_C::PreviousHealth' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, HealthBarMaterial) == 0x000368, "Member 'UHealthBar6_Animated_C::HealthBarMaterial' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, Brackets) == 0x000370, "Member 'UHealthBar6_Animated_C::Brackets' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, CurrentAnimatedBracket) == 0x000380, "Member 'UHealthBar6_Animated_C::CurrentAnimatedBracket' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, Starting_Bracket) == 0x000388, "Member 'UHealthBar6_Animated_C::Starting_Bracket' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, FinishingBracket) == 0x00038C, "Member 'UHealthBar6_Animated_C::FinishingBracket' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, WasDown) == 0x000390, "Member 'UHealthBar6_Animated_C::WasDown' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, OngoingTweens) == 0x000391, "Member 'UHealthBar6_Animated_C::OngoingTweens' has a wrong offset!");
static_assert(offsetof(UHealthBar6_Animated_C, BleedingLeft) == 0x000394, "Member 'UHealthBar6_Animated_C::BleedingLeft' has a wrong offset!");

}

