#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HudBarElement_Animated

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function HudBarElement_Animated.HudBarElement_Animated_C.ExecuteUbergraph_HudBarElement_Animated
// 0x00A0 (0x00A0 - 0x0000)
struct HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2B[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x001C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2C[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated) == 0x000008, "Wrong alignment on HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated");
static_assert(sizeof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated) == 0x0000A0, "Wrong size on HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, EntryPoint) == 0x000000, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::EntryPoint' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, Temp_bool_Variable) == 0x000006, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, Temp_name_Variable) == 0x000008, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, Temp_name_Variable_1) == 0x000010, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, Temp_bool_Variable_1) == 0x000018, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, Temp_byte_Variable) == 0x000019, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, Temp_byte_Variable_1) == 0x00001A, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, K2Node_Event_IsDesignTime) == 0x00001B, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, K2Node_Event_MyGeometry) == 0x00001C, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, K2Node_Event_InDeltaTime) == 0x000054, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, CallFunc_GetDisplayName_ReturnValue) == 0x000058, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, K2Node_Select_Default) == 0x000078, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, CallFunc_Conv_StringToName_ReturnValue) == 0x000080, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000088, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000090, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000098, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, CallFunc_Not_PreBool_ReturnValue_1) == 0x000099, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, CallFunc_BooleanAND_ReturnValue) == 0x00009A, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated, K2Node_Select_Default_1) == 0x00009B, "Member 'HudBarElement_Animated_C_ExecuteUbergraph_HudBarElement_Animated::K2Node_Select_Default_1' has a wrong offset!");

// Function HudBarElement_Animated.HudBarElement_Animated_C.Tick
// 0x003C (0x003C - 0x0000)
struct HudBarElement_Animated_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HudBarElement_Animated_C_Tick) == 0x000004, "Wrong alignment on HudBarElement_Animated_C_Tick");
static_assert(sizeof(HudBarElement_Animated_C_Tick) == 0x00003C, "Wrong size on HudBarElement_Animated_C_Tick");
static_assert(offsetof(HudBarElement_Animated_C_Tick, MyGeometry) == 0x000000, "Member 'HudBarElement_Animated_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_Tick, InDeltaTime) == 0x000038, "Member 'HudBarElement_Animated_C_Tick::InDeltaTime' has a wrong offset!");

// Function HudBarElement_Animated.HudBarElement_Animated_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct HudBarElement_Animated_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HudBarElement_Animated_C_PreConstruct) == 0x000001, "Wrong alignment on HudBarElement_Animated_C_PreConstruct");
static_assert(sizeof(HudBarElement_Animated_C_PreConstruct) == 0x000001, "Wrong size on HudBarElement_Animated_C_PreConstruct");
static_assert(offsetof(HudBarElement_Animated_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'HudBarElement_Animated_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function HudBarElement_Animated.HudBarElement_Animated_C.Setup Tints
// 0x0030 (0x0030 - 0x0000)
struct HudBarElement_Animated_C_Setup_Tints final
{
public:
	struct FLinearColor                           Tint;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BgdTint;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GlowTint;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HudBarElement_Animated_C_Setup_Tints) == 0x000004, "Wrong alignment on HudBarElement_Animated_C_Setup_Tints");
static_assert(sizeof(HudBarElement_Animated_C_Setup_Tints) == 0x000030, "Wrong size on HudBarElement_Animated_C_Setup_Tints");
static_assert(offsetof(HudBarElement_Animated_C_Setup_Tints, Tint) == 0x000000, "Member 'HudBarElement_Animated_C_Setup_Tints::Tint' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_Setup_Tints, BgdTint) == 0x000010, "Member 'HudBarElement_Animated_C_Setup_Tints::BgdTint' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_Setup_Tints, GlowTint) == 0x000020, "Member 'HudBarElement_Animated_C_Setup_Tints::GlowTint' has a wrong offset!");

// Function HudBarElement_Animated.HudBarElement_Animated_C.SetupNewTween
// 0x0048 (0x0048 - 0x0000)
struct HudBarElement_Animated_C_SetupNewTween final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStartBracket;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsFinishBracket;                                   // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          WasIncreasing;                                     // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2D[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2E[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2F[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F30[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F31[0x1];                                     // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HudBarElement_Animated_C_SetupNewTween) == 0x000004, "Wrong alignment on HudBarElement_Animated_C_SetupNewTween");
static_assert(sizeof(HudBarElement_Animated_C_SetupNewTween) == 0x000048, "Wrong size on HudBarElement_Animated_C_SetupNewTween");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, NewValue) == 0x000000, "Member 'HudBarElement_Animated_C_SetupNewTween::NewValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, IsStartBracket) == 0x000004, "Member 'HudBarElement_Animated_C_SetupNewTween::IsStartBracket' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, IsFinishBracket) == 0x000005, "Member 'HudBarElement_Animated_C_SetupNewTween::IsFinishBracket' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, WasIncreasing) == 0x000006, "Member 'HudBarElement_Animated_C_SetupNewTween::WasIncreasing' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, Temp_bool_Variable) == 0x000007, "Member 'HudBarElement_Animated_C_SetupNewTween::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, Temp_byte_Variable) == 0x000008, "Member 'HudBarElement_Animated_C_SetupNewTween::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, Temp_byte_Variable_1) == 0x000009, "Member 'HudBarElement_Animated_C_SetupNewTween::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, Temp_bool_Variable_1) == 0x00000A, "Member 'HudBarElement_Animated_C_SetupNewTween::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, Temp_float_Variable) == 0x00000C, "Member 'HudBarElement_Animated_C_SetupNewTween::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, Temp_float_Variable_1) == 0x000010, "Member 'HudBarElement_Animated_C_SetupNewTween::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, Temp_bool_Variable_2) == 0x000014, "Member 'HudBarElement_Animated_C_SetupNewTween::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, Temp_byte_Variable_2) == 0x000015, "Member 'HudBarElement_Animated_C_SetupNewTween::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, Temp_byte_Variable_3) == 0x000016, "Member 'HudBarElement_Animated_C_SetupNewTween::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, K2Node_Select_Default) == 0x000018, "Member 'HudBarElement_Animated_C_SetupNewTween::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'HudBarElement_Animated_C_SetupNewTween::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001D, "Member 'HudBarElement_Animated_C_SetupNewTween::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, CallFunc_BooleanAND_ReturnValue) == 0x00001E, "Member 'HudBarElement_Animated_C_SetupNewTween::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000020, "Member 'HudBarElement_Animated_C_SetupNewTween::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000024, "Member 'HudBarElement_Animated_C_SetupNewTween::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, K2Node_Select_Default_1) == 0x000028, "Member 'HudBarElement_Animated_C_SetupNewTween::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, CallFunc_MakeVector2D_ReturnValue) == 0x00002C, "Member 'HudBarElement_Animated_C_SetupNewTween::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000034, "Member 'HudBarElement_Animated_C_SetupNewTween::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, CallFunc_MakeVector2D_ReturnValue_1) == 0x000038, "Member 'HudBarElement_Animated_C_SetupNewTween::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, CallFunc_BooleanAND_ReturnValue_1) == 0x000040, "Member 'HudBarElement_Animated_C_SetupNewTween::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, K2Node_Select_Default_2) == 0x000041, "Member 'HudBarElement_Animated_C_SetupNewTween::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000042, "Member 'HudBarElement_Animated_C_SetupNewTween::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetupNewTween, CallFunc_K2_GetScalarParameterValue_ReturnValue_1) == 0x000044, "Member 'HudBarElement_Animated_C_SetupNewTween::CallFunc_K2_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");

// Function HudBarElement_Animated.HudBarElement_Animated_C.UpdateTween
// 0x0090 (0x0090 - 0x0000)
struct HudBarElement_Animated_C_UpdateTween final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F32[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F33[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F34[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_4;                              // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F35[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F36[0x2];                                     // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_1;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_2;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HudBarElement_Animated_C_UpdateTween) == 0x000004, "Wrong alignment on HudBarElement_Animated_C_UpdateTween");
static_assert(sizeof(HudBarElement_Animated_C_UpdateTween) == 0x000090, "Wrong size on HudBarElement_Animated_C_UpdateTween");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, Temp_bool_Variable) == 0x000000, "Member 'HudBarElement_Animated_C_UpdateTween::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, Temp_name_Variable) == 0x000004, "Member 'HudBarElement_Animated_C_UpdateTween::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, Temp_name_Variable_1) == 0x00000C, "Member 'HudBarElement_Animated_C_UpdateTween::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, Temp_bool_Variable_1) == 0x000014, "Member 'HudBarElement_Animated_C_UpdateTween::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, Temp_name_Variable_2) == 0x000018, "Member 'HudBarElement_Animated_C_UpdateTween::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, Temp_name_Variable_3) == 0x000020, "Member 'HudBarElement_Animated_C_UpdateTween::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, Temp_bool_Variable_2) == 0x000028, "Member 'HudBarElement_Animated_C_UpdateTween::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, Temp_name_Variable_4) == 0x00002C, "Member 'HudBarElement_Animated_C_UpdateTween::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, Temp_name_Variable_5) == 0x000034, "Member 'HudBarElement_Animated_C_UpdateTween::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, Temp_bool_Variable_3) == 0x00003C, "Member 'HudBarElement_Animated_C_UpdateTween::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, Temp_float_Variable) == 0x000040, "Member 'HudBarElement_Animated_C_UpdateTween::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, Temp_float_Variable_1) == 0x000044, "Member 'HudBarElement_Animated_C_UpdateTween::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, K2Node_Select_Default) == 0x000048, "Member 'HudBarElement_Animated_C_UpdateTween::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000050, "Member 'HudBarElement_Animated_C_UpdateTween::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000054, "Member 'HudBarElement_Animated_C_UpdateTween::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, CallFunc_MakeVector2D_ReturnValue) == 0x000058, "Member 'HudBarElement_Animated_C_UpdateTween::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000060, "Member 'HudBarElement_Animated_C_UpdateTween::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, CallFunc_MakeVector2D_ReturnValue_1) == 0x000064, "Member 'HudBarElement_Animated_C_UpdateTween::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, CallFunc_IsVisible_ReturnValue) == 0x00006C, "Member 'HudBarElement_Animated_C_UpdateTween::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, CallFunc_IsVisible_ReturnValue_1) == 0x00006D, "Member 'HudBarElement_Animated_C_UpdateTween::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, K2Node_Select_Default_1) == 0x000070, "Member 'HudBarElement_Animated_C_UpdateTween::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, K2Node_Select_Default_2) == 0x000078, "Member 'HudBarElement_Animated_C_UpdateTween::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, K2Node_Select_Default_3) == 0x000080, "Member 'HudBarElement_Animated_C_UpdateTween::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000084, "Member 'HudBarElement_Animated_C_UpdateTween::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, CallFunc_K2_GetScalarParameterValue_ReturnValue_1) == 0x000088, "Member 'HudBarElement_Animated_C_UpdateTween::CallFunc_K2_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_UpdateTween, CallFunc_FInterpTo_Constant_ReturnValue) == 0x00008C, "Member 'HudBarElement_Animated_C_UpdateTween::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");

// Function HudBarElement_Animated.HudBarElement_Animated_C.SetEntireBar
// 0x0010 (0x0010 - 0x0000)
struct HudBarElement_Animated_C_SetEntireBar final
{
public:
	bool                                          Fill;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F37[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HudBarElement_Animated_C_SetEntireBar) == 0x000004, "Wrong alignment on HudBarElement_Animated_C_SetEntireBar");
static_assert(sizeof(HudBarElement_Animated_C_SetEntireBar) == 0x000010, "Wrong size on HudBarElement_Animated_C_SetEntireBar");
static_assert(offsetof(HudBarElement_Animated_C_SetEntireBar, Fill) == 0x000000, "Member 'HudBarElement_Animated_C_SetEntireBar::Fill' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetEntireBar, Temp_bool_Variable) == 0x000001, "Member 'HudBarElement_Animated_C_SetEntireBar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetEntireBar, Temp_float_Variable) == 0x000004, "Member 'HudBarElement_Animated_C_SetEntireBar::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetEntireBar, Temp_float_Variable_1) == 0x000008, "Member 'HudBarElement_Animated_C_SetEntireBar::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(HudBarElement_Animated_C_SetEntireBar, K2Node_Select_Default) == 0x00000C, "Member 'HudBarElement_Animated_C_SetEntireBar::K2Node_Select_Default' has a wrong offset!");

// Function HudBarElement_Animated.HudBarElement_Animated_C.ForceValue
// 0x0004 (0x0004 - 0x0000)
struct HudBarElement_Animated_C_ForceValue final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HudBarElement_Animated_C_ForceValue) == 0x000004, "Wrong alignment on HudBarElement_Animated_C_ForceValue");
static_assert(sizeof(HudBarElement_Animated_C_ForceValue) == 0x000004, "Wrong size on HudBarElement_Animated_C_ForceValue");
static_assert(offsetof(HudBarElement_Animated_C_ForceValue, NewValue) == 0x000000, "Member 'HudBarElement_Animated_C_ForceValue::NewValue' has a wrong offset!");

}

