#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUDGameMessages

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUDGameMessages.HUDGameMessages_C
// 0x00E0 (0x03C8 - 0x02E8)
class UHUDGameMessages_C final : public URBHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideMessageAnim;                                   // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowMessageAnim;                                   // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             AssignmentStatus;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCompleteStamp_C*                       CompleteStamp;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_HUDGameMessages;                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Message;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          NeedIntro;                                         // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsInitialized;                                     // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FDD[0x6];                                     // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               IconMaterial;                                      // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Sound;                                             // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Voice;                                             // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameMessageAudioParams                Audio_Params;                                      // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FTimerHandle                           HideDelayTimerHandle;                              // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitingToShow;                                     // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowingMessage;                                    // 0x0369(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FDE[0x6];                                     // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BufferGameMessage;                                 // 0x0370(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	EGameMessageCategory                          BufferMessageCategory;                             // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FDF[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameMessageAudioParams                BufferAudioParams;                                 // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	FMulticastInlineDelegateProperty_             OnObjectiveCompletedMessageSent;                   // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EGameMessageCategory                          CurrentMessageCategory;                            // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FE0[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnObjectiveStartedMessageSent;                     // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnObjectiveCompletedMessageSent__DelegateSignature();
	void OnObjectiveStartedMessageSent__DelegateSignature();
	void ExecuteUbergraph_HUDGameMessages(int32 EntryPoint);
	void Event_Hide();
	void Event_OnHudModeChanged(EHudMode NewHudMode);
	void Construct();
	void ShowMessage();
	void OnShowGameMessage_Event_0(const class FText& GameMessage, const EGameMessageCategory MessageCategory, const struct FGameMessageAudioParams& AudioParams);
	void Event_Show();
	void OnStageEnded_Event_0(const struct FRBStageID& StageID, const struct FRBMissionID& MissionID, bool IsFail);
	void Finished_1D4430144A0F9FAAAB764FB894A8E54F();
	void InitializeMessage(const class FText& Param_Message, EGameMessageCategory MessageCategory, const struct FGameMessageAudioParams& AudioParams);

	bool ShouldShow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUDGameMessages_C">();
	}
	static class UHUDGameMessages_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDGameMessages_C>();
	}
};
static_assert(alignof(UHUDGameMessages_C) == 0x000008, "Wrong alignment on UHUDGameMessages_C");
static_assert(sizeof(UHUDGameMessages_C) == 0x0003C8, "Wrong size on UHUDGameMessages_C");
static_assert(offsetof(UHUDGameMessages_C, UberGraphFrame) == 0x0002E8, "Member 'UHUDGameMessages_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, HideMessageAnim) == 0x0002F0, "Member 'UHUDGameMessages_C::HideMessageAnim' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, ShowMessageAnim) == 0x0002F8, "Member 'UHUDGameMessages_C::ShowMessageAnim' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, AssignmentStatus) == 0x000300, "Member 'UHUDGameMessages_C::AssignmentStatus' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, CanvasPanel_0) == 0x000308, "Member 'UHUDGameMessages_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, CompleteStamp) == 0x000310, "Member 'UHUDGameMessages_C::CompleteStamp' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, Icon) == 0x000318, "Member 'UHUDGameMessages_C::Icon' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, InvalidationBox_HUDGameMessages) == 0x000320, "Member 'UHUDGameMessages_C::InvalidationBox_HUDGameMessages' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, Message) == 0x000328, "Member 'UHUDGameMessages_C::Message' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, NeedIntro) == 0x000330, "Member 'UHUDGameMessages_C::NeedIntro' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, IsInitialized) == 0x000331, "Member 'UHUDGameMessages_C::IsInitialized' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, IconMaterial) == 0x000338, "Member 'UHUDGameMessages_C::IconMaterial' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, Sound) == 0x000340, "Member 'UHUDGameMessages_C::Sound' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, Voice) == 0x000348, "Member 'UHUDGameMessages_C::Voice' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, Audio_Params) == 0x000350, "Member 'UHUDGameMessages_C::Audio_Params' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, HideDelayTimerHandle) == 0x000360, "Member 'UHUDGameMessages_C::HideDelayTimerHandle' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, WaitingToShow) == 0x000368, "Member 'UHUDGameMessages_C::WaitingToShow' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, ShowingMessage) == 0x000369, "Member 'UHUDGameMessages_C::ShowingMessage' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, BufferGameMessage) == 0x000370, "Member 'UHUDGameMessages_C::BufferGameMessage' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, BufferMessageCategory) == 0x000388, "Member 'UHUDGameMessages_C::BufferMessageCategory' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, BufferAudioParams) == 0x000390, "Member 'UHUDGameMessages_C::BufferAudioParams' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, OnObjectiveCompletedMessageSent) == 0x0003A0, "Member 'UHUDGameMessages_C::OnObjectiveCompletedMessageSent' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, CurrentMessageCategory) == 0x0003B0, "Member 'UHUDGameMessages_C::CurrentMessageCategory' has a wrong offset!");
static_assert(offsetof(UHUDGameMessages_C, OnObjectiveStartedMessageSent) == 0x0003B8, "Member 'UHUDGameMessages_C::OnObjectiveStartedMessageSent' has a wrong offset!");

}

