#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUDNightVision

#include "Basic.hpp"

#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function HUDNightVision.HUDNightVision_C.ExecuteUbergraph_HUDNightVision
// 0x00D8 (0x00D8 - 0x0000)
struct HUDNightVision_C_ExecuteUbergraph_HUDNightVision final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ARBActiveSkill* ActiveSkillActor)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_Event_oldPlayer;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_Event_newPlayer;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bOn;                            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBActiveSkill*                         K2Node_CustomEvent_activeSkillActor;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bOn)>                     K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBActiveSkill*                         K2Node_CustomEvent_ActiveSkill;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsActive;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_CustomEvent_player_1;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_CustomEvent_player;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNVOn_ReturnValue;                       // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(float batteryLevel)>           K2Node_CreateDelegate_OutputDelegate_3;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(float MaxBattery)>             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_CustomEvent_maxBattery;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              CallFunc_GetWatchedPlayer_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_batteryLevel;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ARBActiveSkill* ActiveSkill, bool bIsActive)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision) == 0x000008, "Wrong alignment on HUDNightVision_C_ExecuteUbergraph_HUDNightVision");
static_assert(sizeof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision) == 0x0000D8, "Wrong size on HUDNightVision_C_ExecuteUbergraph_HUDNightVision");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, EntryPoint) == 0x000000, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_Event_oldPlayer) == 0x000028, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_Event_oldPlayer' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_Event_newPlayer) == 0x000030, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_Event_newPlayer' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_CustomEvent_bOn) == 0x000038, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_CustomEvent_bOn' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_CustomEvent_activeSkillActor) == 0x000040, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_CustomEvent_activeSkillActor' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_CreateDelegate_OutputDelegate_2) == 0x00004C, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00005C, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_CustomEvent_ActiveSkill) == 0x000060, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_CustomEvent_ActiveSkill' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_CustomEvent_bIsActive) == 0x000068, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_CustomEvent_bIsActive' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_CustomEvent_player_1) == 0x000070, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_CustomEvent_player_1' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_CustomEvent_player) == 0x000078, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_CustomEvent_player' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, CallFunc_IsValid_ReturnValue_2) == 0x000081, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, CallFunc_IsValid_ReturnValue_3) == 0x000082, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, CallFunc_IsNVOn_ReturnValue) == 0x000083, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::CallFunc_IsNVOn_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_CreateDelegate_OutputDelegate_3) == 0x000084, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_CreateDelegate_OutputDelegate_4) == 0x000094, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_CustomEvent_maxBattery) == 0x0000A4, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_CustomEvent_maxBattery' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, CallFunc_GetWatchedPlayer_ReturnValue) == 0x0000A8, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::CallFunc_GetWatchedPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, CallFunc_IsValid_ReturnValue_4) == 0x0000B0, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_CustomEvent_batteryLevel) == 0x0000B4, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_CustomEvent_batteryLevel' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000B8, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, CallFunc_PlayAnimation_ReturnValue) == 0x0000C8, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ExecuteUbergraph_HUDNightVision, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000D0, "Member 'HUDNightVision_C_ExecuteUbergraph_HUDNightVision::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function HUDNightVision.HUDNightVision_C.OnBatteryLevelChanged
// 0x0004 (0x0004 - 0x0000)
struct HUDNightVision_C_OnBatteryLevelChanged final
{
public:
	float                                         batteryLevel;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDNightVision_C_OnBatteryLevelChanged) == 0x000004, "Wrong alignment on HUDNightVision_C_OnBatteryLevelChanged");
static_assert(sizeof(HUDNightVision_C_OnBatteryLevelChanged) == 0x000004, "Wrong size on HUDNightVision_C_OnBatteryLevelChanged");
static_assert(offsetof(HUDNightVision_C_OnBatteryLevelChanged, batteryLevel) == 0x000000, "Member 'HUDNightVision_C_OnBatteryLevelChanged::batteryLevel' has a wrong offset!");

// Function HUDNightVision.HUDNightVision_C.OnMaxNVBatteryChangedDelegate_Event_0
// 0x0004 (0x0004 - 0x0000)
struct HUDNightVision_C_OnMaxNVBatteryChangedDelegate_Event_0 final
{
public:
	float                                         MaxBattery;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDNightVision_C_OnMaxNVBatteryChangedDelegate_Event_0) == 0x000004, "Wrong alignment on HUDNightVision_C_OnMaxNVBatteryChangedDelegate_Event_0");
static_assert(sizeof(HUDNightVision_C_OnMaxNVBatteryChangedDelegate_Event_0) == 0x000004, "Wrong size on HUDNightVision_C_OnMaxNVBatteryChangedDelegate_Event_0");
static_assert(offsetof(HUDNightVision_C_OnMaxNVBatteryChangedDelegate_Event_0, MaxBattery) == 0x000000, "Member 'HUDNightVision_C_OnMaxNVBatteryChangedDelegate_Event_0::MaxBattery' has a wrong offset!");

// Function HUDNightVision.HUDNightVision_C.UnbindPlayerEvents
// 0x0008 (0x0008 - 0x0000)
struct HUDNightVision_C_UnbindPlayerEvents final
{
public:
	class ARBPlayer*                              Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDNightVision_C_UnbindPlayerEvents) == 0x000008, "Wrong alignment on HUDNightVision_C_UnbindPlayerEvents");
static_assert(sizeof(HUDNightVision_C_UnbindPlayerEvents) == 0x000008, "Wrong size on HUDNightVision_C_UnbindPlayerEvents");
static_assert(offsetof(HUDNightVision_C_UnbindPlayerEvents, Player) == 0x000000, "Member 'HUDNightVision_C_UnbindPlayerEvents::Player' has a wrong offset!");

// Function HUDNightVision.HUDNightVision_C.BindPlayerEvents
// 0x0008 (0x0008 - 0x0000)
struct HUDNightVision_C_BindPlayerEvents final
{
public:
	class ARBPlayer*                              Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDNightVision_C_BindPlayerEvents) == 0x000008, "Wrong alignment on HUDNightVision_C_BindPlayerEvents");
static_assert(sizeof(HUDNightVision_C_BindPlayerEvents) == 0x000008, "Wrong size on HUDNightVision_C_BindPlayerEvents");
static_assert(offsetof(HUDNightVision_C_BindPlayerEvents, Player) == 0x000000, "Member 'HUDNightVision_C_BindPlayerEvents::Player' has a wrong offset!");

// Function HUDNightVision.HUDNightVision_C.OnActiveSkillActivated
// 0x0010 (0x0010 - 0x0000)
struct HUDNightVision_C_OnActiveSkillActivated final
{
public:
	class ARBActiveSkill*                         ActiveSkill;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsActive;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDNightVision_C_OnActiveSkillActivated) == 0x000008, "Wrong alignment on HUDNightVision_C_OnActiveSkillActivated");
static_assert(sizeof(HUDNightVision_C_OnActiveSkillActivated) == 0x000010, "Wrong size on HUDNightVision_C_OnActiveSkillActivated");
static_assert(offsetof(HUDNightVision_C_OnActiveSkillActivated, ActiveSkill) == 0x000000, "Member 'HUDNightVision_C_OnActiveSkillActivated::ActiveSkill' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_OnActiveSkillActivated, bIsActive) == 0x000008, "Member 'HUDNightVision_C_OnActiveSkillActivated::bIsActive' has a wrong offset!");

// Function HUDNightVision.HUDNightVision_C.OnActiveSkillChanged
// 0x0008 (0x0008 - 0x0000)
struct HUDNightVision_C_OnActiveSkillChanged final
{
public:
	class ARBActiveSkill*                         ActiveSkillActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDNightVision_C_OnActiveSkillChanged) == 0x000008, "Wrong alignment on HUDNightVision_C_OnActiveSkillChanged");
static_assert(sizeof(HUDNightVision_C_OnActiveSkillChanged) == 0x000008, "Wrong size on HUDNightVision_C_OnActiveSkillChanged");
static_assert(offsetof(HUDNightVision_C_OnActiveSkillChanged, ActiveSkillActor) == 0x000000, "Member 'HUDNightVision_C_OnActiveSkillChanged::ActiveSkillActor' has a wrong offset!");

// Function HUDNightVision.HUDNightVision_C.OnNVChanged
// 0x0001 (0x0001 - 0x0000)
struct HUDNightVision_C_OnNVChanged final
{
public:
	bool                                          bOn;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDNightVision_C_OnNVChanged) == 0x000001, "Wrong alignment on HUDNightVision_C_OnNVChanged");
static_assert(sizeof(HUDNightVision_C_OnNVChanged) == 0x000001, "Wrong size on HUDNightVision_C_OnNVChanged");
static_assert(offsetof(HUDNightVision_C_OnNVChanged, bOn) == 0x000000, "Member 'HUDNightVision_C_OnNVChanged::bOn' has a wrong offset!");

// Function HUDNightVision.HUDNightVision_C.Event_OnWatchedPlayerChanged
// 0x0010 (0x0010 - 0x0000)
struct HUDNightVision_C_Event_OnWatchedPlayerChanged final
{
public:
	class ARBPlayer*                              OldPlayer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              NewPlayer;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDNightVision_C_Event_OnWatchedPlayerChanged) == 0x000008, "Wrong alignment on HUDNightVision_C_Event_OnWatchedPlayerChanged");
static_assert(sizeof(HUDNightVision_C_Event_OnWatchedPlayerChanged) == 0x000010, "Wrong size on HUDNightVision_C_Event_OnWatchedPlayerChanged");
static_assert(offsetof(HUDNightVision_C_Event_OnWatchedPlayerChanged, OldPlayer) == 0x000000, "Member 'HUDNightVision_C_Event_OnWatchedPlayerChanged::OldPlayer' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_Event_OnWatchedPlayerChanged, NewPlayer) == 0x000008, "Member 'HUDNightVision_C_Event_OnWatchedPlayerChanged::NewPlayer' has a wrong offset!");

// Function HUDNightVision.HUDNightVision_C.SetIsNVActive
// 0x0002 (0x0002 - 0x0000)
struct HUDNightVision_C_SetIsNVActive final
{
public:
	bool                                          IsNvActive_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDNightVision_C_SetIsNVActive) == 0x000001, "Wrong alignment on HUDNightVision_C_SetIsNVActive");
static_assert(sizeof(HUDNightVision_C_SetIsNVActive) == 0x000002, "Wrong size on HUDNightVision_C_SetIsNVActive");
static_assert(offsetof(HUDNightVision_C_SetIsNVActive, IsNvActive_0) == 0x000000, "Member 'HUDNightVision_C_SetIsNVActive::IsNvActive_0' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_SetIsNVActive, CallFunc_BooleanOR_ReturnValue) == 0x000001, "Member 'HUDNightVision_C_SetIsNVActive::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function HUDNightVision.HUDNightVision_C.UpdateRatio
// 0x0038 (0x0038 - 0x0000)
struct HUDNightVision_C_UpdateRatio final
{
public:
	float                                         batteryValue;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDNightVision_C_UpdateRatio) == 0x000008, "Wrong alignment on HUDNightVision_C_UpdateRatio");
static_assert(sizeof(HUDNightVision_C_UpdateRatio) == 0x000038, "Wrong size on HUDNightVision_C_UpdateRatio");
static_assert(offsetof(HUDNightVision_C_UpdateRatio, batteryValue) == 0x000000, "Member 'HUDNightVision_C_UpdateRatio::batteryValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_UpdateRatio, Ratio) == 0x000004, "Member 'HUDNightVision_C_UpdateRatio::Ratio' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_UpdateRatio, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000008, "Member 'HUDNightVision_C_UpdateRatio::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_UpdateRatio, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'HUDNightVision_C_UpdateRatio::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_UpdateRatio, CallFunc_Less_FloatFloat_ReturnValue) == 0x000018, "Member 'HUDNightVision_C_UpdateRatio::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_UpdateRatio, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'HUDNightVision_C_UpdateRatio::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_UpdateRatio, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'HUDNightVision_C_UpdateRatio::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_UpdateRatio, CallFunc_FCeil_ReturnValue) == 0x000024, "Member 'HUDNightVision_C_UpdateRatio::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_UpdateRatio, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000028, "Member 'HUDNightVision_C_UpdateRatio::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_UpdateRatio, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00002C, "Member 'HUDNightVision_C_UpdateRatio::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_UpdateRatio, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'HUDNightVision_C_UpdateRatio::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_UpdateRatio, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'HUDNightVision_C_UpdateRatio::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function HUDNightVision.HUDNightVision_C.GetBatteryBoosterValue
// 0x0030 (0x0030 - 0x0000)
struct HUDNightVision_C_GetBatteryBoosterValue final
{
public:
	float                                         StaminaBoosterValue;                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetWatchedPlayer_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBGameplayAttributeModifier           CallFunc_GetBatteryBoostItemModifier_ReturnValue;  // 0x0018(0x000C)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDNightVision_C_GetBatteryBoosterValue) == 0x000008, "Wrong alignment on HUDNightVision_C_GetBatteryBoosterValue");
static_assert(sizeof(HUDNightVision_C_GetBatteryBoosterValue) == 0x000030, "Wrong size on HUDNightVision_C_GetBatteryBoosterValue");
static_assert(offsetof(HUDNightVision_C_GetBatteryBoosterValue, StaminaBoosterValue) == 0x000000, "Member 'HUDNightVision_C_GetBatteryBoosterValue::StaminaBoosterValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_GetBatteryBoosterValue, Temp_float_Variable) == 0x000004, "Member 'HUDNightVision_C_GetBatteryBoosterValue::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_GetBatteryBoosterValue, Temp_bool_Variable) == 0x000008, "Member 'HUDNightVision_C_GetBatteryBoosterValue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_GetBatteryBoosterValue, CallFunc_GetWatchedPlayer_ReturnValue) == 0x000010, "Member 'HUDNightVision_C_GetBatteryBoosterValue::CallFunc_GetWatchedPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_GetBatteryBoosterValue, CallFunc_GetBatteryBoostItemModifier_ReturnValue) == 0x000018, "Member 'HUDNightVision_C_GetBatteryBoosterValue::CallFunc_GetBatteryBoostItemModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_GetBatteryBoosterValue, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'HUDNightVision_C_GetBatteryBoosterValue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_GetBatteryBoosterValue, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000025, "Member 'HUDNightVision_C_GetBatteryBoosterValue::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_GetBatteryBoosterValue, K2Node_Select_Default) == 0x000028, "Member 'HUDNightVision_C_GetBatteryBoosterValue::K2Node_Select_Default' has a wrong offset!");

// Function HUDNightVision.HUDNightVision_C.HandleMaxBatteryChange
// 0x0010 (0x0010 - 0x0000)
struct HUDNightVision_C_HandleMaxBatteryChange final
{
public:
	float                                         Max_Battery_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBatteryBoosterValue_StaminaBoosterValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDNightVision_C_HandleMaxBatteryChange) == 0x000004, "Wrong alignment on HUDNightVision_C_HandleMaxBatteryChange");
static_assert(sizeof(HUDNightVision_C_HandleMaxBatteryChange) == 0x000010, "Wrong size on HUDNightVision_C_HandleMaxBatteryChange");
static_assert(offsetof(HUDNightVision_C_HandleMaxBatteryChange, Max_Battery_0) == 0x000000, "Member 'HUDNightVision_C_HandleMaxBatteryChange::Max_Battery_0' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_HandleMaxBatteryChange, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'HUDNightVision_C_HandleMaxBatteryChange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_HandleMaxBatteryChange, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'HUDNightVision_C_HandleMaxBatteryChange::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_HandleMaxBatteryChange, CallFunc_GetBatteryBoosterValue_StaminaBoosterValue) == 0x000008, "Member 'HUDNightVision_C_HandleMaxBatteryChange::CallFunc_GetBatteryBoosterValue_StaminaBoosterValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_HandleMaxBatteryChange, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'HUDNightVision_C_HandleMaxBatteryChange::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function HUDNightVision.HUDNightVision_C.ShouldShow
// 0x0002 (0x0002 - 0x0000)
struct HUDNightVision_C_ShouldShow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDNightVision_C_ShouldShow) == 0x000001, "Wrong alignment on HUDNightVision_C_ShouldShow");
static_assert(sizeof(HUDNightVision_C_ShouldShow) == 0x000002, "Wrong size on HUDNightVision_C_ShouldShow");
static_assert(offsetof(HUDNightVision_C_ShouldShow, ReturnValue) == 0x000000, "Member 'HUDNightVision_C_ShouldShow::ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDNightVision_C_ShouldShow, CallFunc_BooleanOR_ReturnValue) == 0x000001, "Member 'HUDNightVision_C_ShouldShow::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

