#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUDObjectives

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUDObjectives.HUDObjectives_C
// 0x0048 (0x0330 - 0x02E8)
class UHUDObjectives_C final : public URBHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HudWidgetFadeIn;                                   // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_HUDObjectives;                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainObjectivesContainer_C*             MainObjectivesContainer;                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USecondaryObjectiveWidget_C*            SecondaryObjectiveWidget;                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USecondaryObjectiveWidget_C*            SecondaryObjectiveWidget_335;                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SubobjectivesBox;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bPauseMenu;                                        // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FFA[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBBaseObjectiveCoordinator*            ForcedShownCoordinator;                            // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HUDObjectives(int32 EntryPoint);
	void OnSingleCompletedObjectiveReverted(class ARBBaseObjectiveCoordinator* Coordinator, class AActor* Objective);
	void OnSingleObjectiveCompleted(class ARBBaseObjectiveCoordinator* Coordinator, class AActor* Player, class AActor* Objective);
	void OnProgressChanged(class ARBBaseObjectiveCoordinator* Coordinator, float ProgressRatio, bool IsPositiveProgress, const class FText& ObjectiveText);
	void OnCompletionInProgressChanged(class ARBBaseObjectiveCoordinator* Coordinator, bool IsProgressionInProgress, bool IsCompletedByLocalPlayer);
	void OnRequestDisplayObjectiveHUD();
	void StateChanged(class ARBBaseObjectiveCoordinator* Coordinator, EObjectiveCoordinatorState State);
	void Construct();
	void OnObjectiveStarted(class ARBBaseObjectiveCoordinator* Coordinator);
	void CanDisplayObjective(class ARBBaseObjectiveCoordinator* Coordinator, bool* CanDisplay);
	void OnObjectiveEnded();
	void RefreshObjectivesTexts();
	void ForceShowObjectives(float Duration, class ARBBaseObjectiveCoordinator* Coordinator);
	void Init();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUDObjectives_C">();
	}
	static class UHUDObjectives_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDObjectives_C>();
	}
};
static_assert(alignof(UHUDObjectives_C) == 0x000008, "Wrong alignment on UHUDObjectives_C");
static_assert(sizeof(UHUDObjectives_C) == 0x000330, "Wrong size on UHUDObjectives_C");
static_assert(offsetof(UHUDObjectives_C, UberGraphFrame) == 0x0002E8, "Member 'UHUDObjectives_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUDObjectives_C, HudWidgetFadeIn) == 0x0002F0, "Member 'UHUDObjectives_C::HudWidgetFadeIn' has a wrong offset!");
static_assert(offsetof(UHUDObjectives_C, InvalidationBox_HUDObjectives) == 0x0002F8, "Member 'UHUDObjectives_C::InvalidationBox_HUDObjectives' has a wrong offset!");
static_assert(offsetof(UHUDObjectives_C, MainObjectivesContainer) == 0x000300, "Member 'UHUDObjectives_C::MainObjectivesContainer' has a wrong offset!");
static_assert(offsetof(UHUDObjectives_C, SecondaryObjectiveWidget) == 0x000308, "Member 'UHUDObjectives_C::SecondaryObjectiveWidget' has a wrong offset!");
static_assert(offsetof(UHUDObjectives_C, SecondaryObjectiveWidget_335) == 0x000310, "Member 'UHUDObjectives_C::SecondaryObjectiveWidget_335' has a wrong offset!");
static_assert(offsetof(UHUDObjectives_C, SubobjectivesBox) == 0x000318, "Member 'UHUDObjectives_C::SubobjectivesBox' has a wrong offset!");
static_assert(offsetof(UHUDObjectives_C, bPauseMenu) == 0x000320, "Member 'UHUDObjectives_C::bPauseMenu' has a wrong offset!");
static_assert(offsetof(UHUDObjectives_C, ForcedShownCoordinator) == 0x000328, "Member 'UHUDObjectives_C::ForcedShownCoordinator' has a wrong offset!");

}

