#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUDStageIntro

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function HUDStageIntro.HUDStageIntro_C.ExecuteUbergraph_HUDStageIntro
// 0x00E0 (0x00E0 - 0x0000)
struct HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D0E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTrialName_stageName;                   // 0x0008(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0044(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBHUD*                                 CallFunc_GetHUD_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStageIntroRemainingTime_ReturnValue;   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D0F[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSettings_Gameplay*                   CallFunc_GetRBSettings_Gameplay_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D10[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D11[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D12[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetStageName_stageName;                   // 0x00C8(0x0018)()
};
static_assert(alignof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro) == 0x000008, "Wrong alignment on HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro");
static_assert(sizeof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro) == 0x0000E0, "Wrong size on HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, EntryPoint) == 0x000000, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_GetTrialName_stageName) == 0x000008, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_GetTrialName_stageName' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, Temp_delegate_Variable) == 0x000030, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_PostEventGlobal_ReturnValue) == 0x000040, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, K2Node_Event_MyGeometry) == 0x000044, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, K2Node_Event_InDeltaTime) == 0x00007C, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_GetHUD_ReturnValue) == 0x000080, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_GetStageIntroRemainingTime_ReturnValue) == 0x000088, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_GetStageIntroRemainingTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_Not_PreBool_ReturnValue) == 0x00008C, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_GetRBSettings_Gameplay_ReturnValue) == 0x000090, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_GetRBSettings_Gameplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000098, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000A0, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000A8, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_BooleanAND_ReturnValue) == 0x0000A9, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000B0, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000B8, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_BooleanAND_ReturnValue_1) == 0x0000C0, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_IsValid_ReturnValue) == 0x0000C1, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro, CallFunc_GetStageName_stageName) == 0x0000C8, "Member 'HUDStageIntro_C_ExecuteUbergraph_HUDStageIntro::CallFunc_GetStageName_stageName' has a wrong offset!");

// Function HUDStageIntro.HUDStageIntro_C.Tick
// 0x003C (0x003C - 0x0000)
struct HUDStageIntro_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDStageIntro_C_Tick) == 0x000004, "Wrong alignment on HUDStageIntro_C_Tick");
static_assert(sizeof(HUDStageIntro_C_Tick) == 0x00003C, "Wrong size on HUDStageIntro_C_Tick");
static_assert(offsetof(HUDStageIntro_C_Tick, MyGeometry) == 0x000000, "Member 'HUDStageIntro_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_Tick, InDeltaTime) == 0x000038, "Member 'HUDStageIntro_C_Tick::InDeltaTime' has a wrong offset!");

// Function HUDStageIntro.HUDStageIntro_C.InitVariators
// 0x01F0 (0x01F0 - 0x0000)
struct HUDStageIntro_C_InitVariators final
{
public:
	TArray<class FName>                           TestVariators;                                     // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D13[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	class UStageIntroVariatorEntry_C*             CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGameStructureConfig*                 CallFunc_GetGameStructureConfig_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTrialId_ReturnValue;                   // 0x0044(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D14[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBTrialInfoRow                        CallFunc_GetTrialInfo_ReturnValue;                 // 0x0050(0x0158)(ConstParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D15[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBVariatorManager*                     CallFunc_GetVariatorManager_ReturnValue;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class URBVariatorInfo*>                CallFunc_GetCurrentVariatorConfigs_ReturnValue;    // 0x01B8(0x0010)(ConstParm, ReferenceParm)
	class URBVariatorInfo*                        CallFunc_Array_Get_Item;                           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D16[0x2];                                     // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDStageIntro_C_InitVariators) == 0x000008, "Wrong alignment on HUDStageIntro_C_InitVariators");
static_assert(sizeof(HUDStageIntro_C_InitVariators) == 0x0001F0, "Wrong size on HUDStageIntro_C_InitVariators");
static_assert(offsetof(HUDStageIntro_C_InitVariators, TestVariators) == 0x000000, "Member 'HUDStageIntro_C_InitVariators::TestVariators' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, Temp_int_Array_Index_Variable) == 0x000010, "Member 'HUDStageIntro_C_InitVariators::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, K2Node_MakeArray_Array) == 0x000018, "Member 'HUDStageIntro_C_InitVariators::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, CallFunc_Create_ReturnValue) == 0x000028, "Member 'HUDStageIntro_C_InitVariators::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, CallFunc_GetGameStructureConfig_ReturnValue) == 0x000030, "Member 'HUDStageIntro_C_InitVariators::CallFunc_GetGameStructureConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, CallFunc_GetRBGameState_ReturnValue) == 0x000038, "Member 'HUDStageIntro_C_InitVariators::CallFunc_GetRBGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'HUDStageIntro_C_InitVariators::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, CallFunc_GetTrialId_ReturnValue) == 0x000044, "Member 'HUDStageIntro_C_InitVariators::CallFunc_GetTrialId_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, CallFunc_GetTrialInfo_ReturnValue) == 0x000050, "Member 'HUDStageIntro_C_InitVariators::CallFunc_GetTrialInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, CallFunc_Add_IntInt_ReturnValue) == 0x0001A8, "Member 'HUDStageIntro_C_InitVariators::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, CallFunc_GetVariatorManager_ReturnValue) == 0x0001B0, "Member 'HUDStageIntro_C_InitVariators::CallFunc_GetVariatorManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, CallFunc_GetCurrentVariatorConfigs_ReturnValue) == 0x0001B8, "Member 'HUDStageIntro_C_InitVariators::CallFunc_GetCurrentVariatorConfigs_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, CallFunc_Array_Get_Item) == 0x0001C8, "Member 'HUDStageIntro_C_InitVariators::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, CallFunc_Array_Length_ReturnValue) == 0x0001D0, "Member 'HUDStageIntro_C_InitVariators::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, CallFunc_IsValid_ReturnValue) == 0x0001D4, "Member 'HUDStageIntro_C_InitVariators::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, CallFunc_Less_IntInt_ReturnValue) == 0x0001D5, "Member 'HUDStageIntro_C_InitVariators::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, K2Node_CreateDelegate_OutputDelegate) == 0x0001D8, "Member 'HUDStageIntro_C_InitVariators::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_InitVariators, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x0001E8, "Member 'HUDStageIntro_C_InitVariators::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function HUDStageIntro.HUDStageIntro_C.ShowNextVariator
// 0x0068 (0x0068 - 0x0000)
struct HUDStageIntro_C_ShowNextVariator final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D17[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBHUD*                                 CallFunc_GetHUD_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBHUD*                                 CallFunc_GetHUD_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAkAudioEvent*>                  K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	class UAkAudioEvent*                          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D18[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0040(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D19[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStageIntroVariatorEntry_C*             K2Node_DynamicCast_AsStage_Intro_Variator_Entry;   // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1A[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDStageIntro_C_ShowNextVariator) == 0x000008, "Wrong alignment on HUDStageIntro_C_ShowNextVariator");
static_assert(sizeof(HUDStageIntro_C_ShowNextVariator) == 0x000068, "Wrong size on HUDStageIntro_C_ShowNextVariator");
static_assert(offsetof(HUDStageIntro_C_ShowNextVariator, Temp_int_Variable) == 0x000000, "Member 'HUDStageIntro_C_ShowNextVariator::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ShowNextVariator, CallFunc_GetHUD_ReturnValue) == 0x000008, "Member 'HUDStageIntro_C_ShowNextVariator::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ShowNextVariator, CallFunc_GetHUD_ReturnValue_1) == 0x000010, "Member 'HUDStageIntro_C_ShowNextVariator::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ShowNextVariator, K2Node_MakeArray_Array) == 0x000018, "Member 'HUDStageIntro_C_ShowNextVariator::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ShowNextVariator, CallFunc_Array_Get_Item) == 0x000028, "Member 'HUDStageIntro_C_ShowNextVariator::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ShowNextVariator, CallFunc_Array_IsEmpty_ReturnValue) == 0x000030, "Member 'HUDStageIntro_C_ShowNextVariator::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ShowNextVariator, CallFunc_GetChildAt_ReturnValue) == 0x000038, "Member 'HUDStageIntro_C_ShowNextVariator::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ShowNextVariator, Temp_delegate_Variable) == 0x000040, "Member 'HUDStageIntro_C_ShowNextVariator::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ShowNextVariator, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'HUDStageIntro_C_ShowNextVariator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ShowNextVariator, CallFunc_PostEventGlobal_ReturnValue) == 0x000054, "Member 'HUDStageIntro_C_ShowNextVariator::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ShowNextVariator, K2Node_DynamicCast_AsStage_Intro_Variator_Entry) == 0x000058, "Member 'HUDStageIntro_C_ShowNextVariator::K2Node_DynamicCast_AsStage_Intro_Variator_Entry' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ShowNextVariator, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'HUDStageIntro_C_ShowNextVariator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_ShowNextVariator, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'HUDStageIntro_C_ShowNextVariator::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function HUDStageIntro.HUDStageIntro_C.GetStageName
// 0x00B0 (0x00B0 - 0x0000)
struct HUDStageIntro_C_GetStageName final
{
public:
	class FText                                   Param_StageName;                                   // 0x0000(0x0018)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1B[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBStageID                             CallFunc_GetStageID_ReturnValue;                   // 0x0040(0x0028)(ConstParm)
	class URBStageInfo*                           CallFunc_GetStageInfo_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1C[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0078(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1D[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0098(0x0018)()
};
static_assert(alignof(HUDStageIntro_C_GetStageName) == 0x000008, "Wrong alignment on HUDStageIntro_C_GetStageName");
static_assert(sizeof(HUDStageIntro_C_GetStageName) == 0x0000B0, "Wrong size on HUDStageIntro_C_GetStageName");
static_assert(offsetof(HUDStageIntro_C_GetStageName, Param_StageName) == 0x000000, "Member 'HUDStageIntro_C_GetStageName::Param_StageName' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_GetStageName, Temp_bool_Variable) == 0x000018, "Member 'HUDStageIntro_C_GetStageName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_GetStageName, Temp_text_Variable) == 0x000020, "Member 'HUDStageIntro_C_GetStageName::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_GetStageName, CallFunc_GetRBGameState_ReturnValue) == 0x000038, "Member 'HUDStageIntro_C_GetStageName::CallFunc_GetRBGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_GetStageName, CallFunc_GetStageID_ReturnValue) == 0x000040, "Member 'HUDStageIntro_C_GetStageName::CallFunc_GetStageID_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_GetStageName, CallFunc_GetStageInfo_ReturnValue) == 0x000068, "Member 'HUDStageIntro_C_GetStageName::CallFunc_GetStageInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_GetStageName, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'HUDStageIntro_C_GetStageName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_GetStageName, CallFunc_TextToUpper_ReturnValue) == 0x000078, "Member 'HUDStageIntro_C_GetStageName::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_GetStageName, CallFunc_TextIsEmpty_ReturnValue) == 0x000090, "Member 'HUDStageIntro_C_GetStageName::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_GetStageName, K2Node_Select_Default) == 0x000098, "Member 'HUDStageIntro_C_GetStageName::K2Node_Select_Default' has a wrong offset!");

// Function HUDStageIntro.HUDStageIntro_C.GetTrialName
// 0x0238 (0x0238 - 0x0000)
struct HUDStageIntro_C_GetTrialName final
{
public:
	class FText                                   Param_StageName;                                   // 0x0000(0x0018)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1E[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1F[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGameStructureConfig*                 CallFunc_GetGameStructureConfig_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue_1;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTrialId_ReturnValue;                   // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBMissionID                           CallFunc_GetMissionID_ReturnValue;                 // 0x0060(0x0028)(ConstParm)
	struct FRBTrialInfoRow                        CallFunc_GetTrialInfo_ReturnValue;                 // 0x0088(0x0158)(ConstParm)
	class URBMissionInfo*                         CallFunc_GetMissionInfo_ReturnValue;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D20[0x6];                                     // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x01F0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0208(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0220(0x0018)()
};
static_assert(alignof(HUDStageIntro_C_GetTrialName) == 0x000008, "Wrong alignment on HUDStageIntro_C_GetTrialName");
static_assert(sizeof(HUDStageIntro_C_GetTrialName) == 0x000238, "Wrong size on HUDStageIntro_C_GetTrialName");
static_assert(offsetof(HUDStageIntro_C_GetTrialName, Param_StageName) == 0x000000, "Member 'HUDStageIntro_C_GetTrialName::Param_StageName' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_GetTrialName, Temp_bool_Variable) == 0x000018, "Member 'HUDStageIntro_C_GetTrialName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_GetTrialName, Temp_text_Variable) == 0x000020, "Member 'HUDStageIntro_C_GetTrialName::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(HUDStageIntro_C_GetTrialName, Temp_bool_Variable_1) == 0x000038, "Member 'HUDStageIntro_C_GetTrialName::Temp_bool_Variable_1' has a wrong offset!");
