#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HudTutorialMessages

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function HudTutorialMessages.HUDTutorialMessages_C.ExecuteUbergraph_HUDTutorialMessages
// 0x0098 (0x0098 - 0x0000)
struct HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGameUserPreferences*                 CallFunc_GetRBGameUserPreferences_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIFontSize                                   CallFunc_GetTutorialSize_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FText& Message)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0044(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBHUD*                                 CallFunc_GetHUD_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_message;                        // 0x0070(0x0018)(ConstParm)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages) == 0x000008, "Wrong alignment on HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages");
static_assert(sizeof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages) == 0x000098, "Wrong size on HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages");
static_assert(offsetof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages, EntryPoint) == 0x000000, "Member 'HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages, CallFunc_GetRBGameUserPreferences_ReturnValue) == 0x000008, "Member 'HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages::CallFunc_GetRBGameUserPreferences_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages, CallFunc_GetTutorialSize_ReturnValue) == 0x000010, "Member 'HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages::CallFunc_GetTutorialSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages, Temp_delegate_Variable) == 0x000044, "Member 'HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages, K2Node_Event_IsDesignTime) == 0x000054, "Member 'HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages, CallFunc_GetHUD_ReturnValue) == 0x000058, "Member 'HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000060, "Member 'HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages, CallFunc_PlayAnimationForward_ReturnValue) == 0x000068, "Member 'HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages, K2Node_CustomEvent_message) == 0x000070, "Member 'HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages::K2Node_CustomEvent_message' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000088, "Member 'HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages, CallFunc_PostEventGlobal_ReturnValue) == 0x000090, "Member 'HUDTutorialMessages_C_ExecuteUbergraph_HUDTutorialMessages::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");

// Function HudTutorialMessages.HUDTutorialMessages_C.CustomEvent_0
// 0x0018 (0x0018 - 0x0000)
struct HUDTutorialMessages_C_CustomEvent_0 final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(HUDTutorialMessages_C_CustomEvent_0) == 0x000008, "Wrong alignment on HUDTutorialMessages_C_CustomEvent_0");
static_assert(sizeof(HUDTutorialMessages_C_CustomEvent_0) == 0x000018, "Wrong size on HUDTutorialMessages_C_CustomEvent_0");
static_assert(offsetof(HUDTutorialMessages_C_CustomEvent_0, Message) == 0x000000, "Member 'HUDTutorialMessages_C_CustomEvent_0::Message' has a wrong offset!");

// Function HudTutorialMessages.HUDTutorialMessages_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct HUDTutorialMessages_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDTutorialMessages_C_PreConstruct) == 0x000001, "Wrong alignment on HUDTutorialMessages_C_PreConstruct");
static_assert(sizeof(HUDTutorialMessages_C_PreConstruct) == 0x000001, "Wrong size on HUDTutorialMessages_C_PreConstruct");
static_assert(offsetof(HUDTutorialMessages_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'HUDTutorialMessages_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function HudTutorialMessages.HUDTutorialMessages_C.SetMessage
// 0x0030 (0x0030 - 0x0000)
struct HUDTutorialMessages_C_SetMessage final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_FormatTextForDecorator_ReturnValue;       // 0x0018(0x0018)()
};
static_assert(alignof(HUDTutorialMessages_C_SetMessage) == 0x000008, "Wrong alignment on HUDTutorialMessages_C_SetMessage");
static_assert(sizeof(HUDTutorialMessages_C_SetMessage) == 0x000030, "Wrong size on HUDTutorialMessages_C_SetMessage");
static_assert(offsetof(HUDTutorialMessages_C_SetMessage, Message) == 0x000000, "Member 'HUDTutorialMessages_C_SetMessage::Message' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_SetMessage, CallFunc_FormatTextForDecorator_ReturnValue) == 0x000018, "Member 'HUDTutorialMessages_C_SetMessage::CallFunc_FormatTextForDecorator_ReturnValue' has a wrong offset!");

// Function HudTutorialMessages.HUDTutorialMessages_C.UpdateTextSize
// 0x0090 (0x0090 - 0x0000)
struct HUDTutorialMessages_C_UpdateTextSize final
{
public:
	EUIFontSize                                   Size;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x0010(0x0020)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0038(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(HUDTutorialMessages_C_UpdateTextSize) == 0x000008, "Wrong alignment on HUDTutorialMessages_C_UpdateTextSize");
static_assert(sizeof(HUDTutorialMessages_C_UpdateTextSize) == 0x000090, "Wrong size on HUDTutorialMessages_C_UpdateTextSize");
static_assert(offsetof(HUDTutorialMessages_C_UpdateTextSize, Size) == 0x000000, "Member 'HUDTutorialMessages_C_UpdateTextSize::Size' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateTextSize, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000008, "Member 'HUDTutorialMessages_C_UpdateTextSize::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateTextSize, K2Node_MakeStruct_FontOutlineSettings) == 0x000010, "Member 'HUDTutorialMessages_C_UpdateTextSize::K2Node_MakeStruct_FontOutlineSettings' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateTextSize, CallFunc_Map_Find_Value) == 0x000030, "Member 'HUDTutorialMessages_C_UpdateTextSize::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateTextSize, CallFunc_Map_Find_ReturnValue) == 0x000034, "Member 'HUDTutorialMessages_C_UpdateTextSize::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateTextSize, K2Node_MakeStruct_SlateFontInfo) == 0x000038, "Member 'HUDTutorialMessages_C_UpdateTextSize::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function HudTutorialMessages.HUDTutorialMessages_C.UpdateInputDecorator
// 0x0048 (0x0048 - 0x0000)
struct HUDTutorialMessages_C_UpdateInputDecorator final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URichTextBlockDecorator*                CallFunc_GetDecoratorByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URichInputWidgetDecorator_C*            K2Node_DynamicCast_AsRich_Input_Widget_Decorator;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActionIconWidget_C*                    K2Node_DynamicCast_AsAction_Icon_Widget;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDTutorialMessages_C_UpdateInputDecorator) == 0x000008, "Wrong alignment on HUDTutorialMessages_C_UpdateInputDecorator");
static_assert(sizeof(HUDTutorialMessages_C_UpdateInputDecorator) == 0x000048, "Wrong size on HUDTutorialMessages_C_UpdateInputDecorator");
static_assert(offsetof(HUDTutorialMessages_C_UpdateInputDecorator, Temp_int_Array_Index_Variable) == 0x000000, "Member 'HUDTutorialMessages_C_UpdateInputDecorator::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateInputDecorator, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'HUDTutorialMessages_C_UpdateInputDecorator::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateInputDecorator, CallFunc_GetDecoratorByClass_ReturnValue) == 0x000008, "Member 'HUDTutorialMessages_C_UpdateInputDecorator::CallFunc_GetDecoratorByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateInputDecorator, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'HUDTutorialMessages_C_UpdateInputDecorator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateInputDecorator, K2Node_DynamicCast_AsRich_Input_Widget_Decorator) == 0x000018, "Member 'HUDTutorialMessages_C_UpdateInputDecorator::K2Node_DynamicCast_AsRich_Input_Widget_Decorator' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateInputDecorator, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'HUDTutorialMessages_C_UpdateInputDecorator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateInputDecorator, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'HUDTutorialMessages_C_UpdateInputDecorator::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateInputDecorator, CallFunc_Array_Get_Item) == 0x000028, "Member 'HUDTutorialMessages_C_UpdateInputDecorator::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateInputDecorator, K2Node_DynamicCast_AsAction_Icon_Widget) == 0x000030, "Member 'HUDTutorialMessages_C_UpdateInputDecorator::K2Node_DynamicCast_AsAction_Icon_Widget' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateInputDecorator, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'HUDTutorialMessages_C_UpdateInputDecorator::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateInputDecorator, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'HUDTutorialMessages_C_UpdateInputDecorator::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDTutorialMessages_C_UpdateInputDecorator, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'HUDTutorialMessages_C_UpdateInputDecorator::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function HudTutorialMessages.HUDTutorialMessages_C.ShouldShow
// 0x0001 (0x0001 - 0x0000)
struct HUDTutorialMessages_C_ShouldShow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDTutorialMessages_C_ShouldShow) == 0x000001, "Wrong alignment on HUDTutorialMessages_C_ShouldShow");
static_assert(sizeof(HUDTutorialMessages_C_ShouldShow) == 0x000001, "Wrong size on HUDTutorialMessages_C_ShouldShow");
static_assert(offsetof(HUDTutorialMessages_C_ShouldShow, ReturnValue) == 0x000000, "Member 'HUDTutorialMessages_C_ShouldShow::ReturnValue' has a wrong offset!");

}

