#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HudTutorialMessages

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HudTutorialMessages.HUDTutorialMessages_C
// 0x0018 (0x0300 - 0x02E8)
class UHUDTutorialMessages_C final : public URBHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URichTextBlock*                         TutorialMessage;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HUDTutorialMessages(int32 EntryPoint);
	void OnTutorialSizeChangedEvent();
	void OnHideTutorialMessage_Event_0();
	void CustomEvent_0(const class FText& Message);
	void Event_Hide();
	void Event_Show();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetMessage(const class FText& Message);
	void UpdateTextSize(EUIFontSize Size);
	void UpdateInputDecorator();

	bool ShouldShow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUDTutorialMessages_C">();
	}
	static class UHUDTutorialMessages_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDTutorialMessages_C>();
	}
};
static_assert(alignof(UHUDTutorialMessages_C) == 0x000008, "Wrong alignment on UHUDTutorialMessages_C");
static_assert(sizeof(UHUDTutorialMessages_C) == 0x000300, "Wrong size on UHUDTutorialMessages_C");
static_assert(offsetof(UHUDTutorialMessages_C, UberGraphFrame) == 0x0002E8, "Member 'UHUDTutorialMessages_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUDTutorialMessages_C, Show) == 0x0002F0, "Member 'UHUDTutorialMessages_C::Show' has a wrong offset!");
static_assert(offsetof(UHUDTutorialMessages_C, TutorialMessage) == 0x0002F8, "Member 'UHUDTutorialMessages_C::TutorialMessage' has a wrong offset!");

}

