#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IconBox

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct IconBox.IconBox
// 0x0030 (0x0030 - 0x0000)
struct FIconBox final
{
public:
	class UTexture*                               Texture_40_BB26CBEB45B65D1E4AC2EE87DE08F86E;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Position_45_E8A4F54440B2BC9C35E31FBEA403A526;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation_47_D7CB7D8E445A3D7077C73FAF30A488F8;      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconScale_50_A5EDC95248C49190EF6113A3D1B330E2;     // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IconColor_37_87D486A246E4E3C9753F3CA1501E233F;     // 0x001C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FIconBox) == 0x000008, "Wrong alignment on FIconBox");
static_assert(sizeof(FIconBox) == 0x000030, "Wrong size on FIconBox");
static_assert(offsetof(FIconBox, Texture_40_BB26CBEB45B65D1E4AC2EE87DE08F86E) == 0x000000, "Member 'FIconBox::Texture_40_BB26CBEB45B65D1E4AC2EE87DE08F86E' has a wrong offset!");
static_assert(offsetof(FIconBox, Position_45_E8A4F54440B2BC9C35E31FBEA403A526) == 0x000008, "Member 'FIconBox::Position_45_E8A4F54440B2BC9C35E31FBEA403A526' has a wrong offset!");
static_assert(offsetof(FIconBox, Rotation_47_D7CB7D8E445A3D7077C73FAF30A488F8) == 0x000010, "Member 'FIconBox::Rotation_47_D7CB7D8E445A3D7077C73FAF30A488F8' has a wrong offset!");
static_assert(offsetof(FIconBox, IconScale_50_A5EDC95248C49190EF6113A3D1B330E2) == 0x000014, "Member 'FIconBox::IconScale_50_A5EDC95248C49190EF6113A3D1B330E2' has a wrong offset!");
static_assert(offsetof(FIconBox, IconColor_37_87D486A246E4E3C9753F3CA1501E233F) == 0x00001C, "Member 'FIconBox::IconColor_37_87D486A246E4E3C9753F3CA1501E233F' has a wrong offset!");

}

