#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImageWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ImageWidget.ImageWidget_C.SetImage
// 0x00C8 (0x00C8 - 0x0000)
struct ImageWidget_C_SetImage final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         SizeX;                                             // 0x0088(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SizeY;                                             // 0x008C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B26[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B27[0x2];                                     // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ImageWidget_C_SetImage) == 0x000008, "Wrong alignment on ImageWidget_C_SetImage");
static_assert(sizeof(ImageWidget_C_SetImage) == 0x0000C8, "Wrong size on ImageWidget_C_SetImage");
static_assert(offsetof(ImageWidget_C_SetImage, Brush) == 0x000000, "Member 'ImageWidget_C_SetImage::Brush' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, SizeX) == 0x000088, "Member 'ImageWidget_C_SetImage::SizeX' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, SizeY) == 0x00008C, "Member 'ImageWidget_C_SetImage::SizeY' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, Temp_bool_Variable) == 0x000090, "Member 'ImageWidget_C_SetImage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, CallFunc_Less_FloatFloat_ReturnValue) == 0x000091, "Member 'ImageWidget_C_SetImage::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000092, "Member 'ImageWidget_C_SetImage::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, CallFunc_GetBrushResourceAsTexture2D_ReturnValue) == 0x000098, "Member 'ImageWidget_C_SetImage::CallFunc_GetBrushResourceAsTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, Temp_bool_Variable_1) == 0x0000A0, "Member 'ImageWidget_C_SetImage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, CallFunc_IsValid_ReturnValue) == 0x0000A1, "Member 'ImageWidget_C_SetImage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x0000A4, "Member 'ImageWidget_C_SetImage::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x0000A8, "Member 'ImageWidget_C_SetImage::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0000AC, "Member 'ImageWidget_C_SetImage::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x0000B0, "Member 'ImageWidget_C_SetImage::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, K2Node_Select_Default) == 0x0000B4, "Member 'ImageWidget_C_SetImage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, K2Node_Select_Default_1) == 0x0000B8, "Member 'ImageWidget_C_SetImage::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ImageWidget_C_SetImage, CallFunc_MakeVector2D_ReturnValue) == 0x0000BC, "Member 'ImageWidget_C_SetImage::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

}

