#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameMenuVariatorEntry

#include "Basic.hpp"

#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function InGameMenuVariatorEntry.InGameMenuVariatorEntry_C.ExecuteUbergraph_InGameMenuVariatorEntry
// 0x0008 (0x0008 - 0x0000)
struct InGameMenuVariatorEntry_C_ExecuteUbergraph_InGameMenuVariatorEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InGameMenuVariatorEntry_C_ExecuteUbergraph_InGameMenuVariatorEntry) == 0x000004, "Wrong alignment on InGameMenuVariatorEntry_C_ExecuteUbergraph_InGameMenuVariatorEntry");
static_assert(sizeof(InGameMenuVariatorEntry_C_ExecuteUbergraph_InGameMenuVariatorEntry) == 0x000008, "Wrong size on InGameMenuVariatorEntry_C_ExecuteUbergraph_InGameMenuVariatorEntry");
static_assert(offsetof(InGameMenuVariatorEntry_C_ExecuteUbergraph_InGameMenuVariatorEntry, EntryPoint) == 0x000000, "Member 'InGameMenuVariatorEntry_C_ExecuteUbergraph_InGameMenuVariatorEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(InGameMenuVariatorEntry_C_ExecuteUbergraph_InGameMenuVariatorEntry, K2Node_Event_IsDesignTime) == 0x000004, "Member 'InGameMenuVariatorEntry_C_ExecuteUbergraph_InGameMenuVariatorEntry::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function InGameMenuVariatorEntry.InGameMenuVariatorEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct InGameMenuVariatorEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InGameMenuVariatorEntry_C_PreConstruct) == 0x000001, "Wrong alignment on InGameMenuVariatorEntry_C_PreConstruct");
static_assert(sizeof(InGameMenuVariatorEntry_C_PreConstruct) == 0x000001, "Wrong size on InGameMenuVariatorEntry_C_PreConstruct");
static_assert(offsetof(InGameMenuVariatorEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'InGameMenuVariatorEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function InGameMenuVariatorEntry.InGameMenuVariatorEntry_C.InitFromDifficulty
// 0x0100 (0x0100 - 0x0000)
struct InGameMenuVariatorEntry_C_InitFromDifficulty final
{
public:
	EGameDifficulty                               Difficulty;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSettings_Gameplay*                   CallFunc_GetRBSettings_Gameplay_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDifficultyConfig                      CallFunc_Map_Find_Value;                           // 0x0010(0x00E0)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD4[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InGameMenuVariatorEntry_C_InitFromDifficulty) == 0x000008, "Wrong alignment on InGameMenuVariatorEntry_C_InitFromDifficulty");
static_assert(sizeof(InGameMenuVariatorEntry_C_InitFromDifficulty) == 0x000100, "Wrong size on InGameMenuVariatorEntry_C_InitFromDifficulty");
static_assert(offsetof(InGameMenuVariatorEntry_C_InitFromDifficulty, Difficulty) == 0x000000, "Member 'InGameMenuVariatorEntry_C_InitFromDifficulty::Difficulty' has a wrong offset!");
static_assert(offsetof(InGameMenuVariatorEntry_C_InitFromDifficulty, CallFunc_GetRBSettings_Gameplay_ReturnValue) == 0x000008, "Member 'InGameMenuVariatorEntry_C_InitFromDifficulty::CallFunc_GetRBSettings_Gameplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuVariatorEntry_C_InitFromDifficulty, CallFunc_Map_Find_Value) == 0x000010, "Member 'InGameMenuVariatorEntry_C_InitFromDifficulty::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(InGameMenuVariatorEntry_C_InitFromDifficulty, CallFunc_Map_Find_ReturnValue) == 0x0000F0, "Member 'InGameMenuVariatorEntry_C_InitFromDifficulty::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuVariatorEntry_C_InitFromDifficulty, CallFunc_GetBrushResourceAsTexture2D_ReturnValue) == 0x0000F8, "Member 'InGameMenuVariatorEntry_C_InitFromDifficulty::CallFunc_GetBrushResourceAsTexture2D_ReturnValue' has a wrong offset!");

// Function InGameMenuVariatorEntry.InGameMenuVariatorEntry_C.InitFromVariatorInfo
// 0x0008 (0x0008 - 0x0000)
struct InGameMenuVariatorEntry_C_InitFromVariatorInfo final
{
public:
	class URBVariatorInfo*                        VariatorInfo;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InGameMenuVariatorEntry_C_InitFromVariatorInfo) == 0x000008, "Wrong alignment on InGameMenuVariatorEntry_C_InitFromVariatorInfo");
static_assert(sizeof(InGameMenuVariatorEntry_C_InitFromVariatorInfo) == 0x000008, "Wrong size on InGameMenuVariatorEntry_C_InitFromVariatorInfo");
static_assert(offsetof(InGameMenuVariatorEntry_C_InitFromVariatorInfo, VariatorInfo) == 0x000000, "Member 'InGameMenuVariatorEntry_C_InitFromVariatorInfo::VariatorInfo' has a wrong offset!");

}

