#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputBindingsMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InputBindingsMenu.InputBindingsMenu_C
// 0x0140 (0x04A8 - 0x0368)
class UInputBindingsMenu_C final : public URBMenuControlMapping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInputBindingEntryWidget_C*             OnestItemBinding;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             TwondItemBinding;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             ThreerdItemBinding;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             FourthItemBinding;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             FivethItemBinding;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             AcceptNotificationBinding;                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             ActiveSkillBinding;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             BackwardBinding;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg;                                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             BlockNotificationsBinding;                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        Blur;                                              // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             ChainingContinueBinding;                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             ChainingQuitBinding;                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             CrouchBinding;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Darkness;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             DeclineNotificationBinding;                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        ExitBtn;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             ForwardBinding;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             HoldCrouchBinding;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InputBlocker;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             InteractBinding;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             ItemDownBinding;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             ItemUpBinding;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             JumpBinding;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             LeftBinding;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             ObjectiveDisplayBinding;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             PeekAnalogBinding;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             PeekLeftBinding;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             PeekRightBinding;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             PushToTalkBinding;                                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             QuickThrow;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        ResetDefaultsBtn;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             RightBinding;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             RunBinding;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             TalkWheelBinding;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             ToggleNVBinding;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             TradeDropBinding;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             UseItemBinding;                                    // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          RebindInProgress;                                  // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_InputBindingsMenu(int32 EntryPoint);
	void Event_DuplicateMappingFound(class URBMenuControlMappingEntry* DuplicateEntry, bool bReplacingPrimaryKey);
	void Event_UpdateRebindStatus(bool IsRebindInProgress, bool bIsRebindingPrimaryKey);
	void OnResetKeyPressed();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BndEvt__ResetDefaultsBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void BndEvt__ExitBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void RefreshDisplay();
	void Init();
	void UpdateNavigationButtons();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InputBindingsMenu_C">();
	}
	static class UInputBindingsMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputBindingsMenu_C>();
	}
};
static_assert(alignof(UInputBindingsMenu_C) == 0x000008, "Wrong alignment on UInputBindingsMenu_C");
static_assert(sizeof(UInputBindingsMenu_C) == 0x0004A8, "Wrong size on UInputBindingsMenu_C");
static_assert(offsetof(UInputBindingsMenu_C, UberGraphFrame) == 0x000368, "Member 'UInputBindingsMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, OnestItemBinding) == 0x000370, "Member 'UInputBindingsMenu_C::OnestItemBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, TwondItemBinding) == 0x000378, "Member 'UInputBindingsMenu_C::TwondItemBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, ThreerdItemBinding) == 0x000380, "Member 'UInputBindingsMenu_C::ThreerdItemBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, FourthItemBinding) == 0x000388, "Member 'UInputBindingsMenu_C::FourthItemBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, FivethItemBinding) == 0x000390, "Member 'UInputBindingsMenu_C::FivethItemBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, AcceptNotificationBinding) == 0x000398, "Member 'UInputBindingsMenu_C::AcceptNotificationBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, ActiveSkillBinding) == 0x0003A0, "Member 'UInputBindingsMenu_C::ActiveSkillBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, BackwardBinding) == 0x0003A8, "Member 'UInputBindingsMenu_C::BackwardBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, bg) == 0x0003B0, "Member 'UInputBindingsMenu_C::bg' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, BlockNotificationsBinding) == 0x0003B8, "Member 'UInputBindingsMenu_C::BlockNotificationsBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, Blur) == 0x0003C0, "Member 'UInputBindingsMenu_C::Blur' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, ChainingContinueBinding) == 0x0003C8, "Member 'UInputBindingsMenu_C::ChainingContinueBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, ChainingQuitBinding) == 0x0003D0, "Member 'UInputBindingsMenu_C::ChainingQuitBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, CrouchBinding) == 0x0003D8, "Member 'UInputBindingsMenu_C::CrouchBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, Darkness) == 0x0003E0, "Member 'UInputBindingsMenu_C::Darkness' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, DeclineNotificationBinding) == 0x0003E8, "Member 'UInputBindingsMenu_C::DeclineNotificationBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, ExitBtn) == 0x0003F0, "Member 'UInputBindingsMenu_C::ExitBtn' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, ForwardBinding) == 0x0003F8, "Member 'UInputBindingsMenu_C::ForwardBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, HoldCrouchBinding) == 0x000400, "Member 'UInputBindingsMenu_C::HoldCrouchBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, InputBlocker) == 0x000408, "Member 'UInputBindingsMenu_C::InputBlocker' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, InteractBinding) == 0x000410, "Member 'UInputBindingsMenu_C::InteractBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, ItemDownBinding) == 0x000418, "Member 'UInputBindingsMenu_C::ItemDownBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, ItemUpBinding) == 0x000420, "Member 'UInputBindingsMenu_C::ItemUpBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, JumpBinding) == 0x000428, "Member 'UInputBindingsMenu_C::JumpBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, LeftBinding) == 0x000430, "Member 'UInputBindingsMenu_C::LeftBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, ObjectiveDisplayBinding) == 0x000438, "Member 'UInputBindingsMenu_C::ObjectiveDisplayBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, PeekAnalogBinding) == 0x000440, "Member 'UInputBindingsMenu_C::PeekAnalogBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, PeekLeftBinding) == 0x000448, "Member 'UInputBindingsMenu_C::PeekLeftBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, PeekRightBinding) == 0x000450, "Member 'UInputBindingsMenu_C::PeekRightBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, PushToTalkBinding) == 0x000458, "Member 'UInputBindingsMenu_C::PushToTalkBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, QuickThrow) == 0x000460, "Member 'UInputBindingsMenu_C::QuickThrow' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, ResetDefaultsBtn) == 0x000468, "Member 'UInputBindingsMenu_C::ResetDefaultsBtn' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, RightBinding) == 0x000470, "Member 'UInputBindingsMenu_C::RightBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, RunBinding) == 0x000478, "Member 'UInputBindingsMenu_C::RunBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, TalkWheelBinding) == 0x000480, "Member 'UInputBindingsMenu_C::TalkWheelBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, ToggleNVBinding) == 0x000488, "Member 'UInputBindingsMenu_C::ToggleNVBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, TradeDropBinding) == 0x000490, "Member 'UInputBindingsMenu_C::TradeDropBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, UseItemBinding) == 0x000498, "Member 'UInputBindingsMenu_C::UseItemBinding' has a wrong offset!");
static_assert(offsetof(UInputBindingsMenu_C, RebindInProgress) == 0x0004A0, "Member 'UInputBindingsMenu_C::RebindInProgress' has a wrong offset!");

}

