#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputBindingsMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function InputBindingsMenu.InputBindingsMenu_C.ExecuteUbergraph_InputBindingsMenu
// 0x0250 (0x0250 - 0x0000)
struct InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuControlMappingEntry*             K2Node_Event_duplicateEntry;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bReplacingPrimaryKey;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputBindingEntryWidget_C*             K2Node_DynamicCast_AsInput_Binding_Entry_Widget;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0028(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x00C0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0128(0x0018)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0148(0x0018)()
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button_1;               // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0168(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0180(0x0040)(HasGetValueTypeHash)
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button;                 // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01D8(0x0018)()
	class FText                                   CallFunc_FormatTextForDecorator_ReturnValue;       // 0x01F0(0x0018)()
	class URBPopUpConfirmCancelWidget*            CallFunc_CreatePopUpConfirmCancel_ReturnValue;     // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidget*                          CallFunc_GetFirstFocusableUserWidgetChild_ReturnValue; // 0x0218(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isRebindInProgress;                   // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsRebindingPrimaryKey;               // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x2];                                      // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x022C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x023C(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu) == 0x000008, "Wrong alignment on InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu");
static_assert(sizeof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu) == 0x000250, "Wrong size on InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, EntryPoint) == 0x000000, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_Event_duplicateEntry) == 0x000008, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_Event_duplicateEntry' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_Event_bReplacingPrimaryKey) == 0x000010, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_Event_bReplacingPrimaryKey' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, Temp_bool_Variable) == 0x000011, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_DynamicCast_AsInput_Binding_Entry_Widget) == 0x000018, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_DynamicCast_AsInput_Binding_Entry_Widget' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, Temp_byte_Variable) == 0x000021, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, CallFunc_GetText_ReturnValue) == 0x000028, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, CallFunc_Conv_NameToText_ReturnValue) == 0x0000C0, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_MakeArray_Array) == 0x0000D8, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E8, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, CallFunc_Format_ReturnValue) == 0x000128, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000140, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, Temp_byte_Variable_1) == 0x000141, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, Temp_bool_Variable_1) == 0x000142, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, Temp_text_Variable) == 0x000148, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_ComponentBoundEvent_Button_1) == 0x000160, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_Select_Default) == 0x000168, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_MakeStruct_FormatArgumentData_3) == 0x000180, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_ComponentBoundEvent_Button) == 0x0001C0, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_MakeArray_Array_1) == 0x0001C8, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, CallFunc_Format_ReturnValue_1) == 0x0001D8, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, CallFunc_FormatTextForDecorator_ReturnValue) == 0x0001F0, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::CallFunc_FormatTextForDecorator_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, CallFunc_CreatePopUpConfirmCancel_ReturnValue) == 0x000208, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::CallFunc_CreatePopUpConfirmCancel_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_Event_IsDesignTime) == 0x000210, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, CallFunc_GetFirstFocusableUserWidgetChild_ReturnValue) == 0x000218, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::CallFunc_GetFirstFocusableUserWidgetChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000220, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_Event_isRebindInProgress) == 0x000228, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_Event_isRebindInProgress' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_Event_bIsRebindingPrimaryKey) == 0x000229, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_Event_bIsRebindingPrimaryKey' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_CreateDelegate_OutputDelegate) == 0x00022C, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x00023C, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu, K2Node_Select_Default_1) == 0x00024C, "Member 'InputBindingsMenu_C_ExecuteUbergraph_InputBindingsMenu::K2Node_Select_Default_1' has a wrong offset!");

// Function InputBindingsMenu.InputBindingsMenu_C.Event_DuplicateMappingFound
// 0x0010 (0x0010 - 0x0000)
struct InputBindingsMenu_C_Event_DuplicateMappingFound final
{
public:
	class URBMenuControlMappingEntry*             DuplicateEntry;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReplacingPrimaryKey;                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InputBindingsMenu_C_Event_DuplicateMappingFound) == 0x000008, "Wrong alignment on InputBindingsMenu_C_Event_DuplicateMappingFound");
static_assert(sizeof(InputBindingsMenu_C_Event_DuplicateMappingFound) == 0x000010, "Wrong size on InputBindingsMenu_C_Event_DuplicateMappingFound");
static_assert(offsetof(InputBindingsMenu_C_Event_DuplicateMappingFound, DuplicateEntry) == 0x000000, "Member 'InputBindingsMenu_C_Event_DuplicateMappingFound::DuplicateEntry' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_Event_DuplicateMappingFound, bReplacingPrimaryKey) == 0x000008, "Member 'InputBindingsMenu_C_Event_DuplicateMappingFound::bReplacingPrimaryKey' has a wrong offset!");

// Function InputBindingsMenu.InputBindingsMenu_C.Event_UpdateRebindStatus
// 0x0002 (0x0002 - 0x0000)
struct InputBindingsMenu_C_Event_UpdateRebindStatus final
{
public:
	bool                                          IsRebindInProgress;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsRebindingPrimaryKey;                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InputBindingsMenu_C_Event_UpdateRebindStatus) == 0x000001, "Wrong alignment on InputBindingsMenu_C_Event_UpdateRebindStatus");
static_assert(sizeof(InputBindingsMenu_C_Event_UpdateRebindStatus) == 0x000002, "Wrong size on InputBindingsMenu_C_Event_UpdateRebindStatus");
static_assert(offsetof(InputBindingsMenu_C_Event_UpdateRebindStatus, IsRebindInProgress) == 0x000000, "Member 'InputBindingsMenu_C_Event_UpdateRebindStatus::IsRebindInProgress' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_Event_UpdateRebindStatus, bIsRebindingPrimaryKey) == 0x000001, "Member 'InputBindingsMenu_C_Event_UpdateRebindStatus::bIsRebindingPrimaryKey' has a wrong offset!");

// Function InputBindingsMenu.InputBindingsMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct InputBindingsMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InputBindingsMenu_C_PreConstruct) == 0x000001, "Wrong alignment on InputBindingsMenu_C_PreConstruct");
static_assert(sizeof(InputBindingsMenu_C_PreConstruct) == 0x000001, "Wrong size on InputBindingsMenu_C_PreConstruct");
static_assert(offsetof(InputBindingsMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'InputBindingsMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function InputBindingsMenu.InputBindingsMenu_C.BndEvt__ResetDefaultsBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct InputBindingsMenu_C_BndEvt__ResetDefaultsBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBindingsMenu_C_BndEvt__ResetDefaultsBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on InputBindingsMenu_C_BndEvt__ResetDefaultsBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(InputBindingsMenu_C_BndEvt__ResetDefaultsBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on InputBindingsMenu_C_BndEvt__ResetDefaultsBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(InputBindingsMenu_C_BndEvt__ResetDefaultsBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'InputBindingsMenu_C_BndEvt__ResetDefaultsBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function InputBindingsMenu.InputBindingsMenu_C.BndEvt__ExitBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct InputBindingsMenu_C_BndEvt__ExitBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBindingsMenu_C_BndEvt__ExitBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on InputBindingsMenu_C_BndEvt__ExitBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(InputBindingsMenu_C_BndEvt__ExitBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong size on InputBindingsMenu_C_BndEvt__ExitBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(InputBindingsMenu_C_BndEvt__ExitBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'InputBindingsMenu_C_BndEvt__ExitBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function InputBindingsMenu.InputBindingsMenu_C.RefreshDisplay
// 0x0020 (0x0020 - 0x0000)
struct InputBindingsMenu_C_RefreshDisplay final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuControlMappingEntry*             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InputBindingsMenu_C_RefreshDisplay) == 0x000008, "Wrong alignment on InputBindingsMenu_C_RefreshDisplay");
static_assert(sizeof(InputBindingsMenu_C_RefreshDisplay) == 0x000020, "Wrong size on InputBindingsMenu_C_RefreshDisplay");
static_assert(offsetof(InputBindingsMenu_C_RefreshDisplay, Temp_int_Array_Index_Variable) == 0x000000, "Member 'InputBindingsMenu_C_RefreshDisplay::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_RefreshDisplay, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'InputBindingsMenu_C_RefreshDisplay::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_RefreshDisplay, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'InputBindingsMenu_C_RefreshDisplay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_RefreshDisplay, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'InputBindingsMenu_C_RefreshDisplay::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_RefreshDisplay, CallFunc_Array_Get_Item) == 0x000010, "Member 'InputBindingsMenu_C_RefreshDisplay::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_RefreshDisplay, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'InputBindingsMenu_C_RefreshDisplay::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_RefreshDisplay, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'InputBindingsMenu_C_RefreshDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function InputBindingsMenu.InputBindingsMenu_C.Init
// 0x0048 (0x0048 - 0x0000)
struct InputBindingsMenu_C_Init final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputBindingEntryWidget_C*             K2Node_DynamicCast_AsInput_Binding_Entry_Widget;   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InputBindingsMenu_C_Init) == 0x000008, "Wrong alignment on InputBindingsMenu_C_Init");
static_assert(sizeof(InputBindingsMenu_C_Init) == 0x000048, "Wrong size on InputBindingsMenu_C_Init");
static_assert(offsetof(InputBindingsMenu_C_Init, Temp_int_Array_Index_Variable) == 0x000000, "Member 'InputBindingsMenu_C_Init::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_Init, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'InputBindingsMenu_C_Init::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'InputBindingsMenu_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_Init, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'InputBindingsMenu_C_Init::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_Init, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'InputBindingsMenu_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_Init, CallFunc_Array_Get_Item) == 0x000028, "Member 'InputBindingsMenu_C_Init::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_Init, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'InputBindingsMenu_C_Init::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_Init, K2Node_DynamicCast_AsInput_Binding_Entry_Widget) == 0x000038, "Member 'InputBindingsMenu_C_Init::K2Node_DynamicCast_AsInput_Binding_Entry_Widget' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_Init, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'InputBindingsMenu_C_Init::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function InputBindingsMenu.InputBindingsMenu_C.UpdateNavigationButtons
// 0x0060 (0x0060 - 0x0000)
struct InputBindingsMenu_C_UpdateNavigationButtons final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0040(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InputBindingsMenu_C_UpdateNavigationButtons) == 0x000008, "Wrong alignment on InputBindingsMenu_C_UpdateNavigationButtons");
static_assert(sizeof(InputBindingsMenu_C_UpdateNavigationButtons) == 0x000060, "Wrong size on InputBindingsMenu_C_UpdateNavigationButtons");
static_assert(offsetof(InputBindingsMenu_C_UpdateNavigationButtons, Temp_bool_Variable) == 0x000000, "Member 'InputBindingsMenu_C_UpdateNavigationButtons::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_UpdateNavigationButtons, Temp_text_Variable) == 0x000008, "Member 'InputBindingsMenu_C_UpdateNavigationButtons::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(InputBindingsMenu_C_UpdateNavigationButtons, Temp_text_Variable_1) == 0x000020, "Member 'InputBindingsMenu_C_UpdateNavigationButtons::Temp_text_Variable_1' has a wrong offset!");
