#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InputBindingEntryWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InputBindingEntryWidget.InputBindingEntryWidget_C
// 0x00D0 (0x0388 - 0x02B8)
class UInputBindingEntryWidget_C final : public URBMenuControlBindingEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UActionIconWidget_C*                    ActionIconWidget;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HoveringDetection;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Name_InputBindingEntryWidget_C;                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RebindButton;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RebindingImage;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleBackground;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ValueBackground;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputBindingsMenu_C*                   ParentMenu;                                        // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             NextWidget;                                        // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputBindingEntryWidget_C*             PreviousWidget;                                    // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            HoveredTint;                                       // 0x0310(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            HoveredTint_Semi;                                  // 0x0338(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NormalTint;                                        // 0x0360(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_InputBindingEntryWidget(int32 EntryPoint);
	void UpdateRebindStatus(bool bIsRebindInProgress);
	void BndEvt__HoveringDetection_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__HoveringDetection_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_131_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Init(class UInputBindingsMenu_C* Param_ParentMenu);
	void RefreshValue();
	void Highlight();
	void Downplay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InputBindingEntryWidget_C">();
	}
	static class UInputBindingEntryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputBindingEntryWidget_C>();
	}
};
static_assert(alignof(UInputBindingEntryWidget_C) == 0x000008, "Wrong alignment on UInputBindingEntryWidget_C");
static_assert(sizeof(UInputBindingEntryWidget_C) == 0x000388, "Wrong size on UInputBindingEntryWidget_C");
static_assert(offsetof(UInputBindingEntryWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UInputBindingEntryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInputBindingEntryWidget_C, ActionIconWidget) == 0x0002C0, "Member 'UInputBindingEntryWidget_C::ActionIconWidget' has a wrong offset!");
static_assert(offsetof(UInputBindingEntryWidget_C, HoveringDetection) == 0x0002C8, "Member 'UInputBindingEntryWidget_C::HoveringDetection' has a wrong offset!");
static_assert(offsetof(UInputBindingEntryWidget_C, Name_InputBindingEntryWidget_C) == 0x0002D0, "Member 'UInputBindingEntryWidget_C::Name_InputBindingEntryWidget_C' has a wrong offset!");
static_assert(offsetof(UInputBindingEntryWidget_C, RebindButton) == 0x0002D8, "Member 'UInputBindingEntryWidget_C::RebindButton' has a wrong offset!");
static_assert(offsetof(UInputBindingEntryWidget_C, RebindingImage) == 0x0002E0, "Member 'UInputBindingEntryWidget_C::RebindingImage' has a wrong offset!");
static_assert(offsetof(UInputBindingEntryWidget_C, TitleBackground) == 0x0002E8, "Member 'UInputBindingEntryWidget_C::TitleBackground' has a wrong offset!");
static_assert(offsetof(UInputBindingEntryWidget_C, ValueBackground) == 0x0002F0, "Member 'UInputBindingEntryWidget_C::ValueBackground' has a wrong offset!");
static_assert(offsetof(UInputBindingEntryWidget_C, ParentMenu) == 0x0002F8, "Member 'UInputBindingEntryWidget_C::ParentMenu' has a wrong offset!");
static_assert(offsetof(UInputBindingEntryWidget_C, NextWidget) == 0x000300, "Member 'UInputBindingEntryWidget_C::NextWidget' has a wrong offset!");
static_assert(offsetof(UInputBindingEntryWidget_C, PreviousWidget) == 0x000308, "Member 'UInputBindingEntryWidget_C::PreviousWidget' has a wrong offset!");
static_assert(offsetof(UInputBindingEntryWidget_C, HoveredTint) == 0x000310, "Member 'UInputBindingEntryWidget_C::HoveredTint' has a wrong offset!");
static_assert(offsetof(UInputBindingEntryWidget_C, HoveredTint_Semi) == 0x000338, "Member 'UInputBindingEntryWidget_C::HoveredTint_Semi' has a wrong offset!");
static_assert(offsetof(UInputBindingEntryWidget_C, NormalTint) == 0x000360, "Member 'UInputBindingEntryWidget_C::NormalTint' has a wrong offset!");

}

