#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IntermediateObjectiveTextWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IntermediateObjectiveTextWidget.IntermediateObjectiveTextWidget_C
// 0x0020 (0x0280 - 0x0260)
class UIntermediateObjectiveTextWidget_C final : public UUserWidget
{
public:
	class UInvalidationBox*                       InvalidationBox_IntermediateObjectiveWidget;       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ObjectiveStatusIcon;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         ObjectiveText;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ObjectiveStatus;                                   // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UpdateStatusAndText(bool Status, const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IntermediateObjectiveTextWidget_C">();
	}
	static class UIntermediateObjectiveTextWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntermediateObjectiveTextWidget_C>();
	}
};
static_assert(alignof(UIntermediateObjectiveTextWidget_C) == 0x000008, "Wrong alignment on UIntermediateObjectiveTextWidget_C");
static_assert(sizeof(UIntermediateObjectiveTextWidget_C) == 0x000280, "Wrong size on UIntermediateObjectiveTextWidget_C");
static_assert(offsetof(UIntermediateObjectiveTextWidget_C, InvalidationBox_IntermediateObjectiveWidget) == 0x000260, "Member 'UIntermediateObjectiveTextWidget_C::InvalidationBox_IntermediateObjectiveWidget' has a wrong offset!");
static_assert(offsetof(UIntermediateObjectiveTextWidget_C, ObjectiveStatusIcon) == 0x000268, "Member 'UIntermediateObjectiveTextWidget_C::ObjectiveStatusIcon' has a wrong offset!");
static_assert(offsetof(UIntermediateObjectiveTextWidget_C, ObjectiveText) == 0x000270, "Member 'UIntermediateObjectiveTextWidget_C::ObjectiveText' has a wrong offset!");
static_assert(offsetof(UIntermediateObjectiveTextWidget_C, ObjectiveStatus) == 0x000278, "Member 'UIntermediateObjectiveTextWidget_C::ObjectiveStatus' has a wrong offset!");

}

