#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaveWithPartyButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeaveWithPartyButton.LeaveWithPartyButton_C
// 0x00B0 (0x0310 - 0x0260)
class ULeaveWithPartyButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ButtonText;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Checkmark;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SelectButton;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bSelected;                                         // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHovered;                                          // 0x0281(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1A[0x6];                                     // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bEnabled;                                          // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1B[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonTextValue;                                   // 0x02A0(0x0018)(Edit, BlueprintVisible)
	struct FSlateFontInfo                         ButtonTextFont;                                    // 0x02B8(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void OnClicked__DelegateSignature();
	void ExecuteUbergraph_LeaveWithPartyButton(int32 EntryPoint);
	void BndEvt__SelectButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void UpdateState();
	void SetSelected(bool bInSelected);
	void SetEnabled(bool bInEnabled);
	void SetButtonText(const class FText& Param_ButtonText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LeaveWithPartyButton_C">();
	}
	static class ULeaveWithPartyButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaveWithPartyButton_C>();
	}
};
static_assert(alignof(ULeaveWithPartyButton_C) == 0x000008, "Wrong alignment on ULeaveWithPartyButton_C");
static_assert(sizeof(ULeaveWithPartyButton_C) == 0x000310, "Wrong size on ULeaveWithPartyButton_C");
static_assert(offsetof(ULeaveWithPartyButton_C, UberGraphFrame) == 0x000260, "Member 'ULeaveWithPartyButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULeaveWithPartyButton_C, ButtonText) == 0x000268, "Member 'ULeaveWithPartyButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(ULeaveWithPartyButton_C, Checkmark) == 0x000270, "Member 'ULeaveWithPartyButton_C::Checkmark' has a wrong offset!");
static_assert(offsetof(ULeaveWithPartyButton_C, SelectButton) == 0x000278, "Member 'ULeaveWithPartyButton_C::SelectButton' has a wrong offset!");
static_assert(offsetof(ULeaveWithPartyButton_C, bSelected) == 0x000280, "Member 'ULeaveWithPartyButton_C::bSelected' has a wrong offset!");
static_assert(offsetof(ULeaveWithPartyButton_C, bHovered) == 0x000281, "Member 'ULeaveWithPartyButton_C::bHovered' has a wrong offset!");
static_assert(offsetof(ULeaveWithPartyButton_C, OnClicked) == 0x000288, "Member 'ULeaveWithPartyButton_C::OnClicked' has a wrong offset!");
static_assert(offsetof(ULeaveWithPartyButton_C, bEnabled) == 0x000298, "Member 'ULeaveWithPartyButton_C::bEnabled' has a wrong offset!");
static_assert(offsetof(ULeaveWithPartyButton_C, ButtonTextValue) == 0x0002A0, "Member 'ULeaveWithPartyButton_C::ButtonTextValue' has a wrong offset!");
static_assert(offsetof(ULeaveWithPartyButton_C, ButtonTextFont) == 0x0002B8, "Member 'ULeaveWithPartyButton_C::ButtonTextFont' has a wrong offset!");

}

