#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelIndicatorWidget

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function LevelIndicatorWidget.LevelIndicatorWidget_C.ExecuteUbergraph_LevelIndicatorWidget
// 0x0014 (0x0014 - 0x0000)
struct LevelIndicatorWidget_C_ExecuteUbergraph_LevelIndicatorWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(LevelIndicatorWidget_C_ExecuteUbergraph_LevelIndicatorWidget) == 0x000004, "Wrong alignment on LevelIndicatorWidget_C_ExecuteUbergraph_LevelIndicatorWidget");
static_assert(sizeof(LevelIndicatorWidget_C_ExecuteUbergraph_LevelIndicatorWidget) == 0x000014, "Wrong size on LevelIndicatorWidget_C_ExecuteUbergraph_LevelIndicatorWidget");
static_assert(offsetof(LevelIndicatorWidget_C_ExecuteUbergraph_LevelIndicatorWidget, EntryPoint) == 0x000000, "Member 'LevelIndicatorWidget_C_ExecuteUbergraph_LevelIndicatorWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_ExecuteUbergraph_LevelIndicatorWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'LevelIndicatorWidget_C_ExecuteUbergraph_LevelIndicatorWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function LevelIndicatorWidget.LevelIndicatorWidget_C.Init
// 0x0070 (0x0070 - 0x0000)
struct LevelIndicatorWidget_C_Init final
{
public:
	int32                                         Param_Level;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReleaseCount;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D27[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D28[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D29[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0058(0x0018)()
};
static_assert(alignof(LevelIndicatorWidget_C_Init) == 0x000008, "Wrong alignment on LevelIndicatorWidget_C_Init");
static_assert(sizeof(LevelIndicatorWidget_C_Init) == 0x000070, "Wrong size on LevelIndicatorWidget_C_Init");
static_assert(offsetof(LevelIndicatorWidget_C_Init, Param_Level) == 0x000000, "Member 'LevelIndicatorWidget_C_Init::Param_Level' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_Init, ReleaseCount) == 0x000004, "Member 'LevelIndicatorWidget_C_Init::ReleaseCount' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_Init, Temp_int_Variable) == 0x000008, "Member 'LevelIndicatorWidget_C_Init::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_Init, Temp_object_Variable) == 0x000010, "Member 'LevelIndicatorWidget_C_Init::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_Init, Temp_object_Variable_1) == 0x000018, "Member 'LevelIndicatorWidget_C_Init::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_Init, Temp_object_Variable_2) == 0x000020, "Member 'LevelIndicatorWidget_C_Init::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_Init, Temp_object_Variable_3) == 0x000028, "Member 'LevelIndicatorWidget_C_Init::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_Init, Temp_bool_Variable) == 0x000030, "Member 'LevelIndicatorWidget_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_Init, Temp_object_Variable_4) == 0x000038, "Member 'LevelIndicatorWidget_C_Init::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_Init, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000040, "Member 'LevelIndicatorWidget_C_Init::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_Init, K2Node_Select_Default) == 0x000048, "Member 'LevelIndicatorWidget_C_Init::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_Init, K2Node_Select_Default_1) == 0x000050, "Member 'LevelIndicatorWidget_C_Init::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_Init, CallFunc_Conv_IntToText_ReturnValue) == 0x000058, "Member 'LevelIndicatorWidget_C_Init::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function LevelIndicatorWidget.LevelIndicatorWidget_C.PlayerLevelUpAnimation
// 0x0028 (0x0028 - 0x0000)
struct LevelIndicatorWidget_C_PlayerLevelUpAnimation final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LevelIndicatorWidget_C_PlayerLevelUpAnimation) == 0x000008, "Wrong alignment on LevelIndicatorWidget_C_PlayerLevelUpAnimation");
static_assert(sizeof(LevelIndicatorWidget_C_PlayerLevelUpAnimation) == 0x000028, "Wrong size on LevelIndicatorWidget_C_PlayerLevelUpAnimation");
static_assert(offsetof(LevelIndicatorWidget_C_PlayerLevelUpAnimation, Temp_delegate_Variable) == 0x000000, "Member 'LevelIndicatorWidget_C_PlayerLevelUpAnimation::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_PlayerLevelUpAnimation, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000010, "Member 'LevelIndicatorWidget_C_PlayerLevelUpAnimation::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_PlayerLevelUpAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'LevelIndicatorWidget_C_PlayerLevelUpAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LevelIndicatorWidget_C_PlayerLevelUpAnimation, CallFunc_PostEventGlobal_ReturnValue) == 0x000020, "Member 'LevelIndicatorWidget_C_PlayerLevelUpAnimation::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");

}

