#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelIndicatorWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LevelIndicatorWidget.LevelIndicatorWidget_C
// 0x0050 (0x02B0 - 0x0260)
class ULevelIndicatorWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LevelUp;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Fx;                                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LevelBrush;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LevelBrushLevelUp;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LevelNumberTxt;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LevelUpBackground;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             LevelUpAnimationFinished;                          // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Level;                                             // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Release_Count;                                     // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void LevelUpAnimationFinished__DelegateSignature();
	void ExecuteUbergraph_LevelIndicatorWidget(int32 EntryPoint);
	void LevelAnimationFinished();
	void Construct();
	void Init(int32 Param_Level, int32 ReleaseCount);
	void PlayerLevelUpAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LevelIndicatorWidget_C">();
	}
	static class ULevelIndicatorWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelIndicatorWidget_C>();
	}
};
static_assert(alignof(ULevelIndicatorWidget_C) == 0x000008, "Wrong alignment on ULevelIndicatorWidget_C");
static_assert(sizeof(ULevelIndicatorWidget_C) == 0x0002B0, "Wrong size on ULevelIndicatorWidget_C");
static_assert(offsetof(ULevelIndicatorWidget_C, UberGraphFrame) == 0x000260, "Member 'ULevelIndicatorWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULevelIndicatorWidget_C, LevelUp) == 0x000268, "Member 'ULevelIndicatorWidget_C::LevelUp' has a wrong offset!");
static_assert(offsetof(ULevelIndicatorWidget_C, Fx) == 0x000270, "Member 'ULevelIndicatorWidget_C::Fx' has a wrong offset!");
static_assert(offsetof(ULevelIndicatorWidget_C, LevelBrush) == 0x000278, "Member 'ULevelIndicatorWidget_C::LevelBrush' has a wrong offset!");
static_assert(offsetof(ULevelIndicatorWidget_C, LevelBrushLevelUp) == 0x000280, "Member 'ULevelIndicatorWidget_C::LevelBrushLevelUp' has a wrong offset!");
static_assert(offsetof(ULevelIndicatorWidget_C, LevelNumberTxt) == 0x000288, "Member 'ULevelIndicatorWidget_C::LevelNumberTxt' has a wrong offset!");
static_assert(offsetof(ULevelIndicatorWidget_C, LevelUpBackground) == 0x000290, "Member 'ULevelIndicatorWidget_C::LevelUpBackground' has a wrong offset!");
static_assert(offsetof(ULevelIndicatorWidget_C, LevelUpAnimationFinished) == 0x000298, "Member 'ULevelIndicatorWidget_C::LevelUpAnimationFinished' has a wrong offset!");
static_assert(offsetof(ULevelIndicatorWidget_C, Level) == 0x0002A8, "Member 'ULevelIndicatorWidget_C::Level' has a wrong offset!");
static_assert(offsetof(ULevelIndicatorWidget_C, Release_Count) == 0x0002AC, "Member 'ULevelIndicatorWidget_C::Release_Count' has a wrong offset!");

}

