#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LinearInventory

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LinearInventory.LinearInventory_C.ExecuteUbergraph_LinearInventory
// 0x0288 (0x0288 - 0x0000)
struct LinearInventory_C_ExecuteUbergraph_LinearInventory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E32[0x4];                                      // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E33[0x3];                                      // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E34[0x3];                                      // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E35[0x1];                                      // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_LastReset_Variable;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStageResetCount_ReturnValue;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInventoryUpdateEventType                     K2Node_Event_eventType;                            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E36[0x4];                                      // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0068(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E37[0x3];                                      // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetWatchedPlayer_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E38[0x6];                                      // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemDefinition                        CallFunc_GetCurrentEquippedItemDefinition_ReturnValue; // 0x00B8(0x0048)(ConstParm)
	bool                                          CallFunc_BP_GetPickupInFocus_outIsSwap;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E39[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPickup*                              CallFunc_BP_GetPickupInFocus_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3A[0x1];                                      // 0x0113(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BP_GetItemIndexForSwap_ReturnValue;       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3B[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPickup*                              CallFunc_BP_GetItemFromIndex_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3C[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0130(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3D[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULinearInventoryEntry_C*                K2Node_DynamicCast_AsLinear_Inventory_Entry;       // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x015E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3E[0x1];                                      // 0x015F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetWatchedPlayer_ReturnValue_1;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3F[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x016C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_E40[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_Event_oldPlayer;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_Event_newPlayer;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E41[0x1];                                      // 0x0197(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetRBPlayerState_ReturnValue;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E42[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FProfileId                             CallFunc_GetProfileId_ReturnValue;                 // 0x01A4(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_newDarknessState;                     // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E43[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBActiveSkill*                         K2Node_Event_ActiveSkill;                          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInCooldown;                        // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E44[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHudMode                                      K2Node_Event_newHudMode;                           // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInValidHudMode_ReturnValue;             // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_2;           // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E45[0x2];                                      // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetWatchedPlayer_ReturnValue_2;           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E46[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGameUserPreferences*                 CallFunc_GetRBGameUserPreferences_ReturnValue;     // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E47[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInventoryDisplay_ReturnValue;          // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E48[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCooldownTimeRemaining_ReturnValue;     // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E49[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E4A[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGameUserPreferences*                 CallFunc_GetRBGameUserPreferences_ReturnValue_1;   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E4B[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInventoryDisplay_ReturnValue_1;        // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E4C[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGameUserPreferences*                 CallFunc_GetRBGameUserPreferences_ReturnValue_2;   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E4D[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInventoryDisplay_ReturnValue_2;        // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_isRestricted;                         // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E4E[0x5];                                      // 0x026B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LinearInventory_C_ExecuteUbergraph_LinearInventory) == 0x000008, "Wrong alignment on LinearInventory_C_ExecuteUbergraph_LinearInventory");
static_assert(sizeof(LinearInventory_C_ExecuteUbergraph_LinearInventory) == 0x000288, "Wrong size on LinearInventory_C_ExecuteUbergraph_LinearInventory");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, EntryPoint) == 0x000000, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::EntryPoint' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, Temp_int_Array_Index_Variable) == 0x000018, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, Temp_bool_Variable) == 0x000030, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, Temp_bool_True_if_break_was_hit_Variable) == 0x000038, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_Not_PreBool_ReturnValue) == 0x00004C, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, Temp_bool_IsClosed_Variable) == 0x00004D, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, Temp_bool_Has_Been_Initd_Variable) == 0x00004E, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, Temp_int_LastReset_Variable) == 0x000050, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::Temp_int_LastReset_Variable' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetStageResetCount_ReturnValue) == 0x000054, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetStageResetCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000058, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_Event_eventType) == 0x000059, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_Event_eventType' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00005A, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_SwitchEnum_CmpSuccess) == 0x00005B, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetMenuManager_ReturnValue) == 0x000060, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_Event_MyGeometry) == 0x000068, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_Event_InDeltaTime) == 0x0000A0, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_IsValid_ReturnValue) == 0x0000A4, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetWatchedPlayer_ReturnValue) == 0x0000A8, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetWatchedPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, Temp_byte_Variable) == 0x0000B0, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_IsValid_ReturnValue_1) == 0x0000B1, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetCurrentEquippedItemDefinition_ReturnValue) == 0x0000B8, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetCurrentEquippedItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_BP_GetPickupInFocus_outIsSwap) == 0x000100, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_BP_GetPickupInFocus_outIsSwap' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_BP_GetPickupInFocus_ReturnValue) == 0x000108, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_BP_GetPickupInFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_IsValid_ReturnValue_2) == 0x000110, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000111, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_Not_PreBool_ReturnValue_1) == 0x000112, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_BP_GetItemIndexForSwap_ReturnValue) == 0x000114, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_BP_GetItemIndexForSwap_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, Temp_byte_Variable_1) == 0x000118, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_BP_GetItemFromIndex_ReturnValue) == 0x000120, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_BP_GetItemFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_IsValid_ReturnValue_3) == 0x000128, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_Event_IsDesignTime) == 0x000129, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetAllChildren_ReturnValue) == 0x000130, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_Array_Get_Item) == 0x000140, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_DynamicCast_AsLinear_Inventory_Entry) == 0x000150, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_DynamicCast_AsLinear_Inventory_Entry' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_Less_IntInt_ReturnValue) == 0x000159, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_IsValid_ReturnValue_4) == 0x00015A, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_BooleanAND_ReturnValue) == 0x00015B, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00015C, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_BooleanAND_ReturnValue_1) == 0x00015D, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00015E, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetWatchedPlayer_ReturnValue_1) == 0x000160, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetWatchedPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_IsValid_ReturnValue_5) == 0x000168, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_CreateDelegate_OutputDelegate_2) == 0x00016C, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_Event_oldPlayer) == 0x000180, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_Event_oldPlayer' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_Event_newPlayer) == 0x000188, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_Event_newPlayer' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_Array_Length_ReturnValue_1) == 0x000190, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_IsValid_ReturnValue_6) == 0x000194, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_Greater_IntInt_ReturnValue) == 0x000195, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_BooleanOR_ReturnValue) == 0x000196, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetRBPlayerState_ReturnValue) == 0x000198, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetRBPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_IsValid_ReturnValue_7) == 0x0001A0, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_IsValid_ReturnValue_8) == 0x0001A1, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetProfileId_ReturnValue) == 0x0001A4, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetProfileId_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_MakeVector2D_ReturnValue) == 0x0001B4, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetRenderOpacity_ReturnValue) == 0x0001BC, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0001C0, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, Temp_bool_Variable_1) == 0x0001C1, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_CustomEvent_InVisibility) == 0x0001C2, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_Event_newDarknessState) == 0x0001C3, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_Event_newDarknessState' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_Event_ActiveSkill) == 0x0001C8, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_Event_ActiveSkill' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_Event_bIsInCooldown) == 0x0001D0, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_Event_bIsInCooldown' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0001D8, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0001E0, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetRenderOpacity_ReturnValue_1) == 0x0001E8, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetRenderOpacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x0001EC, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_Event_newHudMode) == 0x0001ED, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_Event_newHudMode' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_IsInValidHudMode_ReturnValue) == 0x0001EE, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_IsInValidHudMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001EF, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetRenderOpacity_ReturnValue_2) == 0x0001F0, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetRenderOpacity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, Temp_bool_Variable_2) == 0x0001F4, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x0001F5, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetWatchedPlayer_ReturnValue_2) == 0x0001F8, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetWatchedPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_IsValid_ReturnValue_9) == 0x000200, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetRBGameUserPreferences_ReturnValue) == 0x000208, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetRBGameUserPreferences_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_IsValid_ReturnValue_10) == 0x000210, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetInventoryDisplay_ReturnValue) == 0x000214, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetInventoryDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000218, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetCooldownTimeRemaining_ReturnValue) == 0x00021C, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetCooldownTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_Select_Default) == 0x000220, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_Add_FloatFloat_ReturnValue) == 0x000228, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_IsAnimationPlaying_ReturnValue) == 0x00022C, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000230, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000238, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetRBGameUserPreferences_ReturnValue_1) == 0x000240, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetRBGameUserPreferences_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_BooleanAND_ReturnValue_2) == 0x000248, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetInventoryDisplay_ReturnValue_1) == 0x00024C, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetInventoryDisplay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000250, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetRBGameUserPreferences_ReturnValue_2) == 0x000258, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetRBGameUserPreferences_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_BooleanAND_ReturnValue_3) == 0x000260, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_GetInventoryDisplay_ReturnValue_2) == 0x000264, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_GetInventoryDisplay_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_BooleanAND_ReturnValue_4) == 0x000268, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_Greater_IntInt_ReturnValue_3) == 0x000269, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_Event_isRestricted) == 0x00026A, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_Event_isRestricted' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_Select_Default_1) == 0x000270, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, CallFunc_PlayAnimationForward_ReturnValue_4) == 0x000278, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::CallFunc_PlayAnimationForward_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_ExecuteUbergraph_LinearInventory, K2Node_Select_Default_2) == 0x000280, "Member 'LinearInventory_C_ExecuteUbergraph_LinearInventory::K2Node_Select_Default_2' has a wrong offset!");

// Function LinearInventory.LinearInventory_C.Event_RefreshASRestriction
// 0x0001 (0x0001 - 0x0000)
struct LinearInventory_C_Event_RefreshASRestriction final
{
public:
	bool                                          IsRestricted;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LinearInventory_C_Event_RefreshASRestriction) == 0x000001, "Wrong alignment on LinearInventory_C_Event_RefreshASRestriction");
static_assert(sizeof(LinearInventory_C_Event_RefreshASRestriction) == 0x000001, "Wrong size on LinearInventory_C_Event_RefreshASRestriction");
static_assert(offsetof(LinearInventory_C_Event_RefreshASRestriction, IsRestricted) == 0x000000, "Member 'LinearInventory_C_Event_RefreshASRestriction::IsRestricted' has a wrong offset!");

// Function LinearInventory.LinearInventory_C.Event_OnHudModeChanged
// 0x0001 (0x0001 - 0x0000)
struct LinearInventory_C_Event_OnHudModeChanged final
{
public:
	EHudMode                                      NewHudMode;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LinearInventory_C_Event_OnHudModeChanged) == 0x000001, "Wrong alignment on LinearInventory_C_Event_OnHudModeChanged");
static_assert(sizeof(LinearInventory_C_Event_OnHudModeChanged) == 0x000001, "Wrong size on LinearInventory_C_Event_OnHudModeChanged");
static_assert(offsetof(LinearInventory_C_Event_OnHudModeChanged, NewHudMode) == 0x000000, "Member 'LinearInventory_C_Event_OnHudModeChanged::NewHudMode' has a wrong offset!");

// Function LinearInventory.LinearInventory_C.Event_OnIsInCooldownChanged
// 0x0010 (0x0010 - 0x0000)
struct LinearInventory_C_Event_OnIsInCooldownChanged final
{
public:
	class ARBActiveSkill*                         ActiveSkill;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInCooldown;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LinearInventory_C_Event_OnIsInCooldownChanged) == 0x000008, "Wrong alignment on LinearInventory_C_Event_OnIsInCooldownChanged");
static_assert(sizeof(LinearInventory_C_Event_OnIsInCooldownChanged) == 0x000010, "Wrong size on LinearInventory_C_Event_OnIsInCooldownChanged");
static_assert(offsetof(LinearInventory_C_Event_OnIsInCooldownChanged, ActiveSkill) == 0x000000, "Member 'LinearInventory_C_Event_OnIsInCooldownChanged::ActiveSkill' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_Event_OnIsInCooldownChanged, bIsInCooldown) == 0x000008, "Member 'LinearInventory_C_Event_OnIsInCooldownChanged::bIsInCooldown' has a wrong offset!");

// Function LinearInventory.LinearInventory_C.Event_RefreshDarknessIndicator
// 0x0001 (0x0001 - 0x0000)
struct LinearInventory_C_Event_RefreshDarknessIndicator final
{
public:
	bool                                          NewDarknessState;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LinearInventory_C_Event_RefreshDarknessIndicator) == 0x000001, "Wrong alignment on LinearInventory_C_Event_RefreshDarknessIndicator");
static_assert(sizeof(LinearInventory_C_Event_RefreshDarknessIndicator) == 0x000001, "Wrong size on LinearInventory_C_Event_RefreshDarknessIndicator");
static_assert(offsetof(LinearInventory_C_Event_RefreshDarknessIndicator, NewDarknessState) == 0x000000, "Member 'LinearInventory_C_Event_RefreshDarknessIndicator::NewDarknessState' has a wrong offset!");

// Function LinearInventory.LinearInventory_C.OnSpeakerVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct LinearInventory_C_OnSpeakerVisibilityChanged final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LinearInventory_C_OnSpeakerVisibilityChanged) == 0x000001, "Wrong alignment on LinearInventory_C_OnSpeakerVisibilityChanged");
static_assert(sizeof(LinearInventory_C_OnSpeakerVisibilityChanged) == 0x000001, "Wrong size on LinearInventory_C_OnSpeakerVisibilityChanged");
static_assert(offsetof(LinearInventory_C_OnSpeakerVisibilityChanged, InVisibility) == 0x000000, "Member 'LinearInventory_C_OnSpeakerVisibilityChanged::InVisibility' has a wrong offset!");

// Function LinearInventory.LinearInventory_C.Event_OnWatchedPlayerChanged
// 0x0010 (0x0010 - 0x0000)
struct LinearInventory_C_Event_OnWatchedPlayerChanged final
{
public:
	class ARBPlayer*                              OldPlayer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              NewPlayer;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LinearInventory_C_Event_OnWatchedPlayerChanged) == 0x000008, "Wrong alignment on LinearInventory_C_Event_OnWatchedPlayerChanged");
static_assert(sizeof(LinearInventory_C_Event_OnWatchedPlayerChanged) == 0x000010, "Wrong size on LinearInventory_C_Event_OnWatchedPlayerChanged");
static_assert(offsetof(LinearInventory_C_Event_OnWatchedPlayerChanged, OldPlayer) == 0x000000, "Member 'LinearInventory_C_Event_OnWatchedPlayerChanged::OldPlayer' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_Event_OnWatchedPlayerChanged, NewPlayer) == 0x000008, "Member 'LinearInventory_C_Event_OnWatchedPlayerChanged::NewPlayer' has a wrong offset!");

// Function LinearInventory.LinearInventory_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LinearInventory_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LinearInventory_C_PreConstruct) == 0x000001, "Wrong alignment on LinearInventory_C_PreConstruct");
static_assert(sizeof(LinearInventory_C_PreConstruct) == 0x000001, "Wrong size on LinearInventory_C_PreConstruct");
static_assert(offsetof(LinearInventory_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LinearInventory_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LinearInventory.LinearInventory_C.Tick
// 0x003C (0x003C - 0x0000)
struct LinearInventory_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LinearInventory_C_Tick) == 0x000004, "Wrong alignment on LinearInventory_C_Tick");
static_assert(sizeof(LinearInventory_C_Tick) == 0x00003C, "Wrong size on LinearInventory_C_Tick");
static_assert(offsetof(LinearInventory_C_Tick, MyGeometry) == 0x000000, "Member 'LinearInventory_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(LinearInventory_C_Tick, InDeltaTime) == 0x000038, "Member 'LinearInventory_C_Tick::InDeltaTime' has a wrong offset!");

// Function LinearInventory.LinearInventory_C.Event_Refresh
// 0x0001 (0x0001 - 0x0000)
struct LinearInventory_C_Event_Refresh final
{
public:
	EInventoryUpdateEventType                     EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LinearInventory_C_Event_Refresh) == 0x000001, "Wrong alignment on LinearInventory_C_Event_Refresh");
static_assert(sizeof(LinearInventory_C_Event_Refresh) == 0x000001, "Wrong size on LinearInventory_C_Event_Refresh");
static_assert(offsetof(LinearInventory_C_Event_Refresh, EventType) == 0x000000, "Member 'LinearInventory_C_Event_Refresh::EventType' has a wrong offset!");

// Function LinearInventory.LinearInventory_C.UpdateEquippedItem
// 0x0078 (0x0078 - 0x0000)
struct LinearInventory_C_UpdateEquippedItem final
{
public:
	class ARBPickup*                              CurrentEquippedItem;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E4F[0x3];                                      // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E50[0x3];                                      // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E51[0x3];                                      // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E52[0x6];                                      // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetWatchedPlayer_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
