#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadoutMenuLibrary

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function LoadoutMenuLibrary.LoadoutMenuLibrary_C.GetActiveSkillColor
// 0x0108 (0x0108 - 0x0000)
struct LoadoutMenuLibrary_C_GetActiveSkillColor final
{
public:
	EActiveSkillType                              ActiveSkillType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28E5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            Color;                                             // 0x0010(0x0028)(Parm, OutParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0028)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28E6[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0068(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0090(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00B8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x00E0(0x0028)()
};
static_assert(alignof(LoadoutMenuLibrary_C_GetActiveSkillColor) == 0x000008, "Wrong alignment on LoadoutMenuLibrary_C_GetActiveSkillColor");
static_assert(sizeof(LoadoutMenuLibrary_C_GetActiveSkillColor) == 0x000108, "Wrong size on LoadoutMenuLibrary_C_GetActiveSkillColor");
static_assert(offsetof(LoadoutMenuLibrary_C_GetActiveSkillColor, ActiveSkillType) == 0x000000, "Member 'LoadoutMenuLibrary_C_GetActiveSkillColor::ActiveSkillType' has a wrong offset!");
static_assert(offsetof(LoadoutMenuLibrary_C_GetActiveSkillColor, __WorldContext) == 0x000008, "Member 'LoadoutMenuLibrary_C_GetActiveSkillColor::__WorldContext' has a wrong offset!");
static_assert(offsetof(LoadoutMenuLibrary_C_GetActiveSkillColor, Color) == 0x000010, "Member 'LoadoutMenuLibrary_C_GetActiveSkillColor::Color' has a wrong offset!");
static_assert(offsetof(LoadoutMenuLibrary_C_GetActiveSkillColor, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'LoadoutMenuLibrary_C_GetActiveSkillColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(LoadoutMenuLibrary_C_GetActiveSkillColor, K2Node_SwitchEnum_CmpSuccess) == 0x000060, "Member 'LoadoutMenuLibrary_C_GetActiveSkillColor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LoadoutMenuLibrary_C_GetActiveSkillColor, K2Node_MakeStruct_SlateColor_1) == 0x000068, "Member 'LoadoutMenuLibrary_C_GetActiveSkillColor::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(LoadoutMenuLibrary_C_GetActiveSkillColor, K2Node_MakeStruct_SlateColor_2) == 0x000090, "Member 'LoadoutMenuLibrary_C_GetActiveSkillColor::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(LoadoutMenuLibrary_C_GetActiveSkillColor, K2Node_MakeStruct_SlateColor_3) == 0x0000B8, "Member 'LoadoutMenuLibrary_C_GetActiveSkillColor::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(LoadoutMenuLibrary_C_GetActiveSkillColor, K2Node_MakeStruct_SlateColor_4) == 0x0000E0, "Member 'LoadoutMenuLibrary_C_GetActiveSkillColor::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");

}

