#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function LoadingScreen.LoadingScreen_C.ExecuteUbergraph_LoadingScreen
// 0x0190 (0x0190 - 0x0000)
struct LoadingScreen_C_ExecuteUbergraph_LoadingScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB2[0x1];                                     // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0058(0x0028)()
	bool                                          Temp_bool_Variable_3;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_skipIntro;                            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_skipOutro;                            // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB3[0x5];                                     // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB4[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB5[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB6[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_Select_Default_1;                           // 0x00C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB7[0x6];                                     // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_2;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default_3;                           // 0x00E8(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasPlayedTutorialMap_ReturnValue;         // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB8[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue;        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenUrl_ReturnValue;                      // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CB9[0x2];                                     // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Random_OutItem;                     // 0x0138(0x0018)()
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CBA[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatTextForDecorator_ReturnValue;       // 0x0158(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_Select_Default_4;                           // 0x0180(0x0010)(ReferenceParm)
};
static_assert(alignof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen) == 0x000008, "Wrong alignment on LoadingScreen_C_ExecuteUbergraph_LoadingScreen");
static_assert(sizeof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen) == 0x000190, "Wrong size on LoadingScreen_C_ExecuteUbergraph_LoadingScreen");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, EntryPoint) == 0x000000, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, Temp_float_Variable) == 0x000004, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, Temp_float_Variable_1) == 0x000008, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, Temp_bool_Variable) == 0x00002C, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, Temp_bool_Variable_1) == 0x00002D, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, Temp_bool_Variable_2) == 0x00002E, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, K2Node_MakeStruct_SlateColor_1) == 0x000058, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, Temp_bool_Variable_3) == 0x000080, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, K2Node_Event_skipIntro) == 0x000081, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::K2Node_Event_skipIntro' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, K2Node_Event_skipOutro) == 0x000082, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::K2Node_Event_skipOutro' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000088, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, Temp_bool_Variable_4) == 0x000090, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, K2Node_Select_Default) == 0x000094, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000098, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_Array_IsEmpty_ReturnValue) == 0x0000A0, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000A8, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000B0, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_GetRBGameState_ReturnValue) == 0x0000B8, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_GetRBGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, K2Node_Select_Default_1) == 0x0000C8, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D8, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_BooleanAND_ReturnValue) == 0x0000D9, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, K2Node_Select_Default_2) == 0x0000E0, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, K2Node_Select_Default_3) == 0x0000E8, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x000110, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_HasPlayedTutorialMap_ReturnValue) == 0x000120, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_HasPlayedTutorialMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_Not_PreBool_ReturnValue) == 0x000121, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_Not_PreBool_ReturnValue_1) == 0x000122, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_BooleanAND_ReturnValue_1) == 0x000123, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_GetRBGameModeMainMenu_ReturnValue) == 0x000128, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_GetRBGameModeMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_IsValid_ReturnValue_1) == 0x000130, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_Play_ReturnValue) == 0x000131, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_BooleanAND_ReturnValue_2) == 0x000132, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_OpenUrl_ReturnValue) == 0x000133, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_OpenUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_BooleanOR_ReturnValue) == 0x000134, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000135, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_Array_Random_OutItem) == 0x000138, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_Array_Random_OutIndex) == 0x000150, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, CallFunc_FormatTextForDecorator_ReturnValue) == 0x000158, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::CallFunc_FormatTextForDecorator_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, K2Node_MakeArray_Array) == 0x000170, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_ExecuteUbergraph_LoadingScreen, K2Node_Select_Default_4) == 0x000180, "Member 'LoadingScreen_C_ExecuteUbergraph_LoadingScreen::K2Node_Select_Default_4' has a wrong offset!");

// Function LoadingScreen.LoadingScreen_C.Event_StopLoadingScreen
// 0x0001 (0x0001 - 0x0000)
struct LoadingScreen_C_Event_StopLoadingScreen final
{
public:
	bool                                          SkipOutro;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoadingScreen_C_Event_StopLoadingScreen) == 0x000001, "Wrong alignment on LoadingScreen_C_Event_StopLoadingScreen");
static_assert(sizeof(LoadingScreen_C_Event_StopLoadingScreen) == 0x000001, "Wrong size on LoadingScreen_C_Event_StopLoadingScreen");
static_assert(offsetof(LoadingScreen_C_Event_StopLoadingScreen, SkipOutro) == 0x000000, "Member 'LoadingScreen_C_Event_StopLoadingScreen::SkipOutro' has a wrong offset!");

// Function LoadingScreen.LoadingScreen_C.Event_StartLoadingScreen
// 0x0001 (0x0001 - 0x0000)
struct LoadingScreen_C_Event_StartLoadingScreen final
{
public:
	bool                                          SkipIntro;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoadingScreen_C_Event_StartLoadingScreen) == 0x000001, "Wrong alignment on LoadingScreen_C_Event_StartLoadingScreen");
static_assert(sizeof(LoadingScreen_C_Event_StartLoadingScreen) == 0x000001, "Wrong size on LoadingScreen_C_Event_StartLoadingScreen");
static_assert(offsetof(LoadingScreen_C_Event_StartLoadingScreen, SkipIntro) == 0x000000, "Member 'LoadingScreen_C_Event_StartLoadingScreen::SkipIntro' has a wrong offset!");

// Function LoadingScreen.LoadingScreen_C.GetProgressionText
// 0x00A0 (0x00A0 - 0x0000)
struct LoadingScreen_C_GetProgressionText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class URBWorld*                               CallFunc_GetRBWorld_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CBB[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLoadProgressPercentage_ReturnValue;    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoadingScreen_C_GetProgressionText) == 0x000008, "Wrong alignment on LoadingScreen_C_GetProgressionText");
static_assert(sizeof(LoadingScreen_C_GetProgressionText) == 0x0000A0, "Wrong size on LoadingScreen_C_GetProgressionText");
static_assert(offsetof(LoadingScreen_C_GetProgressionText, ReturnValue) == 0x000000, "Member 'LoadingScreen_C_GetProgressionText::ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_GetProgressionText, CallFunc_GetRBWorld_ReturnValue) == 0x000018, "Member 'LoadingScreen_C_GetProgressionText::CallFunc_GetRBWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_GetProgressionText, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'LoadingScreen_C_GetProgressionText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_GetProgressionText, CallFunc_GetLoadProgressPercentage_ReturnValue) == 0x000024, "Member 'LoadingScreen_C_GetProgressionText::CallFunc_GetLoadProgressPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_GetProgressionText, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'LoadingScreen_C_GetProgressionText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_GetProgressionText, K2Node_MakeArray_Array) == 0x000068, "Member 'LoadingScreen_C_GetProgressionText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_GetProgressionText, CallFunc_GetRBGameState_ReturnValue) == 0x000078, "Member 'LoadingScreen_C_GetProgressionText::CallFunc_GetRBGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_GetProgressionText, CallFunc_Format_ReturnValue) == 0x000080, "Member 'LoadingScreen_C_GetProgressionText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_GetProgressionText, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'LoadingScreen_C_GetProgressionText::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadingScreen_C_GetProgressionText, K2Node_SwitchEnum_CmpSuccess) == 0x000099, "Member 'LoadingScreen_C_GetProgressionText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

