#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadoutRecap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "OPP_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadoutRecap.LoadoutRecap_C
// 0x0080 (0x02E0 - 0x0260)
class ULoadoutRecap_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCoreUpgradesButton_C*                  CoreUpgradesButton;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkSlotsButton_C*                     PerkSlotsButton_Medecine;                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkSlotsButton_C*                     PerkSlotsButton_Skill;                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkSlotsButton_C*                     PerkSlotsButton_Tool;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URigSlotButton_C*                       RigSlotButton;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitlePerks;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleRig;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleRx;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnRigButtonClicked;                                // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPerkSlotsButtonClicked;                          // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCoreUpgradesButtonClicked;                       // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUserWidget*                            LastFocusedWidget;                                 // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void Refresh();
	void Init();
	void BndEvt__LoadoutRecap_RigSlotButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void BndEvt__LoadoutRecap_PerkSlotsButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__LoadoutRecap_CoreUpgradesButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__LoadoutRecap_PerkSlotsButton_Skill_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__LoadoutRecap_PerkSlotsButton_Medecine_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void Construct();
	void OnUpdateNewStatus();
	void ExecuteUbergraph_LoadoutRecap(int32 EntryPoint);
	void OnCoreUpgradesButtonClicked__DelegateSignature();
	void OnPerkSlotsButtonClicked__DelegateSignature(EPerkCategory PerkCategory);
	void OnRigButtonClicked__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadoutRecap_C">();
	}
	static class ULoadoutRecap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadoutRecap_C>();
	}
};
static_assert(alignof(ULoadoutRecap_C) == 0x000008, "Wrong alignment on ULoadoutRecap_C");
static_assert(sizeof(ULoadoutRecap_C) == 0x0002E0, "Wrong size on ULoadoutRecap_C");
static_assert(offsetof(ULoadoutRecap_C, UberGraphFrame) == 0x000260, "Member 'ULoadoutRecap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoadoutRecap_C, CoreUpgradesButton) == 0x000268, "Member 'ULoadoutRecap_C::CoreUpgradesButton' has a wrong offset!");
static_assert(offsetof(ULoadoutRecap_C, PerkSlotsButton_Medecine) == 0x000270, "Member 'ULoadoutRecap_C::PerkSlotsButton_Medecine' has a wrong offset!");
static_assert(offsetof(ULoadoutRecap_C, PerkSlotsButton_Skill) == 0x000278, "Member 'ULoadoutRecap_C::PerkSlotsButton_Skill' has a wrong offset!");
static_assert(offsetof(ULoadoutRecap_C, PerkSlotsButton_Tool) == 0x000280, "Member 'ULoadoutRecap_C::PerkSlotsButton_Tool' has a wrong offset!");
static_assert(offsetof(ULoadoutRecap_C, RigSlotButton) == 0x000288, "Member 'ULoadoutRecap_C::RigSlotButton' has a wrong offset!");
static_assert(offsetof(ULoadoutRecap_C, TitlePerks) == 0x000290, "Member 'ULoadoutRecap_C::TitlePerks' has a wrong offset!");
static_assert(offsetof(ULoadoutRecap_C, TitleRig) == 0x000298, "Member 'ULoadoutRecap_C::TitleRig' has a wrong offset!");
static_assert(offsetof(ULoadoutRecap_C, TitleRx) == 0x0002A0, "Member 'ULoadoutRecap_C::TitleRx' has a wrong offset!");
static_assert(offsetof(ULoadoutRecap_C, OnRigButtonClicked) == 0x0002A8, "Member 'ULoadoutRecap_C::OnRigButtonClicked' has a wrong offset!");
static_assert(offsetof(ULoadoutRecap_C, OnPerkSlotsButtonClicked) == 0x0002B8, "Member 'ULoadoutRecap_C::OnPerkSlotsButtonClicked' has a wrong offset!");
static_assert(offsetof(ULoadoutRecap_C, OnCoreUpgradesButtonClicked) == 0x0002C8, "Member 'ULoadoutRecap_C::OnCoreUpgradesButtonClicked' has a wrong offset!");
static_assert(offsetof(ULoadoutRecap_C, LastFocusedWidget) == 0x0002D8, "Member 'ULoadoutRecap_C::LastFocusedWidget' has a wrong offset!");

}

