#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lobby_Persistent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Lobby_Persistent.Lobby_Persistent_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct Lobby_Persistent_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_Persistent_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on Lobby_Persistent_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(Lobby_Persistent_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on Lobby_Persistent_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(Lobby_Persistent_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'Lobby_Persistent_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

// Function Lobby_Persistent.Lobby_Persistent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Lobby_Persistent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_Persistent_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on Lobby_Persistent_C_ReceiveEndPlay");
static_assert(sizeof(Lobby_Persistent_C_ReceiveEndPlay) == 0x000001, "Wrong size on Lobby_Persistent_C_ReceiveEndPlay");
static_assert(offsetof(Lobby_Persistent_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'Lobby_Persistent_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function Lobby_Persistent.Lobby_Persistent_C.ExecuteUbergraph_Lobby_Persistent
// 0x0008 (0x0008 - 0x0000)
struct Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckFeatureSwitch_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFeatureSwitch_ReturnValue_1;         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFeatureSwitch_ReturnValue_2;         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent) == 0x000004, "Wrong alignment on Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent");
static_assert(sizeof(Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent) == 0x000008, "Wrong size on Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent");
static_assert(offsetof(Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent, EntryPoint) == 0x000000, "Member 'Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent, K2Node_Event_EndPlayReason) == 0x000004, "Member 'Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent, CallFunc_CheckFeatureSwitch_ReturnValue) == 0x000005, "Member 'Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent::CallFunc_CheckFeatureSwitch_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent, CallFunc_CheckFeatureSwitch_ReturnValue_1) == 0x000006, "Member 'Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent::CallFunc_CheckFeatureSwitch_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent, CallFunc_CheckFeatureSwitch_ReturnValue_2) == 0x000007, "Member 'Lobby_Persistent_C_ExecuteUbergraph_Lobby_Persistent::CallFunc_CheckFeatureSwitch_ReturnValue_2' has a wrong offset!");

}

