#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyCellTVMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NarrativeScreenBase_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LobbyCellTV-01_BP.LobbyCellTV-01_BP_C
// 0x0020 (0x0410 - 0x03F0)
class ALobbyCellTVMinus01_BP_C final : public ANarrativeScreenBase_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_LobbyCellTVMinus01_BP_C;            // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   CeilingAttach;                                     // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pole;                                              // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SupportMinus01;                                    // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_LobbyCellTVMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyCellTV-01_BP_C">();
	}
	static class ALobbyCellTVMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobbyCellTVMinus01_BP_C>();
	}
};
static_assert(alignof(ALobbyCellTVMinus01_BP_C) == 0x000008, "Wrong alignment on ALobbyCellTVMinus01_BP_C");
static_assert(sizeof(ALobbyCellTVMinus01_BP_C) == 0x000410, "Wrong size on ALobbyCellTVMinus01_BP_C");
static_assert(offsetof(ALobbyCellTVMinus01_BP_C, UberGraphFrame_LobbyCellTVMinus01_BP_C) == 0x0003F0, "Member 'ALobbyCellTVMinus01_BP_C::UberGraphFrame_LobbyCellTVMinus01_BP_C' has a wrong offset!");
static_assert(offsetof(ALobbyCellTVMinus01_BP_C, CeilingAttach) == 0x0003F8, "Member 'ALobbyCellTVMinus01_BP_C::CeilingAttach' has a wrong offset!");
static_assert(offsetof(ALobbyCellTVMinus01_BP_C, Pole) == 0x000400, "Member 'ALobbyCellTVMinus01_BP_C::Pole' has a wrong offset!");
static_assert(offsetof(ALobbyCellTVMinus01_BP_C, SupportMinus01) == 0x000408, "Member 'ALobbyCellTVMinus01_BP_C::SupportMinus01' has a wrong offset!");

}

