#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyMinus01_Art

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "OPP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Lobby-01_Art.Lobby-01_Art_C
// 0x0180 (0x03D0 - 0x0250)
class ALobbyMinus01_Art_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FCameraShakeData                       DoorShutShakeValues;                               // 0x0258(0x0090)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FCameraShakeData                       TruckStartShakeValues;                             // 0x02E8(0x0090)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<class ARBAISpawner*>                   CellsAI;                                           // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ARBAmbientActivityMarker*>       CellsAIShakeDoorAmbientMarkers;                    // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UBinkMediaPlayer*                       BinkMediaPlayer;                                   // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           Movie1;                                            // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ANarrativeScreenBase_BP_C*>      PlayerReleaseTVs;                                  // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ATvChannel_BP_C*                        TvChannel_02_Room_BP_ExecuteUbergraph_LobbyMinus01_Art_RefProperty; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATvChannel_BP_C*                        TvChannel_01_BP_ExecuteUbergraph_LobbyMinus01_Art_RefProperty; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AReagentReleasePhotoBoothMinus02_BP_C*  ReagentReleasePhotoBoothMinus02_BP_ExecuteUbergraph_LobbyMinus01_Art_RefProperty; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnWorldPopulateFinishedTimeSliced();
	void OnWorldFullyLoaded();
	void ReceiveBeginPlay();
	void OnWorldPopulateFinished();
	void CustomEvent_0(class ARBLobbyPlayerState* RBLobbyPlayerState, const struct FMatchState& MatchState);
	void BindReleaseReagentEvents();
	void CustomEvent_1(const struct FPlayerReleaseState& PlayerReleaseState);
	void TakeReleasedReagentPicture(class ARBPlayerState* Target);
	void ChangeReleaseCorridorColor(bool Releasing);
	void ExecuteUbergraph_LobbyMinus01_Art(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Lobby-01_Art_C">();
	}
	static class ALobbyMinus01_Art_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobbyMinus01_Art_C>();
	}
};
static_assert(alignof(ALobbyMinus01_Art_C) == 0x000008, "Wrong alignment on ALobbyMinus01_Art_C");
static_assert(sizeof(ALobbyMinus01_Art_C) == 0x0003D0, "Wrong size on ALobbyMinus01_Art_C");
static_assert(offsetof(ALobbyMinus01_Art_C, UberGraphFrame) == 0x000250, "Member 'ALobbyMinus01_Art_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_Art_C, DoorShutShakeValues) == 0x000258, "Member 'ALobbyMinus01_Art_C::DoorShutShakeValues' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_Art_C, TruckStartShakeValues) == 0x0002E8, "Member 'ALobbyMinus01_Art_C::TruckStartShakeValues' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_Art_C, CellsAI) == 0x000378, "Member 'ALobbyMinus01_Art_C::CellsAI' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_Art_C, CellsAIShakeDoorAmbientMarkers) == 0x000388, "Member 'ALobbyMinus01_Art_C::CellsAIShakeDoorAmbientMarkers' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_Art_C, BinkMediaPlayer) == 0x000398, "Member 'ALobbyMinus01_Art_C::BinkMediaPlayer' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_Art_C, Movie1) == 0x0003A0, "Member 'ALobbyMinus01_Art_C::Movie1' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_Art_C, PlayerReleaseTVs) == 0x0003A8, "Member 'ALobbyMinus01_Art_C::PlayerReleaseTVs' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_Art_C, TvChannel_02_Room_BP_ExecuteUbergraph_LobbyMinus01_Art_RefProperty) == 0x0003B8, "Member 'ALobbyMinus01_Art_C::TvChannel_02_Room_BP_ExecuteUbergraph_LobbyMinus01_Art_RefProperty' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_Art_C, TvChannel_01_BP_ExecuteUbergraph_LobbyMinus01_Art_RefProperty) == 0x0003C0, "Member 'ALobbyMinus01_Art_C::TvChannel_01_BP_ExecuteUbergraph_LobbyMinus01_Art_RefProperty' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_Art_C, ReagentReleasePhotoBoothMinus02_BP_ExecuteUbergraph_LobbyMinus01_Art_RefProperty) == 0x0003C8, "Member 'ALobbyMinus01_Art_C::ReagentReleasePhotoBoothMinus02_BP_ExecuteUbergraph_LobbyMinus01_Art_RefProperty' has a wrong offset!");

}

