#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyPrompts

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LobbyPrompts.LobbyPrompts_C.ExecuteUbergraph_LobbyPrompts
// 0x0068 (0x0068 - 0x0000)
struct LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionKeyMapping                 CallFunc_GetInputBinding_ReturnValue;              // 0x0008(0x0028)()
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionMappingValid_ReturnValue;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts) == 0x000008, "Wrong alignment on LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts");
static_assert(sizeof(LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts) == 0x000068, "Wrong size on LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts");
static_assert(offsetof(LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts, EntryPoint) == 0x000000, "Member 'LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts, CallFunc_GetInputBinding_ReturnValue) == 0x000008, "Member 'LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts::CallFunc_GetInputBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts, Temp_bool_Variable) == 0x000030, "Member 'LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts, CallFunc_IsActionMappingValid_ReturnValue) == 0x000031, "Member 'LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts::CallFunc_IsActionMappingValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts, Temp_string_Variable) == 0x000038, "Member 'LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts, Temp_string_Variable_1) == 0x000048, "Member 'LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts, K2Node_Select_Default) == 0x000058, "Member 'LobbyPrompts_C_ExecuteUbergraph_LobbyPrompts::K2Node_Select_Default' has a wrong offset!");

// Function LobbyPrompts.LobbyPrompts_C.UpdateNewsPromptDisplay
// 0x0005 (0x0005 - 0x0000)
struct LobbyPrompts_C_UpdateNewsPromptDisplay final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyPrompts_C_UpdateNewsPromptDisplay) == 0x000001, "Wrong alignment on LobbyPrompts_C_UpdateNewsPromptDisplay");
static_assert(sizeof(LobbyPrompts_C_UpdateNewsPromptDisplay) == 0x000005, "Wrong size on LobbyPrompts_C_UpdateNewsPromptDisplay");
static_assert(offsetof(LobbyPrompts_C_UpdateNewsPromptDisplay, bShouldShow) == 0x000000, "Member 'LobbyPrompts_C_UpdateNewsPromptDisplay::bShouldShow' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_UpdateNewsPromptDisplay, Temp_bool_Variable) == 0x000001, "Member 'LobbyPrompts_C_UpdateNewsPromptDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_UpdateNewsPromptDisplay, Temp_byte_Variable) == 0x000002, "Member 'LobbyPrompts_C_UpdateNewsPromptDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_UpdateNewsPromptDisplay, Temp_byte_Variable_1) == 0x000003, "Member 'LobbyPrompts_C_UpdateNewsPromptDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_UpdateNewsPromptDisplay, K2Node_Select_Default) == 0x000004, "Member 'LobbyPrompts_C_UpdateNewsPromptDisplay::K2Node_Select_Default' has a wrong offset!");

// Function LobbyPrompts.LobbyPrompts_C.UpdateTerminalPromptDisplay
// 0x0005 (0x0005 - 0x0000)
struct LobbyPrompts_C_UpdateTerminalPromptDisplay final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyPrompts_C_UpdateTerminalPromptDisplay) == 0x000001, "Wrong alignment on LobbyPrompts_C_UpdateTerminalPromptDisplay");
static_assert(sizeof(LobbyPrompts_C_UpdateTerminalPromptDisplay) == 0x000005, "Wrong size on LobbyPrompts_C_UpdateTerminalPromptDisplay");
static_assert(offsetof(LobbyPrompts_C_UpdateTerminalPromptDisplay, bShouldShow) == 0x000000, "Member 'LobbyPrompts_C_UpdateTerminalPromptDisplay::bShouldShow' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_UpdateTerminalPromptDisplay, Temp_bool_Variable) == 0x000001, "Member 'LobbyPrompts_C_UpdateTerminalPromptDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_UpdateTerminalPromptDisplay, Temp_byte_Variable) == 0x000002, "Member 'LobbyPrompts_C_UpdateTerminalPromptDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_UpdateTerminalPromptDisplay, Temp_byte_Variable_1) == 0x000003, "Member 'LobbyPrompts_C_UpdateTerminalPromptDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_UpdateTerminalPromptDisplay, K2Node_Select_Default) == 0x000004, "Member 'LobbyPrompts_C_UpdateTerminalPromptDisplay::K2Node_Select_Default' has a wrong offset!");

// Function LobbyPrompts.LobbyPrompts_C.ShouldShow
// 0x0028 (0x0028 - 0x0000)
struct LobbyPrompts_C_ShouldShow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetWatchedPlayer_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShow_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetRBPlayerState_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerLevel_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyPrompts_C_ShouldShow) == 0x000008, "Wrong alignment on LobbyPrompts_C_ShouldShow");
static_assert(sizeof(LobbyPrompts_C_ShouldShow) == 0x000028, "Wrong size on LobbyPrompts_C_ShouldShow");
static_assert(offsetof(LobbyPrompts_C_ShouldShow, ReturnValue) == 0x000000, "Member 'LobbyPrompts_C_ShouldShow::ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_ShouldShow, CallFunc_GetWatchedPlayer_ReturnValue) == 0x000008, "Member 'LobbyPrompts_C_ShouldShow::CallFunc_GetWatchedPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_ShouldShow, CallFunc_ShouldShow_ReturnValue) == 0x000010, "Member 'LobbyPrompts_C_ShouldShow::CallFunc_ShouldShow_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_ShouldShow, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'LobbyPrompts_C_ShouldShow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_ShouldShow, CallFunc_GetRBPlayerState_ReturnValue) == 0x000018, "Member 'LobbyPrompts_C_ShouldShow::CallFunc_GetRBPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_ShouldShow, CallFunc_GetPlayerLevel_ReturnValue) == 0x000020, "Member 'LobbyPrompts_C_ShouldShow::CallFunc_GetPlayerLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_ShouldShow, CallFunc_IsValid_ReturnValue_1) == 0x000024, "Member 'LobbyPrompts_C_ShouldShow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LobbyPrompts_C_ShouldShow, CallFunc_Greater_IntInt_ReturnValue) == 0x000025, "Member 'LobbyPrompts_C_ShouldShow::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

