#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyMinus01_LD_AI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function Lobby-01_LD_AI.Lobby-01_LD_AI_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct LobbyMinus01_LD_AI_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyMinus01_LD_AI_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on LobbyMinus01_LD_AI_C_ReceiveEndPlay");
static_assert(sizeof(LobbyMinus01_LD_AI_C_ReceiveEndPlay) == 0x000001, "Wrong size on LobbyMinus01_LD_AI_C_ReceiveEndPlay");
static_assert(offsetof(LobbyMinus01_LD_AI_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'LobbyMinus01_LD_AI_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function Lobby-01_LD_AI.Lobby-01_LD_AI_C.OnMatchStateUpdated
// 0x0028 (0x0028 - 0x0000)
struct LobbyMinus01_LD_AI_C_OnMatchStateUpdated final
{
public:
	class ARBLobbyPlayerState*                    RBLobbyPlayerState;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchState                            MatchState;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(LobbyMinus01_LD_AI_C_OnMatchStateUpdated) == 0x000008, "Wrong alignment on LobbyMinus01_LD_AI_C_OnMatchStateUpdated");
static_assert(sizeof(LobbyMinus01_LD_AI_C_OnMatchStateUpdated) == 0x000028, "Wrong size on LobbyMinus01_LD_AI_C_OnMatchStateUpdated");
static_assert(offsetof(LobbyMinus01_LD_AI_C_OnMatchStateUpdated, RBLobbyPlayerState) == 0x000000, "Member 'LobbyMinus01_LD_AI_C_OnMatchStateUpdated::RBLobbyPlayerState' has a wrong offset!");
static_assert(offsetof(LobbyMinus01_LD_AI_C_OnMatchStateUpdated, MatchState) == 0x000008, "Member 'LobbyMinus01_LD_AI_C_OnMatchStateUpdated::MatchState' has a wrong offset!");

// Function Lobby-01_LD_AI.Lobby-01_LD_AI_C.OnPlayerInOwnCellUpdated
// 0x0001 (0x0001 - 0x0000)
struct LobbyMinus01_LD_AI_C_OnPlayerInOwnCellUpdated final
{
public:
	bool                                          bInOwnCell;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyMinus01_LD_AI_C_OnPlayerInOwnCellUpdated) == 0x000001, "Wrong alignment on LobbyMinus01_LD_AI_C_OnPlayerInOwnCellUpdated");
static_assert(sizeof(LobbyMinus01_LD_AI_C_OnPlayerInOwnCellUpdated) == 0x000001, "Wrong size on LobbyMinus01_LD_AI_C_OnPlayerInOwnCellUpdated");
static_assert(offsetof(LobbyMinus01_LD_AI_C_OnPlayerInOwnCellUpdated, bInOwnCell) == 0x000000, "Member 'LobbyMinus01_LD_AI_C_OnPlayerInOwnCellUpdated::bInOwnCell' has a wrong offset!");

// Function Lobby-01_LD_AI.Lobby-01_LD_AI_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct LobbyMinus01_LD_AI_C_CustomEvent_0 final
{
public:
	class ARBPlayer*                              Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyMinus01_LD_AI_C_CustomEvent_0) == 0x000008, "Wrong alignment on LobbyMinus01_LD_AI_C_CustomEvent_0");
static_assert(sizeof(LobbyMinus01_LD_AI_C_CustomEvent_0) == 0x000008, "Wrong size on LobbyMinus01_LD_AI_C_CustomEvent_0");
static_assert(offsetof(LobbyMinus01_LD_AI_C_CustomEvent_0, Player) == 0x000000, "Member 'LobbyMinus01_LD_AI_C_CustomEvent_0::Player' has a wrong offset!");

// Function Lobby-01_LD_AI.Lobby-01_LD_AI_C.CustomEvent_1
// 0x0008 (0x0008 - 0x0000)
struct LobbyMinus01_LD_AI_C_CustomEvent_1 final
{
public:
	class ARBPlayer*                              Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyMinus01_LD_AI_C_CustomEvent_1) == 0x000008, "Wrong alignment on LobbyMinus01_LD_AI_C_CustomEvent_1");
static_assert(sizeof(LobbyMinus01_LD_AI_C_CustomEvent_1) == 0x000008, "Wrong size on LobbyMinus01_LD_AI_C_CustomEvent_1");
static_assert(offsetof(LobbyMinus01_LD_AI_C_CustomEvent_1, Player) == 0x000000, "Member 'LobbyMinus01_LD_AI_C_CustomEvent_1::Player' has a wrong offset!");

// Function Lobby-01_LD_AI.Lobby-01_LD_AI_C.SASTubeBeginOverlapEvent
// 0x00A8 (0x00A8 - 0x0000)
struct LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33EB[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent) == 0x000008, "Wrong alignment on LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent");
static_assert(sizeof(LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent) == 0x0000A8, "Wrong size on LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent");
static_assert(offsetof(LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent, OverlappedComponent) == 0x000000, "Member 'LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent, OtherActor) == 0x000008, "Member 'LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent::OtherActor' has a wrong offset!");
static_assert(offsetof(LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent, OtherComp) == 0x000010, "Member 'LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent::OtherComp' has a wrong offset!");
static_assert(offsetof(LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent, OtherBodyIndex) == 0x000018, "Member 'LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent, bFromSweep) == 0x00001C, "Member 'LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent::bFromSweep' has a wrong offset!");
static_assert(offsetof(LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent, SweepResult) == 0x000020, "Member 'LobbyMinus01_LD_AI_C_SASTubeBeginOverlapEvent::SweepResult' has a wrong offset!");

// Function Lobby-01_LD_AI.Lobby-01_LD_AI_C.ExecuteUbergraph_Lobby-01_LD_AI
// 0x0268 (0x0268 - 0x0000)
struct LobbyMinus01_LD_AI_C_ExecuteUbergraph_LobbyMinus01_LD_AI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33EC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLobbyPlayerController*               CallFunc_GetLocalLobbyPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ARBPlayer* Player)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33ED[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ARBPlayer* Player)>      K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33EE[0x2];                                     // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33EF[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bInOwnCell)>              K2Node_CreateDelegate_OutputDelegate_4;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33F0[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBStreaming*                           CallFunc_GetRBStreaming_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F1[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLobbyPlayerState*                    K2Node_DynamicCast_AsRB_Lobby_Player_State;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F2[0x5];                                     // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLobbyPlayerState*                    K2Node_CustomEvent_rbLobbyPlayerState;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchState                            K2Node_CustomEvent_matchState;                     // 0x00C0(0x0020)(ConstParm, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowingLoadingScreen_ReturnValue;       // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class ARBLobbyPlayerState* RBLobbyPlayerState, struct FMatchState& MatchState)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasPlayedTutorial_ReturnValue;            // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F3[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLobbyPlayerController*               CallFunc_GetLocalLobbyPlayerController_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLobbyPlayerController*               CallFunc_GetLocalLobbyPlayerController_ReturnValue_2; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerInOwnCell_ReturnValue;            // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bInOwnCell;                     // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue;                  // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F4[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_CustomEvent_player_1;                       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLobbyPlayerController_BP_C*          K2Node_DynamicCast_AsRB_Lobby_Player_Controller_BP; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F5[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_CustomEvent_player;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameModeLobby*                       CallFunc_GetRBGameModeLobby_ReturnValue;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLobbyPlayerController*               K2Node_DynamicCast_AsRB_Lobby_Player_Controller;   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F6[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetNarrator_ClientOnly_ReturnValue;       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue;                 // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoteEvent_ReturnValue_1;                // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F7[0x6];                                     // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F8[0x3];                                     // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x0190(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ARBPlayer*                              K2Node_DynamicCast_AsRB_Player;                    // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F9[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBSASTube*                             CallFunc_Array_Get_Item;                           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_2;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLobbyPlayerController_BP_C*          K2Node_DynamicCast_AsRB_Lobby_Player_Controller_BP_1; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33FA[0x3];                                     // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33FB[0x6];                                     // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLobbyPlayerController*               CallFunc_GetLocalLobbyPlayerController_ReturnValue_3; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBSASTube*                             CallFunc_Array_Get_Item_1;                         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyMinus01_LD_AI_C_ExecuteUbergraph_LobbyMinus01_LD_AI) == 0x000008, "Wrong alignment on LobbyMinus01_LD_AI_C_ExecuteUbergraph_LobbyMinus01_LD_AI");
static_assert(sizeof(LobbyMinus01_LD_AI_C_ExecuteUbergraph_LobbyMinus01_LD_AI) == 0x000268, "Wrong size on LobbyMinus01_LD_AI_C_ExecuteUbergraph_LobbyMinus01_LD_AI");
static_assert(offsetof(LobbyMinus01_LD_AI_C_ExecuteUbergraph_LobbyMinus01_LD_AI, EntryPoint) == 0x000000, "Member 'LobbyMinus01_LD_AI_C_ExecuteUbergraph_LobbyMinus01_LD_AI::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbyMinus01_LD_AI_C_ExecuteUbergraph_LobbyMinus01_LD_AI, CallFunc_GetLocalLobbyPlayerController_ReturnValue) == 0x000008, "Member 'LobbyMinus01_LD_AI_C_ExecuteUbergraph_LobbyMinus01_LD_AI::CallFunc_GetLocalLobbyPlayerController_ReturnValue' has a wrong offset!");
