#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyDecalActorMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LobbyDecalActor-01_BP.LobbyDecalActor-01_BP_C
// 0x0068 (0x06C8 - 0x0660)
class ALobbyDecalActorMinus01_BP_C final : public ARBOperatable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ScaleFactor;                                       // 0x0668(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348C[0x4];                                     // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADecalActor*                            DecalActor;                                        // 0x0670(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0678(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastestHitImpactPos;                               // 0x0684(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OriginalInteractionZoneBoxLocation;                // 0x0690(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation;                                          // 0x069C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceConstant*>      DecalList;                                         // 0x06A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceConstant*              DecalMaterial;                                     // 0x06B0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentDecalIndex;                                 // 0x06B8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastestHitImpactNormal;                            // 0x06BC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void CustomEvent_0();
	void MoveObject(class ARBPawn* Pawn);
	void CustomEvent_1(float Axis, bool Shift, bool Alt);
	void Event_OnStopOperating(class ARBPawn* Pawn);
	void ChangeDecal(bool Next);
	void Event_OnStartOperating(class ARBPawn* Pawn);
	void UnbindEvent();
	void BindOnMouseWheelEvent();
	void MoveInteractionsToOrigin();
	void MulticastSetInitialDecalMaterial(class UMaterialInterface* NewDecalMaterial, class UDecalComponent* Target);
	void ExecuteUbergraph_LobbyDecalActorMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyDecalActor-01_BP_C">();
	}
	static class ALobbyDecalActorMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobbyDecalActorMinus01_BP_C>();
	}
};
static_assert(alignof(ALobbyDecalActorMinus01_BP_C) == 0x000008, "Wrong alignment on ALobbyDecalActorMinus01_BP_C");
static_assert(sizeof(ALobbyDecalActorMinus01_BP_C) == 0x0006C8, "Wrong size on ALobbyDecalActorMinus01_BP_C");
static_assert(offsetof(ALobbyDecalActorMinus01_BP_C, UberGraphFrame) == 0x000660, "Member 'ALobbyDecalActorMinus01_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALobbyDecalActorMinus01_BP_C, ScaleFactor) == 0x000668, "Member 'ALobbyDecalActorMinus01_BP_C::ScaleFactor' has a wrong offset!");
static_assert(offsetof(ALobbyDecalActorMinus01_BP_C, DecalActor) == 0x000670, "Member 'ALobbyDecalActorMinus01_BP_C::DecalActor' has a wrong offset!");
static_assert(offsetof(ALobbyDecalActorMinus01_BP_C, Offset) == 0x000678, "Member 'ALobbyDecalActorMinus01_BP_C::Offset' has a wrong offset!");
static_assert(offsetof(ALobbyDecalActorMinus01_BP_C, LastestHitImpactPos) == 0x000684, "Member 'ALobbyDecalActorMinus01_BP_C::LastestHitImpactPos' has a wrong offset!");
static_assert(offsetof(ALobbyDecalActorMinus01_BP_C, OriginalInteractionZoneBoxLocation) == 0x000690, "Member 'ALobbyDecalActorMinus01_BP_C::OriginalInteractionZoneBoxLocation' has a wrong offset!");
static_assert(offsetof(ALobbyDecalActorMinus01_BP_C, Rotation) == 0x00069C, "Member 'ALobbyDecalActorMinus01_BP_C::Rotation' has a wrong offset!");
static_assert(offsetof(ALobbyDecalActorMinus01_BP_C, DecalList) == 0x0006A0, "Member 'ALobbyDecalActorMinus01_BP_C::DecalList' has a wrong offset!");
static_assert(offsetof(ALobbyDecalActorMinus01_BP_C, DecalMaterial) == 0x0006B0, "Member 'ALobbyDecalActorMinus01_BP_C::DecalMaterial' has a wrong offset!");
static_assert(offsetof(ALobbyDecalActorMinus01_BP_C, CurrentDecalIndex) == 0x0006B8, "Member 'ALobbyDecalActorMinus01_BP_C::CurrentDecalIndex' has a wrong offset!");
static_assert(offsetof(ALobbyDecalActorMinus01_BP_C, LastestHitImpactNormal) == 0x0006BC, "Member 'ALobbyDecalActorMinus01_BP_C::LastestHitImpactNormal' has a wrong offset!");

}

