#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lobby_StoolSeatMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Lobby_StoolSeat-01_BP.Lobby_StoolSeat-01_BP_C
// 0x0058 (0x02A0 - 0x0248)
class ALobby_StoolSeatMinus01_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBInteractiblePanelComponent*          RBInteractiblePanel;                               // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ALobby_FakeReagent_BP_C> LinkedFakeReagent;                                 // 0x0278(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	bool OnWorldPopulateFinishedTimeSliced();
	void PostToggled(bool bToggleEnabled);
	void OnWorldFullyLoaded();
	void OnWorldPopulateFinished();
	void ExecuteUbergraph_Lobby_StoolSeatMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Lobby_StoolSeat-01_BP_C">();
	}
	static class ALobby_StoolSeatMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobby_StoolSeatMinus01_BP_C>();
	}
};
static_assert(alignof(ALobby_StoolSeatMinus01_BP_C) == 0x000008, "Wrong alignment on ALobby_StoolSeatMinus01_BP_C");
static_assert(sizeof(ALobby_StoolSeatMinus01_BP_C) == 0x0002A0, "Wrong size on ALobby_StoolSeatMinus01_BP_C");
static_assert(offsetof(ALobby_StoolSeatMinus01_BP_C, UberGraphFrame) == 0x000248, "Member 'ALobby_StoolSeatMinus01_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALobby_StoolSeatMinus01_BP_C, Arrow) == 0x000250, "Member 'ALobby_StoolSeatMinus01_BP_C::Arrow' has a wrong offset!");
static_assert(offsetof(ALobby_StoolSeatMinus01_BP_C, Scene) == 0x000258, "Member 'ALobby_StoolSeatMinus01_BP_C::Scene' has a wrong offset!");
static_assert(offsetof(ALobby_StoolSeatMinus01_BP_C, RBInteractiblePanel) == 0x000260, "Member 'ALobby_StoolSeatMinus01_BP_C::RBInteractiblePanel' has a wrong offset!");
static_assert(offsetof(ALobby_StoolSeatMinus01_BP_C, StaticMesh) == 0x000268, "Member 'ALobby_StoolSeatMinus01_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ALobby_StoolSeatMinus01_BP_C, DefaultSceneRoot) == 0x000270, "Member 'ALobby_StoolSeatMinus01_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ALobby_StoolSeatMinus01_BP_C, LinkedFakeReagent) == 0x000278, "Member 'ALobby_StoolSeatMinus01_BP_C::LinkedFakeReagent' has a wrong offset!");

}

