#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyCell_Walls_ConspiracyMinus01_BP

#include "Basic.hpp"

#include "CellCustomizationBundleBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LobbyCell_Walls_Conspiracy-01_BP.LobbyCell_Walls_Conspiracy-01_BP_C
// 0x0018 (0x0270 - 0x0258)
class ALobbyCell_Walls_ConspiracyMinus01_BP_C final : public ACellCustomizationBundleBase_C
{
public:
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyCell_Walls_Conspiracy-01_BP_C">();
	}
	static class ALobbyCell_Walls_ConspiracyMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobbyCell_Walls_ConspiracyMinus01_BP_C>();
	}
};
static_assert(alignof(ALobbyCell_Walls_ConspiracyMinus01_BP_C) == 0x000008, "Wrong alignment on ALobbyCell_Walls_ConspiracyMinus01_BP_C");
static_assert(sizeof(ALobbyCell_Walls_ConspiracyMinus01_BP_C) == 0x000270, "Wrong size on ALobbyCell_Walls_ConspiracyMinus01_BP_C");
static_assert(offsetof(ALobbyCell_Walls_ConspiracyMinus01_BP_C, StaticMesh2) == 0x000258, "Member 'ALobbyCell_Walls_ConspiracyMinus01_BP_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ALobbyCell_Walls_ConspiracyMinus01_BP_C, StaticMesh1) == 0x000260, "Member 'ALobbyCell_Walls_ConspiracyMinus01_BP_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ALobbyCell_Walls_ConspiracyMinus01_BP_C, StaticMesh) == 0x000268, "Member 'ALobbyCell_Walls_ConspiracyMinus01_BP_C::StaticMesh' has a wrong offset!");

}

