#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyAutomaticDoor_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LobbyAutomaticDoor_BP.LobbyAutomaticDoor_BP_C.ExecuteUbergraph_LobbyAutomaticDoor_BP
// 0x009C (0x009C - 0x0000)
struct LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33E9[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0014(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP) == 0x000004, "Wrong alignment on LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP");
static_assert(sizeof(LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP) == 0x00009C, "Wrong size on LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP");
static_assert(offsetof(LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP, EntryPoint) == 0x000000, "Member 'LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP, CallFunc_HasAuthority_ReturnValue_1) == 0x000006, "Member 'LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP, CallFunc_RLerp_ReturnValue) == 0x000008, "Member 'LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000014, "Member 'LobbyAutomaticDoor_BP_C_ExecuteUbergraph_LobbyAutomaticDoor_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

