#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyCell_NamePlate

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "TextBox_structs.hpp"


namespace SDK::Params
{

// Function LobbyCell_NamePlate.LobbyCell_NamePlate_C.CreateDynMaterial
// 0x0008 (0x0008 - 0x0000)
struct LobbyCell_NamePlate_C_CreateDynMaterial final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyCell_NamePlate_C_CreateDynMaterial) == 0x000008, "Wrong alignment on LobbyCell_NamePlate_C_CreateDynMaterial");
static_assert(sizeof(LobbyCell_NamePlate_C_CreateDynMaterial) == 0x000008, "Wrong size on LobbyCell_NamePlate_C_CreateDynMaterial");
static_assert(offsetof(LobbyCell_NamePlate_C_CreateDynMaterial, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'LobbyCell_NamePlate_C_CreateDynMaterial::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function LobbyCell_NamePlate.LobbyCell_NamePlate_C.SetTexture
// 0x0028 (0x0028 - 0x0000)
struct LobbyCell_NamePlate_C_SetTexture final
{
public:
	class UTexture*                               PrintTexture;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PrintTexture_UVOffset;                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PrintTexture_UVSize;                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyCell_NamePlate_C_SetTexture) == 0x000008, "Wrong alignment on LobbyCell_NamePlate_C_SetTexture");
static_assert(sizeof(LobbyCell_NamePlate_C_SetTexture) == 0x000028, "Wrong size on LobbyCell_NamePlate_C_SetTexture");
static_assert(offsetof(LobbyCell_NamePlate_C_SetTexture, PrintTexture) == 0x000000, "Member 'LobbyCell_NamePlate_C_SetTexture::PrintTexture' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_SetTexture, PrintTexture_UVOffset) == 0x000008, "Member 'LobbyCell_NamePlate_C_SetTexture::PrintTexture_UVOffset' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_SetTexture, PrintTexture_UVSize) == 0x000010, "Member 'LobbyCell_NamePlate_C_SetTexture::PrintTexture_UVSize' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_SetTexture, K2Node_MakeStruct_LinearColor) == 0x000018, "Member 'LobbyCell_NamePlate_C_SetTexture::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function LobbyCell_NamePlate.LobbyCell_NamePlate_C.UpdateNamePlate
// 0x0058 (0x0058 - 0x0000)
struct LobbyCell_NamePlate_C_UpdateNamePlate final
{
public:
	class FText                                   PlayerName;                                        // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FormatPlayerDisplayName_formatedDisplayName; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyCell_NamePlate_C_UpdateNamePlate) == 0x000008, "Wrong alignment on LobbyCell_NamePlate_C_UpdateNamePlate");
static_assert(sizeof(LobbyCell_NamePlate_C_UpdateNamePlate) == 0x000058, "Wrong size on LobbyCell_NamePlate_C_UpdateNamePlate");
static_assert(offsetof(LobbyCell_NamePlate_C_UpdateNamePlate, PlayerName) == 0x000000, "Member 'LobbyCell_NamePlate_C_UpdateNamePlate::PlayerName' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_UpdateNamePlate, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'LobbyCell_NamePlate_C_UpdateNamePlate::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_UpdateNamePlate, CallFunc_FormatPlayerDisplayName_formatedDisplayName) == 0x000028, "Member 'LobbyCell_NamePlate_C_UpdateNamePlate::CallFunc_FormatPlayerDisplayName_formatedDisplayName' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_UpdateNamePlate, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'LobbyCell_NamePlate_C_UpdateNamePlate::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_UpdateNamePlate, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'LobbyCell_NamePlate_C_UpdateNamePlate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function LobbyCell_NamePlate.LobbyCell_NamePlate_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct LobbyCell_NamePlate_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B3[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FormatPlayerDisplayName_formatedDisplayName; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
};
static_assert(alignof(LobbyCell_NamePlate_C_UserConstructionScript) == 0x000008, "Wrong alignment on LobbyCell_NamePlate_C_UserConstructionScript");
static_assert(sizeof(LobbyCell_NamePlate_C_UserConstructionScript) == 0x000040, "Wrong size on LobbyCell_NamePlate_C_UserConstructionScript");
static_assert(offsetof(LobbyCell_NamePlate_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'LobbyCell_NamePlate_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_UserConstructionScript, CallFunc_Conv_TextToString_ReturnValue) == 0x000008, "Member 'LobbyCell_NamePlate_C_UserConstructionScript::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_UserConstructionScript, CallFunc_FormatPlayerDisplayName_formatedDisplayName) == 0x000018, "Member 'LobbyCell_NamePlate_C_UserConstructionScript::CallFunc_FormatPlayerDisplayName_formatedDisplayName' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_UserConstructionScript, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'LobbyCell_NamePlate_C_UserConstructionScript::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function LobbyCell_NamePlate.LobbyCell_NamePlate_C.Event_AssignToPlayer
// 0x0008 (0x0008 - 0x0000)
struct LobbyCell_NamePlate_C_Event_AssignToPlayer final
{
public:
	class ARBLobbyPlayerState*                    RBLobbyPlayerState;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyCell_NamePlate_C_Event_AssignToPlayer) == 0x000008, "Wrong alignment on LobbyCell_NamePlate_C_Event_AssignToPlayer");
static_assert(sizeof(LobbyCell_NamePlate_C_Event_AssignToPlayer) == 0x000008, "Wrong size on LobbyCell_NamePlate_C_Event_AssignToPlayer");
static_assert(offsetof(LobbyCell_NamePlate_C_Event_AssignToPlayer, RBLobbyPlayerState) == 0x000000, "Member 'LobbyCell_NamePlate_C_Event_AssignToPlayer::RBLobbyPlayerState' has a wrong offset!");

// Function LobbyCell_NamePlate.LobbyCell_NamePlate_C.DrawText
// 0x0018 (0x0018 - 0x0000)
struct LobbyCell_NamePlate_C_DrawText final
{
public:
	class FText                                   PlayerName;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(LobbyCell_NamePlate_C_DrawText) == 0x000008, "Wrong alignment on LobbyCell_NamePlate_C_DrawText");
static_assert(sizeof(LobbyCell_NamePlate_C_DrawText) == 0x000018, "Wrong size on LobbyCell_NamePlate_C_DrawText");
static_assert(offsetof(LobbyCell_NamePlate_C_DrawText, PlayerName) == 0x000000, "Member 'LobbyCell_NamePlate_C_DrawText::PlayerName' has a wrong offset!");

// Function LobbyCell_NamePlate.LobbyCell_NamePlate_C.ExecuteUbergraph_LobbyCell_NamePlate
// 0x0200 (0x0200 - 0x0000)
struct LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B4[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LerpAngle_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x002C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_33B5[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLobbyPlayerState*                    K2Node_Event_rbLobbyPlayerState;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00D0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00E8(0x0018)()
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0110(0x0010)(NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B6[0x3];                                     // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B7[0x3];                                     // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_PlayerName;                     // 0x0138(0x0018)()
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasRenderTarget2D*                  CallFunc_CreateCanvasRenderTarget2D_ReturnValue;   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33B8[0x8];                                     // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBox                               K2Node_MakeStruct_TextBox;                         // 0x0170(0x0090)(HasGetValueTypeHash)
};
static_assert(alignof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate) == 0x000010, "Wrong alignment on LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate");
static_assert(sizeof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate) == 0x000200, "Wrong size on LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, EntryPoint) == 0x000000, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000005, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000006, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000007, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x000008, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_BreakRotator_Roll) == 0x000010, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_BreakRotator_Pitch) == 0x000014, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_BreakRotator_Yaw) == 0x000018, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_LerpAngle_ReturnValue) == 0x00001C, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_LerpAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_MakeRotator_ReturnValue) == 0x000020, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00002C, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, K2Node_Event_rbLobbyPlayerState) == 0x0000B8, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::K2Node_Event_rbLobbyPlayerState' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_GetPlayerName_ReturnValue) == 0x0000C0, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_MakeLiteralText_ReturnValue) == 0x0000D0, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_Conv_StringToText_ReturnValue) == 0x0000E8, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_BeginDrawCanvasToRenderTarget_Canvas) == 0x000100, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_BeginDrawCanvasToRenderTarget_Canvas' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_BeginDrawCanvasToRenderTarget_Size) == 0x000108, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_BeginDrawCanvasToRenderTarget_Size' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_BeginDrawCanvasToRenderTarget_Context) == 0x000110, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_BeginDrawCanvasToRenderTarget_Context' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_BreakVector2D_X) == 0x000120, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_BreakVector2D_Y) == 0x000124, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_IsValid_ReturnValue) == 0x000128, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_MakeVector2D_ReturnValue) == 0x00012C, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_IsValid_ReturnValue_1) == 0x000134, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, K2Node_CustomEvent_PlayerName) == 0x000138, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::K2Node_CustomEvent_PlayerName' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_BreakVector2D_X_1) == 0x000150, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_BreakVector2D_Y_1) == 0x000154, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_FTrunc_ReturnValue) == 0x000158, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_FTrunc_ReturnValue_1) == 0x00015C, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, CallFunc_CreateCanvasRenderTarget2D_ReturnValue) == 0x000160, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::CallFunc_CreateCanvasRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate, K2Node_MakeStruct_TextBox) == 0x000170, "Member 'LobbyCell_NamePlate_C_ExecuteUbergraph_LobbyCell_NamePlate::K2Node_MakeStruct_TextBox' has a wrong offset!");

}

