#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyReleasedPlayerCounterMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LobbyReleasedPlayerCounter-01_BP.LobbyReleasedPlayerCounter-01_BP_C
// 0x0060 (0x02A8 - 0x0248)
class ALobbyReleasedPlayerCounterMinus01_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   One;                                               // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   One000000;                                         // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   One00000;                                          // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   One0000;                                           // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   One000;                                            // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   One00;                                             // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   One0;                                              // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FlipClockMinus02;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UChildActorComponent*>           Flaps;                                             // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         NumReleasedPlayers;                                // 0x02A0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	int32                                         DisplayedAmountReleasedPlayers;                    // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnWorldPopulateFinishedTimeSliced();
	bool IsCelebrationNumber(int32 Num);
	void UpdateDigitFlap(int32 Param_Index);
	void OnRep_NumReleasedPlayers();
	void UpdateAllDigitFlaps();
	void UserConstructionScript();
	void OnWorldFullyLoaded();
	void OnWorldPopulateFinished();
	void OnCharacterReleaseCountUpdated_Event_0(int32 CharacterReleaseCount);
	void PresentNewNumberSequence();
	void ExecuteUbergraph_LobbyReleasedPlayerCounterMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyReleasedPlayerCounter-01_BP_C">();
	}
	static class ALobbyReleasedPlayerCounterMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobbyReleasedPlayerCounterMinus01_BP_C>();
	}
};
static_assert(alignof(ALobbyReleasedPlayerCounterMinus01_BP_C) == 0x000008, "Wrong alignment on ALobbyReleasedPlayerCounterMinus01_BP_C");
static_assert(sizeof(ALobbyReleasedPlayerCounterMinus01_BP_C) == 0x0002A8, "Wrong size on ALobbyReleasedPlayerCounterMinus01_BP_C");
static_assert(offsetof(ALobbyReleasedPlayerCounterMinus01_BP_C, UberGraphFrame) == 0x000248, "Member 'ALobbyReleasedPlayerCounterMinus01_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALobbyReleasedPlayerCounterMinus01_BP_C, One) == 0x000250, "Member 'ALobbyReleasedPlayerCounterMinus01_BP_C::One' has a wrong offset!");
static_assert(offsetof(ALobbyReleasedPlayerCounterMinus01_BP_C, One000000) == 0x000258, "Member 'ALobbyReleasedPlayerCounterMinus01_BP_C::One000000' has a wrong offset!");
static_assert(offsetof(ALobbyReleasedPlayerCounterMinus01_BP_C, One00000) == 0x000260, "Member 'ALobbyReleasedPlayerCounterMinus01_BP_C::One00000' has a wrong offset!");
static_assert(offsetof(ALobbyReleasedPlayerCounterMinus01_BP_C, One0000) == 0x000268, "Member 'ALobbyReleasedPlayerCounterMinus01_BP_C::One0000' has a wrong offset!");
static_assert(offsetof(ALobbyReleasedPlayerCounterMinus01_BP_C, One000) == 0x000270, "Member 'ALobbyReleasedPlayerCounterMinus01_BP_C::One000' has a wrong offset!");
static_assert(offsetof(ALobbyReleasedPlayerCounterMinus01_BP_C, One00) == 0x000278, "Member 'ALobbyReleasedPlayerCounterMinus01_BP_C::One00' has a wrong offset!");
static_assert(offsetof(ALobbyReleasedPlayerCounterMinus01_BP_C, One0) == 0x000280, "Member 'ALobbyReleasedPlayerCounterMinus01_BP_C::One0' has a wrong offset!");
static_assert(offsetof(ALobbyReleasedPlayerCounterMinus01_BP_C, FlipClockMinus02) == 0x000288, "Member 'ALobbyReleasedPlayerCounterMinus01_BP_C::FlipClockMinus02' has a wrong offset!");
static_assert(offsetof(ALobbyReleasedPlayerCounterMinus01_BP_C, Flaps) == 0x000290, "Member 'ALobbyReleasedPlayerCounterMinus01_BP_C::Flaps' has a wrong offset!");
static_assert(offsetof(ALobbyReleasedPlayerCounterMinus01_BP_C, NumReleasedPlayers) == 0x0002A0, "Member 'ALobbyReleasedPlayerCounterMinus01_BP_C::NumReleasedPlayers' has a wrong offset!");
static_assert(offsetof(ALobbyReleasedPlayerCounterMinus01_BP_C, DisplayedAmountReleasedPlayers) == 0x0002A4, "Member 'ALobbyReleasedPlayerCounterMinus01_BP_C::DisplayedAmountReleasedPlayers' has a wrong offset!");

}

