#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyPrompts

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LobbyPrompts.LobbyPrompts_C
// 0x0020 (0x0308 - 0x02E8)
class ULobbyPrompts_C final : public URBHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               News;                                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        NewsPrompt;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Terminal;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LobbyPrompts(int32 EntryPoint);
	void Event_Show();
	void UpdateNewsPromptDisplay(bool bShouldShow);
	void UpdateTerminalPromptDisplay(bool bShouldShow);

	bool ShouldShow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyPrompts_C">();
	}
	static class ULobbyPrompts_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULobbyPrompts_C>();
	}
};
static_assert(alignof(ULobbyPrompts_C) == 0x000008, "Wrong alignment on ULobbyPrompts_C");
static_assert(sizeof(ULobbyPrompts_C) == 0x000308, "Wrong size on ULobbyPrompts_C");
static_assert(offsetof(ULobbyPrompts_C, UberGraphFrame) == 0x0002E8, "Member 'ULobbyPrompts_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULobbyPrompts_C, News) == 0x0002F0, "Member 'ULobbyPrompts_C::News' has a wrong offset!");
static_assert(offsetof(ULobbyPrompts_C, NewsPrompt) == 0x0002F8, "Member 'ULobbyPrompts_C::NewsPrompt' has a wrong offset!");
static_assert(offsetof(ULobbyPrompts_C, Terminal) == 0x000300, "Member 'ULobbyPrompts_C::Terminal' has a wrong offset!");

}

