#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyIndustrialFanMinus01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LobbyIndustrialFan-01_BP.LobbyIndustrialFan-01_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct LobbyIndustrialFanMinus01_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyIndustrialFanMinus01_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on LobbyIndustrialFanMinus01_BP_C_ReceiveTick");
static_assert(sizeof(LobbyIndustrialFanMinus01_BP_C_ReceiveTick) == 0x000004, "Wrong size on LobbyIndustrialFanMinus01_BP_C_ReceiveTick");
static_assert(offsetof(LobbyIndustrialFanMinus01_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'LobbyIndustrialFanMinus01_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function LobbyIndustrialFan-01_BP.LobbyIndustrialFan-01_BP_C.ExecuteUbergraph_LobbyIndustrialFan-01_BP
// 0x00A0 (0x00A0 - 0x0000)
struct LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0018(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP) == 0x000004, "Wrong alignment on LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP");
static_assert(sizeof(LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP) == 0x0000A0, "Wrong size on LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP");
static_assert(offsetof(LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP, EntryPoint) == 0x000000, "Member 'LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP, CallFunc_MakeRotator_ReturnValue) == 0x00000C, "Member 'LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000018, "Member 'LobbyIndustrialFanMinus01_BP_C_ExecuteUbergraph_LobbyIndustrialFanMinus01_BP::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");

}

