#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lobby_StationnaryCharacterBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Lobby_StationnaryCharacterBase.Lobby_StationnaryCharacterBase_C.TryPlayFacialAnim
// 0x0018 (0x0018 - 0x0000)
struct Lobby_StationnaryCharacterBase_C_TryPlayFacialAnim final
{
public:
	class FString                                 LineId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryPlayFacialAnim_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_StationnaryCharacterBase_C_TryPlayFacialAnim) == 0x000008, "Wrong alignment on Lobby_StationnaryCharacterBase_C_TryPlayFacialAnim");
static_assert(sizeof(Lobby_StationnaryCharacterBase_C_TryPlayFacialAnim) == 0x000018, "Wrong size on Lobby_StationnaryCharacterBase_C_TryPlayFacialAnim");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_TryPlayFacialAnim, LineId) == 0x000000, "Member 'Lobby_StationnaryCharacterBase_C_TryPlayFacialAnim::LineId' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_TryPlayFacialAnim, ReturnValue) == 0x000010, "Member 'Lobby_StationnaryCharacterBase_C_TryPlayFacialAnim::ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_TryPlayFacialAnim, CallFunc_TryPlayFacialAnim_ReturnValue) == 0x000011, "Member 'Lobby_StationnaryCharacterBase_C_TryPlayFacialAnim::CallFunc_TryPlayFacialAnim_ReturnValue' has a wrong offset!");

// Function Lobby_StationnaryCharacterBase.Lobby_StationnaryCharacterBase_C.GetFacePoseAsset
// 0x0008 (0x0008 - 0x0000)
struct Lobby_StationnaryCharacterBase_C_GetFacePoseAsset final
{
public:
	class UPoseAsset*                             PoseAsset;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_StationnaryCharacterBase_C_GetFacePoseAsset) == 0x000008, "Wrong alignment on Lobby_StationnaryCharacterBase_C_GetFacePoseAsset");
static_assert(sizeof(Lobby_StationnaryCharacterBase_C_GetFacePoseAsset) == 0x000008, "Wrong size on Lobby_StationnaryCharacterBase_C_GetFacePoseAsset");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_GetFacePoseAsset, PoseAsset) == 0x000000, "Member 'Lobby_StationnaryCharacterBase_C_GetFacePoseAsset::PoseAsset' has a wrong offset!");

// Function Lobby_StationnaryCharacterBase.Lobby_StationnaryCharacterBase_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct Lobby_StationnaryCharacterBase_C_UserConstructionScript final
{
public:
	struct FSingleAnimationPlayData               K2Node_MakeStruct_SingleAnimationPlayData;         // 0x0000(0x0018)(NoDestructor)
};
static_assert(alignof(Lobby_StationnaryCharacterBase_C_UserConstructionScript) == 0x000008, "Wrong alignment on Lobby_StationnaryCharacterBase_C_UserConstructionScript");
static_assert(sizeof(Lobby_StationnaryCharacterBase_C_UserConstructionScript) == 0x000018, "Wrong size on Lobby_StationnaryCharacterBase_C_UserConstructionScript");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_UserConstructionScript, K2Node_MakeStruct_SingleAnimationPlayData) == 0x000000, "Member 'Lobby_StationnaryCharacterBase_C_UserConstructionScript::K2Node_MakeStruct_SingleAnimationPlayData' has a wrong offset!");

// Function Lobby_StationnaryCharacterBase.Lobby_StationnaryCharacterBase_C.BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Lobby_StationnaryCharacterBase.Lobby_StationnaryCharacterBase_C.BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C97[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Lobby_StationnaryCharacterBase_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Lobby_StationnaryCharacterBase.Lobby_StationnaryCharacterBase_C.ExecuteUbergraph_Lobby_StationnaryCharacterBase
// 0x01F0 (0x01F0 - 0x0000)
struct Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C98[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class ULobby_StationaryCharacter_AnimBP_C*    K2Node_DynamicCast_AsLobby_Stationary_Character_Anim_BP; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C99[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULobby_StationaryCharacter_AnimBP_C*    K2Node_DynamicCast_AsLobby_Stationary_Character_Anim_BP_1; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9A[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue_1;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer_BP_C*                         K2Node_DynamicCast_AsRB_Player_BP;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9B[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFace_Lobby_StaticCharacter_AnimBlueprint_C* K2Node_DynamicCast_AsFace_Lobby_Static_Character_Anim_Blueprint; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9C[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9D[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9E[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0118(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue_2;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_3;            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9F[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobby_StationaryCharacter_AnimBP_C*    K2Node_DynamicCast_AsLobby_Stationary_Character_Anim_BP_2; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CA0[0x6];                                     // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_4;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFace_Lobby_StaticCharacter_AnimBlueprint_C* K2Node_DynamicCast_AsFace_Lobby_Static_Character_Anim_Blueprint_1; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CA1[0x6];                                     // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue; // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase) == 0x000010, "Wrong alignment on Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase");
static_assert(sizeof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase) == 0x0001F0, "Wrong size on Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, EntryPoint) == 0x000000, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_DynamicCast_AsLobby_Stationary_Character_Anim_BP) == 0x000040, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_DynamicCast_AsLobby_Stationary_Character_Anim_BP' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000050, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_DynamicCast_AsLobby_Stationary_Character_Anim_BP_1) == 0x000058, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_DynamicCast_AsLobby_Stationary_Character_Anim_BP_1' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_GetLocalPawn_ReturnValue) == 0x000068, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_GetLocalPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000070, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_InverseTransformLocation_ReturnValue) == 0x00007C, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000088, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_BreakRotator_Roll) == 0x000094, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_BreakRotator_Pitch) == 0x000098, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_BreakRotator_Yaw) == 0x00009C, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000A0, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000A4, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_GetLocalPawn_ReturnValue_1) == 0x0000A8, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_GetLocalPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_DynamicCast_AsRB_Player_BP) == 0x0000B0, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_DynamicCast_AsRB_Player_BP' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_GetAnimInstance_ReturnValue_2) == 0x0000C0, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_DynamicCast_AsFace_Lobby_Static_Character_Anim_Blueprint) == 0x0000C8, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_DynamicCast_AsFace_Lobby_Static_Character_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_DynamicCast_bSuccess_3) == 0x0000D0, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0000D8, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0000E0, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0000E8, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0000F0, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000F8, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_ComponentBoundEvent_OtherActor) == 0x000100, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_ComponentBoundEvent_OtherComp) == 0x000108, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000110, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_ComponentBoundEvent_bFromSweep) == 0x000114, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_ComponentBoundEvent_SweepResult) == 0x000118, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_GetLocalPawn_ReturnValue_2) == 0x0001A0, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_GetLocalPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_GetAnimInstance_ReturnValue_3) == 0x0001A8, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_GetAnimInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001B0, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_DynamicCast_AsLobby_Stationary_Character_Anim_BP_2) == 0x0001B8, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_DynamicCast_AsLobby_Stationary_Character_Anim_BP_2' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_DynamicCast_bSuccess_4) == 0x0001C0, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0001C1, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_GetAnimInstance_ReturnValue_4) == 0x0001C8, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_GetAnimInstance_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_DynamicCast_AsFace_Lobby_Static_Character_Anim_Blueprint_1) == 0x0001D0, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_DynamicCast_AsFace_Lobby_Static_Character_Anim_Blueprint_1' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, K2Node_DynamicCast_bSuccess_5) == 0x0001D8, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_BooleanAND_ReturnValue) == 0x0001D9, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue) == 0x0001E0, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase, CallFunc_BooleanAND_ReturnValue_1) == 0x0001E8, "Member 'Lobby_StationnaryCharacterBase_C_ExecuteUbergraph_Lobby_StationnaryCharacterBase::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function Lobby_StationnaryCharacterBase.Lobby_StationnaryCharacterBase_C.FindFaceAnimSequence
// 0x0020 (0x0020 - 0x0000)
struct Lobby_StationnaryCharacterBase_C_FindFaceAnimSequence final
{
public:
	class FString                                 LineId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UAnimSequence*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_FindFaceAnimSequenceFromLobbyData_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_StationnaryCharacterBase_C_FindFaceAnimSequence) == 0x000008, "Wrong alignment on Lobby_StationnaryCharacterBase_C_FindFaceAnimSequence");
static_assert(sizeof(Lobby_StationnaryCharacterBase_C_FindFaceAnimSequence) == 0x000020, "Wrong size on Lobby_StationnaryCharacterBase_C_FindFaceAnimSequence");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_FindFaceAnimSequence, LineId) == 0x000000, "Member 'Lobby_StationnaryCharacterBase_C_FindFaceAnimSequence::LineId' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_FindFaceAnimSequence, ReturnValue) == 0x000010, "Member 'Lobby_StationnaryCharacterBase_C_FindFaceAnimSequence::ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_FindFaceAnimSequence, CallFunc_FindFaceAnimSequenceFromLobbyData_ReturnValue) == 0x000018, "Member 'Lobby_StationnaryCharacterBase_C_FindFaceAnimSequence::CallFunc_FindFaceAnimSequenceFromLobbyData_ReturnValue' has a wrong offset!");

// Function Lobby_StationnaryCharacterBase.Lobby_StationnaryCharacterBase_C.GetFaceFXSkeletalMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct Lobby_StationnaryCharacterBase_C_GetFaceFXSkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_StationnaryCharacterBase_C_GetFaceFXSkeletalMeshComponent) == 0x000008, "Wrong alignment on Lobby_StationnaryCharacterBase_C_GetFaceFXSkeletalMeshComponent");
static_assert(sizeof(Lobby_StationnaryCharacterBase_C_GetFaceFXSkeletalMeshComponent) == 0x000008, "Wrong size on Lobby_StationnaryCharacterBase_C_GetFaceFXSkeletalMeshComponent");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_GetFaceFXSkeletalMeshComponent, ReturnValue) == 0x000000, "Member 'Lobby_StationnaryCharacterBase_C_GetFaceFXSkeletalMeshComponent::ReturnValue' has a wrong offset!");

// Function Lobby_StationnaryCharacterBase.Lobby_StationnaryCharacterBase_C.GetVoiceComponent
// 0x0008 (0x0008 - 0x0000)
struct Lobby_StationnaryCharacterBase_C_GetVoiceComponent final
{
public:
	class URBSoundComponent*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_StationnaryCharacterBase_C_GetVoiceComponent) == 0x000008, "Wrong alignment on Lobby_StationnaryCharacterBase_C_GetVoiceComponent");
static_assert(sizeof(Lobby_StationnaryCharacterBase_C_GetVoiceComponent) == 0x000008, "Wrong size on Lobby_StationnaryCharacterBase_C_GetVoiceComponent");
static_assert(offsetof(Lobby_StationnaryCharacterBase_C_GetVoiceComponent, ReturnValue) == 0x000000, "Member 'Lobby_StationnaryCharacterBase_C_GetVoiceComponent::ReturnValue' has a wrong offset!");

}

