#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyShuttingDoorMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass LobbyShuttingDoor-01_BP.LobbyShuttingDoor-01_BP_C
// 0x0088 (0x02D0 - 0x0248)
class ALobbyShuttingDoorMinus01_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   L_BarMinus03;                                      // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   L_BarMinus02;                                      // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   L_BarMinus01;                                      // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   R_BarMinus03;                                      // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   R_BarMinus02;                                      // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   R_BarMinus01;                                      // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LeftBars;                                          // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RightBars;                                         // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Trigger;                                           // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      RBSound;                                           // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_8C00E3604F2B7C93481DA595090B8813; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_8C00E3604F2B7C93481DA595090B8813; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E65[0x3];                                     // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BarsOffset;                                        // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bVisualLocked;                                     // 0x02C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E66[0x3];                                     // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              PreviouslyAllowedPlayer;                           // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateAllowedPlayer();
	void SetIgnoreActor(class ARBPlayer* Actor, bool Ignore);
	void B_Should_Bars_be_Locked(bool* bShouldBeBlocked);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__Sound__EventFunc();
	void BndEvt__LobbyShuttingDoorMinus01_BP_Trigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__LobbyShuttingDoorMinus01_BP_Trigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ReceiveTick(float DeltaSeconds);
	void SetBarsLocked(bool Locked);
	void ExecuteUbergraph_LobbyShuttingDoorMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyShuttingDoor-01_BP_C">();
	}
	static class ALobbyShuttingDoorMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobbyShuttingDoorMinus01_BP_C>();
	}
};
static_assert(alignof(ALobbyShuttingDoorMinus01_BP_C) == 0x000008, "Wrong alignment on ALobbyShuttingDoorMinus01_BP_C");
static_assert(sizeof(ALobbyShuttingDoorMinus01_BP_C) == 0x0002D0, "Wrong size on ALobbyShuttingDoorMinus01_BP_C");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, UberGraphFrame) == 0x000248, "Member 'ALobbyShuttingDoorMinus01_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, Box) == 0x000250, "Member 'ALobbyShuttingDoorMinus01_BP_C::Box' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, L_BarMinus03) == 0x000258, "Member 'ALobbyShuttingDoorMinus01_BP_C::L_BarMinus03' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, L_BarMinus02) == 0x000260, "Member 'ALobbyShuttingDoorMinus01_BP_C::L_BarMinus02' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, L_BarMinus01) == 0x000268, "Member 'ALobbyShuttingDoorMinus01_BP_C::L_BarMinus01' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, R_BarMinus03) == 0x000270, "Member 'ALobbyShuttingDoorMinus01_BP_C::R_BarMinus03' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, R_BarMinus02) == 0x000278, "Member 'ALobbyShuttingDoorMinus01_BP_C::R_BarMinus02' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, R_BarMinus01) == 0x000280, "Member 'ALobbyShuttingDoorMinus01_BP_C::R_BarMinus01' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, LeftBars) == 0x000288, "Member 'ALobbyShuttingDoorMinus01_BP_C::LeftBars' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, RightBars) == 0x000290, "Member 'ALobbyShuttingDoorMinus01_BP_C::RightBars' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, Trigger) == 0x000298, "Member 'ALobbyShuttingDoorMinus01_BP_C::Trigger' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, RBSound) == 0x0002A0, "Member 'ALobbyShuttingDoorMinus01_BP_C::RBSound' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, DefaultSceneRoot) == 0x0002A8, "Member 'ALobbyShuttingDoorMinus01_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, Timeline_0_NewTrack_0_8C00E3604F2B7C93481DA595090B8813) == 0x0002B0, "Member 'ALobbyShuttingDoorMinus01_BP_C::Timeline_0_NewTrack_0_8C00E3604F2B7C93481DA595090B8813' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, Timeline_0__Direction_8C00E3604F2B7C93481DA595090B8813) == 0x0002B4, "Member 'ALobbyShuttingDoorMinus01_BP_C::Timeline_0__Direction_8C00E3604F2B7C93481DA595090B8813' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, Timeline_0) == 0x0002B8, "Member 'ALobbyShuttingDoorMinus01_BP_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, BarsOffset) == 0x0002C0, "Member 'ALobbyShuttingDoorMinus01_BP_C::BarsOffset' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, bVisualLocked) == 0x0002C4, "Member 'ALobbyShuttingDoorMinus01_BP_C::bVisualLocked' has a wrong offset!");
static_assert(offsetof(ALobbyShuttingDoorMinus01_BP_C, PreviouslyAllowedPlayer) == 0x0002C8, "Member 'ALobbyShuttingDoorMinus01_BP_C::PreviouslyAllowedPlayer' has a wrong offset!");

}

