#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lobby_StationnaryCharacterBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Lobby_StationnaryCharacterBase.Lobby_StationnaryCharacterBase_C
// 0x0078 (0x02C0 - 0x0248)
class ALobby_StationnaryCharacterBase_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          HailingZone;                                       // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      RBSound;                                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBPropOptimizerComponent*              RBPropOptimizer;                                   // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lhand_Prop;                                        // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 FullBody_Mesh;                                     // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 GuardHead;                                         // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh1;                                     // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBNetworkSyncComponent*                RBNetworkSync;                                     // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          UseAnimBP;                                         // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C95[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          PreviewAnimSequence;                               // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Animation_Data_Initial_Position;                   // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animation_Data_Looping;                            // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Animation_Data_Playing;                            // 0x02AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AllowLookAt;                                       // 0x02AE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C96[0x1];                                     // 0x02AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ALobby_StationnaryCharacterBase_C*      StationaryCharacterBase;                           // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookAtYaw;                                         // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LookAtEnabled;                                     // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool TryPlayFacialAnim(const class FString& LineId);
	void GetFacePoseAsset(class UPoseAsset** PoseAsset);
	void UserConstructionScript();
	void UpdateLookAt();
	void BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void StopFacialAnim();
	void Blink();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Lobby_StationnaryCharacterBase(int32 EntryPoint);

	class UAnimSequence* FindFaceAnimSequence(const class FString& LineId) const;
	class USkeletalMeshComponent* GetFaceFXSkeletalMeshComponent() const;
	class URBSoundComponent* GetVoiceComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Lobby_StationnaryCharacterBase_C">();
	}
	static class ALobby_StationnaryCharacterBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobby_StationnaryCharacterBase_C>();
	}
};
static_assert(alignof(ALobby_StationnaryCharacterBase_C) == 0x000008, "Wrong alignment on ALobby_StationnaryCharacterBase_C");
static_assert(sizeof(ALobby_StationnaryCharacterBase_C) == 0x0002C0, "Wrong size on ALobby_StationnaryCharacterBase_C");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, UberGraphFrame) == 0x000248, "Member 'ALobby_StationnaryCharacterBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, HailingZone) == 0x000250, "Member 'ALobby_StationnaryCharacterBase_C::HailingZone' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, RBSound) == 0x000258, "Member 'ALobby_StationnaryCharacterBase_C::RBSound' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, RBPropOptimizer) == 0x000260, "Member 'ALobby_StationnaryCharacterBase_C::RBPropOptimizer' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, Lhand_Prop) == 0x000268, "Member 'ALobby_StationnaryCharacterBase_C::Lhand_Prop' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, FullBody_Mesh) == 0x000270, "Member 'ALobby_StationnaryCharacterBase_C::FullBody_Mesh' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, GuardHead) == 0x000278, "Member 'ALobby_StationnaryCharacterBase_C::GuardHead' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, SkeletalMesh1) == 0x000280, "Member 'ALobby_StationnaryCharacterBase_C::SkeletalMesh1' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, RBNetworkSync) == 0x000288, "Member 'ALobby_StationnaryCharacterBase_C::RBNetworkSync' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, DefaultSceneRoot) == 0x000290, "Member 'ALobby_StationnaryCharacterBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, UseAnimBP) == 0x000298, "Member 'ALobby_StationnaryCharacterBase_C::UseAnimBP' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, PreviewAnimSequence) == 0x0002A0, "Member 'ALobby_StationnaryCharacterBase_C::PreviewAnimSequence' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, Animation_Data_Initial_Position) == 0x0002A8, "Member 'ALobby_StationnaryCharacterBase_C::Animation_Data_Initial_Position' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, Animation_Data_Looping) == 0x0002AC, "Member 'ALobby_StationnaryCharacterBase_C::Animation_Data_Looping' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, Animation_Data_Playing) == 0x0002AD, "Member 'ALobby_StationnaryCharacterBase_C::Animation_Data_Playing' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, AllowLookAt) == 0x0002AE, "Member 'ALobby_StationnaryCharacterBase_C::AllowLookAt' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, StationaryCharacterBase) == 0x0002B0, "Member 'ALobby_StationnaryCharacterBase_C::StationaryCharacterBase' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, LookAtYaw) == 0x0002B8, "Member 'ALobby_StationnaryCharacterBase_C::LookAtYaw' has a wrong offset!");
static_assert(offsetof(ALobby_StationnaryCharacterBase_C, LookAtEnabled) == 0x0002BC, "Member 'ALobby_StationnaryCharacterBase_C::LookAtEnabled' has a wrong offset!");

}

