#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyExitReagentBoardNameItem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LobbyExitReagentBoardNameItem.LobbyExitReagentBoardNameItem_C.SwapCollapsedStat
// 0x0060 (0x0060 - 0x0000)
struct LobbyExitReagentBoardNameItem_C_SwapCollapsedStat final
{
public:
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_1;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULobbyCell_StatBoard_C*                 K2Node_DynamicCast_AsLobby_Cell_Stat_Board;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CA5[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobbyCell_StatBoard_C*                 K2Node_DynamicCast_AsLobby_Cell_Stat_Board_1;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CA6[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_2;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_3;                  // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULobbyCell_StatBoard_C*                 K2Node_DynamicCast_AsLobby_Cell_Stat_Board_2;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CA7[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobbyCell_StatBoard_C*                 K2Node_DynamicCast_AsLobby_Cell_Stat_Board_3;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyExitReagentBoardNameItem_C_SwapCollapsedStat) == 0x000008, "Wrong alignment on LobbyExitReagentBoardNameItem_C_SwapCollapsedStat");
static_assert(sizeof(LobbyExitReagentBoardNameItem_C_SwapCollapsedStat) == 0x000060, "Wrong size on LobbyExitReagentBoardNameItem_C_SwapCollapsedStat");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SwapCollapsedStat, CallFunc_GetWidget_ReturnValue) == 0x000000, "Member 'LobbyExitReagentBoardNameItem_C_SwapCollapsedStat::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SwapCollapsedStat, CallFunc_GetWidget_ReturnValue_1) == 0x000008, "Member 'LobbyExitReagentBoardNameItem_C_SwapCollapsedStat::CallFunc_GetWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SwapCollapsedStat, K2Node_DynamicCast_AsLobby_Cell_Stat_Board) == 0x000010, "Member 'LobbyExitReagentBoardNameItem_C_SwapCollapsedStat::K2Node_DynamicCast_AsLobby_Cell_Stat_Board' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SwapCollapsedStat, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'LobbyExitReagentBoardNameItem_C_SwapCollapsedStat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SwapCollapsedStat, K2Node_DynamicCast_AsLobby_Cell_Stat_Board_1) == 0x000020, "Member 'LobbyExitReagentBoardNameItem_C_SwapCollapsedStat::K2Node_DynamicCast_AsLobby_Cell_Stat_Board_1' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SwapCollapsedStat, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'LobbyExitReagentBoardNameItem_C_SwapCollapsedStat::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SwapCollapsedStat, CallFunc_GetWidget_ReturnValue_2) == 0x000030, "Member 'LobbyExitReagentBoardNameItem_C_SwapCollapsedStat::CallFunc_GetWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SwapCollapsedStat, CallFunc_GetWidget_ReturnValue_3) == 0x000038, "Member 'LobbyExitReagentBoardNameItem_C_SwapCollapsedStat::CallFunc_GetWidget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SwapCollapsedStat, K2Node_DynamicCast_AsLobby_Cell_Stat_Board_2) == 0x000040, "Member 'LobbyExitReagentBoardNameItem_C_SwapCollapsedStat::K2Node_DynamicCast_AsLobby_Cell_Stat_Board_2' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SwapCollapsedStat, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'LobbyExitReagentBoardNameItem_C_SwapCollapsedStat::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SwapCollapsedStat, K2Node_DynamicCast_AsLobby_Cell_Stat_Board_3) == 0x000050, "Member 'LobbyExitReagentBoardNameItem_C_SwapCollapsedStat::K2Node_DynamicCast_AsLobby_Cell_Stat_Board_3' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SwapCollapsedStat, K2Node_DynamicCast_bSuccess_3) == 0x000058, "Member 'LobbyExitReagentBoardNameItem_C_SwapCollapsedStat::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function LobbyExitReagentBoardNameItem.LobbyExitReagentBoardNameItem_C.SetWidgetText
// 0x0088 (0x0088 - 0x0000)
struct LobbyExitReagentBoardNameItem_C_SetWidgetText final
{
public:
	class UWidgetComponent*                       Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InPlayerName;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InStatistic;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULobbyCell_StatBoard_C*                 K2Node_DynamicCast_AsLobby_Cell_Stat_Board;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CA8[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_FormatPlayerName_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
};
static_assert(alignof(LobbyExitReagentBoardNameItem_C_SetWidgetText) == 0x000008, "Wrong alignment on LobbyExitReagentBoardNameItem_C_SetWidgetText");
static_assert(sizeof(LobbyExitReagentBoardNameItem_C_SetWidgetText) == 0x000088, "Wrong size on LobbyExitReagentBoardNameItem_C_SetWidgetText");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SetWidgetText, Target) == 0x000000, "Member 'LobbyExitReagentBoardNameItem_C_SetWidgetText::Target' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SetWidgetText, InPlayerName) == 0x000008, "Member 'LobbyExitReagentBoardNameItem_C_SetWidgetText::InPlayerName' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SetWidgetText, InStatistic) == 0x000020, "Member 'LobbyExitReagentBoardNameItem_C_SetWidgetText::InStatistic' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SetWidgetText, CallFunc_GetWidget_ReturnValue) == 0x000038, "Member 'LobbyExitReagentBoardNameItem_C_SetWidgetText::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SetWidgetText, CallFunc_Conv_TextToString_ReturnValue) == 0x000040, "Member 'LobbyExitReagentBoardNameItem_C_SetWidgetText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SetWidgetText, K2Node_DynamicCast_AsLobby_Cell_Stat_Board) == 0x000050, "Member 'LobbyExitReagentBoardNameItem_C_SetWidgetText::K2Node_DynamicCast_AsLobby_Cell_Stat_Board' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SetWidgetText, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'LobbyExitReagentBoardNameItem_C_SetWidgetText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SetWidgetText, CallFunc_FormatPlayerName_ReturnValue) == 0x000060, "Member 'LobbyExitReagentBoardNameItem_C_SetWidgetText::CallFunc_FormatPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_SetWidgetText, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'LobbyExitReagentBoardNameItem_C_SetWidgetText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function LobbyExitReagentBoardNameItem.LobbyExitReagentBoardNameItem_C.UpdateStatType
// 0x0038 (0x0038 - 0x0000)
struct LobbyExitReagentBoardNameItem_C_UpdateStatType final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   CategoryHeader;                                    // 0x0018(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyExitReagentBoardNameItem_C_UpdateStatType) == 0x000008, "Wrong alignment on LobbyExitReagentBoardNameItem_C_UpdateStatType");
static_assert(sizeof(LobbyExitReagentBoardNameItem_C_UpdateStatType) == 0x000038, "Wrong size on LobbyExitReagentBoardNameItem_C_UpdateStatType");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_UpdateStatType, Value) == 0x000000, "Member 'LobbyExitReagentBoardNameItem_C_UpdateStatType::Value' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_UpdateStatType, CategoryHeader) == 0x000018, "Member 'LobbyExitReagentBoardNameItem_C_UpdateStatType::CategoryHeader' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_UpdateStatType, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'LobbyExitReagentBoardNameItem_C_UpdateStatType::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function LobbyExitReagentBoardNameItem.LobbyExitReagentBoardNameItem_C.UpdateStatistic
// 0x0038 (0x0038 - 0x0000)
struct LobbyExitReagentBoardNameItem_C_UpdateStatistic final
{
public:
	class FText                                   PlayerName;                                        // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Value1;                                            // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyExitReagentBoardNameItem_C_UpdateStatistic) == 0x000008, "Wrong alignment on LobbyExitReagentBoardNameItem_C_UpdateStatistic");
static_assert(sizeof(LobbyExitReagentBoardNameItem_C_UpdateStatistic) == 0x000038, "Wrong size on LobbyExitReagentBoardNameItem_C_UpdateStatistic");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_UpdateStatistic, PlayerName) == 0x000000, "Member 'LobbyExitReagentBoardNameItem_C_UpdateStatistic::PlayerName' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_UpdateStatistic, Value1) == 0x000018, "Member 'LobbyExitReagentBoardNameItem_C_UpdateStatistic::Value1' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_UpdateStatistic, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'LobbyExitReagentBoardNameItem_C_UpdateStatistic::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function LobbyExitReagentBoardNameItem.LobbyExitReagentBoardNameItem_C.ExecuteUbergraph_LobbyExitReagentBoardNameItem
// 0x00AC (0x00AC - 0x0000)
struct LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LerpAngle_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0024(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem) == 0x000004, "Wrong alignment on LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem");
static_assert(sizeof(LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem) == 0x0000AC, "Wrong size on LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem, EntryPoint) == 0x000000, "Member 'LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem, CallFunc_Add_FloatFloat_ReturnValue) == 0x000004, "Member 'LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem, CallFunc_BreakRotator_Roll) == 0x000008, "Member 'LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem, CallFunc_BreakRotator_Pitch) == 0x00000C, "Member 'LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem, CallFunc_BreakRotator_Yaw) == 0x000010, "Member 'LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem, CallFunc_LerpAngle_ReturnValue) == 0x000014, "Member 'LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem::CallFunc_LerpAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000024, "Member 'LobbyExitReagentBoardNameItem_C_ExecuteUbergraph_LobbyExitReagentBoardNameItem::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

