#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainObjectivesContainer

#include "Basic.hpp"


namespace SDK::Params
{

// Function MainObjectivesContainer.MainObjectivesContainer_C.ExecuteUbergraph_MainObjectivesContainer
// 0x0040 (0x0040 - 0x0000)
struct MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF0[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF1[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHUDObjectives_C*                       K2Node_DynamicCast_AsHUD_Objectives;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF2[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer) == 0x000008, "Wrong alignment on MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer");
static_assert(sizeof(MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer) == 0x000040, "Wrong size on MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer");
static_assert(offsetof(MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer, EntryPoint) == 0x000000, "Member 'MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer, Temp_bool_Variable) == 0x000004, "Member 'MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer, Temp_float_Variable) == 0x000008, "Member 'MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer, Temp_float_Variable_1) == 0x00000C, "Member 'MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer, K2Node_Event_IsDesignTime) == 0x000010, "Member 'MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer, K2Node_Select_Default) == 0x000014, "Member 'MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x000018, "Member 'MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000020, "Member 'MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer, K2Node_DynamicCast_AsHUD_Objectives) == 0x000028, "Member 'MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer::K2Node_DynamicCast_AsHUD_Objectives' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer, CallFunc_PlayAnimationForward_ReturnValue) == 0x000038, "Member 'MainObjectivesContainer_C_ExecuteUbergraph_MainObjectivesContainer::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function MainObjectivesContainer.MainObjectivesContainer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct MainObjectivesContainer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainObjectivesContainer_C_PreConstruct) == 0x000001, "Wrong alignment on MainObjectivesContainer_C_PreConstruct");
static_assert(sizeof(MainObjectivesContainer_C_PreConstruct) == 0x000001, "Wrong size on MainObjectivesContainer_C_PreConstruct");
static_assert(offsetof(MainObjectivesContainer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'MainObjectivesContainer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function MainObjectivesContainer.MainObjectivesContainer_C.Add Objective
// 0x0030 (0x0030 - 0x0000)
struct MainObjectivesContainer_C_Add_Objective final
{
public:
	class ARBBaseObjectiveCoordinator*            Coordinator;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMainObjectiveWidget_C*                 CreatedWidget;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMainObjectiveWidget_C*                 CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsVisible)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainObjectivesContainer_C_Add_Objective) == 0x000008, "Wrong alignment on MainObjectivesContainer_C_Add_Objective");
static_assert(sizeof(MainObjectivesContainer_C_Add_Objective) == 0x000030, "Wrong size on MainObjectivesContainer_C_Add_Objective");
static_assert(offsetof(MainObjectivesContainer_C_Add_Objective, Coordinator) == 0x000000, "Member 'MainObjectivesContainer_C_Add_Objective::Coordinator' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_Add_Objective, CreatedWidget) == 0x000008, "Member 'MainObjectivesContainer_C_Add_Objective::CreatedWidget' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_Add_Objective, CallFunc_Create_ReturnValue) == 0x000010, "Member 'MainObjectivesContainer_C_Add_Objective::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_Add_Objective, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'MainObjectivesContainer_C_Add_Objective::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_Add_Objective, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000028, "Member 'MainObjectivesContainer_C_Add_Objective::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function MainObjectivesContainer.MainObjectivesContainer_C.OnMainObjectiveVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct MainObjectivesContainer_C_OnMainObjectiveVisibilityChanged final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainObjectivesContainer_C_OnMainObjectiveVisibilityChanged) == 0x000001, "Wrong alignment on MainObjectivesContainer_C_OnMainObjectiveVisibilityChanged");
static_assert(sizeof(MainObjectivesContainer_C_OnMainObjectiveVisibilityChanged) == 0x000001, "Wrong size on MainObjectivesContainer_C_OnMainObjectiveVisibilityChanged");
static_assert(offsetof(MainObjectivesContainer_C_OnMainObjectiveVisibilityChanged, Param_IsVisible) == 0x000000, "Member 'MainObjectivesContainer_C_OnMainObjectiveVisibilityChanged::Param_IsVisible' has a wrong offset!");

// Function MainObjectivesContainer.MainObjectivesContainer_C.RefreshObjectivesTexts
// 0x0048 (0x0048 - 0x0000)
struct MainObjectivesContainer_C_RefreshObjectivesTexts final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DF3[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DF4[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF5[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainObjectiveWidget_C*                 K2Node_DynamicCast_AsMain_Objective_Widget;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainObjectivesContainer_C_RefreshObjectivesTexts) == 0x000008, "Wrong alignment on MainObjectivesContainer_C_RefreshObjectivesTexts");
static_assert(sizeof(MainObjectivesContainer_C_RefreshObjectivesTexts) == 0x000048, "Wrong size on MainObjectivesContainer_C_RefreshObjectivesTexts");
static_assert(offsetof(MainObjectivesContainer_C_RefreshObjectivesTexts, Temp_int_Array_Index_Variable) == 0x000000, "Member 'MainObjectivesContainer_C_RefreshObjectivesTexts::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_RefreshObjectivesTexts, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'MainObjectivesContainer_C_RefreshObjectivesTexts::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_RefreshObjectivesTexts, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'MainObjectivesContainer_C_RefreshObjectivesTexts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_RefreshObjectivesTexts, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'MainObjectivesContainer_C_RefreshObjectivesTexts::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_RefreshObjectivesTexts, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'MainObjectivesContainer_C_RefreshObjectivesTexts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_RefreshObjectivesTexts, CallFunc_Array_Get_Item) == 0x000028, "Member 'MainObjectivesContainer_C_RefreshObjectivesTexts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_RefreshObjectivesTexts, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'MainObjectivesContainer_C_RefreshObjectivesTexts::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_RefreshObjectivesTexts, K2Node_DynamicCast_AsMain_Objective_Widget) == 0x000038, "Member 'MainObjectivesContainer_C_RefreshObjectivesTexts::K2Node_DynamicCast_AsMain_Objective_Widget' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_RefreshObjectivesTexts, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'MainObjectivesContainer_C_RefreshObjectivesTexts::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_RefreshObjectivesTexts, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'MainObjectivesContainer_C_RefreshObjectivesTexts::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MainObjectivesContainer.MainObjectivesContainer_C.RegisterCoordinator
// 0x0010 (0x0010 - 0x0000)
struct MainObjectivesContainer_C_RegisterCoordinator final
{
public:
	class ARBBaseObjectiveCoordinator*            Coordinator;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainObjectivesContainer_C_RegisterCoordinator) == 0x000008, "Wrong alignment on MainObjectivesContainer_C_RegisterCoordinator");
static_assert(sizeof(MainObjectivesContainer_C_RegisterCoordinator) == 0x000010, "Wrong size on MainObjectivesContainer_C_RegisterCoordinator");
static_assert(offsetof(MainObjectivesContainer_C_RegisterCoordinator, Coordinator) == 0x000000, "Member 'MainObjectivesContainer_C_RegisterCoordinator::Coordinator' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_RegisterCoordinator, CallFunc_Array_AddUnique_ReturnValue) == 0x000008, "Member 'MainObjectivesContainer_C_RegisterCoordinator::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function MainObjectivesContainer.MainObjectivesContainer_C.AddWaitingCoordinators
// 0x0020 (0x0020 - 0x0000)
struct MainObjectivesContainer_C_AddWaitingCoordinators final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DF6[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBBaseObjectiveCoordinator*            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainObjectivesContainer_C_AddWaitingCoordinators) == 0x000008, "Wrong alignment on MainObjectivesContainer_C_AddWaitingCoordinators");
static_assert(sizeof(MainObjectivesContainer_C_AddWaitingCoordinators) == 0x000020, "Wrong size on MainObjectivesContainer_C_AddWaitingCoordinators");
static_assert(offsetof(MainObjectivesContainer_C_AddWaitingCoordinators, Temp_int_Array_Index_Variable) == 0x000000, "Member 'MainObjectivesContainer_C_AddWaitingCoordinators::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_AddWaitingCoordinators, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'MainObjectivesContainer_C_AddWaitingCoordinators::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_AddWaitingCoordinators, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'MainObjectivesContainer_C_AddWaitingCoordinators::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_AddWaitingCoordinators, CallFunc_Array_Get_Item) == 0x000010, "Member 'MainObjectivesContainer_C_AddWaitingCoordinators::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_AddWaitingCoordinators, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'MainObjectivesContainer_C_AddWaitingCoordinators::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_AddWaitingCoordinators, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'MainObjectivesContainer_C_AddWaitingCoordinators::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_AddWaitingCoordinators, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001D, "Member 'MainObjectivesContainer_C_AddWaitingCoordinators::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function MainObjectivesContainer.MainObjectivesContainer_C.ShouldShow
// 0x0018 (0x0018 - 0x0000)
struct MainObjectivesContainer_C_ShouldShow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DF7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGameUserPreferences*                 CallFunc_GetRBGameUserPreferences_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetObjectiveDisplay_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainObjectivesContainer_C_ShouldShow) == 0x000008, "Wrong alignment on MainObjectivesContainer_C_ShouldShow");
static_assert(sizeof(MainObjectivesContainer_C_ShouldShow) == 0x000018, "Wrong size on MainObjectivesContainer_C_ShouldShow");
static_assert(offsetof(MainObjectivesContainer_C_ShouldShow, ReturnValue) == 0x000000, "Member 'MainObjectivesContainer_C_ShouldShow::ReturnValue' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_ShouldShow, CallFunc_GetRBGameUserPreferences_ReturnValue) == 0x000008, "Member 'MainObjectivesContainer_C_ShouldShow::CallFunc_GetRBGameUserPreferences_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_ShouldShow, CallFunc_GetObjectiveDisplay_ReturnValue) == 0x000010, "Member 'MainObjectivesContainer_C_ShouldShow::CallFunc_GetObjectiveDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_ShouldShow, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000014, "Member 'MainObjectivesContainer_C_ShouldShow::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainObjectivesContainer_C_ShouldShow, CallFunc_BooleanOR_ReturnValue) == 0x000015, "Member 'MainObjectivesContainer_C_ShouldShow::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

