#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function MainMenu.MainMenu_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct MainMenu_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on MainMenu_C_ReceiveEndPlay");
static_assert(sizeof(MainMenu_C_ReceiveEndPlay) == 0x000001, "Wrong size on MainMenu_C_ReceiveEndPlay");
static_assert(offsetof(MainMenu_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'MainMenu_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function MainMenu.MainMenu_C.OnMainMenuStageChanged
// 0x0001 (0x0001 - 0x0000)
struct MainMenu_C_OnMainMenuStageChanged final
{
public:
	EMainMenuState                                MainMenuState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_OnMainMenuStageChanged) == 0x000001, "Wrong alignment on MainMenu_C_OnMainMenuStageChanged");
static_assert(sizeof(MainMenu_C_OnMainMenuStageChanged) == 0x000001, "Wrong size on MainMenu_C_OnMainMenuStageChanged");
static_assert(offsetof(MainMenu_C_OnMainMenuStageChanged, MainMenuState) == 0x000000, "Member 'MainMenu_C_OnMainMenuStageChanged::MainMenuState' has a wrong offset!");

// Function MainMenu.MainMenu_C.ExecuteUbergraph_MainMenu
// 0x0080 (0x0080 - 0x0000)
struct MainMenu_C_ExecuteUbergraph_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EMainMenuState MainMenuState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenUrl_ReturnValue;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30CF[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_1;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBMainMenuGameMode_BP_C*               K2Node_DynamicCast_AsRB_Main_Menu_Game_Mode_BP;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D0[0x5];                                     // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMainMenuState                                K2Node_CustomEvent_mainMenuState;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_1;                       // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_2;                       // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenUrl_ReturnValue_1;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenUrl_ReturnValue_2;                    // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_3;                       // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue_4;                       // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenUrl_ReturnValue_3;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenUrl_ReturnValue_4;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_C_ExecuteUbergraph_MainMenu) == 0x000008, "Wrong alignment on MainMenu_C_ExecuteUbergraph_MainMenu");
static_assert(sizeof(MainMenu_C_ExecuteUbergraph_MainMenu) == 0x000080, "Wrong size on MainMenu_C_ExecuteUbergraph_MainMenu");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, EntryPoint) == 0x000000, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Play_ReturnValue) == 0x000014, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_OpenUrl_ReturnValue) == 0x000015, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_OpenUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_delegate_Variable) == 0x000018, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_delegate_Variable_1) == 0x000028, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_PostEventGlobal_ReturnValue) == 0x000038, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_PostEventGlobal_ReturnValue_1) == 0x00003C, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_PostEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetRBGameModeMainMenu_ReturnValue) == 0x000040, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetRBGameModeMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_DynamicCast_AsRB_Main_Menu_Game_Mode_BP) == 0x000048, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_DynamicCast_AsRB_Main_Menu_Game_Mode_BP' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_Event_EndPlayReason) == 0x000051, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000052, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetSequencePlayer_ReturnValue) == 0x000058, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetSequencePlayer_ReturnValue_1) == 0x000060, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetSequencePlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetRBGameModeMainMenu_ReturnValue_1) == 0x000068, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetRBGameModeMainMenu_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CustomEvent_mainMenuState) == 0x000070, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CustomEvent_mainMenuState' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_SwitchEnum_CmpSuccess) == 0x000071, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Play_ReturnValue_1) == 0x000072, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Play_ReturnValue_2) == 0x000073, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_OpenUrl_ReturnValue_1) == 0x000074, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_OpenUrl_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_OpenUrl_ReturnValue_2) == 0x000075, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_OpenUrl_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Play_ReturnValue_3) == 0x000076, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Play_ReturnValue_4) == 0x000077, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Play_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_OpenUrl_ReturnValue_3) == 0x000078, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_OpenUrl_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_OpenUrl_ReturnValue_4) == 0x000079, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_OpenUrl_ReturnValue_4' has a wrong offset!");

}

