#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MainMenu.MainMenu_C.ExecuteUbergraph_MainMenu
// 0x0398 (0x0398 - 0x0000)
struct MainMenu_C_ExecuteUbergraph_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B8(0x0040)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0120(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_2;            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetChangelist_ReturnValue;                // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0148(0x0018)()
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue_1;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlay_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue_2;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue_3;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue_4;      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0194(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBChunkInstallManager*                 CallFunc_GetChunkInstallManager_ReturnValue;       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetChunkInstallationStatus_Percent;       // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetChunkInstallationStatus_ReturnValue;   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_Button_Enabled_enabled;               // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x2];                                      // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x01EC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x01FC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_3;            // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_4;            // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0214(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0228(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0268(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0278(0x0018)()
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue_5;      // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlay_ReturnValue_1;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBChunkInstallManager*                 CallFunc_GetChunkInstallManager_ReturnValue_1;     // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChunkInstallationCompleted_ReturnValue; // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsGamepad;                           // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AB[0x5];                                      // 0x02AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue_6;      // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerDisplayName_ReturnValue;         // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x02D0(0x0018)()
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue_7;      // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMainMenuProgressionDetails            CallFunc_GetMainMenuProgressionDetails_ReturnValue; // 0x02F0(0x0060)(ConstParm)
	bool                                          K2Node_Event_bShouldHide;                          // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x0353(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanXOR_ReturnValue;                   // 0x0355(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_356[0x2];                                      // 0x0356(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentItemIndex_ReturnValue;          // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidget*                          CallFunc_GetFocusedChild_ReturnValue;              // 0x0370(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button_1;               // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button;                 // 0x0380(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetId_ReturnValue;                        // 0x038C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_C_ExecuteUbergraph_MainMenu) == 0x000008, "Wrong alignment on MainMenu_C_ExecuteUbergraph_MainMenu");
static_assert(sizeof(MainMenu_C_ExecuteUbergraph_MainMenu) == 0x000398, "Wrong size on MainMenu_C_ExecuteUbergraph_MainMenu");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, EntryPoint) == 0x000000, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_delegate_Variable) == 0x000004, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_delegate_Variable_1) == 0x000014, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_PostEventGlobal_ReturnValue) == 0x000024, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_PostEventGlobal_ReturnValue_1) == 0x000028, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_PostEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_bool_Variable) == 0x00002C, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_byte_Variable) == 0x00002D, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_byte_Variable_1) == 0x00002E, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_MakeArray_Array) == 0x000080, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Format_ReturnValue) == 0x000090, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000A8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000F8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000108, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_bool_Variable_1) == 0x000118, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_byte_Variable_2) == 0x000119, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_byte_Variable_3) == 0x00011A, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_bool_Variable_2) == 0x00011B, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_byte_Variable_4) == 0x00011C, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_byte_Variable_5) == 0x00011D, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_delegate_Variable_2) == 0x000120, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_PostEventGlobal_ReturnValue_2) == 0x000130, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_PostEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetChangelist_ReturnValue) == 0x000138, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetChangelist_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Conv_StringToText_ReturnValue) == 0x000148, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetRBGameModeMainMenu_ReturnValue) == 0x000160, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetRBGameModeMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetRBGameModeMainMenu_ReturnValue_1) == 0x000168, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetRBGameModeMainMenu_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_CanPlay_ReturnValue) == 0x000170, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_CanPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetRBGameModeMainMenu_ReturnValue_2) == 0x000178, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetRBGameModeMainMenu_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetRBGameModeMainMenu_ReturnValue_3) == 0x000180, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetRBGameModeMainMenu_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetRBGameModeMainMenu_ReturnValue_4) == 0x000188, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetRBGameModeMainMenu_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_IsConsole_ReturnValue) == 0x000190, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_Event_MyGeometry) == 0x000194, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_Event_InDeltaTime) == 0x0001CC, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetChunkInstallManager_ReturnValue) == 0x0001D0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetChunkInstallManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_Select_Default) == 0x0001D8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetChunkInstallationStatus_Percent) == 0x0001DC, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetChunkInstallationStatus_Percent' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetChunkInstallationStatus_ReturnValue) == 0x0001E0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetChunkInstallationStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_FFloor_ReturnValue) == 0x0001E4, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0001E8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Get_Button_Enabled_enabled) == 0x0001E9, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Get_Button_Enabled_enabled' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_delegate_Variable_3) == 0x0001EC, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_delegate_Variable_4) == 0x0001FC, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_PostEventGlobal_ReturnValue_3) == 0x00020C, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_PostEventGlobal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_PostEventGlobal_ReturnValue_4) == 0x000210, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_PostEventGlobal_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CreateDelegate_OutputDelegate_4) == 0x000214, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_MakeStruct_FormatArgumentData_2) == 0x000228, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_MakeArray_Array_1) == 0x000268, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Format_ReturnValue_1) == 0x000278, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetRBGameModeMainMenu_ReturnValue_5) == 0x000290, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetRBGameModeMainMenu_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_CanPlay_ReturnValue_1) == 0x000298, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_CanPlay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetChunkInstallManager_ReturnValue_1) == 0x0002A0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetChunkInstallManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_IsChunkInstallationCompleted_ReturnValue) == 0x0002A8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_IsChunkInstallationCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_Event_bIsGamepad) == 0x0002A9, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_Event_bIsGamepad' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_BooleanAND_ReturnValue) == 0x0002AA, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetRBGameModeMainMenu_ReturnValue_6) == 0x0002B0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetRBGameModeMainMenu_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_IsValid_ReturnValue) == 0x0002B8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetPlayerDisplayName_ReturnValue) == 0x0002C0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetPlayerDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0002D0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetRBGameModeMainMenu_ReturnValue_7) == 0x0002E8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetRBGameModeMainMenu_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetMainMenuProgressionDetails_ReturnValue) == 0x0002F0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetMainMenuProgressionDetails_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_Event_bShouldHide) == 0x000350, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_Event_bShouldHide' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000351, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000352, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_IsAnimationPlayingForward_ReturnValue) == 0x000353, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_IsAnimationPlayingForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_Select_Default_1) == 0x000354, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_BooleanXOR_ReturnValue) == 0x000355, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_BooleanXOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000358, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetCurrentItemIndex_ReturnValue) == 0x000360, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetCurrentItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Index) == 0x000364, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_Select_Default_2) == 0x000368, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetFocusedChild_ReturnValue) == 0x000370, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetFocusedChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button_1) == 0x000378, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button) == 0x000380, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetNumItems_ReturnValue) == 0x000388, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetId_ReturnValue) == 0x00038C, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x000394, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_Event_IsDesignTime) == 0x000395, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function MainMenu.MainMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct MainMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_C_PreConstruct) == 0x000001, "Wrong alignment on MainMenu_C_PreConstruct");
static_assert(sizeof(MainMenu_C_PreConstruct) == 0x000001, "Wrong size on MainMenu_C_PreConstruct");
static_assert(offsetof(MainMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'MainMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function MainMenu.MainMenu_C.BndEvt__MainMenu_NewsActionPrompt_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MainMenu_C_BndEvt__MainMenu_NewsActionPrompt_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_BndEvt__MainMenu_NewsActionPrompt_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on MainMenu_C_BndEvt__MainMenu_NewsActionPrompt_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature");
static_assert(sizeof(MainMenu_C_BndEvt__MainMenu_NewsActionPrompt_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature) == 0x000008, "Wrong size on MainMenu_C_BndEvt__MainMenu_NewsActionPrompt_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature");
static_assert(offsetof(MainMenu_C_BndEvt__MainMenu_NewsActionPrompt_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'MainMenu_C_BndEvt__MainMenu_NewsActionPrompt_K2Node_ComponentBoundEvent_12_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function MainMenu.MainMenu_C.BndEvt__MainMenu_NewsBackPrompt_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MainMenu_C_BndEvt__MainMenu_NewsBackPrompt_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_BndEvt__MainMenu_NewsBackPrompt_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on MainMenu_C_BndEvt__MainMenu_NewsBackPrompt_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature");
static_assert(sizeof(MainMenu_C_BndEvt__MainMenu_NewsBackPrompt_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature) == 0x000008, "Wrong size on MainMenu_C_BndEvt__MainMenu_NewsBackPrompt_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature");
static_assert(offsetof(MainMenu_C_BndEvt__MainMenu_NewsBackPrompt_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'MainMenu_C_BndEvt__MainMenu_NewsBackPrompt_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function MainMenu.MainMenu_C.BndEvt__MainMenu_NewsFocus_K2Node_ComponentBoundEvent_11_ActiveItemSet__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct MainMenu_C_BndEvt__MainMenu_NewsFocus_K2Node_ComponentBoundEvent_11_ActiveItemSet__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_BndEvt__MainMenu_NewsFocus_K2Node_ComponentBoundEvent_11_ActiveItemSet__DelegateSignature) == 0x000004, "Wrong alignment on MainMenu_C_BndEvt__MainMenu_NewsFocus_K2Node_ComponentBoundEvent_11_ActiveItemSet__DelegateSignature");
static_assert(sizeof(MainMenu_C_BndEvt__MainMenu_NewsFocus_K2Node_ComponentBoundEvent_11_ActiveItemSet__DelegateSignature) == 0x000004, "Wrong size on MainMenu_C_BndEvt__MainMenu_NewsFocus_K2Node_ComponentBoundEvent_11_ActiveItemSet__DelegateSignature");
static_assert(offsetof(MainMenu_C_BndEvt__MainMenu_NewsFocus_K2Node_ComponentBoundEvent_11_ActiveItemSet__DelegateSignature, Index_0) == 0x000000, "Member 'MainMenu_C_BndEvt__MainMenu_NewsFocus_K2Node_ComponentBoundEvent_11_ActiveItemSet__DelegateSignature::Index_0' has a wrong offset!");

// Function MainMenu.MainMenu_C.Event_OnUnfocusMenu
// 0x0001 (0x0001 - 0x0000)
struct MainMenu_C_Event_OnUnfocusMenu final
{
public:
	bool                                          bShouldHide;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_C_Event_OnUnfocusMenu) == 0x000001, "Wrong alignment on MainMenu_C_Event_OnUnfocusMenu");
static_assert(sizeof(MainMenu_C_Event_OnUnfocusMenu) == 0x000001, "Wrong size on MainMenu_C_Event_OnUnfocusMenu");
static_assert(offsetof(MainMenu_C_Event_OnUnfocusMenu, bShouldHide) == 0x000000, "Member 'MainMenu_C_Event_OnUnfocusMenu::bShouldHide' has a wrong offset!");

// Function MainMenu.MainMenu_C.Event_InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct MainMenu_C_Event_InputSourceChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_C_Event_InputSourceChanged) == 0x000001, "Wrong alignment on MainMenu_C_Event_InputSourceChanged");
static_assert(sizeof(MainMenu_C_Event_InputSourceChanged) == 0x000001, "Wrong size on MainMenu_C_Event_InputSourceChanged");
static_assert(offsetof(MainMenu_C_Event_InputSourceChanged, bIsGamepad) == 0x000000, "Member 'MainMenu_C_Event_InputSourceChanged::bIsGamepad' has a wrong offset!");

// Function MainMenu.MainMenu_C.Tick
// 0x003C (0x003C - 0x0000)
struct MainMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_Tick) == 0x000004, "Wrong alignment on MainMenu_C_Tick");
static_assert(sizeof(MainMenu_C_Tick) == 0x00003C, "Wrong size on MainMenu_C_Tick");
static_assert(offsetof(MainMenu_C_Tick, MyGeometry) == 0x000000, "Member 'MainMenu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(MainMenu_C_Tick, InDeltaTime) == 0x000038, "Member 'MainMenu_C_Tick::InDeltaTime' has a wrong offset!");

// Function MainMenu.MainMenu_C.Get_SpectateGridPanel_Visibility_0
// 0x0001 (0x0001 - 0x0000)
struct MainMenu_C_Get_SpectateGridPanel_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_Get_SpectateGridPanel_Visibility_0) == 0x000001, "Wrong alignment on MainMenu_C_Get_SpectateGridPanel_Visibility_0");
static_assert(sizeof(MainMenu_C_Get_SpectateGridPanel_Visibility_0) == 0x000001, "Wrong size on MainMenu_C_Get_SpectateGridPanel_Visibility_0");
static_assert(offsetof(MainMenu_C_Get_SpectateGridPanel_Visibility_0, ReturnValue) == 0x000000, "Member 'MainMenu_C_Get_SpectateGridPanel_Visibility_0::ReturnValue' has a wrong offset!");

// Function MainMenu.MainMenu_C.GetChangelist
// 0x0030 (0x0030 - 0x0000)
struct MainMenu_C_GetChangelist final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetGameVersionString_ReturnValue;         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_GetChangelist) == 0x000008, "Wrong alignment on MainMenu_C_GetChangelist");
static_assert(sizeof(MainMenu_C_GetChangelist) == 0x000030, "Wrong size on MainMenu_C_GetChangelist");
static_assert(offsetof(MainMenu_C_GetChangelist, ReturnValue) == 0x000000, "Member 'MainMenu_C_GetChangelist::ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetChangelist, CallFunc_GetGameVersionString_ReturnValue) == 0x000010, "Member 'MainMenu_C_GetChangelist::CallFunc_GetGameVersionString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetChangelist, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'MainMenu_C_GetChangelist::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function MainMenu.MainMenu_C.StartGame
// 0x0008 (0x0008 - 0x0000)
struct MainMenu_C_StartGame final
{
public:
	class ARBMainMenuPlayerController*            CallFunc_GetLocalMainMenuPlayerController_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_StartGame) == 0x000008, "Wrong alignment on MainMenu_C_StartGame");
static_assert(sizeof(MainMenu_C_StartGame) == 0x000008, "Wrong size on MainMenu_C_StartGame");
static_assert(offsetof(MainMenu_C_StartGame, CallFunc_GetLocalMainMenuPlayerController_ReturnValue) == 0x000000, "Member 'MainMenu_C_StartGame::CallFunc_GetLocalMainMenuPlayerController_ReturnValue' has a wrong offset!");

// Function MainMenu.MainMenu_C.Get_Crossplay_Text_0
// 0x0028 (0x0028 - 0x0000)
struct MainMenu_C_Get_Crossplay_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class ARBMainMenuPlayerController*            CallFunc_GetLocalMainMenuPlayerController_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrossplayEnabled_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_C_Get_Crossplay_Text_0) == 0x000008, "Wrong alignment on MainMenu_C_Get_Crossplay_Text_0");
static_assert(sizeof(MainMenu_C_Get_Crossplay_Text_0) == 0x000028, "Wrong size on MainMenu_C_Get_Crossplay_Text_0");
static_assert(offsetof(MainMenu_C_Get_Crossplay_Text_0, ReturnValue) == 0x000000, "Member 'MainMenu_C_Get_Crossplay_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_Get_Crossplay_Text_0, CallFunc_GetLocalMainMenuPlayerController_ReturnValue) == 0x000018, "Member 'MainMenu_C_Get_Crossplay_Text_0::CallFunc_GetLocalMainMenuPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_Get_Crossplay_Text_0, CallFunc_IsCrossplayEnabled_ReturnValue) == 0x000020, "Member 'MainMenu_C_Get_Crossplay_Text_0::CallFunc_IsCrossplayEnabled_ReturnValue' has a wrong offset!");

// Function MainMenu.MainMenu_C.GetRejoinPartyButtonVisibility
// 0x0018 (0x0018 - 0x0000)
struct MainMenu_C_GetRejoinPartyButtonVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayEnabled_ReturnValue;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanRejoinParty_ReturnValue;               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_GetRejoinPartyButtonVisibility) == 0x000008, "Wrong alignment on MainMenu_C_GetRejoinPartyButtonVisibility");
static_assert(sizeof(MainMenu_C_GetRejoinPartyButtonVisibility) == 0x000018, "Wrong size on MainMenu_C_GetRejoinPartyButtonVisibility");
static_assert(offsetof(MainMenu_C_GetRejoinPartyButtonVisibility, ReturnValue) == 0x000000, "Member 'MainMenu_C_GetRejoinPartyButtonVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinPartyButtonVisibility, Temp_bool_Variable) == 0x000001, "Member 'MainMenu_C_GetRejoinPartyButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinPartyButtonVisibility, Temp_byte_Variable) == 0x000002, "Member 'MainMenu_C_GetRejoinPartyButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinPartyButtonVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'MainMenu_C_GetRejoinPartyButtonVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinPartyButtonVisibility, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000004, "Member 'MainMenu_C_GetRejoinPartyButtonVisibility::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinPartyButtonVisibility, CallFunc_GetRBGameModeMainMenu_ReturnValue) == 0x000008, "Member 'MainMenu_C_GetRejoinPartyButtonVisibility::CallFunc_GetRBGameModeMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinPartyButtonVisibility, CallFunc_HasAnyUserFocus_ReturnValue) == 0x000010, "Member 'MainMenu_C_GetRejoinPartyButtonVisibility::CallFunc_HasAnyUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinPartyButtonVisibility, CallFunc_IsPlayEnabled_ReturnValue) == 0x000011, "Member 'MainMenu_C_GetRejoinPartyButtonVisibility::CallFunc_IsPlayEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinPartyButtonVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'MainMenu_C_GetRejoinPartyButtonVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinPartyButtonVisibility, CallFunc_CanRejoinParty_ReturnValue) == 0x000013, "Member 'MainMenu_C_GetRejoinPartyButtonVisibility::CallFunc_CanRejoinParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinPartyButtonVisibility, CallFunc_BooleanAND_ReturnValue_1) == 0x000014, "Member 'MainMenu_C_GetRejoinPartyButtonVisibility::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinPartyButtonVisibility, K2Node_Select_Default) == 0x000015, "Member 'MainMenu_C_GetRejoinPartyButtonVisibility::K2Node_Select_Default' has a wrong offset!");

// Function MainMenu.MainMenu_C.GetRejoinSoloGameSessionButtonVisibility
// 0x0018 (0x0018 - 0x0000)
struct MainMenu_C_GetRejoinSoloGameSessionButtonVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayEnabled_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanRejoinParty_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanRejoinSoloGameSession_ReturnValue;     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility) == 0x000008, "Wrong alignment on MainMenu_C_GetRejoinSoloGameSessionButtonVisibility");
static_assert(sizeof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility) == 0x000018, "Wrong size on MainMenu_C_GetRejoinSoloGameSessionButtonVisibility");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, ReturnValue) == 0x000000, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, Temp_bool_Variable) == 0x000001, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, Temp_byte_Variable) == 0x000002, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000004, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, CallFunc_HasAnyUserFocus_ReturnValue) == 0x000005, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::CallFunc_HasAnyUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, CallFunc_GetRBGameModeMainMenu_ReturnValue) == 0x000008, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::CallFunc_GetRBGameModeMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, CallFunc_IsPlayEnabled_ReturnValue) == 0x000010, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::CallFunc_IsPlayEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, CallFunc_CanRejoinParty_ReturnValue) == 0x000011, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::CallFunc_CanRejoinParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, CallFunc_CanRejoinSoloGameSession_ReturnValue) == 0x000012, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::CallFunc_CanRejoinSoloGameSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000013, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, CallFunc_BooleanAND_ReturnValue_1) == 0x000014, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, CallFunc_BooleanAND_ReturnValue_2) == 0x000015, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_GetRejoinSoloGameSessionButtonVisibility, K2Node_Select_Default) == 0x000016, "Member 'MainMenu_C_GetRejoinSoloGameSessionButtonVisibility::K2Node_Select_Default' has a wrong offset!");

// Function MainMenu.MainMenu_C.Get_EnterButton_Visibility_0
// 0x0018 (0x0018 - 0x0000)
struct MainMenu_C_Get_EnterButton_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayEnabled_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_Get_EnterButton_Visibility_0) == 0x000008, "Wrong alignment on MainMenu_C_Get_EnterButton_Visibility_0");
static_assert(sizeof(MainMenu_C_Get_EnterButton_Visibility_0) == 0x000018, "Wrong size on MainMenu_C_Get_EnterButton_Visibility_0");
static_assert(offsetof(MainMenu_C_Get_EnterButton_Visibility_0, ReturnValue) == 0x000000, "Member 'MainMenu_C_Get_EnterButton_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_Get_EnterButton_Visibility_0, Temp_bool_Variable) == 0x000001, "Member 'MainMenu_C_Get_EnterButton_Visibility_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_C_Get_EnterButton_Visibility_0, Temp_byte_Variable) == 0x000002, "Member 'MainMenu_C_Get_EnterButton_Visibility_0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_C_Get_EnterButton_Visibility_0, Temp_byte_Variable_1) == 0x000003, "Member 'MainMenu_C_Get_EnterButton_Visibility_0::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MainMenu_C_Get_EnterButton_Visibility_0, CallFunc_GetRBGameModeMainMenu_ReturnValue) == 0x000008, "Member 'MainMenu_C_Get_EnterButton_Visibility_0::CallFunc_GetRBGameModeMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_Get_EnterButton_Visibility_0, CallFunc_IsPlayEnabled_ReturnValue) == 0x000010, "Member 'MainMenu_C_Get_EnterButton_Visibility_0::CallFunc_IsPlayEnabled_ReturnValue' has a wrong offset!");
