#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainObjectivesContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainObjectivesContainer.MainObjectivesContainer_C
// 0x0058 (0x0340 - 0x02E8)
class UMainObjectivesContainer_C final : public URBHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_MainObjectivesContainer;           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainObjectiveWidget_C*                 MainObjectiveWidget;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainObjectiveWidget_C*                 MainObjectiveWidget_177;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainObjectiveWidget_C*                 MainObjectiveWidget_250;                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_20;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsCurrentObjectiveVisible;                         // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPauseMenu;                                        // 0x0321(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F14[0x6];                                     // 0x0322(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARBBaseObjectiveCoordinator*>    CoordinatorsWaitingToBeAdded;                      // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          RetainObjectives;                                  // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MainObjectivesContainer(int32 EntryPoint);
	void Event_Hide();
	void Event_Show();
	void PreConstruct(bool IsDesignTime);
	void Add_Objective(class ARBBaseObjectiveCoordinator* Coordinator);
	void OnMainObjectiveVisibilityChanged(bool Param_IsVisible);
	void RefreshObjectivesTexts();
	void RegisterCoordinator(class ARBBaseObjectiveCoordinator* Coordinator);
	void AddWaitingCoordinators();

	bool ShouldShow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainObjectivesContainer_C">();
	}
	static class UMainObjectivesContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainObjectivesContainer_C>();
	}
};
static_assert(alignof(UMainObjectivesContainer_C) == 0x000008, "Wrong alignment on UMainObjectivesContainer_C");
static_assert(sizeof(UMainObjectivesContainer_C) == 0x000340, "Wrong size on UMainObjectivesContainer_C");
static_assert(offsetof(UMainObjectivesContainer_C, UberGraphFrame) == 0x0002E8, "Member 'UMainObjectivesContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainObjectivesContainer_C, Show) == 0x0002F0, "Member 'UMainObjectivesContainer_C::Show' has a wrong offset!");
static_assert(offsetof(UMainObjectivesContainer_C, InvalidationBox_MainObjectivesContainer) == 0x0002F8, "Member 'UMainObjectivesContainer_C::InvalidationBox_MainObjectivesContainer' has a wrong offset!");
static_assert(offsetof(UMainObjectivesContainer_C, MainObjectiveWidget) == 0x000300, "Member 'UMainObjectivesContainer_C::MainObjectiveWidget' has a wrong offset!");
static_assert(offsetof(UMainObjectivesContainer_C, MainObjectiveWidget_177) == 0x000308, "Member 'UMainObjectivesContainer_C::MainObjectiveWidget_177' has a wrong offset!");
static_assert(offsetof(UMainObjectivesContainer_C, MainObjectiveWidget_250) == 0x000310, "Member 'UMainObjectivesContainer_C::MainObjectiveWidget_250' has a wrong offset!");
static_assert(offsetof(UMainObjectivesContainer_C, VerticalBox_20) == 0x000318, "Member 'UMainObjectivesContainer_C::VerticalBox_20' has a wrong offset!");
static_assert(offsetof(UMainObjectivesContainer_C, IsCurrentObjectiveVisible) == 0x000320, "Member 'UMainObjectivesContainer_C::IsCurrentObjectiveVisible' has a wrong offset!");
static_assert(offsetof(UMainObjectivesContainer_C, bPauseMenu) == 0x000321, "Member 'UMainObjectivesContainer_C::bPauseMenu' has a wrong offset!");
static_assert(offsetof(UMainObjectivesContainer_C, CoordinatorsWaitingToBeAdded) == 0x000328, "Member 'UMainObjectivesContainer_C::CoordinatorsWaitingToBeAdded' has a wrong offset!");
static_assert(offsetof(UMainObjectivesContainer_C, RetainObjectives) == 0x000338, "Member 'UMainObjectivesContainer_C::RetainObjectives' has a wrong offset!");

}

