#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchSettingsInterface_02_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MatchSettingsInterface_02_BP.MatchSettingsInterface_02_BP_C
// 0x0040 (0x0300 - 0x02C0)
class AMatchSettingsInterface_02_BP_C final : public ARBCustomSpecialMoveInteractableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ComputerMinus01;                                   // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBObjectiveActorComponent*             RBObjectiveActor;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTrialEvaluationInfo                   LastTrialEvaluationInfo;                           // 0x02E0(0x001C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Event_OnLocalPlayerInteracted();
	void OnPawnPlaySpecialMoveAnimation(const class ARBPawn* Pawn, ESpecialMove SpecialMove);
	void OnMenuExit();
	void ExecuteUbergraph_MatchSettingsInterface_02_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MatchSettingsInterface_02_BP_C">();
	}
	static class AMatchSettingsInterface_02_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMatchSettingsInterface_02_BP_C>();
	}
};
static_assert(alignof(AMatchSettingsInterface_02_BP_C) == 0x000008, "Wrong alignment on AMatchSettingsInterface_02_BP_C");
static_assert(sizeof(AMatchSettingsInterface_02_BP_C) == 0x000300, "Wrong size on AMatchSettingsInterface_02_BP_C");
static_assert(offsetof(AMatchSettingsInterface_02_BP_C, UberGraphFrame) == 0x0002C0, "Member 'AMatchSettingsInterface_02_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMatchSettingsInterface_02_BP_C, PointLight) == 0x0002C8, "Member 'AMatchSettingsInterface_02_BP_C::PointLight' has a wrong offset!");
static_assert(offsetof(AMatchSettingsInterface_02_BP_C, ComputerMinus01) == 0x0002D0, "Member 'AMatchSettingsInterface_02_BP_C::ComputerMinus01' has a wrong offset!");
static_assert(offsetof(AMatchSettingsInterface_02_BP_C, RBObjectiveActor) == 0x0002D8, "Member 'AMatchSettingsInterface_02_BP_C::RBObjectiveActor' has a wrong offset!");
static_assert(offsetof(AMatchSettingsInterface_02_BP_C, LastTrialEvaluationInfo) == 0x0002E0, "Member 'AMatchSettingsInterface_02_BP_C::LastTrialEvaluationInfo' has a wrong offset!");

}

