#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchAcceptanceNotificationWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MatchAcceptanceNotificationWidget.MatchAcceptanceNotificationWidget_C.ExecuteUbergraph_MatchAcceptanceNotificationWidget
// 0x00B8 (0x00B8 - 0x0000)
struct MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPartyMemberCount_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0058(0x0018)()
	float                                         K2Node_Event_displayTime;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_totalDisplayTime;                     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget) == 0x000008, "Wrong alignment on MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget");
static_assert(sizeof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget) == 0x0000B8, "Wrong size on MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget, EntryPoint) == 0x000000, "Member 'MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget, CallFunc_GetPartyMemberCount_ReturnValue) == 0x000004, "Member 'MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget::CallFunc_GetPartyMemberCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget, K2Node_MakeArray_Array) == 0x000048, "Member 'MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget, CallFunc_Format_ReturnValue) == 0x000058, "Member 'MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget, K2Node_Event_displayTime) == 0x000070, "Member 'MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget::K2Node_Event_displayTime' has a wrong offset!");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget, K2Node_Event_totalDisplayTime) == 0x000074, "Member 'MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget::K2Node_Event_totalDisplayTime' has a wrong offset!");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000078, "Member 'MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000080, "Member 'MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000088, "Member 'MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000090, "Member 'MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000098, "Member 'MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget, K2Node_CreateDelegate_OutputDelegate) == 0x0000A4, "Member 'MatchAcceptanceNotificationWidget_C_ExecuteUbergraph_MatchAcceptanceNotificationWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function MatchAcceptanceNotificationWidget.MatchAcceptanceNotificationWidget_C.Event_UpdateDisplayTime
// 0x0008 (0x0008 - 0x0000)
struct MatchAcceptanceNotificationWidget_C_Event_UpdateDisplayTime final
{
public:
	float                                         DisplayTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDisplayTime_0;                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MatchAcceptanceNotificationWidget_C_Event_UpdateDisplayTime) == 0x000004, "Wrong alignment on MatchAcceptanceNotificationWidget_C_Event_UpdateDisplayTime");
static_assert(sizeof(MatchAcceptanceNotificationWidget_C_Event_UpdateDisplayTime) == 0x000008, "Wrong size on MatchAcceptanceNotificationWidget_C_Event_UpdateDisplayTime");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_Event_UpdateDisplayTime, DisplayTime) == 0x000000, "Member 'MatchAcceptanceNotificationWidget_C_Event_UpdateDisplayTime::DisplayTime' has a wrong offset!");
static_assert(offsetof(MatchAcceptanceNotificationWidget_C_Event_UpdateDisplayTime, TotalDisplayTime_0) == 0x000004, "Member 'MatchAcceptanceNotificationWidget_C_Event_UpdateDisplayTime::TotalDisplayTime_0' has a wrong offset!");

}

