#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MatchAcceptanceNotificationWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MatchAcceptanceNotificationWidget.MatchAcceptanceNotificationWidget_C
// 0x0028 (0x0318 - 0x02F0)
class UMatchAcceptanceNotificationWidget_C final : public URBMatchAcceptanceNotificationUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonNotificationWidget_C*            CommonNotificationWidget;                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalTime;                                         // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MatchAcceptanceNotificationWidget(int32 EntryPoint);
	void Event_Blocked();
	void Event_Refused();
	void Event_Accepted();
	void Event_Hide();
	void Event_UpdateDisplayTime(float DisplayTime, float Param_TotalDisplayTime);
	void Event_Show();
	void Finished_B968D2F4453AEAEB172D068B95ABDC98();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MatchAcceptanceNotificationWidget_C">();
	}
	static class UMatchAcceptanceNotificationWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMatchAcceptanceNotificationWidget_C>();
	}
};
static_assert(alignof(UMatchAcceptanceNotificationWidget_C) == 0x000008, "Wrong alignment on UMatchAcceptanceNotificationWidget_C");
static_assert(sizeof(UMatchAcceptanceNotificationWidget_C) == 0x000318, "Wrong size on UMatchAcceptanceNotificationWidget_C");
static_assert(offsetof(UMatchAcceptanceNotificationWidget_C, UberGraphFrame) == 0x0002F0, "Member 'UMatchAcceptanceNotificationWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMatchAcceptanceNotificationWidget_C, HideAnim) == 0x0002F8, "Member 'UMatchAcceptanceNotificationWidget_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UMatchAcceptanceNotificationWidget_C, ShowAnim) == 0x000300, "Member 'UMatchAcceptanceNotificationWidget_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UMatchAcceptanceNotificationWidget_C, CommonNotificationWidget) == 0x000308, "Member 'UMatchAcceptanceNotificationWidget_C::CommonNotificationWidget' has a wrong offset!");
static_assert(offsetof(UMatchAcceptanceNotificationWidget_C, CurrentTime) == 0x000310, "Member 'UMatchAcceptanceNotificationWidget_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(UMatchAcceptanceNotificationWidget_C, TotalTime) == 0x000314, "Member 'UMatchAcceptanceNotificationWidget_C::TotalTime' has a wrong offset!");

}

