#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MedPharma_SkillController_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MedPharma_SkillController_BP.MedPharma_SkillController_BP_C
// 0x0020 (0x0A40 - 0x0A20)
class AMedPharma_SkillController_BP_C final : public ARBActiveSkillController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Ngr_SkillDeactivate;                               // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Ptc_Thrust;                                        // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MedPharma_SkillController_BP(int32 EntryPoint);
	void On_Skill_Deactivate_FX(bool IsInZone);
	void Event_OnItemHeldInHandChanged(bool bHeldInHand);
	void UpdateParticleEmitter(bool IsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MedPharma_SkillController_BP_C">();
	}
	static class AMedPharma_SkillController_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMedPharma_SkillController_BP_C>();
	}
};
static_assert(alignof(AMedPharma_SkillController_BP_C) == 0x000010, "Wrong alignment on AMedPharma_SkillController_BP_C");
static_assert(sizeof(AMedPharma_SkillController_BP_C) == 0x000A40, "Wrong size on AMedPharma_SkillController_BP_C");
static_assert(offsetof(AMedPharma_SkillController_BP_C, UberGraphFrame) == 0x000A20, "Member 'AMedPharma_SkillController_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMedPharma_SkillController_BP_C, Ngr_SkillDeactivate) == 0x000A28, "Member 'AMedPharma_SkillController_BP_C::Ngr_SkillDeactivate' has a wrong offset!");
static_assert(offsetof(AMedPharma_SkillController_BP_C, Ptc_Thrust) == 0x000A30, "Member 'AMedPharma_SkillController_BP_C::Ptc_Thrust' has a wrong offset!");

}

