#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuCharacter

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MenuCharacter.MenuCharacter_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct MenuCharacter_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on MenuCharacter_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(MenuCharacter_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on MenuCharacter_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(MenuCharacter_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'MenuCharacter_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.CycleCameras
// 0x0078 (0x0078 - 0x0000)
struct MenuCharacter_C_CycleCameras final
{
public:
	ECustomizationMenuCategory                    Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A47[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizationCategoryCameras          CallFunc_Map_Find_Value;                           // 0x0008(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A48[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A49[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBController*                          CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCustomizationCategoryCameras          CallFunc_Map_Find_Value_1;                         // 0x0030(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A4A[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A4B[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4C[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuCharacter_AnimBP_C*                K2Node_DynamicCast_AsMenu_Character_Anim_BP;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_CycleCameras) == 0x000008, "Wrong alignment on MenuCharacter_C_CycleCameras");
static_assert(sizeof(MenuCharacter_C_CycleCameras) == 0x000078, "Wrong size on MenuCharacter_C_CycleCameras");
static_assert(offsetof(MenuCharacter_C_CycleCameras, Selection) == 0x000000, "Member 'MenuCharacter_C_CycleCameras::Selection' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Map_Find_Value) == 0x000008, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000020, "Member 'MenuCharacter_C_CycleCameras::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000028, "Member 'MenuCharacter_C_CycleCameras::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Map_Find_Value_1) == 0x000030, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Map_Find_ReturnValue_1) == 0x000040, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Array_Get_Item) == 0x000048, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_IsValid_ReturnValue) == 0x000054, "Member 'MenuCharacter_C_CycleCameras::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Percent_IntInt_ReturnValue) == 0x000058, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_GetAnimInstance_ReturnValue) == 0x000060, "Member 'MenuCharacter_C_CycleCameras::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, K2Node_DynamicCast_AsMenu_Character_Anim_BP) == 0x000068, "Member 'MenuCharacter_C_CycleCameras::K2Node_DynamicCast_AsMenu_Character_Anim_BP' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'MenuCharacter_C_CycleCameras::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.GetFacePoseAsset
// 0x0008 (0x0008 - 0x0000)
struct MenuCharacter_C_GetFacePoseAsset final
{
public:
	class UPoseAsset*                             Param_FacePoseAsset;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_C_GetFacePoseAsset) == 0x000008, "Wrong alignment on MenuCharacter_C_GetFacePoseAsset");
static_assert(sizeof(MenuCharacter_C_GetFacePoseAsset) == 0x000008, "Wrong size on MenuCharacter_C_GetFacePoseAsset");
static_assert(offsetof(MenuCharacter_C_GetFacePoseAsset, Param_FacePoseAsset) == 0x000000, "Member 'MenuCharacter_C_GetFacePoseAsset::Param_FacePoseAsset' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.ResetPlacementAndAnim
// 0x00A0 (0x00A0 - 0x0000)
struct MenuCharacter_C_ResetPlacementAndAnim final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0008(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMenuCharacter_AnimBP_C*                K2Node_DynamicCast_AsMenu_Character_Anim_BP;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_ResetPlacementAndAnim) == 0x000008, "Wrong alignment on MenuCharacter_C_ResetPlacementAndAnim");
static_assert(sizeof(MenuCharacter_C_ResetPlacementAndAnim) == 0x0000A0, "Wrong size on MenuCharacter_C_ResetPlacementAndAnim");
static_assert(offsetof(MenuCharacter_C_ResetPlacementAndAnim, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'MenuCharacter_C_ResetPlacementAndAnim::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ResetPlacementAndAnim, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000008, "Member 'MenuCharacter_C_ResetPlacementAndAnim::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ResetPlacementAndAnim, K2Node_DynamicCast_AsMenu_Character_Anim_BP) == 0x000090, "Member 'MenuCharacter_C_ResetPlacementAndAnim::K2Node_DynamicCast_AsMenu_Character_Anim_BP' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ResetPlacementAndAnim, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'MenuCharacter_C_ResetPlacementAndAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.HasCustomizationChanged
// 0x0068 (0x0068 - 0x0000)
struct MenuCharacter_C_HasCustomizationChanged final
{
public:
	struct FRBPlayerCustomizationInfo             RBPlayerCustomizationInfo;                         // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bHasChanged;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A4D[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4E[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerCustomizationOption*           CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A4F[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A50[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_HasCustomizationChanged) == 0x000008, "Wrong alignment on MenuCharacter_C_HasCustomizationChanged");
static_assert(sizeof(MenuCharacter_C_HasCustomizationChanged) == 0x000068, "Wrong size on MenuCharacter_C_HasCustomizationChanged");
static_assert(offsetof(MenuCharacter_C_HasCustomizationChanged, RBPlayerCustomizationInfo) == 0x000000, "Member 'MenuCharacter_C_HasCustomizationChanged::RBPlayerCustomizationInfo' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_HasCustomizationChanged, bHasChanged) == 0x000038, "Member 'MenuCharacter_C_HasCustomizationChanged::bHasChanged' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_HasCustomizationChanged, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'MenuCharacter_C_HasCustomizationChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_HasCustomizationChanged, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'MenuCharacter_C_HasCustomizationChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_HasCustomizationChanged, CallFunc_Array_Get_Item) == 0x000048, "Member 'MenuCharacter_C_HasCustomizationChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_HasCustomizationChanged, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'MenuCharacter_C_HasCustomizationChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_HasCustomizationChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000051, "Member 'MenuCharacter_C_HasCustomizationChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_HasCustomizationChanged, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'MenuCharacter_C_HasCustomizationChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_HasCustomizationChanged, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'MenuCharacter_C_HasCustomizationChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_HasCustomizationChanged, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'MenuCharacter_C_HasCustomizationChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_HasCustomizationChanged, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000060, "Member 'MenuCharacter_C_HasCustomizationChanged::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_HasCustomizationChanged, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000061, "Member 'MenuCharacter_C_HasCustomizationChanged::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_HasCustomizationChanged, CallFunc_IsValid_ReturnValue_1) == 0x000062, "Member 'MenuCharacter_C_HasCustomizationChanged::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_HasCustomizationChanged, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x000063, "Member 'MenuCharacter_C_HasCustomizationChanged::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.SetHairColor
// 0x000C (0x000C - 0x0000)
struct MenuCharacter_C_SetHairColor final
{
public:
	class FName                                   NewHairColor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_SetHairColor) == 0x000004, "Wrong alignment on MenuCharacter_C_SetHairColor");
static_assert(sizeof(MenuCharacter_C_SetHairColor) == 0x00000C, "Wrong size on MenuCharacter_C_SetHairColor");
static_assert(offsetof(MenuCharacter_C_SetHairColor, NewHairColor) == 0x000000, "Member 'MenuCharacter_C_SetHairColor::NewHairColor' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetHairColor, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'MenuCharacter_C_SetHairColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.CycleDebugPose
// 0x0010 (0x0010 - 0x0000)
struct MenuCharacter_C_CycleDebugPose final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_CycleDebugPose) == 0x000004, "Wrong alignment on MenuCharacter_C_CycleDebugPose");
static_assert(sizeof(MenuCharacter_C_CycleDebugPose) == 0x000010, "Wrong size on MenuCharacter_C_CycleDebugPose");
static_assert(offsetof(MenuCharacter_C_CycleDebugPose, Temp_int_Variable) == 0x000000, "Member 'MenuCharacter_C_CycleDebugPose::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleDebugPose, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'MenuCharacter_C_CycleDebugPose::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleDebugPose, CallFunc_Add_IntInt_ReturnValue_1) == 0x000008, "Member 'MenuCharacter_C_CycleDebugPose::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleDebugPose, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'MenuCharacter_C_CycleDebugPose::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleDebugPose, K2Node_SwitchInteger_CmpSuccess) == 0x00000D, "Member 'MenuCharacter_C_CycleDebugPose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.SetCharacterHidden
// 0x0068 (0x0068 - 0x0000)
struct MenuCharacter_C_SetCharacterHidden final
{
public:
	bool                                          Hidden;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A51[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A52[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A53[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A54[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_SetCharacterHidden) == 0x000008, "Wrong alignment on MenuCharacter_C_SetCharacterHidden");
static_assert(sizeof(MenuCharacter_C_SetCharacterHidden) == 0x000068, "Wrong size on MenuCharacter_C_SetCharacterHidden");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, Hidden) == 0x000000, "Member 'MenuCharacter_C_SetCharacterHidden::Hidden' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'MenuCharacter_C_SetCharacterHidden::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'MenuCharacter_C_SetCharacterHidden::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'MenuCharacter_C_SetCharacterHidden::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'MenuCharacter_C_SetCharacterHidden::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'MenuCharacter_C_SetCharacterHidden::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'MenuCharacter_C_SetCharacterHidden::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'MenuCharacter_C_SetCharacterHidden::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, CallFunc_Array_Get_Item) == 0x000028, "Member 'MenuCharacter_C_SetCharacterHidden::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'MenuCharacter_C_SetCharacterHidden::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'MenuCharacter_C_SetCharacterHidden::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'MenuCharacter_C_SetCharacterHidden::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000040, "Member 'MenuCharacter_C_SetCharacterHidden::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'MenuCharacter_C_SetCharacterHidden::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'MenuCharacter_C_SetCharacterHidden::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCharacterHidden, CallFunc_Less_IntInt_ReturnValue_1) == 0x000060, "Member 'MenuCharacter_C_SetCharacterHidden::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.SetDebugMode
// 0x0001 (0x0001 - 0x0000)
struct MenuCharacter_C_SetDebugMode final
{
public:
	bool                                          Param_Debug;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_SetDebugMode) == 0x000001, "Wrong alignment on MenuCharacter_C_SetDebugMode");
static_assert(sizeof(MenuCharacter_C_SetDebugMode) == 0x000001, "Wrong size on MenuCharacter_C_SetDebugMode");
static_assert(offsetof(MenuCharacter_C_SetDebugMode, Param_Debug) == 0x000000, "Member 'MenuCharacter_C_SetDebugMode::Param_Debug' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.SetLightsActivation
// 0x0038 (0x0038 - 0x0000)
struct MenuCharacter_C_SetLightsActivation final
{
public:
	bool                                          bAffectWorld;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A55[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULightComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A56[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_SetLightsActivation) == 0x000008, "Wrong alignment on MenuCharacter_C_SetLightsActivation");
static_assert(sizeof(MenuCharacter_C_SetLightsActivation) == 0x000038, "Wrong size on MenuCharacter_C_SetLightsActivation");
static_assert(offsetof(MenuCharacter_C_SetLightsActivation, bAffectWorld) == 0x000000, "Member 'MenuCharacter_C_SetLightsActivation::bAffectWorld' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightsActivation, Temp_int_Array_Index_Variable) == 0x000004, "Member 'MenuCharacter_C_SetLightsActivation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightsActivation, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'MenuCharacter_C_SetLightsActivation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightsActivation, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'MenuCharacter_C_SetLightsActivation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightsActivation, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'MenuCharacter_C_SetLightsActivation::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightsActivation, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'MenuCharacter_C_SetLightsActivation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightsActivation, CallFunc_Array_Get_Item) == 0x000028, "Member 'MenuCharacter_C_SetLightsActivation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightsActivation, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'MenuCharacter_C_SetLightsActivation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.GetCameras
// 0x0190 (0x0190 - 0x0000)
struct MenuCharacter_C_GetCameras final
{
public:
	class FName                                   Temp_name_Variable;                                // 0x0000(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A57[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACameraActor*>                   K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	struct FCustomizationCategoryCameras          K2Node_MakeStruct_CustomizationCategoryCameras;    // 0x0040(0x0010)()
	TArray<class ACameraActor*>                   K2Node_MakeArray_Array_1;                          // 0x0050(0x0010)(ReferenceParm)
	struct FCustomizationCategoryCameras          K2Node_MakeStruct_CustomizationCategoryCameras_1;  // 0x0060(0x0010)()
	struct FCustomizationCategoryCameras          K2Node_MakeStruct_CustomizationCategoryCameras_2;  // 0x0070(0x0010)()
	TArray<class ACameraActor*>                   K2Node_MakeArray_Array_2;                          // 0x0080(0x0010)(ReferenceParm)
	struct FCustomizationCategoryCameras          K2Node_MakeStruct_CustomizationCategoryCameras_3;  // 0x0090(0x0010)()
	TArray<class ACameraActor*>                   K2Node_MakeArray_Array_3;                          // 0x00A0(0x0010)(ReferenceParm)
	TArray<class ACameraActor*>                   K2Node_MakeArray_Array_4;                          // 0x00B0(0x0010)(ReferenceParm)
	struct FCustomizationCategoryCameras          K2Node_MakeStruct_CustomizationCategoryCameras_4;  // 0x00C0(0x0010)()
	struct FCustomizationCategoryCameras          K2Node_MakeStruct_CustomizationCategoryCameras_5;  // 0x00D0(0x0010)()
	struct FCustomizationCategoryCameras          K2Node_MakeStruct_CustomizationCategoryCameras_6;  // 0x00E0(0x0010)()
	struct FCustomizationCategoryCameras          K2Node_MakeStruct_CustomizationCategoryCameras_7;  // 0x00F0(0x0010)()
	struct FCustomizationCategoryCameras          K2Node_MakeStruct_CustomizationCategoryCameras_8;  // 0x0100(0x0010)()
	TMap<ECustomizationMenuCategory, struct FCustomizationCategoryCameras> K2Node_MakeMap_Map;                                // 0x0110(0x0050)()
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0160(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A58[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           K2Node_DynamicCast_AsCamera_Actor;                 // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_3;             // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_GetCameras) == 0x000008, "Wrong alignment on MenuCharacter_C_GetCameras");
static_assert(sizeof(MenuCharacter_C_GetCameras) == 0x000190, "Wrong size on MenuCharacter_C_GetCameras");
static_assert(offsetof(MenuCharacter_C_GetCameras, Temp_name_Variable) == 0x000000, "Member 'MenuCharacter_C_GetCameras::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, Temp_name_Variable_1) == 0x000008, "Member 'MenuCharacter_C_GetCameras::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, Temp_name_Variable_2) == 0x000010, "Member 'MenuCharacter_C_GetCameras::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, Temp_name_Variable_3) == 0x000018, "Member 'MenuCharacter_C_GetCameras::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, Temp_int_Array_Index_Variable) == 0x000020, "Member 'MenuCharacter_C_GetCameras::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'MenuCharacter_C_GetCameras::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'MenuCharacter_C_GetCameras::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeArray_Array) == 0x000030, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeStruct_CustomizationCategoryCameras) == 0x000040, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeStruct_CustomizationCategoryCameras' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeArray_Array_1) == 0x000050, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeStruct_CustomizationCategoryCameras_1) == 0x000060, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeStruct_CustomizationCategoryCameras_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeStruct_CustomizationCategoryCameras_2) == 0x000070, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeStruct_CustomizationCategoryCameras_2' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeArray_Array_2) == 0x000080, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeStruct_CustomizationCategoryCameras_3) == 0x000090, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeStruct_CustomizationCategoryCameras_3' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeArray_Array_3) == 0x0000A0, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeArray_Array_4) == 0x0000B0, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeStruct_CustomizationCategoryCameras_4) == 0x0000C0, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeStruct_CustomizationCategoryCameras_4' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeStruct_CustomizationCategoryCameras_5) == 0x0000D0, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeStruct_CustomizationCategoryCameras_5' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeStruct_CustomizationCategoryCameras_6) == 0x0000E0, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeStruct_CustomizationCategoryCameras_6' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeStruct_CustomizationCategoryCameras_7) == 0x0000F0, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeStruct_CustomizationCategoryCameras_7' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeStruct_CustomizationCategoryCameras_8) == 0x000100, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeStruct_CustomizationCategoryCameras_8' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_MakeMap_Map) == 0x000110, "Member 'MenuCharacter_C_GetCameras::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000160, "Member 'MenuCharacter_C_GetCameras::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, CallFunc_Array_Get_Item) == 0x000170, "Member 'MenuCharacter_C_GetCameras::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, CallFunc_Array_Length_ReturnValue) == 0x000178, "Member 'MenuCharacter_C_GetCameras::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_DynamicCast_AsCamera_Actor) == 0x000180, "Member 'MenuCharacter_C_GetCameras::K2Node_DynamicCast_AsCamera_Actor' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'MenuCharacter_C_GetCameras::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, CallFunc_Less_IntInt_ReturnValue) == 0x000189, "Member 'MenuCharacter_C_GetCameras::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, CallFunc_Array_Contains_ReturnValue) == 0x00018A, "Member 'MenuCharacter_C_GetCameras::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, CallFunc_Array_Contains_ReturnValue_1) == 0x00018B, "Member 'MenuCharacter_C_GetCameras::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, CallFunc_Array_Contains_ReturnValue_2) == 0x00018C, "Member 'MenuCharacter_C_GetCameras::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_GetCameras, CallFunc_Array_Contains_ReturnValue_3) == 0x00018D, "Member 'MenuCharacter_C_GetCameras::CallFunc_Array_Contains_ReturnValue_3' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.DeactivateViewer
// 0x0018 (0x0018 - 0x0000)
struct MenuCharacter_C_DeactivateViewer final
{
public:
	class URBFXManager*                           CallFunc_GetFXManager_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBController*                          CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_DeactivateViewer) == 0x000008, "Wrong alignment on MenuCharacter_C_DeactivateViewer");
static_assert(sizeof(MenuCharacter_C_DeactivateViewer) == 0x000018, "Wrong size on MenuCharacter_C_DeactivateViewer");
static_assert(offsetof(MenuCharacter_C_DeactivateViewer, CallFunc_GetFXManager_ReturnValue) == 0x000000, "Member 'MenuCharacter_C_DeactivateViewer::CallFunc_GetFXManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_DeactivateViewer, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000008, "Member 'MenuCharacter_C_DeactivateViewer::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_DeactivateViewer, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'MenuCharacter_C_DeactivateViewer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.ActivateViewer
// 0x0018 (0x0018 - 0x0000)
struct MenuCharacter_C_ActivateViewer final
{
public:
	class AActor*                                 CustomReturnViewTarget;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBFXManager*                           CallFunc_GetFXManager_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBController*                          CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_C_ActivateViewer) == 0x000008, "Wrong alignment on MenuCharacter_C_ActivateViewer");
static_assert(sizeof(MenuCharacter_C_ActivateViewer) == 0x000018, "Wrong size on MenuCharacter_C_ActivateViewer");
static_assert(offsetof(MenuCharacter_C_ActivateViewer, CustomReturnViewTarget) == 0x000000, "Member 'MenuCharacter_C_ActivateViewer::CustomReturnViewTarget' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ActivateViewer, CallFunc_GetFXManager_ReturnValue) == 0x000008, "Member 'MenuCharacter_C_ActivateViewer::CallFunc_GetFXManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ActivateViewer, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000010, "Member 'MenuCharacter_C_ActivateViewer::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.SetLightingChannels
// 0x0068 (0x0068 - 0x0000)
struct MenuCharacter_C_SetLightingChannels final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A59[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A5A[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5B[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5C[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_SetLightingChannels) == 0x000008, "Wrong alignment on MenuCharacter_C_SetLightingChannels");
static_assert(sizeof(MenuCharacter_C_SetLightingChannels) == 0x000068, "Wrong size on MenuCharacter_C_SetLightingChannels");
static_assert(offsetof(MenuCharacter_C_SetLightingChannels, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'MenuCharacter_C_SetLightingChannels::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightingChannels, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'MenuCharacter_C_SetLightingChannels::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightingChannels, Temp_int_Array_Index_Variable) == 0x000008, "Member 'MenuCharacter_C_SetLightingChannels::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightingChannels, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'MenuCharacter_C_SetLightingChannels::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightingChannels, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'MenuCharacter_C_SetLightingChannels::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightingChannels, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'MenuCharacter_C_SetLightingChannels::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightingChannels, CallFunc_Array_Get_Item) == 0x000028, "Member 'MenuCharacter_C_SetLightingChannels::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightingChannels, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'MenuCharacter_C_SetLightingChannels::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightingChannels, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'MenuCharacter_C_SetLightingChannels::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightingChannels, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'MenuCharacter_C_SetLightingChannels::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightingChannels, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000040, "Member 'MenuCharacter_C_SetLightingChannels::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightingChannels, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'MenuCharacter_C_SetLightingChannels::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightingChannels, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'MenuCharacter_C_SetLightingChannels::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetLightingChannels, CallFunc_Less_IntInt_ReturnValue_1) == 0x000060, "Member 'MenuCharacter_C_SetLightingChannels::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.SetCustomization
// 0x0068 (0x0068 - 0x0000)
struct MenuCharacter_C_SetCustomization final
{
public:
	struct FRBPlayerCustomizationInfo             CustomizationInfo;                                 // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_HasCustomizationChanged_bHasChanged;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A5D[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A5E[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBPlayerCustomizationOption*           CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A5F[0x1];                                     // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A60[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_SetCustomization) == 0x000008, "Wrong alignment on MenuCharacter_C_SetCustomization");
static_assert(sizeof(MenuCharacter_C_SetCustomization) == 0x000068, "Wrong size on MenuCharacter_C_SetCustomization");
static_assert(offsetof(MenuCharacter_C_SetCustomization, CustomizationInfo) == 0x000000, "Member 'MenuCharacter_C_SetCustomization::CustomizationInfo' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCustomization, CallFunc_HasCustomizationChanged_bHasChanged) == 0x000038, "Member 'MenuCharacter_C_SetCustomization::CallFunc_HasCustomizationChanged_bHasChanged' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCustomization, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'MenuCharacter_C_SetCustomization::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCustomization, Temp_bool_True_if_break_was_hit_Variable) == 0x000040, "Member 'MenuCharacter_C_SetCustomization::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCustomization, Temp_int_Array_Index_Variable) == 0x000044, "Member 'MenuCharacter_C_SetCustomization::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCustomization, CallFunc_Array_Get_Item) == 0x000048, "Member 'MenuCharacter_C_SetCustomization::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCustomization, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'MenuCharacter_C_SetCustomization::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCustomization, CallFunc_Not_PreBool_ReturnValue) == 0x000051, "Member 'MenuCharacter_C_SetCustomization::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCustomization, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000052, "Member 'MenuCharacter_C_SetCustomization::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCustomization, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'MenuCharacter_C_SetCustomization::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCustomization, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'MenuCharacter_C_SetCustomization::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_SetCustomization, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'MenuCharacter_C_SetCustomization::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
