#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuFocusActionButtonContainer

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function MenuFocusActionButtonContainer.MenuFocusActionButtonContainer_C.ExecuteUbergraph_MenuFocusActionButtonContainer
// 0x00A0 (0x00A0 - 0x0000)
struct MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD1[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWidget* Source)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD2[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_CustomEvent_source_1;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_action;                         // 0x0048(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_text;                           // 0x0050(0x0018)(ConstParm)
	class UWidget*                                K2Node_CustomEvent_source;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD3[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UWidget* Source, class FName& Action, class FText& Text)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer) == 0x000008, "Wrong alignment on MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer");
static_assert(sizeof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer) == 0x0000A0, "Wrong size on MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer");
static_assert(offsetof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer, EntryPoint) == 0x000000, "Member 'MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer, CallFunc_Create_ReturnValue) == 0x000008, "Member 'MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer, CallFunc_GetMenuManager_ReturnValue) == 0x000030, "Member 'MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer, K2Node_CustomEvent_source_1) == 0x000040, "Member 'MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer::K2Node_CustomEvent_source_1' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer, K2Node_CustomEvent_action) == 0x000048, "Member 'MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer::K2Node_CustomEvent_action' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer, K2Node_CustomEvent_text) == 0x000050, "Member 'MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer::K2Node_CustomEvent_text' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer, K2Node_CustomEvent_source) == 0x000068, "Member 'MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer::K2Node_CustomEvent_source' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000070, "Member 'MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer, CallFunc_Conv_NameToString_ReturnValue) == 0x000078, "Member 'MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer, CallFunc_AddChild_ReturnValue) == 0x000098, "Member 'MenuFocusActionButtonContainer_C_ExecuteUbergraph_MenuFocusActionButtonContainer::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function MenuFocusActionButtonContainer.MenuFocusActionButtonContainer_C.OnMenuFocusActionCleared
// 0x0008 (0x0008 - 0x0000)
struct MenuFocusActionButtonContainer_C_OnMenuFocusActionCleared final
{
public:
	class UWidget*                                Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuFocusActionButtonContainer_C_OnMenuFocusActionCleared) == 0x000008, "Wrong alignment on MenuFocusActionButtonContainer_C_OnMenuFocusActionCleared");
static_assert(sizeof(MenuFocusActionButtonContainer_C_OnMenuFocusActionCleared) == 0x000008, "Wrong size on MenuFocusActionButtonContainer_C_OnMenuFocusActionCleared");
static_assert(offsetof(MenuFocusActionButtonContainer_C_OnMenuFocusActionCleared, Source) == 0x000000, "Member 'MenuFocusActionButtonContainer_C_OnMenuFocusActionCleared::Source' has a wrong offset!");

// Function MenuFocusActionButtonContainer.MenuFocusActionButtonContainer_C.OnMenuFocusActionSet
// 0x0028 (0x0028 - 0x0000)
struct MenuFocusActionButtonContainer_C_OnMenuFocusActionSet final
{
public:
	class UWidget*                                Source;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Action;                                            // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MenuFocusActionButtonContainer_C_OnMenuFocusActionSet) == 0x000008, "Wrong alignment on MenuFocusActionButtonContainer_C_OnMenuFocusActionSet");
static_assert(sizeof(MenuFocusActionButtonContainer_C_OnMenuFocusActionSet) == 0x000028, "Wrong size on MenuFocusActionButtonContainer_C_OnMenuFocusActionSet");
static_assert(offsetof(MenuFocusActionButtonContainer_C_OnMenuFocusActionSet, Source) == 0x000000, "Member 'MenuFocusActionButtonContainer_C_OnMenuFocusActionSet::Source' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_OnMenuFocusActionSet, Action) == 0x000008, "Member 'MenuFocusActionButtonContainer_C_OnMenuFocusActionSet::Action' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_OnMenuFocusActionSet, Text) == 0x000010, "Member 'MenuFocusActionButtonContainer_C_OnMenuFocusActionSet::Text' has a wrong offset!");

// Function MenuFocusActionButtonContainer.MenuFocusActionButtonContainer_C.UpdateVisibility
// 0x0018 (0x0018 - 0x0000)
struct MenuFocusActionButtonContainer_C_UpdateVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD4[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuFocusActionButtonContainer_C_UpdateVisibility) == 0x000008, "Wrong alignment on MenuFocusActionButtonContainer_C_UpdateVisibility");
static_assert(sizeof(MenuFocusActionButtonContainer_C_UpdateVisibility) == 0x000018, "Wrong size on MenuFocusActionButtonContainer_C_UpdateVisibility");
static_assert(offsetof(MenuFocusActionButtonContainer_C_UpdateVisibility, Temp_bool_Variable) == 0x000000, "Member 'MenuFocusActionButtonContainer_C_UpdateVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_UpdateVisibility, Temp_byte_Variable) == 0x000001, "Member 'MenuFocusActionButtonContainer_C_UpdateVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_UpdateVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'MenuFocusActionButtonContainer_C_UpdateVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_UpdateVisibility, CallFunc_GetMenuManager_ReturnValue) == 0x000008, "Member 'MenuFocusActionButtonContainer_C_UpdateVisibility::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_UpdateVisibility, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000010, "Member 'MenuFocusActionButtonContainer_C_UpdateVisibility::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuFocusActionButtonContainer_C_UpdateVisibility, K2Node_Select_Default) == 0x000011, "Member 'MenuFocusActionButtonContainer_C_UpdateVisibility::K2Node_Select_Default' has a wrong offset!");

}

