#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuCharacter_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MenuCharacter_AnimBP.MenuCharacter_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct MenuCharacter_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(MenuCharacter_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on MenuCharacter_AnimBP_C_AnimGraph");
static_assert(sizeof(MenuCharacter_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on MenuCharacter_AnimBP_C_AnimGraph");
static_assert(offsetof(MenuCharacter_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'MenuCharacter_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function MenuCharacter_AnimBP.MenuCharacter_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct MenuCharacter_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on MenuCharacter_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(MenuCharacter_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on MenuCharacter_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(MenuCharacter_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'MenuCharacter_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function MenuCharacter_AnimBP.MenuCharacter_AnimBP_C.ExecuteUbergraph_MenuCharacter_AnimBP
// 0x0028 (0x0028 - 0x0000)
struct MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CDB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMenuCharacter_C*                       K2Node_DynamicCast_AsMenu_Character;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CDC[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CDD[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP) == 0x000008, "Wrong alignment on MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP");
static_assert(sizeof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP) == 0x000028, "Wrong size on MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, EntryPoint) == 0x000000, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_DynamicCast_AsMenu_Character) == 0x000010, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_DynamicCast_AsMenu_Character' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_Event_DeltaTimeX) == 0x00001C, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_RandomInteger_ReturnValue) == 0x000024, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");

}

