#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MessageWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MessageWidget.MessageWidget_C
// 0x0078 (0x0360 - 0x02E8)
class UMessageWidget_C final : public URBHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_MessageWidget;                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                ItemsSpacer;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMessageLineWidget_C*                   MessageLineWidget;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MessageVerticalBox;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PickedUpItem;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SwapIcon;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SwapItem;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0330(0x0018)(Edit, BlueprintVisible)
	float                                         LinePadding;                                       // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x034C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxNumberMessages;                                 // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MessageWidget(int32 EntryPoint);
	void Event_Hide();
	void Event_Show();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void SendTemporaryText(const class FText& MessageText);
	void SetMessage(const class FText& MessageText, const struct FLinearColor& DefaultColor);
	void OninputChanged();
	void HandleItemsIconsDisplay();
	void HideIcons();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MessageWidget_C">();
	}
	static class UMessageWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMessageWidget_C>();
	}
};
static_assert(alignof(UMessageWidget_C) == 0x000008, "Wrong alignment on UMessageWidget_C");
static_assert(sizeof(UMessageWidget_C) == 0x000360, "Wrong size on UMessageWidget_C");
static_assert(offsetof(UMessageWidget_C, UberGraphFrame) == 0x0002E8, "Member 'UMessageWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMessageWidget_C, FadeIn) == 0x0002F0, "Member 'UMessageWidget_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UMessageWidget_C, InvalidationBox_MessageWidget) == 0x0002F8, "Member 'UMessageWidget_C::InvalidationBox_MessageWidget' has a wrong offset!");
static_assert(offsetof(UMessageWidget_C, ItemsSpacer) == 0x000300, "Member 'UMessageWidget_C::ItemsSpacer' has a wrong offset!");
static_assert(offsetof(UMessageWidget_C, MessageLineWidget) == 0x000308, "Member 'UMessageWidget_C::MessageLineWidget' has a wrong offset!");
static_assert(offsetof(UMessageWidget_C, MessageVerticalBox) == 0x000310, "Member 'UMessageWidget_C::MessageVerticalBox' has a wrong offset!");
static_assert(offsetof(UMessageWidget_C, PickedUpItem) == 0x000318, "Member 'UMessageWidget_C::PickedUpItem' has a wrong offset!");
static_assert(offsetof(UMessageWidget_C, SwapIcon) == 0x000320, "Member 'UMessageWidget_C::SwapIcon' has a wrong offset!");
static_assert(offsetof(UMessageWidget_C, SwapItem) == 0x000328, "Member 'UMessageWidget_C::SwapItem' has a wrong offset!");
static_assert(offsetof(UMessageWidget_C, Text) == 0x000330, "Member 'UMessageWidget_C::Text' has a wrong offset!");
static_assert(offsetof(UMessageWidget_C, LinePadding) == 0x000348, "Member 'UMessageWidget_C::LinePadding' has a wrong offset!");
static_assert(offsetof(UMessageWidget_C, Color) == 0x00034C, "Member 'UMessageWidget_C::Color' has a wrong offset!");
static_assert(offsetof(UMessageWidget_C, MaxNumberMessages) == 0x00035C, "Member 'UMessageWidget_C::MaxNumberMessages' has a wrong offset!");

}

