#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetalBarMinusDoorLock_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MetalBar-DoorLock_BP.MetalBar-DoorLock_BP_C
// 0x0030 (0x0630 - 0x0600)
class AMetalBarMinusDoorLock_BP_C final : public ARBSlidingLock
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   LockRestRight;                                     // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LockRestLeft;                                      // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LockBase;                                          // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoorRef;                                           // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LastTriggeredStimulusTimestamp;                    // 0x0628(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SnapBarToPosition();
	void GetCurrentAnimSequence(class UAnimSequence** AnimSequence);
	void GetLockedTransform(struct FTransform* UnlockedTransform);
	void GetUnlockedTransform(struct FTransform* UnlockedTransform);
	struct FTransform BP_OverrideEditorCompTranform(class FName CompName, bool bLocked, const struct FTransform& Transform);
	void OnSetup();
	void UserConstructionScript();
	void BP_OnInitialization();
	void Event_SnapToState();
	void ReceiveBeginPlay();
	void BP_ApplyAnimatedTransform(float CurveValue, const class ARBPawn* InteractorPawn);
	void BP_OnDoorOwnerChanged();
	void Event_OnResetStage();
	void ExecuteUbergraph_MetalBarMinusDoorLock_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MetalBar-DoorLock_BP_C">();
	}
	static class AMetalBarMinusDoorLock_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMetalBarMinusDoorLock_BP_C>();
	}
};
static_assert(alignof(AMetalBarMinusDoorLock_BP_C) == 0x000008, "Wrong alignment on AMetalBarMinusDoorLock_BP_C");
static_assert(sizeof(AMetalBarMinusDoorLock_BP_C) == 0x000630, "Wrong size on AMetalBarMinusDoorLock_BP_C");
static_assert(offsetof(AMetalBarMinusDoorLock_BP_C, UberGraphFrame) == 0x000600, "Member 'AMetalBarMinusDoorLock_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMetalBarMinusDoorLock_BP_C, LockRestRight) == 0x000608, "Member 'AMetalBarMinusDoorLock_BP_C::LockRestRight' has a wrong offset!");
static_assert(offsetof(AMetalBarMinusDoorLock_BP_C, LockRestLeft) == 0x000610, "Member 'AMetalBarMinusDoorLock_BP_C::LockRestLeft' has a wrong offset!");
static_assert(offsetof(AMetalBarMinusDoorLock_BP_C, LockBase) == 0x000618, "Member 'AMetalBarMinusDoorLock_BP_C::LockBase' has a wrong offset!");
static_assert(offsetof(AMetalBarMinusDoorLock_BP_C, DoorRef) == 0x000620, "Member 'AMetalBarMinusDoorLock_BP_C::DoorRef' has a wrong offset!");
static_assert(offsetof(AMetalBarMinusDoorLock_BP_C, LastTriggeredStimulusTimestamp) == 0x000628, "Member 'AMetalBarMinusDoorLock_BP_C::LastTriggeredStimulusTimestamp' has a wrong offset!");

}

