#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Murkoff_ExitCeilingBorder_StraightMinus01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Murkoff_ExitCeilingBorder_Straight-01_BP.Murkoff_ExitCeilingBorder_Straight-01_BP_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct Murkoff_ExitCeilingBorder_StraightMinus01_BP_C_UserConstructionScript final
{
public:
	float                                         CallFunc_BreakVector_X;                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Murkoff_ExitCeilingBorder_StraightMinus01_BP_C_UserConstructionScript) == 0x000004, "Wrong alignment on Murkoff_ExitCeilingBorder_StraightMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(Murkoff_ExitCeilingBorder_StraightMinus01_BP_C_UserConstructionScript) == 0x000018, "Wrong size on Murkoff_ExitCeilingBorder_StraightMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(Murkoff_ExitCeilingBorder_StraightMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000000, "Member 'Murkoff_ExitCeilingBorder_StraightMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Murkoff_ExitCeilingBorder_StraightMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000004, "Member 'Murkoff_ExitCeilingBorder_StraightMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Murkoff_ExitCeilingBorder_StraightMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000008, "Member 'Murkoff_ExitCeilingBorder_StraightMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Murkoff_ExitCeilingBorder_StraightMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x00000C, "Member 'Murkoff_ExitCeilingBorder_StraightMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

