#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewsFocus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NewsFocus.NewsFocus_C
// 0x0100 (0x03E8 - 0x02E8)
class UNewsFocus_C final : public URBNewsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CategoryBackground;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CategoryOverlay;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             DescriptionScrollBox;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DotsBox;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               DotsSizeBox;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                GamepadInputHolder;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingVideoWidget_C*                  LoadingVideoWidget;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NewsCategoryTitle;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NewsDescription;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewsImage;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              NewsScaleBox;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NewsTitle;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NewsVerticalBox;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsWidgetDot_C*                       NewsWidgetDot;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsWidgetDot_C*                       NewsWidgetDot_90;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsWidgetDot_C*                       NewsWidgetDot_235;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsWidgetDot_C*                       NewsWidgetDot_372;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                NextNewsButton;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NextNewsButtonArrow;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NoNewsText;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PreviousNewsButton;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PreviousNewsButtonArrow;                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RemoveFocusButton;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                DotPadding;                                        // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Speed_Accumulator;                                 // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             ActiveItemSet;                                     // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             QuitFocusRequested;                                // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HasBeenInit;                                       // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ActiveItemSet__DelegateSignature(int32 Index_0);
	void QuitFocusRequested__DelegateSignature();
	void ExecuteUbergraph_NewsFocus(int32 EntryPoint);
	void Event_ShowNothing();
	void Construct();
	void BndEvt__NewsFocus_PreviousNewsButton_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__NewsFocus_NextNewsButton_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__NewsFocus_PreviousNewsButton_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__NewsFocus_NextNewsButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__NewsFocus_RemoveFocusButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__NewsFocus_NextNewsButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__NewsFocus_Button_351_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnDotButtonClicked(int32 Index_0);
	void Event_Refresh();
	void Event_NextItem();
	void UpdateDots();
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void TransmitFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewsFocus_C">();
	}
	static class UNewsFocus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNewsFocus_C>();
	}
};
static_assert(alignof(UNewsFocus_C) == 0x000008, "Wrong alignment on UNewsFocus_C");
static_assert(sizeof(UNewsFocus_C) == 0x0003E8, "Wrong size on UNewsFocus_C");
static_assert(offsetof(UNewsFocus_C, UberGraphFrame) == 0x0002E8, "Member 'UNewsFocus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, CategoryBackground) == 0x0002F0, "Member 'UNewsFocus_C::CategoryBackground' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, CategoryOverlay) == 0x0002F8, "Member 'UNewsFocus_C::CategoryOverlay' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, DescriptionScrollBox) == 0x000300, "Member 'UNewsFocus_C::DescriptionScrollBox' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, DotsBox) == 0x000308, "Member 'UNewsFocus_C::DotsBox' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, DotsSizeBox) == 0x000310, "Member 'UNewsFocus_C::DotsSizeBox' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, GamepadInputHolder) == 0x000318, "Member 'UNewsFocus_C::GamepadInputHolder' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, LoadingVideoWidget) == 0x000320, "Member 'UNewsFocus_C::LoadingVideoWidget' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsCategoryTitle) == 0x000328, "Member 'UNewsFocus_C::NewsCategoryTitle' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsDescription) == 0x000330, "Member 'UNewsFocus_C::NewsDescription' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsImage) == 0x000338, "Member 'UNewsFocus_C::NewsImage' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsScaleBox) == 0x000340, "Member 'UNewsFocus_C::NewsScaleBox' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsTitle) == 0x000348, "Member 'UNewsFocus_C::NewsTitle' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsVerticalBox) == 0x000350, "Member 'UNewsFocus_C::NewsVerticalBox' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsWidgetDot) == 0x000358, "Member 'UNewsFocus_C::NewsWidgetDot' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsWidgetDot_90) == 0x000360, "Member 'UNewsFocus_C::NewsWidgetDot_90' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsWidgetDot_235) == 0x000368, "Member 'UNewsFocus_C::NewsWidgetDot_235' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsWidgetDot_372) == 0x000370, "Member 'UNewsFocus_C::NewsWidgetDot_372' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NextNewsButton) == 0x000378, "Member 'UNewsFocus_C::NextNewsButton' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NextNewsButtonArrow) == 0x000380, "Member 'UNewsFocus_C::NextNewsButtonArrow' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NoNewsText) == 0x000388, "Member 'UNewsFocus_C::NoNewsText' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, PreviousNewsButton) == 0x000390, "Member 'UNewsFocus_C::PreviousNewsButton' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, PreviousNewsButtonArrow) == 0x000398, "Member 'UNewsFocus_C::PreviousNewsButtonArrow' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, RemoveFocusButton) == 0x0003A0, "Member 'UNewsFocus_C::RemoveFocusButton' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, DotPadding) == 0x0003A8, "Member 'UNewsFocus_C::DotPadding' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, Speed_Accumulator) == 0x0003B8, "Member 'UNewsFocus_C::Speed_Accumulator' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, ActiveItemSet) == 0x0003C0, "Member 'UNewsFocus_C::ActiveItemSet' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, QuitFocusRequested) == 0x0003D0, "Member 'UNewsFocus_C::QuitFocusRequested' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, HasBeenInit) == 0x0003E0, "Member 'UNewsFocus_C::HasBeenInit' has a wrong offset!");

}

