#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewsWidgetDot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NewsWidgetDot.NewsWidgetDot_C
// 0x0148 (0x03A8 - 0x0260)
class UNewsWidgetDot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                DotButton;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 State;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            ActiveBrush;                                       // 0x0278(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            InactiveBrush;                                     // 0x0300(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNewsWidget_C*                          Parent;                                            // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             DotClicked;                                        // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void DotClicked__DelegateSignature(int32 Index_0);
	void ExecuteUbergraph_NewsWidgetDot(int32 EntryPoint);
	void BndEvt__Button_70_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void SetActive(bool bActive);
	void SetIndex(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewsWidgetDot_C">();
	}
	static class UNewsWidgetDot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNewsWidgetDot_C>();
	}
};
static_assert(alignof(UNewsWidgetDot_C) == 0x000008, "Wrong alignment on UNewsWidgetDot_C");
static_assert(sizeof(UNewsWidgetDot_C) == 0x0003A8, "Wrong size on UNewsWidgetDot_C");
static_assert(offsetof(UNewsWidgetDot_C, UberGraphFrame) == 0x000260, "Member 'UNewsWidgetDot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNewsWidgetDot_C, DotButton) == 0x000268, "Member 'UNewsWidgetDot_C::DotButton' has a wrong offset!");
static_assert(offsetof(UNewsWidgetDot_C, State) == 0x000270, "Member 'UNewsWidgetDot_C::State' has a wrong offset!");
static_assert(offsetof(UNewsWidgetDot_C, ActiveBrush) == 0x000278, "Member 'UNewsWidgetDot_C::ActiveBrush' has a wrong offset!");
static_assert(offsetof(UNewsWidgetDot_C, InactiveBrush) == 0x000300, "Member 'UNewsWidgetDot_C::InactiveBrush' has a wrong offset!");
static_assert(offsetof(UNewsWidgetDot_C, Parent) == 0x000388, "Member 'UNewsWidgetDot_C::Parent' has a wrong offset!");
static_assert(offsetof(UNewsWidgetDot_C, Index_0) == 0x000390, "Member 'UNewsWidgetDot_C::Index_0' has a wrong offset!");
static_assert(offsetof(UNewsWidgetDot_C, DotClicked) == 0x000398, "Member 'UNewsWidgetDot_C::DotClicked' has a wrong offset!");

}

