#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewsWidgetDot

#include "Basic.hpp"


namespace SDK::Params
{

// Function NewsWidgetDot.NewsWidgetDot_C.DotClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct NewsWidgetDot_C_DotClicked__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewsWidgetDot_C_DotClicked__DelegateSignature) == 0x000004, "Wrong alignment on NewsWidgetDot_C_DotClicked__DelegateSignature");
static_assert(sizeof(NewsWidgetDot_C_DotClicked__DelegateSignature) == 0x000004, "Wrong size on NewsWidgetDot_C_DotClicked__DelegateSignature");
static_assert(offsetof(NewsWidgetDot_C_DotClicked__DelegateSignature, Index_0) == 0x000000, "Member 'NewsWidgetDot_C_DotClicked__DelegateSignature::Index_0' has a wrong offset!");

// Function NewsWidgetDot.NewsWidgetDot_C.ExecuteUbergraph_NewsWidgetDot
// 0x0004 (0x0004 - 0x0000)
struct NewsWidgetDot_C_ExecuteUbergraph_NewsWidgetDot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewsWidgetDot_C_ExecuteUbergraph_NewsWidgetDot) == 0x000004, "Wrong alignment on NewsWidgetDot_C_ExecuteUbergraph_NewsWidgetDot");
static_assert(sizeof(NewsWidgetDot_C_ExecuteUbergraph_NewsWidgetDot) == 0x000004, "Wrong size on NewsWidgetDot_C_ExecuteUbergraph_NewsWidgetDot");
static_assert(offsetof(NewsWidgetDot_C_ExecuteUbergraph_NewsWidgetDot, EntryPoint) == 0x000000, "Member 'NewsWidgetDot_C_ExecuteUbergraph_NewsWidgetDot::EntryPoint' has a wrong offset!");

// Function NewsWidgetDot.NewsWidgetDot_C.SetActive
// 0x0001 (0x0001 - 0x0000)
struct NewsWidgetDot_C_SetActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewsWidgetDot_C_SetActive) == 0x000001, "Wrong alignment on NewsWidgetDot_C_SetActive");
static_assert(sizeof(NewsWidgetDot_C_SetActive) == 0x000001, "Wrong size on NewsWidgetDot_C_SetActive");
static_assert(offsetof(NewsWidgetDot_C_SetActive, bActive) == 0x000000, "Member 'NewsWidgetDot_C_SetActive::bActive' has a wrong offset!");

// Function NewsWidgetDot.NewsWidgetDot_C.SetIndex
// 0x0004 (0x0004 - 0x0000)
struct NewsWidgetDot_C_SetIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewsWidgetDot_C_SetIndex) == 0x000004, "Wrong alignment on NewsWidgetDot_C_SetIndex");
static_assert(sizeof(NewsWidgetDot_C_SetIndex) == 0x000004, "Wrong size on NewsWidgetDot_C_SetIndex");
static_assert(offsetof(NewsWidgetDot_C_SetIndex, Index_0) == 0x000000, "Member 'NewsWidgetDot_C_SetIndex::Index_0' has a wrong offset!");

}

