#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewsFocus

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function NewsFocus.NewsFocus_C.ExecuteUbergraph_NewsFocus
// 0x00D8 (0x00D8 - 0x0000)
struct NewsFocus_C_ExecuteUbergraph_NewsFocus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNewsWidgetDot_C*                       CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A41[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A42[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      CallFunc_GetImage_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTitle_ReturnValue;                     // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	class FString                                 CallFunc_GetDescription_ReturnValue;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetHeaderBackgroundColor_ReturnValue;     // 0x0080(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0090(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00A8(0x0028)()
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewsFocus_C_ExecuteUbergraph_NewsFocus) == 0x000008, "Wrong alignment on NewsFocus_C_ExecuteUbergraph_NewsFocus");
static_assert(sizeof(NewsFocus_C_ExecuteUbergraph_NewsFocus) == 0x0000D8, "Wrong size on NewsFocus_C_ExecuteUbergraph_NewsFocus");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, EntryPoint) == 0x000000, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, Temp_int_Variable) == 0x000004, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, CallFunc_GetNumItems_ReturnValue) == 0x00001C, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, CallFunc_Create_ReturnValue) == 0x000020, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00002C, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, CallFunc_Greater_IntInt_ReturnValue) == 0x00002D, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, K2Node_CustomEvent_Index) == 0x000030, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, CallFunc_GetImage_ReturnValue) == 0x000040, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::CallFunc_GetImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, CallFunc_GetTitle_ReturnValue) == 0x000048, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::CallFunc_GetTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, CallFunc_GetDescription_ReturnValue) == 0x000070, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, CallFunc_GetHeaderBackgroundColor_ReturnValue) == 0x000080, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::CallFunc_GetHeaderBackgroundColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000090, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, K2Node_MakeStruct_SlateColor) == 0x0000A8, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_ExecuteUbergraph_NewsFocus, CallFunc_HasAnyUserFocus_ReturnValue) == 0x0000D0, "Member 'NewsFocus_C_ExecuteUbergraph_NewsFocus::CallFunc_HasAnyUserFocus_ReturnValue' has a wrong offset!");

// Function NewsFocus.NewsFocus_C.OnDotButtonClicked
// 0x0004 (0x0004 - 0x0000)
struct NewsFocus_C_OnDotButtonClicked final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewsFocus_C_OnDotButtonClicked) == 0x000004, "Wrong alignment on NewsFocus_C_OnDotButtonClicked");
static_assert(sizeof(NewsFocus_C_OnDotButtonClicked) == 0x000004, "Wrong size on NewsFocus_C_OnDotButtonClicked");
static_assert(offsetof(NewsFocus_C_OnDotButtonClicked, Param_Index) == 0x000000, "Member 'NewsFocus_C_OnDotButtonClicked::Param_Index' has a wrong offset!");

// Function NewsFocus.NewsFocus_C.UpdateDots
// 0x0048 (0x0048 - 0x0000)
struct NewsFocus_C_UpdateDots final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentItemIndex_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A43[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A44[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNewsWidgetDot_C*                       K2Node_DynamicCast_AsNews_Widget_Dot;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewsFocus_C_UpdateDots) == 0x000008, "Wrong alignment on NewsFocus_C_UpdateDots");
static_assert(sizeof(NewsFocus_C_UpdateDots) == 0x000048, "Wrong size on NewsFocus_C_UpdateDots");
static_assert(offsetof(NewsFocus_C_UpdateDots, Temp_int_Array_Index_Variable) == 0x000000, "Member 'NewsFocus_C_UpdateDots::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_UpdateDots, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'NewsFocus_C_UpdateDots::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_UpdateDots, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'NewsFocus_C_UpdateDots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_UpdateDots, CallFunc_GetCurrentItemIndex_ReturnValue) == 0x00000C, "Member 'NewsFocus_C_UpdateDots::CallFunc_GetCurrentItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_UpdateDots, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'NewsFocus_C_UpdateDots::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_UpdateDots, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'NewsFocus_C_UpdateDots::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_UpdateDots, CallFunc_Array_Get_Item) == 0x000028, "Member 'NewsFocus_C_UpdateDots::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_UpdateDots, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'NewsFocus_C_UpdateDots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_UpdateDots, K2Node_DynamicCast_AsNews_Widget_Dot) == 0x000038, "Member 'NewsFocus_C_UpdateDots::K2Node_DynamicCast_AsNews_Widget_Dot' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_UpdateDots, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'NewsFocus_C_UpdateDots::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_UpdateDots, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'NewsFocus_C_UpdateDots::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function NewsFocus.NewsFocus_C.UpdateMenuFocusAction
// 0x0028 (0x0028 - 0x0000)
struct NewsFocus_C_UpdateMenuFocusAction final
{
public:
	bool                                          CallFunc_HasCTA_ReturnValue;                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A45[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewsFocus_C_UpdateMenuFocusAction) == 0x000008, "Wrong alignment on NewsFocus_C_UpdateMenuFocusAction");
static_assert(sizeof(NewsFocus_C_UpdateMenuFocusAction) == 0x000028, "Wrong size on NewsFocus_C_UpdateMenuFocusAction");
static_assert(offsetof(NewsFocus_C_UpdateMenuFocusAction, CallFunc_HasCTA_ReturnValue) == 0x000000, "Member 'NewsFocus_C_UpdateMenuFocusAction::CallFunc_HasCTA_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_UpdateMenuFocusAction, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'NewsFocus_C_UpdateMenuFocusAction::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewsFocus_C_UpdateMenuFocusAction, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'NewsFocus_C_UpdateMenuFocusAction::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

}

