#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewsFocus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NewsFocus.NewsFocus_C
// 0x0080 (0x0368 - 0x02E8)
class UNewsFocus_C final : public URBNewsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         DotsBox;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GameVersion;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_59;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_212;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NewsDateAndNumber;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NewsDescription;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewsImage;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NewsTitle;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsWidgetDot_C*                       NewsWidgetDot;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsWidgetDot_C*                       NewsWidgetDot_90;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsWidgetDot_C*                       NewsWidgetDot_235;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNewsWidgetDot_C*                       NewsWidgetDot_372;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleBackground;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                DotPadding;                                        // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_NewsFocus(int32 EntryPoint);
	void OnDotButtonClicked(int32 Param_Index);
	void Event_Refresh();
	void Event_NextItem();
	void UpdateDots();
	void UpdateMenuFocusAction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewsFocus_C">();
	}
	static class UNewsFocus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNewsFocus_C>();
	}
};
static_assert(alignof(UNewsFocus_C) == 0x000008, "Wrong alignment on UNewsFocus_C");
static_assert(sizeof(UNewsFocus_C) == 0x000368, "Wrong size on UNewsFocus_C");
static_assert(offsetof(UNewsFocus_C, UberGraphFrame) == 0x0002E8, "Member 'UNewsFocus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, DotsBox) == 0x0002F0, "Member 'UNewsFocus_C::DotsBox' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, GameVersion) == 0x0002F8, "Member 'UNewsFocus_C::GameVersion' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, Image_59) == 0x000300, "Member 'UNewsFocus_C::Image_59' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, Image_212) == 0x000308, "Member 'UNewsFocus_C::Image_212' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsDateAndNumber) == 0x000310, "Member 'UNewsFocus_C::NewsDateAndNumber' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsDescription) == 0x000318, "Member 'UNewsFocus_C::NewsDescription' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsImage) == 0x000320, "Member 'UNewsFocus_C::NewsImage' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsTitle) == 0x000328, "Member 'UNewsFocus_C::NewsTitle' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsWidgetDot) == 0x000330, "Member 'UNewsFocus_C::NewsWidgetDot' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsWidgetDot_90) == 0x000338, "Member 'UNewsFocus_C::NewsWidgetDot_90' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsWidgetDot_235) == 0x000340, "Member 'UNewsFocus_C::NewsWidgetDot_235' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, NewsWidgetDot_372) == 0x000348, "Member 'UNewsFocus_C::NewsWidgetDot_372' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, TitleBackground) == 0x000350, "Member 'UNewsFocus_C::TitleBackground' has a wrong offset!");
static_assert(offsetof(UNewsFocus_C, DotPadding) == 0x000358, "Member 'UNewsFocus_C::DotPadding' has a wrong offset!");

}

