#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NextLevelRewardWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NextLevelRewardWidget.NextLevelRewardWidget_C
// 0x00A0 (0x0300 - 0x0260)
class UNextLevelRewardWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AmountText;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BackgroundBorder;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CustomizationBorder;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CustomizationRarityOverlay;                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bAcquired;                                         // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPerfectReward;                                    // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3794[0x2];                                     // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Amount;                                            // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             IconTexture;                                       // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRewardUIData                          Reward_UI_Data;                                    // 0x02A0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSlateColor                            IconTintColor;                                     // 0x02C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ForcedText;                                        // 0x02E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateRarity(EPlayerCustomizationRarity Rarity);
	void InitFromRewardUIData(bool Param_bAcquired, bool bPerfect, const struct FRewardUIData& RewardUIData);
	void Setup();
	void OnLoaded_54A1EA1342F0219294453894BE060EF2(class UObject* Loaded);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void LoadThumbnail(TSoftObjectPtr<class UTexture2D> ThumbnailSoftRef);
	void ExecuteUbergraph_NextLevelRewardWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NextLevelRewardWidget_C">();
	}
	static class UNextLevelRewardWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNextLevelRewardWidget_C>();
	}
};
static_assert(alignof(UNextLevelRewardWidget_C) == 0x000008, "Wrong alignment on UNextLevelRewardWidget_C");
static_assert(sizeof(UNextLevelRewardWidget_C) == 0x000300, "Wrong size on UNextLevelRewardWidget_C");
static_assert(offsetof(UNextLevelRewardWidget_C, UberGraphFrame) == 0x000260, "Member 'UNextLevelRewardWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNextLevelRewardWidget_C, AmountText) == 0x000268, "Member 'UNextLevelRewardWidget_C::AmountText' has a wrong offset!");
static_assert(offsetof(UNextLevelRewardWidget_C, BackgroundBorder) == 0x000270, "Member 'UNextLevelRewardWidget_C::BackgroundBorder' has a wrong offset!");
static_assert(offsetof(UNextLevelRewardWidget_C, CustomizationBorder) == 0x000278, "Member 'UNextLevelRewardWidget_C::CustomizationBorder' has a wrong offset!");
static_assert(offsetof(UNextLevelRewardWidget_C, CustomizationRarityOverlay) == 0x000280, "Member 'UNextLevelRewardWidget_C::CustomizationRarityOverlay' has a wrong offset!");
static_assert(offsetof(UNextLevelRewardWidget_C, Icon) == 0x000288, "Member 'UNextLevelRewardWidget_C::Icon' has a wrong offset!");
static_assert(offsetof(UNextLevelRewardWidget_C, bAcquired) == 0x000290, "Member 'UNextLevelRewardWidget_C::bAcquired' has a wrong offset!");
static_assert(offsetof(UNextLevelRewardWidget_C, bPerfectReward) == 0x000291, "Member 'UNextLevelRewardWidget_C::bPerfectReward' has a wrong offset!");
static_assert(offsetof(UNextLevelRewardWidget_C, Amount) == 0x000294, "Member 'UNextLevelRewardWidget_C::Amount' has a wrong offset!");
static_assert(offsetof(UNextLevelRewardWidget_C, IconTexture) == 0x000298, "Member 'UNextLevelRewardWidget_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UNextLevelRewardWidget_C, Reward_UI_Data) == 0x0002A0, "Member 'UNextLevelRewardWidget_C::Reward_UI_Data' has a wrong offset!");
static_assert(offsetof(UNextLevelRewardWidget_C, IconTintColor) == 0x0002C0, "Member 'UNextLevelRewardWidget_C::IconTintColor' has a wrong offset!");
static_assert(offsetof(UNextLevelRewardWidget_C, ForcedText) == 0x0002E8, "Member 'UNextLevelRewardWidget_C::ForcedText' has a wrong offset!");

}

