#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NextLevelRewardWidget

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NextLevelRewardWidget.NextLevelRewardWidget_C.UpdateRarity
// 0x00D0 (0x00D0 - 0x0000)
struct NextLevelRewardWidget_C_UpdateRarity final
{
public:
	EPlayerCustomizationRarity                    Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3795[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	class URBPlayerCustomizationConfig*           CallFunc_GetPlayerCustomizationConfig_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCustomizationRarityUIInfo             CallFunc_Map_Find_Value;                           // 0x0038(0x0068)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3796[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x00A8(0x0028)()
};
static_assert(alignof(NextLevelRewardWidget_C_UpdateRarity) == 0x000008, "Wrong alignment on NextLevelRewardWidget_C_UpdateRarity");
static_assert(sizeof(NextLevelRewardWidget_C_UpdateRarity) == 0x0000D0, "Wrong size on NextLevelRewardWidget_C_UpdateRarity");
static_assert(offsetof(NextLevelRewardWidget_C_UpdateRarity, Rarity) == 0x000000, "Member 'NextLevelRewardWidget_C_UpdateRarity::Rarity' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_UpdateRarity, Temp_bool_Variable) == 0x000001, "Member 'NextLevelRewardWidget_C_UpdateRarity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_UpdateRarity, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'NextLevelRewardWidget_C_UpdateRarity::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_UpdateRarity, CallFunc_GetPlayerCustomizationConfig_ReturnValue) == 0x000030, "Member 'NextLevelRewardWidget_C_UpdateRarity::CallFunc_GetPlayerCustomizationConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_UpdateRarity, CallFunc_Map_Find_Value) == 0x000038, "Member 'NextLevelRewardWidget_C_UpdateRarity::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_UpdateRarity, CallFunc_Map_Find_ReturnValue) == 0x0000A0, "Member 'NextLevelRewardWidget_C_UpdateRarity::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_UpdateRarity, K2Node_Select_Default) == 0x0000A8, "Member 'NextLevelRewardWidget_C_UpdateRarity::K2Node_Select_Default' has a wrong offset!");

// Function NextLevelRewardWidget.NextLevelRewardWidget_C.InitFromRewardUIData
// 0x0188 (0x0188 - 0x0000)
struct NextLevelRewardWidget_C_InitFromRewardUIData final
{
public:
	bool                                          Param_bAcquired;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPerfect;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3797[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRewardUIData                          RewardUIData;                                      // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3798[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerIconCustomizationOption*       K2Node_DynamicCast_AsRB_Player_Icon_Customization_Option; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3799[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerCellItemDefinition*            K2Node_DynamicCast_AsRB_Player_Cell_Item_Definition; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379A[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBCustomizationOutfit*                 K2Node_DynamicCast_AsRB_Customization_Outfit;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379B[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerCustomizationOption*           K2Node_DynamicCast_AsRB_Player_Customization_Option; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379C[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0070(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0098(0x0028)()
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBSettings_Gameplay*                   CallFunc_GetRBSettings_Gameplay_ReturnValue;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomRewardPoolDisplayDetails        CallFunc_GetRandomRewardPoolDisplayDetails_ReturnValue; // 0x00D0(0x0030)(ConstParm, NoDestructor)
	struct FCurencySettings                       CallFunc_Map_Find_Value;                           // 0x0100(0x0030)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379D[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0138(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0160(0x0028)()
};
static_assert(alignof(NextLevelRewardWidget_C_InitFromRewardUIData) == 0x000008, "Wrong alignment on NextLevelRewardWidget_C_InitFromRewardUIData");
static_assert(sizeof(NextLevelRewardWidget_C_InitFromRewardUIData) == 0x000188, "Wrong size on NextLevelRewardWidget_C_InitFromRewardUIData");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, Param_bAcquired) == 0x000000, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::Param_bAcquired' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, bPerfect) == 0x000001, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::bPerfect' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, RewardUIData) == 0x000008, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::RewardUIData' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, Temp_bool_Variable) == 0x000028, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, K2Node_DynamicCast_AsRB_Player_Icon_Customization_Option) == 0x000030, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::K2Node_DynamicCast_AsRB_Player_Icon_Customization_Option' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, K2Node_DynamicCast_AsRB_Player_Cell_Item_Definition) == 0x000040, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::K2Node_DynamicCast_AsRB_Player_Cell_Item_Definition' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, K2Node_DynamicCast_AsRB_Customization_Outfit) == 0x000050, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::K2Node_DynamicCast_AsRB_Customization_Outfit' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, K2Node_DynamicCast_AsRB_Player_Customization_Option) == 0x000060, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::K2Node_DynamicCast_AsRB_Player_Customization_Option' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, K2Node_DynamicCast_bSuccess_3) == 0x000068, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, K2Node_SwitchEnum_CmpSuccess) == 0x000069, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, Temp_byte_Variable) == 0x00006A, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, Temp_byte_Variable_1) == 0x00006B, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, K2Node_MakeStruct_SlateColor) == 0x000070, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, K2Node_MakeStruct_SlateColor_1) == 0x000098, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x0000C0, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, CallFunc_GetRBSettings_Gameplay_ReturnValue) == 0x0000C8, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::CallFunc_GetRBSettings_Gameplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, CallFunc_GetRandomRewardPoolDisplayDetails_ReturnValue) == 0x0000D0, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::CallFunc_GetRandomRewardPoolDisplayDetails_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, CallFunc_Map_Find_Value) == 0x000100, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, CallFunc_Map_Find_ReturnValue) == 0x000130, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, K2Node_Select_Default) == 0x000131, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, K2Node_MakeStruct_SlateColor_2) == 0x000138, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_InitFromRewardUIData, K2Node_MakeStruct_SlateColor_3) == 0x000160, "Member 'NextLevelRewardWidget_C_InitFromRewardUIData::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

// Function NextLevelRewardWidget.NextLevelRewardWidget_C.Setup
// 0x00B0 (0x00B0 - 0x0000)
struct NextLevelRewardWidget_C_Setup final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379E[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A0[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0098(0x0018)()
};
static_assert(alignof(NextLevelRewardWidget_C_Setup) == 0x000008, "Wrong alignment on NextLevelRewardWidget_C_Setup");
static_assert(sizeof(NextLevelRewardWidget_C_Setup) == 0x0000B0, "Wrong size on NextLevelRewardWidget_C_Setup");
static_assert(offsetof(NextLevelRewardWidget_C_Setup, Temp_bool_Variable) == 0x000000, "Member 'NextLevelRewardWidget_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_Setup, Temp_bool_Variable_1) == 0x000001, "Member 'NextLevelRewardWidget_C_Setup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_Setup, Temp_byte_Variable) == 0x000002, "Member 'NextLevelRewardWidget_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_Setup, Temp_byte_Variable_1) == 0x000003, "Member 'NextLevelRewardWidget_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_Setup, CallFunc_TextIsEmpty_ReturnValue) == 0x000004, "Member 'NextLevelRewardWidget_C_Setup::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_Setup, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'NextLevelRewardWidget_C_Setup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_Setup, CallFunc_Greater_IntInt_ReturnValue) == 0x000006, "Member 'NextLevelRewardWidget_C_Setup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_Setup, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'NextLevelRewardWidget_C_Setup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_Setup, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'NextLevelRewardWidget_C_Setup::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_Setup, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'NextLevelRewardWidget_C_Setup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_Setup, K2Node_MakeArray_Array) == 0x000068, "Member 'NextLevelRewardWidget_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_Setup, K2Node_Select_Default) == 0x000078, "Member 'NextLevelRewardWidget_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_Setup, CallFunc_Format_ReturnValue) == 0x000080, "Member 'NextLevelRewardWidget_C_Setup::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_Setup, K2Node_Select_Default_1) == 0x000098, "Member 'NextLevelRewardWidget_C_Setup::K2Node_Select_Default_1' has a wrong offset!");

// Function NextLevelRewardWidget.NextLevelRewardWidget_C.OnLoaded_54A1EA1342F0219294453894BE060EF2
// 0x0008 (0x0008 - 0x0000)
struct NextLevelRewardWidget_C_OnLoaded_54A1EA1342F0219294453894BE060EF2 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NextLevelRewardWidget_C_OnLoaded_54A1EA1342F0219294453894BE060EF2) == 0x000008, "Wrong alignment on NextLevelRewardWidget_C_OnLoaded_54A1EA1342F0219294453894BE060EF2");
static_assert(sizeof(NextLevelRewardWidget_C_OnLoaded_54A1EA1342F0219294453894BE060EF2) == 0x000008, "Wrong size on NextLevelRewardWidget_C_OnLoaded_54A1EA1342F0219294453894BE060EF2");
static_assert(offsetof(NextLevelRewardWidget_C_OnLoaded_54A1EA1342F0219294453894BE060EF2, Loaded) == 0x000000, "Member 'NextLevelRewardWidget_C_OnLoaded_54A1EA1342F0219294453894BE060EF2::Loaded' has a wrong offset!");

// Function NextLevelRewardWidget.NextLevelRewardWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct NextLevelRewardWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NextLevelRewardWidget_C_PreConstruct) == 0x000001, "Wrong alignment on NextLevelRewardWidget_C_PreConstruct");
static_assert(sizeof(NextLevelRewardWidget_C_PreConstruct) == 0x000001, "Wrong size on NextLevelRewardWidget_C_PreConstruct");
static_assert(offsetof(NextLevelRewardWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'NextLevelRewardWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function NextLevelRewardWidget.NextLevelRewardWidget_C.LoadThumbnail
// 0x0028 (0x0028 - 0x0000)
struct NextLevelRewardWidget_C_LoadThumbnail final
{
public:
	TSoftObjectPtr<class UTexture2D>              ThumbnailSoftRef;                                  // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(NextLevelRewardWidget_C_LoadThumbnail) == 0x000008, "Wrong alignment on NextLevelRewardWidget_C_LoadThumbnail");
static_assert(sizeof(NextLevelRewardWidget_C_LoadThumbnail) == 0x000028, "Wrong size on NextLevelRewardWidget_C_LoadThumbnail");
static_assert(offsetof(NextLevelRewardWidget_C_LoadThumbnail, ThumbnailSoftRef) == 0x000000, "Member 'NextLevelRewardWidget_C_LoadThumbnail::ThumbnailSoftRef' has a wrong offset!");

// Function NextLevelRewardWidget.NextLevelRewardWidget_C.ExecuteUbergraph_NextLevelRewardWidget
// 0x0060 (0x0060 - 0x0000)
struct NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A1[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37A2[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_thumbnailSoftref;               // 0x0038(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget) == 0x000008, "Wrong alignment on NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget");
static_assert(sizeof(NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget) == 0x000060, "Wrong size on NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget");
static_assert(offsetof(NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget, EntryPoint) == 0x000000, "Member 'NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget, Temp_object_Variable) == 0x000020, "Member 'NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget, K2Node_DynamicCast_AsTexture_2D) == 0x000028, "Member 'NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget, K2Node_Event_IsDesignTime) == 0x000031, "Member 'NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget, K2Node_CustomEvent_thumbnailSoftref) == 0x000038, "Member 'NextLevelRewardWidget_C_ExecuteUbergraph_NextLevelRewardWidget::K2Node_CustomEvent_thumbnailSoftref' has a wrong offset!");

}

