#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCMenu

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NPCMenu.NPCMenu_C
// 0x00D8 (0x03E0 - 0x0308)
class UNPCMenu_C final : public URBMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomBorder;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCoreUpgradeList_C*                     CoreUpgradeList;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCoreUpgradeTierList_C*                 CoreUpgradeTierList;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExperimentBoardActionButton_C*         DiscussButton;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        ExitButton;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULocalPlayerInfo_v2_C*                  LocalPlayerInfo_v2;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       MenuContent;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageSubTitle;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageSubTitleSeparator;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageTitle;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkList_C*                            PerkList;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkListTabs_C*                        PerkListTabs;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerLoadoutHoverInfo_C*              PlayerLoadoutHoverInfo;                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URigList_C*                             RigList;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RigTutorialFocusAnchor;                            // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RigTutorialPopupAnchor;                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URigUpgradeList_C*                      RigUpgradeList;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBorder;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TutorialFocusAnchor;                               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TutorialPopupAnchor;                               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 NPCActor;                                          // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMetaNPCType                                  NPCType;                                           // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bActivateCamera;                                   // 0x03D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ELoadoutElementType                           CurrentCategory;                                   // 0x03D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActiveSkillType                              SelectedActiveSkillType;                           // 0x03D3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedCoreUpgradeTier;                           // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPendingTutorialRequest;                           // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnRigClicked(class FName ItemId, EActiveSkillType ActiveSkillType);
	void OnMenuRightClick();
	void UpdateStorylineButton();
	void PlayPurchasedVoice();
	void TryStartNextMenuTutorial();
	void SetCategoryFocus();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void Refresh();
	void OnMenuBackRequested();
	void OnCoreUpgradeTierClicked(int32 Param_SelectedCoreUpgradeTier);
	void ChangeCategory(ELoadoutElementType Category);
	void PlayExitVoiceline(bool IsRudeExit);
	void PlayGreetingVoiceline();
	void Initialize(class AActor* Param_NPCActor, EMetaNPCType Param_NPCType, bool Param_bActivateCamera);
	void Setup();
	void Construct();
	void Event_OnPop();
	void BndEvt__ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void Event_OnFocusMenu();
	void BndEvt__NPCMenu_RigList_K2Node_ComponentBoundEvent_1_OnUpgradeAcquired__DelegateSignature();
	void BndEvt__NPCMenu_RigUpgradeList_K2Node_ComponentBoundEvent_3_OnUpgradeAcquired__DelegateSignature();
	void BndEvt__NPCMenu_PerkList_K2Node_ComponentBoundEvent_4_OnUpgradeAcquired__DelegateSignature();
	void BndEvt__NPCMenu_CoreUpgradeList_K2Node_ComponentBoundEvent_5_OnUpgradeAcquired__DelegateSignature();
	void BndEvt__NPCMenu_CoreUpgradeTierList_K2Node_ComponentBoundEvent_6_OnTierClicked__DelegateSignature(int32 Tier);
	void Event_OnMenuTutorialSeen();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Event_MenuCancel_Pressed();
	void OnStorylinePlayingChanged();
	void Event_MenuTabLeft_Pressed();
	void OnTabButtonClicked(EPerkCategory NewCategory);
	void OnPerkListCategoryChanged(EPerkCategory NewCategory);
	void Event_MenuTabRight_Pressed();
	void OnPerkListPageChanged(bool CategoryEntered);
	void OnMenuDiscussPressed();
	void BndEvt__NPCMenu_ExperimentBoardActionButton_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature();
	void BndEvt__NPCMenu_RigList_K2Node_ComponentBoundEvent_7_OnRigHovered__DelegateSignature(class FName ItemId, EActiveSkillType ActiveSkillType);
	void BndEvt__NPCMenu_PlayerLoadoutHoverInfo_K2Node_ComponentBoundEvent_9_RequestNPCSetupActionButton__DelegateSignature(bool SecondActionButton);
	void BndEvt__NPCMenu_RigList_K2Node_ComponentBoundEvent_0_OnRigClicked__DelegateSignature(class FName ItemId, EActiveSkillType ActiveSkillType);
	void ExecuteUbergraph_NPCMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPCMenu_C">();
	}
	static class UNPCMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPCMenu_C>();
	}
};
static_assert(alignof(UNPCMenu_C) == 0x000008, "Wrong alignment on UNPCMenu_C");
static_assert(sizeof(UNPCMenu_C) == 0x0003E0, "Wrong size on UNPCMenu_C");
static_assert(offsetof(UNPCMenu_C, UberGraphFrame) == 0x000308, "Member 'UNPCMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, FadeOut) == 0x000310, "Member 'UNPCMenu_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, Background) == 0x000318, "Member 'UNPCMenu_C::Background' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, BackgroundImage) == 0x000320, "Member 'UNPCMenu_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, BottomBorder) == 0x000328, "Member 'UNPCMenu_C::BottomBorder' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, CoreUpgradeList) == 0x000330, "Member 'UNPCMenu_C::CoreUpgradeList' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, CoreUpgradeTierList) == 0x000338, "Member 'UNPCMenu_C::CoreUpgradeTierList' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, DiscussButton) == 0x000340, "Member 'UNPCMenu_C::DiscussButton' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, ExitButton) == 0x000348, "Member 'UNPCMenu_C::ExitButton' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, LocalPlayerInfo_v2) == 0x000350, "Member 'UNPCMenu_C::LocalPlayerInfo_v2' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, MenuContent) == 0x000358, "Member 'UNPCMenu_C::MenuContent' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, PageSubTitle) == 0x000360, "Member 'UNPCMenu_C::PageSubTitle' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, PageSubTitleSeparator) == 0x000368, "Member 'UNPCMenu_C::PageSubTitleSeparator' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, PageTitle) == 0x000370, "Member 'UNPCMenu_C::PageTitle' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, PerkList) == 0x000378, "Member 'UNPCMenu_C::PerkList' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, PerkListTabs) == 0x000380, "Member 'UNPCMenu_C::PerkListTabs' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, PlayerLoadoutHoverInfo) == 0x000388, "Member 'UNPCMenu_C::PlayerLoadoutHoverInfo' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, RigList) == 0x000390, "Member 'UNPCMenu_C::RigList' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, RigTutorialFocusAnchor) == 0x000398, "Member 'UNPCMenu_C::RigTutorialFocusAnchor' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, RigTutorialPopupAnchor) == 0x0003A0, "Member 'UNPCMenu_C::RigTutorialPopupAnchor' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, RigUpgradeList) == 0x0003A8, "Member 'UNPCMenu_C::RigUpgradeList' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, TopBorder) == 0x0003B0, "Member 'UNPCMenu_C::TopBorder' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, TutorialFocusAnchor) == 0x0003B8, "Member 'UNPCMenu_C::TutorialFocusAnchor' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, TutorialPopupAnchor) == 0x0003C0, "Member 'UNPCMenu_C::TutorialPopupAnchor' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, NPCActor) == 0x0003C8, "Member 'UNPCMenu_C::NPCActor' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, NPCType) == 0x0003D0, "Member 'UNPCMenu_C::NPCType' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, bActivateCamera) == 0x0003D1, "Member 'UNPCMenu_C::bActivateCamera' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, CurrentCategory) == 0x0003D2, "Member 'UNPCMenu_C::CurrentCategory' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, SelectedActiveSkillType) == 0x0003D3, "Member 'UNPCMenu_C::SelectedActiveSkillType' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, SelectedCoreUpgradeTier) == 0x0003D4, "Member 'UNPCMenu_C::SelectedCoreUpgradeTier' has a wrong offset!");
static_assert(offsetof(UNPCMenu_C, bPendingTutorialRequest) == 0x0003D8, "Member 'UNPCMenu_C::bPendingTutorialRequest' has a wrong offset!");

}

