#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ObjectiveWidgetBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function ObjectiveWidgetBase.ObjectiveWidgetBase_C.VisibilityEventDispatcher__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ObjectiveWidgetBase_C_VisibilityEventDispatcher__DelegateSignature final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObjectiveWidgetBase_C_VisibilityEventDispatcher__DelegateSignature) == 0x000001, "Wrong alignment on ObjectiveWidgetBase_C_VisibilityEventDispatcher__DelegateSignature");
static_assert(sizeof(ObjectiveWidgetBase_C_VisibilityEventDispatcher__DelegateSignature) == 0x000001, "Wrong size on ObjectiveWidgetBase_C_VisibilityEventDispatcher__DelegateSignature");
static_assert(offsetof(ObjectiveWidgetBase_C_VisibilityEventDispatcher__DelegateSignature, Param_IsVisible) == 0x000000, "Member 'ObjectiveWidgetBase_C_VisibilityEventDispatcher__DelegateSignature::Param_IsVisible' has a wrong offset!");

// Function ObjectiveWidgetBase.ObjectiveWidgetBase_C.ExecuteUbergraph_ObjectiveWidgetBase
// 0x0078 (0x0078 - 0x0000)
struct ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DEC[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UWidgetAnimation*                       CallFunc_GetFadeInAnimation_FadeInAnimation;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetFadeInAnimation_FadeInAnimation_1;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetFadeInAnimation_FadeInAnimation_2;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetRemoveAnimation_RemoveAnimation;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DED[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase) == 0x000008, "Wrong alignment on ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase");
static_assert(sizeof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase) == 0x000078, "Wrong size on ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, EntryPoint) == 0x000000, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, Temp_bool_Variable) == 0x000004, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, Temp_float_Variable) == 0x000018, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, Temp_float_Variable_1) == 0x00001C, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, CallFunc_GetFadeInAnimation_FadeInAnimation) == 0x000030, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::CallFunc_GetFadeInAnimation_FadeInAnimation' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, CallFunc_GetFadeInAnimation_FadeInAnimation_1) == 0x000038, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::CallFunc_GetFadeInAnimation_FadeInAnimation_1' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, CallFunc_GetFadeInAnimation_FadeInAnimation_2) == 0x000040, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::CallFunc_GetFadeInAnimation_FadeInAnimation_2' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, CallFunc_GetRemoveAnimation_RemoveAnimation) == 0x000048, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::CallFunc_GetRemoveAnimation_RemoveAnimation' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, K2Node_Select_Default) == 0x000050, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, CallFunc_PlayAnimationForward_ReturnValue) == 0x000058, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000060, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000068, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'ObjectiveWidgetBase_C_ExecuteUbergraph_ObjectiveWidgetBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ObjectiveWidgetBase.ObjectiveWidgetBase_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct ObjectiveWidgetBase_C_Initialize final
{
public:
	class ARBBaseObjectiveCoordinator*            Coordinator;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ObjectiveWidgetBase_C_Initialize) == 0x000008, "Wrong alignment on ObjectiveWidgetBase_C_Initialize");
static_assert(sizeof(ObjectiveWidgetBase_C_Initialize) == 0x000008, "Wrong size on ObjectiveWidgetBase_C_Initialize");
static_assert(offsetof(ObjectiveWidgetBase_C_Initialize, Coordinator) == 0x000000, "Member 'ObjectiveWidgetBase_C_Initialize::Coordinator' has a wrong offset!");

// Function ObjectiveWidgetBase.ObjectiveWidgetBase_C.UpdateProgress
// 0x0020 (0x0020 - 0x0000)
struct ObjectiveWidgetBase_C_UpdateProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPositiveProgress;                                // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DEE[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ObjectiveText;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(ObjectiveWidgetBase_C_UpdateProgress) == 0x000008, "Wrong alignment on ObjectiveWidgetBase_C_UpdateProgress");
static_assert(sizeof(ObjectiveWidgetBase_C_UpdateProgress) == 0x000020, "Wrong size on ObjectiveWidgetBase_C_UpdateProgress");
static_assert(offsetof(ObjectiveWidgetBase_C_UpdateProgress, Progress) == 0x000000, "Member 'ObjectiveWidgetBase_C_UpdateProgress::Progress' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_UpdateProgress, IsPositiveProgress) == 0x000004, "Member 'ObjectiveWidgetBase_C_UpdateProgress::IsPositiveProgress' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_UpdateProgress, ObjectiveText) == 0x000008, "Member 'ObjectiveWidgetBase_C_UpdateProgress::ObjectiveText' has a wrong offset!");

// Function ObjectiveWidgetBase.ObjectiveWidgetBase_C.GetFadeInAnimation
// 0x0008 (0x0008 - 0x0000)
struct ObjectiveWidgetBase_C_GetFadeInAnimation final
{
public:
	class UWidgetAnimation*                       FadeInAnimation;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ObjectiveWidgetBase_C_GetFadeInAnimation) == 0x000008, "Wrong alignment on ObjectiveWidgetBase_C_GetFadeInAnimation");
static_assert(sizeof(ObjectiveWidgetBase_C_GetFadeInAnimation) == 0x000008, "Wrong size on ObjectiveWidgetBase_C_GetFadeInAnimation");
static_assert(offsetof(ObjectiveWidgetBase_C_GetFadeInAnimation, FadeInAnimation) == 0x000000, "Member 'ObjectiveWidgetBase_C_GetFadeInAnimation::FadeInAnimation' has a wrong offset!");

// Function ObjectiveWidgetBase.ObjectiveWidgetBase_C.GetRemoveAnimation
// 0x0008 (0x0008 - 0x0000)
struct ObjectiveWidgetBase_C_GetRemoveAnimation final
{
public:
	class UWidgetAnimation*                       RemoveAnimation;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ObjectiveWidgetBase_C_GetRemoveAnimation) == 0x000008, "Wrong alignment on ObjectiveWidgetBase_C_GetRemoveAnimation");
static_assert(sizeof(ObjectiveWidgetBase_C_GetRemoveAnimation) == 0x000008, "Wrong size on ObjectiveWidgetBase_C_GetRemoveAnimation");
static_assert(offsetof(ObjectiveWidgetBase_C_GetRemoveAnimation, RemoveAnimation) == 0x000000, "Member 'ObjectiveWidgetBase_C_GetRemoveAnimation::RemoveAnimation' has a wrong offset!");

// Function ObjectiveWidgetBase.ObjectiveWidgetBase_C.IsInValidStateForExtraInfo
// 0x0002 (0x0002 - 0x0000)
struct ObjectiveWidgetBase_C_IsInValidStateForExtraInfo final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObjectiveWidgetBase_C_IsInValidStateForExtraInfo) == 0x000001, "Wrong alignment on ObjectiveWidgetBase_C_IsInValidStateForExtraInfo");
static_assert(sizeof(ObjectiveWidgetBase_C_IsInValidStateForExtraInfo) == 0x000002, "Wrong size on ObjectiveWidgetBase_C_IsInValidStateForExtraInfo");
static_assert(offsetof(ObjectiveWidgetBase_C_IsInValidStateForExtraInfo, ReturnValue) == 0x000000, "Member 'ObjectiveWidgetBase_C_IsInValidStateForExtraInfo::ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_IsInValidStateForExtraInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'ObjectiveWidgetBase_C_IsInValidStateForExtraInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function ObjectiveWidgetBase.ObjectiveWidgetBase_C.ShouldShow
// 0x0002 (0x0002 - 0x0000)
struct ObjectiveWidgetBase_C_ShouldShow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObjectiveWidgetBase_C_ShouldShow) == 0x000001, "Wrong alignment on ObjectiveWidgetBase_C_ShouldShow");
static_assert(sizeof(ObjectiveWidgetBase_C_ShouldShow) == 0x000002, "Wrong size on ObjectiveWidgetBase_C_ShouldShow");
static_assert(offsetof(ObjectiveWidgetBase_C_ShouldShow, ReturnValue) == 0x000000, "Member 'ObjectiveWidgetBase_C_ShouldShow::ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectiveWidgetBase_C_ShouldShow, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'ObjectiveWidgetBase_C_ShouldShow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

