#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OPP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "OPP_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function OPP.RBActiveSkill.Event_OnIsActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct RBActiveSkill_Event_OnIsActiveChanged final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBActiveSkill_Event_OnIsActiveChanged) == 0x000001, "Wrong alignment on RBActiveSkill_Event_OnIsActiveChanged");
static_assert(sizeof(RBActiveSkill_Event_OnIsActiveChanged) == 0x000001, "Wrong size on RBActiveSkill_Event_OnIsActiveChanged");
static_assert(offsetof(RBActiveSkill_Event_OnIsActiveChanged, IsActive) == 0x000000, "Member 'RBActiveSkill_Event_OnIsActiveChanged::IsActive' has a wrong offset!");

// Function OPP.RBActiveSkill.Event_OnIsInCooldownChanged
// 0x0001 (0x0001 - 0x0000)
struct RBActiveSkill_Event_OnIsInCooldownChanged final
{
public:
	bool                                          IsInCooldown;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBActiveSkill_Event_OnIsInCooldownChanged) == 0x000001, "Wrong alignment on RBActiveSkill_Event_OnIsInCooldownChanged");
static_assert(sizeof(RBActiveSkill_Event_OnIsInCooldownChanged) == 0x000001, "Wrong size on RBActiveSkill_Event_OnIsInCooldownChanged");
static_assert(offsetof(RBActiveSkill_Event_OnIsInCooldownChanged, IsInCooldown) == 0x000000, "Member 'RBActiveSkill_Event_OnIsInCooldownChanged::IsInCooldown' has a wrong offset!");

// Function OPP.RBActiveSkill.Event_OnPlayerInitReplicated
// 0x0008 (0x0008 - 0x0000)
struct RBActiveSkill_Event_OnPlayerInitReplicated final
{
public:
	class ARBPlayer*                              Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBActiveSkill_Event_OnPlayerInitReplicated) == 0x000008, "Wrong alignment on RBActiveSkill_Event_OnPlayerInitReplicated");
static_assert(sizeof(RBActiveSkill_Event_OnPlayerInitReplicated) == 0x000008, "Wrong size on RBActiveSkill_Event_OnPlayerInitReplicated");
static_assert(offsetof(RBActiveSkill_Event_OnPlayerInitReplicated, Player) == 0x000000, "Member 'RBActiveSkill_Event_OnPlayerInitReplicated::Player' has a wrong offset!");

// Function OPP.RBActiveSkill.OnActiveSkillCooldownChanged
// 0x0004 (0x0004 - 0x0000)
struct RBActiveSkill_OnActiveSkillCooldownChanged final
{
public:
	float                                         OldValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBActiveSkill_OnActiveSkillCooldownChanged) == 0x000004, "Wrong alignment on RBActiveSkill_OnActiveSkillCooldownChanged");
static_assert(sizeof(RBActiveSkill_OnActiveSkillCooldownChanged) == 0x000004, "Wrong size on RBActiveSkill_OnActiveSkillCooldownChanged");
static_assert(offsetof(RBActiveSkill_OnActiveSkillCooldownChanged, OldValue) == 0x000000, "Member 'RBActiveSkill_OnActiveSkillCooldownChanged::OldValue' has a wrong offset!");

// Function OPP.RBActiveSkill.BP_CanUseSkillInLocation
// 0x0001 (0x0001 - 0x0000)
struct RBActiveSkill_BP_CanUseSkillInLocation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBActiveSkill_BP_CanUseSkillInLocation) == 0x000001, "Wrong alignment on RBActiveSkill_BP_CanUseSkillInLocation");
static_assert(sizeof(RBActiveSkill_BP_CanUseSkillInLocation) == 0x000001, "Wrong size on RBActiveSkill_BP_CanUseSkillInLocation");
static_assert(offsetof(RBActiveSkill_BP_CanUseSkillInLocation, ReturnValue) == 0x000000, "Member 'RBActiveSkill_BP_CanUseSkillInLocation::ReturnValue' has a wrong offset!");

// Function OPP.RBActiveSkill.BP_GetEffectDuration
// 0x0004 (0x0004 - 0x0000)
struct RBActiveSkill_BP_GetEffectDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBActiveSkill_BP_GetEffectDuration) == 0x000004, "Wrong alignment on RBActiveSkill_BP_GetEffectDuration");
static_assert(sizeof(RBActiveSkill_BP_GetEffectDuration) == 0x000004, "Wrong size on RBActiveSkill_BP_GetEffectDuration");
static_assert(offsetof(RBActiveSkill_BP_GetEffectDuration, ReturnValue) == 0x000000, "Member 'RBActiveSkill_BP_GetEffectDuration::ReturnValue' has a wrong offset!");

// Function OPP.RBActiveSkill.BP_GetTotalCooldownTime
// 0x0004 (0x0004 - 0x0000)
struct RBActiveSkill_BP_GetTotalCooldownTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBActiveSkill_BP_GetTotalCooldownTime) == 0x000004, "Wrong alignment on RBActiveSkill_BP_GetTotalCooldownTime");
static_assert(sizeof(RBActiveSkill_BP_GetTotalCooldownTime) == 0x000004, "Wrong size on RBActiveSkill_BP_GetTotalCooldownTime");
static_assert(offsetof(RBActiveSkill_BP_GetTotalCooldownTime, ReturnValue) == 0x000000, "Member 'RBActiveSkill_BP_GetTotalCooldownTime::ReturnValue' has a wrong offset!");

// Function OPP.RBActiveSkill.BP_IsSkillUsageDisabled
// 0x0001 (0x0001 - 0x0000)
struct RBActiveSkill_BP_IsSkillUsageDisabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBActiveSkill_BP_IsSkillUsageDisabled) == 0x000001, "Wrong alignment on RBActiveSkill_BP_IsSkillUsageDisabled");
static_assert(sizeof(RBActiveSkill_BP_IsSkillUsageDisabled) == 0x000001, "Wrong size on RBActiveSkill_BP_IsSkillUsageDisabled");
static_assert(offsetof(RBActiveSkill_BP_IsSkillUsageDisabled, ReturnValue) == 0x000000, "Member 'RBActiveSkill_BP_IsSkillUsageDisabled::ReturnValue' has a wrong offset!");

// Function OPP.RBActiveSkill.GetControllerItem
// 0x0008 (0x0008 - 0x0000)
struct RBActiveSkill_GetControllerItem final
{
public:
	class ARBActiveSkillController*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBActiveSkill_GetControllerItem) == 0x000008, "Wrong alignment on RBActiveSkill_GetControllerItem");
static_assert(sizeof(RBActiveSkill_GetControllerItem) == 0x000008, "Wrong size on RBActiveSkill_GetControllerItem");
static_assert(offsetof(RBActiveSkill_GetControllerItem, ReturnValue) == 0x000000, "Member 'RBActiveSkill_GetControllerItem::ReturnValue' has a wrong offset!");

// Function OPP.RBActiveSkill.GetCooldownRatio
// 0x0004 (0x0004 - 0x0000)
struct RBActiveSkill_GetCooldownRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBActiveSkill_GetCooldownRatio) == 0x000004, "Wrong alignment on RBActiveSkill_GetCooldownRatio");
static_assert(sizeof(RBActiveSkill_GetCooldownRatio) == 0x000004, "Wrong size on RBActiveSkill_GetCooldownRatio");
static_assert(offsetof(RBActiveSkill_GetCooldownRatio, ReturnValue) == 0x000000, "Member 'RBActiveSkill_GetCooldownRatio::ReturnValue' has a wrong offset!");

// Function OPP.RBActiveSkill.GetCooldownTimeRemaining
// 0x0004 (0x0004 - 0x0000)
struct RBActiveSkill_GetCooldownTimeRemaining final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBActiveSkill_GetCooldownTimeRemaining) == 0x000004, "Wrong alignment on RBActiveSkill_GetCooldownTimeRemaining");
static_assert(sizeof(RBActiveSkill_GetCooldownTimeRemaining) == 0x000004, "Wrong size on RBActiveSkill_GetCooldownTimeRemaining");
static_assert(offsetof(RBActiveSkill_GetCooldownTimeRemaining, ReturnValue) == 0x000000, "Member 'RBActiveSkill_GetCooldownTimeRemaining::ReturnValue' has a wrong offset!");

// Function OPP.RBAICondition_Blueprint.Event_EvaluateCondition
// 0x0010 (0x0010 - 0x0000)
struct RBAICondition_Blueprint_Event_EvaluateCondition final
{
public:
	class ARBBot*                                 bot;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A43[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RBAICondition_Blueprint_Event_EvaluateCondition) == 0x000008, "Wrong alignment on RBAICondition_Blueprint_Event_EvaluateCondition");
static_assert(sizeof(RBAICondition_Blueprint_Event_EvaluateCondition) == 0x000010, "Wrong size on RBAICondition_Blueprint_Event_EvaluateCondition");
static_assert(offsetof(RBAICondition_Blueprint_Event_EvaluateCondition, bot) == 0x000000, "Member 'RBAICondition_Blueprint_Event_EvaluateCondition::bot' has a wrong offset!");
static_assert(offsetof(RBAICondition_Blueprint_Event_EvaluateCondition, ReturnValue) == 0x000008, "Member 'RBAICondition_Blueprint_Event_EvaluateCondition::ReturnValue' has a wrong offset!");

// Function OPP.AlignedWrapBox.AddChildWrapBox
// 0x0010 (0x0010 - 0x0000)
struct AlignedWrapBox_AddChildWrapBox final
{
public:
	class UWidget*                                Content;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAlignedWrapBoxSlot*                    ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AlignedWrapBox_AddChildWrapBox) == 0x000008, "Wrong alignment on AlignedWrapBox_AddChildWrapBox");
static_assert(sizeof(AlignedWrapBox_AddChildWrapBox) == 0x000010, "Wrong size on AlignedWrapBox_AddChildWrapBox");
static_assert(offsetof(AlignedWrapBox_AddChildWrapBox, Content) == 0x000000, "Member 'AlignedWrapBox_AddChildWrapBox::Content' has a wrong offset!");
static_assert(offsetof(AlignedWrapBox_AddChildWrapBox, ReturnValue) == 0x000008, "Member 'AlignedWrapBox_AddChildWrapBox::ReturnValue' has a wrong offset!");

// Function OPP.AlignedWrapBox.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct AlignedWrapBox_SetHorizontalAlignment final
{
public:
	EHorizontalAlignment                          InHorizontalAlignment;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AlignedWrapBox_SetHorizontalAlignment) == 0x000001, "Wrong alignment on AlignedWrapBox_SetHorizontalAlignment");
static_assert(sizeof(AlignedWrapBox_SetHorizontalAlignment) == 0x000001, "Wrong size on AlignedWrapBox_SetHorizontalAlignment");
static_assert(offsetof(AlignedWrapBox_SetHorizontalAlignment, InHorizontalAlignment) == 0x000000, "Member 'AlignedWrapBox_SetHorizontalAlignment::InHorizontalAlignment' has a wrong offset!");

// Function OPP.AlignedWrapBox.SetInnerSlotPadding
// 0x0008 (0x0008 - 0x0000)
struct AlignedWrapBox_SetInnerSlotPadding final
{
public:
	struct FVector2D                              InPadding;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AlignedWrapBox_SetInnerSlotPadding) == 0x000004, "Wrong alignment on AlignedWrapBox_SetInnerSlotPadding");
static_assert(sizeof(AlignedWrapBox_SetInnerSlotPadding) == 0x000008, "Wrong size on AlignedWrapBox_SetInnerSlotPadding");
static_assert(offsetof(AlignedWrapBox_SetInnerSlotPadding, InPadding) == 0x000000, "Member 'AlignedWrapBox_SetInnerSlotPadding::InPadding' has a wrong offset!");

// Function OPP.RBAttackDummy.BP_SetLocationFromTimeline
// 0x000C (0x000C - 0x0000)
struct RBAttackDummy_BP_SetLocationFromTimeline final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBAttackDummy_BP_SetLocationFromTimeline) == 0x000004, "Wrong alignment on RBAttackDummy_BP_SetLocationFromTimeline");
static_assert(sizeof(RBAttackDummy_BP_SetLocationFromTimeline) == 0x00000C, "Wrong size on RBAttackDummy_BP_SetLocationFromTimeline");
static_assert(offsetof(RBAttackDummy_BP_SetLocationFromTimeline, NewLocation) == 0x000000, "Member 'RBAttackDummy_BP_SetLocationFromTimeline::NewLocation' has a wrong offset!");

// Function OPP.AlignedWrapBoxSlot.SetFillEmptySpace
// 0x0001 (0x0001 - 0x0000)
struct AlignedWrapBoxSlot_SetFillEmptySpace final
{
public:
	bool                                          InbFillEmptySpace;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AlignedWrapBoxSlot_SetFillEmptySpace) == 0x000001, "Wrong alignment on AlignedWrapBoxSlot_SetFillEmptySpace");
static_assert(sizeof(AlignedWrapBoxSlot_SetFillEmptySpace) == 0x000001, "Wrong size on AlignedWrapBoxSlot_SetFillEmptySpace");
static_assert(offsetof(AlignedWrapBoxSlot_SetFillEmptySpace, InbFillEmptySpace) == 0x000000, "Member 'AlignedWrapBoxSlot_SetFillEmptySpace::InbFillEmptySpace' has a wrong offset!");

// Function OPP.AlignedWrapBoxSlot.SetFillSpanWhenLessThan
// 0x0004 (0x0004 - 0x0000)
struct AlignedWrapBoxSlot_SetFillSpanWhenLessThan final
{
public:
	float                                         InFillSpanWhenLessThan;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AlignedWrapBoxSlot_SetFillSpanWhenLessThan) == 0x000004, "Wrong alignment on AlignedWrapBoxSlot_SetFillSpanWhenLessThan");
static_assert(sizeof(AlignedWrapBoxSlot_SetFillSpanWhenLessThan) == 0x000004, "Wrong size on AlignedWrapBoxSlot_SetFillSpanWhenLessThan");
static_assert(offsetof(AlignedWrapBoxSlot_SetFillSpanWhenLessThan, InFillSpanWhenLessThan) == 0x000000, "Member 'AlignedWrapBoxSlot_SetFillSpanWhenLessThan::InFillSpanWhenLessThan' has a wrong offset!");

// Function OPP.AlignedWrapBoxSlot.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct AlignedWrapBoxSlot_SetHorizontalAlignment final
{
public:
	EHorizontalAlignment                          InHorizontalAlignment;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AlignedWrapBoxSlot_SetHorizontalAlignment) == 0x000001, "Wrong alignment on AlignedWrapBoxSlot_SetHorizontalAlignment");
static_assert(sizeof(AlignedWrapBoxSlot_SetHorizontalAlignment) == 0x000001, "Wrong size on AlignedWrapBoxSlot_SetHorizontalAlignment");
static_assert(offsetof(AlignedWrapBoxSlot_SetHorizontalAlignment, InHorizontalAlignment) == 0x000000, "Member 'AlignedWrapBoxSlot_SetHorizontalAlignment::InHorizontalAlignment' has a wrong offset!");

// Function OPP.AlignedWrapBoxSlot.SetPadding
// 0x0010 (0x0010 - 0x0000)
struct AlignedWrapBoxSlot_SetPadding final
{
public:
	struct FMargin                                InPadding;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AlignedWrapBoxSlot_SetPadding) == 0x000004, "Wrong alignment on AlignedWrapBoxSlot_SetPadding");
static_assert(sizeof(AlignedWrapBoxSlot_SetPadding) == 0x000010, "Wrong size on AlignedWrapBoxSlot_SetPadding");
static_assert(offsetof(AlignedWrapBoxSlot_SetPadding, InPadding) == 0x000000, "Member 'AlignedWrapBoxSlot_SetPadding::InPadding' has a wrong offset!");

// Function OPP.AlignedWrapBoxSlot.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct AlignedWrapBoxSlot_SetVerticalAlignment final
{
public:
	EVerticalAlignment                            InVerticalAlignment;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AlignedWrapBoxSlot_SetVerticalAlignment) == 0x000001, "Wrong alignment on AlignedWrapBoxSlot_SetVerticalAlignment");
static_assert(sizeof(AlignedWrapBoxSlot_SetVerticalAlignment) == 0x000001, "Wrong size on AlignedWrapBoxSlot_SetVerticalAlignment");
static_assert(offsetof(AlignedWrapBoxSlot_SetVerticalAlignment, InVerticalAlignment) == 0x000000, "Member 'AlignedWrapBoxSlot_SetVerticalAlignment::InVerticalAlignment' has a wrong offset!");

// Function OPP.RBOutlineComponent.BP_IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct RBOutlineComponent_BP_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBOutlineComponent_BP_IsEnabled) == 0x000001, "Wrong alignment on RBOutlineComponent_BP_IsEnabled");
static_assert(sizeof(RBOutlineComponent_BP_IsEnabled) == 0x000001, "Wrong size on RBOutlineComponent_BP_IsEnabled");
static_assert(offsetof(RBOutlineComponent_BP_IsEnabled, ReturnValue) == 0x000000, "Member 'RBOutlineComponent_BP_IsEnabled::ReturnValue' has a wrong offset!");

// Function OPP.RBOutlineComponent.BP_SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct RBOutlineComponent_BP_SetEnabled final
{
public:
	bool                                          bEnabledValue;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBOutlineComponent_BP_SetEnabled) == 0x000001, "Wrong alignment on RBOutlineComponent_BP_SetEnabled");
static_assert(sizeof(RBOutlineComponent_BP_SetEnabled) == 0x000001, "Wrong size on RBOutlineComponent_BP_SetEnabled");
static_assert(offsetof(RBOutlineComponent_BP_SetEnabled, bEnabledValue) == 0x000000, "Member 'RBOutlineComponent_BP_SetEnabled::bEnabledValue' has a wrong offset!");

// Function OPP.RBUserWidget.AddToGameViewport
// 0x0004 (0x0004 - 0x0000)
struct RBUserWidget_AddToGameViewport final
{
public:
	int32                                         ZOrder;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBUserWidget_AddToGameViewport) == 0x000004, "Wrong alignment on RBUserWidget_AddToGameViewport");
static_assert(sizeof(RBUserWidget_AddToGameViewport) == 0x000004, "Wrong size on RBUserWidget_AddToGameViewport");
static_assert(offsetof(RBUserWidget_AddToGameViewport, ZOrder) == 0x000000, "Member 'RBUserWidget_AddToGameViewport::ZOrder' has a wrong offset!");

// Function OPP.RBUserWidget.BP_SplitMessageToMultipleLines
// 0x0028 (0x0028 - 0x0000)
struct RBUserWidget_BP_SplitMessageToMultipleLines final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FText>                           ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBUserWidget_BP_SplitMessageToMultipleLines) == 0x000008, "Wrong alignment on RBUserWidget_BP_SplitMessageToMultipleLines");
static_assert(sizeof(RBUserWidget_BP_SplitMessageToMultipleLines) == 0x000028, "Wrong size on RBUserWidget_BP_SplitMessageToMultipleLines");
static_assert(offsetof(RBUserWidget_BP_SplitMessageToMultipleLines, Message) == 0x000000, "Member 'RBUserWidget_BP_SplitMessageToMultipleLines::Message' has a wrong offset!");
static_assert(offsetof(RBUserWidget_BP_SplitMessageToMultipleLines, ReturnValue) == 0x000018, "Member 'RBUserWidget_BP_SplitMessageToMultipleLines::ReturnValue' has a wrong offset!");

// Function OPP.RBUserWidget.Event_InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct RBUserWidget_Event_InputSourceChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBUserWidget_Event_InputSourceChanged) == 0x000001, "Wrong alignment on RBUserWidget_Event_InputSourceChanged");
static_assert(sizeof(RBUserWidget_Event_InputSourceChanged) == 0x000001, "Wrong size on RBUserWidget_Event_InputSourceChanged");
static_assert(offsetof(RBUserWidget_Event_InputSourceChanged, bIsGamepad) == 0x000000, "Member 'RBUserWidget_Event_InputSourceChanged::bIsGamepad' has a wrong offset!");

// Function OPP.RBUserWidget.BP_IsUsingGamepad
// 0x0001 (0x0001 - 0x0000)
struct RBUserWidget_BP_IsUsingGamepad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBUserWidget_BP_IsUsingGamepad) == 0x000001, "Wrong alignment on RBUserWidget_BP_IsUsingGamepad");
static_assert(sizeof(RBUserWidget_BP_IsUsingGamepad) == 0x000001, "Wrong size on RBUserWidget_BP_IsUsingGamepad");
static_assert(offsetof(RBUserWidget_BP_IsUsingGamepad, ReturnValue) == 0x000000, "Member 'RBUserWidget_BP_IsUsingGamepad::ReturnValue' has a wrong offset!");

// Function OPP.RBMenuWidget.BP_GetFocusedWidget
// 0x0008 (0x0008 - 0x0000)
struct RBMenuWidget_BP_GetFocusedWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBMenuWidget_BP_GetFocusedWidget) == 0x000008, "Wrong alignment on RBMenuWidget_BP_GetFocusedWidget");
static_assert(sizeof(RBMenuWidget_BP_GetFocusedWidget) == 0x000008, "Wrong size on RBMenuWidget_BP_GetFocusedWidget");
static_assert(offsetof(RBMenuWidget_BP_GetFocusedWidget, ReturnValue) == 0x000000, "Member 'RBMenuWidget_BP_GetFocusedWidget::ReturnValue' has a wrong offset!");

// Function OPP.RBMenuWidget.BP_PushAndClearTransitionStack
// 0x0001 (0x0001 - 0x0000)
struct RBMenuWidget_BP_PushAndClearTransitionStack final
{
public:
	bool                                          bDoTransition;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBMenuWidget_BP_PushAndClearTransitionStack) == 0x000001, "Wrong alignment on RBMenuWidget_BP_PushAndClearTransitionStack");
static_assert(sizeof(RBMenuWidget_BP_PushAndClearTransitionStack) == 0x000001, "Wrong size on RBMenuWidget_BP_PushAndClearTransitionStack");
static_assert(offsetof(RBMenuWidget_BP_PushAndClearTransitionStack, bDoTransition) == 0x000000, "Member 'RBMenuWidget_BP_PushAndClearTransitionStack::bDoTransition' has a wrong offset!");

// Function OPP.RBMenuWidget.BP_SetFocusedWidget
// 0x0008 (0x0008 - 0x0000)
struct RBMenuWidget_BP_SetFocusedWidget final
{
public:
	class UWidget*                                WidgetToFocus;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBMenuWidget_BP_SetFocusedWidget) == 0x000008, "Wrong alignment on RBMenuWidget_BP_SetFocusedWidget");
static_assert(sizeof(RBMenuWidget_BP_SetFocusedWidget) == 0x000008, "Wrong size on RBMenuWidget_BP_SetFocusedWidget");
static_assert(offsetof(RBMenuWidget_BP_SetFocusedWidget, WidgetToFocus) == 0x000000, "Member 'RBMenuWidget_BP_SetFocusedWidget::WidgetToFocus' has a wrong offset!");

// Function OPP.RBMenuWidget.Event_OnUnfocusMenu
// 0x0001 (0x0001 - 0x0000)
struct RBMenuWidget_Event_OnUnfocusMenu final
{
public:
	bool                                          bShouldHide;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBMenuWidget_Event_OnUnfocusMenu) == 0x000001, "Wrong alignment on RBMenuWidget_Event_OnUnfocusMenu");
static_assert(sizeof(RBMenuWidget_Event_OnUnfocusMenu) == 0x000001, "Wrong size on RBMenuWidget_Event_OnUnfocusMenu");
static_assert(offsetof(RBMenuWidget_Event_OnUnfocusMenu, bShouldHide) == 0x000000, "Member 'RBMenuWidget_Event_OnUnfocusMenu::bShouldHide' has a wrong offset!");

// Function OPP.RBMenuWidget.IsMenuFocused
// 0x0001 (0x0001 - 0x0000)
struct RBMenuWidget_IsMenuFocused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBMenuWidget_IsMenuFocused) == 0x000001, "Wrong alignment on RBMenuWidget_IsMenuFocused");
static_assert(sizeof(RBMenuWidget_IsMenuFocused) == 0x000001, "Wrong size on RBMenuWidget_IsMenuFocused");
static_assert(offsetof(RBMenuWidget_IsMenuFocused, ReturnValue) == 0x000000, "Member 'RBMenuWidget_IsMenuFocused::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.BP_CompleteSingleObjective
// 0x0010 (0x0010 - 0x0000)
struct RBBaseObjectiveCoordinator_BP_CompleteSingleObjective final
{
public:
	class ARBPawn*                                Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ObjectiveActor;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_BP_CompleteSingleObjective) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_BP_CompleteSingleObjective");
static_assert(sizeof(RBBaseObjectiveCoordinator_BP_CompleteSingleObjective) == 0x000010, "Wrong size on RBBaseObjectiveCoordinator_BP_CompleteSingleObjective");
static_assert(offsetof(RBBaseObjectiveCoordinator_BP_CompleteSingleObjective, Player) == 0x000000, "Member 'RBBaseObjectiveCoordinator_BP_CompleteSingleObjective::Player' has a wrong offset!");
static_assert(offsetof(RBBaseObjectiveCoordinator_BP_CompleteSingleObjective, ObjectiveActor) == 0x000008, "Member 'RBBaseObjectiveCoordinator_BP_CompleteSingleObjective::ObjectiveActor' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.CompleteCoordinator
// 0x0001 (0x0001 - 0x0000)
struct RBBaseObjectiveCoordinator_CompleteCoordinator final
{
public:
	bool                                          ForceCompletion;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_CompleteCoordinator) == 0x000001, "Wrong alignment on RBBaseObjectiveCoordinator_CompleteCoordinator");
static_assert(sizeof(RBBaseObjectiveCoordinator_CompleteCoordinator) == 0x000001, "Wrong size on RBBaseObjectiveCoordinator_CompleteCoordinator");
static_assert(offsetof(RBBaseObjectiveCoordinator_CompleteCoordinator, ForceCompletion) == 0x000000, "Member 'RBBaseObjectiveCoordinator_CompleteCoordinator::ForceCompletion' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.Event_OnCleanSingleObjectiveActor
// 0x0008 (0x0008 - 0x0000)
struct RBBaseObjectiveCoordinator_Event_OnCleanSingleObjectiveActor final
{
public:
	class AActor*                                 ObjectiveActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_Event_OnCleanSingleObjectiveActor) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_Event_OnCleanSingleObjectiveActor");
static_assert(sizeof(RBBaseObjectiveCoordinator_Event_OnCleanSingleObjectiveActor) == 0x000008, "Wrong size on RBBaseObjectiveCoordinator_Event_OnCleanSingleObjectiveActor");
static_assert(offsetof(RBBaseObjectiveCoordinator_Event_OnCleanSingleObjectiveActor, ObjectiveActor) == 0x000000, "Member 'RBBaseObjectiveCoordinator_Event_OnCleanSingleObjectiveActor::ObjectiveActor' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.Event_OnCoordinatorStateChanged
// 0x0002 (0x0002 - 0x0000)
struct RBBaseObjectiveCoordinator_Event_OnCoordinatorStateChanged final
{
public:
	EObjectiveCoordinatorState                    OldState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectiveCoordinatorState                    NewState;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_Event_OnCoordinatorStateChanged) == 0x000001, "Wrong alignment on RBBaseObjectiveCoordinator_Event_OnCoordinatorStateChanged");
static_assert(sizeof(RBBaseObjectiveCoordinator_Event_OnCoordinatorStateChanged) == 0x000002, "Wrong size on RBBaseObjectiveCoordinator_Event_OnCoordinatorStateChanged");
static_assert(offsetof(RBBaseObjectiveCoordinator_Event_OnCoordinatorStateChanged, OldState) == 0x000000, "Member 'RBBaseObjectiveCoordinator_Event_OnCoordinatorStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(RBBaseObjectiveCoordinator_Event_OnCoordinatorStateChanged, NewState) == 0x000001, "Member 'RBBaseObjectiveCoordinator_Event_OnCoordinatorStateChanged::NewState' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.Event_OnSetupSingleObjectiveActor
// 0x0008 (0x0008 - 0x0000)
struct RBBaseObjectiveCoordinator_Event_OnSetupSingleObjectiveActor final
{
public:
	class AActor*                                 ObjectiveActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_Event_OnSetupSingleObjectiveActor) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_Event_OnSetupSingleObjectiveActor");
static_assert(sizeof(RBBaseObjectiveCoordinator_Event_OnSetupSingleObjectiveActor) == 0x000008, "Wrong size on RBBaseObjectiveCoordinator_Event_OnSetupSingleObjectiveActor");
static_assert(offsetof(RBBaseObjectiveCoordinator_Event_OnSetupSingleObjectiveActor, ObjectiveActor) == 0x000000, "Member 'RBBaseObjectiveCoordinator_Event_OnSetupSingleObjectiveActor::ObjectiveActor' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.Multicast_OnSingleCompletedObjectiveReverted
// 0x0010 (0x0010 - 0x0000)
struct RBBaseObjectiveCoordinator_Multicast_OnSingleCompletedObjectiveReverted final
{
public:
	class AActor*                                 ObjectiveActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReaddToRemainingList;                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A6B[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RBBaseObjectiveCoordinator_Multicast_OnSingleCompletedObjectiveReverted) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_Multicast_OnSingleCompletedObjectiveReverted");
static_assert(sizeof(RBBaseObjectiveCoordinator_Multicast_OnSingleCompletedObjectiveReverted) == 0x000010, "Wrong size on RBBaseObjectiveCoordinator_Multicast_OnSingleCompletedObjectiveReverted");
static_assert(offsetof(RBBaseObjectiveCoordinator_Multicast_OnSingleCompletedObjectiveReverted, ObjectiveActor) == 0x000000, "Member 'RBBaseObjectiveCoordinator_Multicast_OnSingleCompletedObjectiveReverted::ObjectiveActor' has a wrong offset!");
static_assert(offsetof(RBBaseObjectiveCoordinator_Multicast_OnSingleCompletedObjectiveReverted, bReaddToRemainingList) == 0x000008, "Member 'RBBaseObjectiveCoordinator_Multicast_OnSingleCompletedObjectiveReverted::bReaddToRemainingList' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.Multicast_OnSingleObjectiveCompleted
// 0x0018 (0x0018 - 0x0000)
struct RBBaseObjectiveCoordinator_Multicast_OnSingleObjectiveCompleted final
{
public:
	class AActor*                                 Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ObjectiveActor;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFinalObjective;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveFromRemainingList;                          // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A6C[0x6];                                     // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RBBaseObjectiveCoordinator_Multicast_OnSingleObjectiveCompleted) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_Multicast_OnSingleObjectiveCompleted");
static_assert(sizeof(RBBaseObjectiveCoordinator_Multicast_OnSingleObjectiveCompleted) == 0x000018, "Wrong size on RBBaseObjectiveCoordinator_Multicast_OnSingleObjectiveCompleted");
static_assert(offsetof(RBBaseObjectiveCoordinator_Multicast_OnSingleObjectiveCompleted, Player) == 0x000000, "Member 'RBBaseObjectiveCoordinator_Multicast_OnSingleObjectiveCompleted::Player' has a wrong offset!");
static_assert(offsetof(RBBaseObjectiveCoordinator_Multicast_OnSingleObjectiveCompleted, ObjectiveActor) == 0x000008, "Member 'RBBaseObjectiveCoordinator_Multicast_OnSingleObjectiveCompleted::ObjectiveActor' has a wrong offset!");
static_assert(offsetof(RBBaseObjectiveCoordinator_Multicast_OnSingleObjectiveCompleted, IsFinalObjective) == 0x000010, "Member 'RBBaseObjectiveCoordinator_Multicast_OnSingleObjectiveCompleted::IsFinalObjective' has a wrong offset!");
static_assert(offsetof(RBBaseObjectiveCoordinator_Multicast_OnSingleObjectiveCompleted, bRemoveFromRemainingList) == 0x000011, "Member 'RBBaseObjectiveCoordinator_Multicast_OnSingleObjectiveCompleted::bRemoveFromRemainingList' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.OnEndOfStage
// 0x0058 (0x0058 - 0x0000)
struct RBBaseObjectiveCoordinator_OnEndOfStage final
{
public:
	struct FRBStageID                             StageID;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRBMissionID                           MissionID;                                         // 0x0028(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          IsRestart;                                         // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A6D[0x7];                                     // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RBBaseObjectiveCoordinator_OnEndOfStage) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_OnEndOfStage");
static_assert(sizeof(RBBaseObjectiveCoordinator_OnEndOfStage) == 0x000058, "Wrong size on RBBaseObjectiveCoordinator_OnEndOfStage");
static_assert(offsetof(RBBaseObjectiveCoordinator_OnEndOfStage, StageID) == 0x000000, "Member 'RBBaseObjectiveCoordinator_OnEndOfStage::StageID' has a wrong offset!");
static_assert(offsetof(RBBaseObjectiveCoordinator_OnEndOfStage, MissionID) == 0x000028, "Member 'RBBaseObjectiveCoordinator_OnEndOfStage::MissionID' has a wrong offset!");
static_assert(offsetof(RBBaseObjectiveCoordinator_OnEndOfStage, IsRestart) == 0x000050, "Member 'RBBaseObjectiveCoordinator_OnEndOfStage::IsRestart' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.OnRep_CoordinatorState
// 0x0001 (0x0001 - 0x0000)
struct RBBaseObjectiveCoordinator_OnRep_CoordinatorState final
{
public:
	EObjectiveCoordinatorState                    OldState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_OnRep_CoordinatorState) == 0x000001, "Wrong alignment on RBBaseObjectiveCoordinator_OnRep_CoordinatorState");
static_assert(sizeof(RBBaseObjectiveCoordinator_OnRep_CoordinatorState) == 0x000001, "Wrong size on RBBaseObjectiveCoordinator_OnRep_CoordinatorState");
static_assert(offsetof(RBBaseObjectiveCoordinator_OnRep_CoordinatorState, OldState) == 0x000000, "Member 'RBBaseObjectiveCoordinator_OnRep_CoordinatorState::OldState' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.OnStageReady
// 0x0050 (0x0050 - 0x0000)
struct RBBaseObjectiveCoordinator_OnStageReady final
{
public:
	struct FRBStageID                             StageID;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRBMissionID                           MissionID;                                         // 0x0028(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_OnStageReady) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_OnStageReady");
static_assert(sizeof(RBBaseObjectiveCoordinator_OnStageReady) == 0x000050, "Wrong size on RBBaseObjectiveCoordinator_OnStageReady");
static_assert(offsetof(RBBaseObjectiveCoordinator_OnStageReady, StageID) == 0x000000, "Member 'RBBaseObjectiveCoordinator_OnStageReady::StageID' has a wrong offset!");
static_assert(offsetof(RBBaseObjectiveCoordinator_OnStageReady, MissionID) == 0x000028, "Member 'RBBaseObjectiveCoordinator_OnStageReady::MissionID' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct RBBaseObjectiveCoordinator_SetEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_SetEnabled) == 0x000001, "Wrong alignment on RBBaseObjectiveCoordinator_SetEnabled");
static_assert(sizeof(RBBaseObjectiveCoordinator_SetEnabled) == 0x000001, "Wrong size on RBBaseObjectiveCoordinator_SetEnabled");
static_assert(offsetof(RBBaseObjectiveCoordinator_SetEnabled, Enabled) == 0x000000, "Member 'RBBaseObjectiveCoordinator_SetEnabled::Enabled' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.StartCoordinator
// 0x0001 (0x0001 - 0x0000)
struct RBBaseObjectiveCoordinator_StartCoordinator final
{
public:
	bool                                          bForceSkipDelay;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_StartCoordinator) == 0x000001, "Wrong alignment on RBBaseObjectiveCoordinator_StartCoordinator");
static_assert(sizeof(RBBaseObjectiveCoordinator_StartCoordinator) == 0x000001, "Wrong size on RBBaseObjectiveCoordinator_StartCoordinator");
static_assert(offsetof(RBBaseObjectiveCoordinator_StartCoordinator, bForceSkipDelay) == 0x000000, "Member 'RBBaseObjectiveCoordinator_StartCoordinator::bForceSkipDelay' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.BP_CalculateObjectiveActors
// 0x0010 (0x0010 - 0x0000)
struct RBBaseObjectiveCoordinator_BP_CalculateObjectiveActors final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_BP_CalculateObjectiveActors) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_BP_CalculateObjectiveActors");
static_assert(sizeof(RBBaseObjectiveCoordinator_BP_CalculateObjectiveActors) == 0x000010, "Wrong size on RBBaseObjectiveCoordinator_BP_CalculateObjectiveActors");
static_assert(offsetof(RBBaseObjectiveCoordinator_BP_CalculateObjectiveActors, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_BP_CalculateObjectiveActors::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.BP_GetAllValidPrimaryObjectiveActors
// 0x0010 (0x0010 - 0x0000)
struct RBBaseObjectiveCoordinator_BP_GetAllValidPrimaryObjectiveActors final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_BP_GetAllValidPrimaryObjectiveActors) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_BP_GetAllValidPrimaryObjectiveActors");
static_assert(sizeof(RBBaseObjectiveCoordinator_BP_GetAllValidPrimaryObjectiveActors) == 0x000010, "Wrong size on RBBaseObjectiveCoordinator_BP_GetAllValidPrimaryObjectiveActors");
static_assert(offsetof(RBBaseObjectiveCoordinator_BP_GetAllValidPrimaryObjectiveActors, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_BP_GetAllValidPrimaryObjectiveActors::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.BP_GetAllValidSecondaryObjectiveActors
// 0x0010 (0x0010 - 0x0000)
struct RBBaseObjectiveCoordinator_BP_GetAllValidSecondaryObjectiveActors final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_BP_GetAllValidSecondaryObjectiveActors) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_BP_GetAllValidSecondaryObjectiveActors");
static_assert(sizeof(RBBaseObjectiveCoordinator_BP_GetAllValidSecondaryObjectiveActors) == 0x000010, "Wrong size on RBBaseObjectiveCoordinator_BP_GetAllValidSecondaryObjectiveActors");
static_assert(offsetof(RBBaseObjectiveCoordinator_BP_GetAllValidSecondaryObjectiveActors, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_BP_GetAllValidSecondaryObjectiveActors::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.BP_GetFailedSound
// 0x0008 (0x0008 - 0x0000)
struct RBBaseObjectiveCoordinator_BP_GetFailedSound final
{
public:
	class UAkAudioEvent*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_BP_GetFailedSound) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_BP_GetFailedSound");
static_assert(sizeof(RBBaseObjectiveCoordinator_BP_GetFailedSound) == 0x000008, "Wrong size on RBBaseObjectiveCoordinator_BP_GetFailedSound");
static_assert(offsetof(RBBaseObjectiveCoordinator_BP_GetFailedSound, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_BP_GetFailedSound::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.BP_GetObjectiveLevelText
// 0x0018 (0x0018 - 0x0000)
struct RBBaseObjectiveCoordinator_BP_GetObjectiveLevelText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_BP_GetObjectiveLevelText) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_BP_GetObjectiveLevelText");
static_assert(sizeof(RBBaseObjectiveCoordinator_BP_GetObjectiveLevelText) == 0x000018, "Wrong size on RBBaseObjectiveCoordinator_BP_GetObjectiveLevelText");
static_assert(offsetof(RBBaseObjectiveCoordinator_BP_GetObjectiveLevelText, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_BP_GetObjectiveLevelText::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.BP_GetObjectiveMaxCount
// 0x0004 (0x0004 - 0x0000)
struct RBBaseObjectiveCoordinator_BP_GetObjectiveMaxCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_BP_GetObjectiveMaxCount) == 0x000004, "Wrong alignment on RBBaseObjectiveCoordinator_BP_GetObjectiveMaxCount");
static_assert(sizeof(RBBaseObjectiveCoordinator_BP_GetObjectiveMaxCount) == 0x000004, "Wrong size on RBBaseObjectiveCoordinator_BP_GetObjectiveMaxCount");
static_assert(offsetof(RBBaseObjectiveCoordinator_BP_GetObjectiveMaxCount, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_BP_GetObjectiveMaxCount::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.BP_GetRemainingObjectiveActors
// 0x0010 (0x0010 - 0x0000)
struct RBBaseObjectiveCoordinator_BP_GetRemainingObjectiveActors final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_BP_GetRemainingObjectiveActors) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_BP_GetRemainingObjectiveActors");
static_assert(sizeof(RBBaseObjectiveCoordinator_BP_GetRemainingObjectiveActors) == 0x000010, "Wrong size on RBBaseObjectiveCoordinator_BP_GetRemainingObjectiveActors");
static_assert(offsetof(RBBaseObjectiveCoordinator_BP_GetRemainingObjectiveActors, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_BP_GetRemainingObjectiveActors::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.BP_GetRemainingObjectiveCount
// 0x0004 (0x0004 - 0x0000)
struct RBBaseObjectiveCoordinator_BP_GetRemainingObjectiveCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_BP_GetRemainingObjectiveCount) == 0x000004, "Wrong alignment on RBBaseObjectiveCoordinator_BP_GetRemainingObjectiveCount");
static_assert(sizeof(RBBaseObjectiveCoordinator_BP_GetRemainingObjectiveCount) == 0x000004, "Wrong size on RBBaseObjectiveCoordinator_BP_GetRemainingObjectiveCount");
static_assert(offsetof(RBBaseObjectiveCoordinator_BP_GetRemainingObjectiveCount, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_BP_GetRemainingObjectiveCount::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.BP_ShouldShowObjectiveInHUD
// 0x0001 (0x0001 - 0x0000)
struct RBBaseObjectiveCoordinator_BP_ShouldShowObjectiveInHUD final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_BP_ShouldShowObjectiveInHUD) == 0x000001, "Wrong alignment on RBBaseObjectiveCoordinator_BP_ShouldShowObjectiveInHUD");
static_assert(sizeof(RBBaseObjectiveCoordinator_BP_ShouldShowObjectiveInHUD) == 0x000001, "Wrong size on RBBaseObjectiveCoordinator_BP_ShouldShowObjectiveInHUD");
static_assert(offsetof(RBBaseObjectiveCoordinator_BP_ShouldShowObjectiveInHUD, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_BP_ShouldShowObjectiveInHUD::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.GetCoordinatorName
// 0x0010 (0x0010 - 0x0000)
struct RBBaseObjectiveCoordinator_GetCoordinatorName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_GetCoordinatorName) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_GetCoordinatorName");
static_assert(sizeof(RBBaseObjectiveCoordinator_GetCoordinatorName) == 0x000010, "Wrong size on RBBaseObjectiveCoordinator_GetCoordinatorName");
static_assert(offsetof(RBBaseObjectiveCoordinator_GetCoordinatorName, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_GetCoordinatorName::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.GetCurrentCompletedCount
// 0x0004 (0x0004 - 0x0000)
struct RBBaseObjectiveCoordinator_GetCurrentCompletedCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_GetCurrentCompletedCount) == 0x000004, "Wrong alignment on RBBaseObjectiveCoordinator_GetCurrentCompletedCount");
static_assert(sizeof(RBBaseObjectiveCoordinator_GetCurrentCompletedCount) == 0x000004, "Wrong size on RBBaseObjectiveCoordinator_GetCurrentCompletedCount");
static_assert(offsetof(RBBaseObjectiveCoordinator_GetCurrentCompletedCount, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_GetCurrentCompletedCount::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.GetIntermediateObjectivesData
// 0x0010 (0x0010 - 0x0000)
struct RBBaseObjectiveCoordinator_GetIntermediateObjectivesData final
{
public:
	TArray<struct FIntermediateObjectiveData>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_GetIntermediateObjectivesData) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_GetIntermediateObjectivesData");
static_assert(sizeof(RBBaseObjectiveCoordinator_GetIntermediateObjectivesData) == 0x000010, "Wrong size on RBBaseObjectiveCoordinator_GetIntermediateObjectivesData");
static_assert(offsetof(RBBaseObjectiveCoordinator_GetIntermediateObjectivesData, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_GetIntermediateObjectivesData::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.GetMainObjectiveType
// 0x0001 (0x0001 - 0x0000)
struct RBBaseObjectiveCoordinator_GetMainObjectiveType final
{
public:
	EMainObjectiveType                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_GetMainObjectiveType) == 0x000001, "Wrong alignment on RBBaseObjectiveCoordinator_GetMainObjectiveType");
static_assert(sizeof(RBBaseObjectiveCoordinator_GetMainObjectiveType) == 0x000001, "Wrong size on RBBaseObjectiveCoordinator_GetMainObjectiveType");
static_assert(offsetof(RBBaseObjectiveCoordinator_GetMainObjectiveType, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_GetMainObjectiveType::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.GetMaxCount
// 0x0004 (0x0004 - 0x0000)
struct RBBaseObjectiveCoordinator_GetMaxCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_GetMaxCount) == 0x000004, "Wrong alignment on RBBaseObjectiveCoordinator_GetMaxCount");
static_assert(sizeof(RBBaseObjectiveCoordinator_GetMaxCount) == 0x000004, "Wrong size on RBBaseObjectiveCoordinator_GetMaxCount");
static_assert(offsetof(RBBaseObjectiveCoordinator_GetMaxCount, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_GetMaxCount::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.GetObjectiveWidgetIcon
// 0x0008 (0x0008 - 0x0000)
struct RBBaseObjectiveCoordinator_GetObjectiveWidgetIcon final
{
public:
	class UTexture2D*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_GetObjectiveWidgetIcon) == 0x000008, "Wrong alignment on RBBaseObjectiveCoordinator_GetObjectiveWidgetIcon");
static_assert(sizeof(RBBaseObjectiveCoordinator_GetObjectiveWidgetIcon) == 0x000008, "Wrong size on RBBaseObjectiveCoordinator_GetObjectiveWidgetIcon");
static_assert(offsetof(RBBaseObjectiveCoordinator_GetObjectiveWidgetIcon, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_GetObjectiveWidgetIcon::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.HasIntermediateObjectiveText
// 0x0001 (0x0001 - 0x0000)
struct RBBaseObjectiveCoordinator_HasIntermediateObjectiveText final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_HasIntermediateObjectiveText) == 0x000001, "Wrong alignment on RBBaseObjectiveCoordinator_HasIntermediateObjectiveText");
static_assert(sizeof(RBBaseObjectiveCoordinator_HasIntermediateObjectiveText) == 0x000001, "Wrong size on RBBaseObjectiveCoordinator_HasIntermediateObjectiveText");
static_assert(offsetof(RBBaseObjectiveCoordinator_HasIntermediateObjectiveText, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_HasIntermediateObjectiveText::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.IsCompleted
// 0x0001 (0x0001 - 0x0000)
struct RBBaseObjectiveCoordinator_IsCompleted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_IsCompleted) == 0x000001, "Wrong alignment on RBBaseObjectiveCoordinator_IsCompleted");
static_assert(sizeof(RBBaseObjectiveCoordinator_IsCompleted) == 0x000001, "Wrong size on RBBaseObjectiveCoordinator_IsCompleted");
static_assert(offsetof(RBBaseObjectiveCoordinator_IsCompleted, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_IsCompleted::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.IsDisabled
// 0x0001 (0x0001 - 0x0000)
struct RBBaseObjectiveCoordinator_IsDisabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_IsDisabled) == 0x000001, "Wrong alignment on RBBaseObjectiveCoordinator_IsDisabled");
static_assert(sizeof(RBBaseObjectiveCoordinator_IsDisabled) == 0x000001, "Wrong size on RBBaseObjectiveCoordinator_IsDisabled");
static_assert(offsetof(RBBaseObjectiveCoordinator_IsDisabled, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_IsDisabled::ReturnValue' has a wrong offset!");

// Function OPP.RBBaseObjectiveCoordinator.IsFinalObjective
// 0x0001 (0x0001 - 0x0000)
struct RBBaseObjectiveCoordinator_IsFinalObjective final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RBBaseObjectiveCoordinator_IsFinalObjective) == 0x000001, "Wrong alignment on RBBaseObjectiveCoordinator_IsFinalObjective");
static_assert(sizeof(RBBaseObjectiveCoordinator_IsFinalObjective) == 0x000001, "Wrong size on RBBaseObjectiveCoordinator_IsFinalObjective");
static_assert(offsetof(RBBaseObjectiveCoordinator_IsFinalObjective, ReturnValue) == 0x000000, "Member 'RBBaseObjectiveCoordinator_IsFinalObjective::ReturnValue' has a wrong offset!");

