#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsCategory

#include "Basic.hpp"


namespace SDK::Params
{

// Function OptionsCategory.OptionsCategory_C.Init
// 0x0068 (0x0068 - 0x0000)
struct OptionsCategory_C_Init final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E7F[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E80[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E81[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0050(0x0018)()
};
static_assert(alignof(OptionsCategory_C_Init) == 0x000008, "Wrong alignment on OptionsCategory_C_Init");
static_assert(sizeof(OptionsCategory_C_Init) == 0x000068, "Wrong size on OptionsCategory_C_Init");
static_assert(offsetof(OptionsCategory_C_Init, Title) == 0x000000, "Member 'OptionsCategory_C_Init::Title' has a wrong offset!");
static_assert(offsetof(OptionsCategory_C_Init, Temp_bool_Variable) == 0x000018, "Member 'OptionsCategory_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsCategory_C_Init, Temp_text_Variable) == 0x000020, "Member 'OptionsCategory_C_Init::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(OptionsCategory_C_Init, CallFunc_IsConsole_ReturnValue) == 0x000038, "Member 'OptionsCategory_C_Init::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsCategory_C_Init, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000040, "Member 'OptionsCategory_C_Init::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsCategory_C_Init, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000048, "Member 'OptionsCategory_C_Init::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsCategory_C_Init, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'OptionsCategory_C_Init::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsCategory_C_Init, K2Node_Select_Default) == 0x000050, "Member 'OptionsCategory_C_Init::K2Node_Select_Default' has a wrong offset!");

}

