#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function OptionsMenu.OptionsMenu_C.ExecuteUbergraph_OptionsMenu
// 0x0198 (0x0198 - 0x0000)
struct OptionsMenu_C_ExecuteUbergraph_OptionsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button_2;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button_1;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuOptionsTab*                      K2Node_DynamicCast_AsRB_Menu_Options_Tab;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuOptionsTab*                      K2Node_DynamicCast_AsRB_Menu_Options_Tab_1;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsResettingToDefault_ReturnValue;         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOptionsTab_C*                          CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuWidget*                          CallFunc_BP_GetCurrentPage_ReturnValue;            // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuBrightnessCalibration*           K2Node_DynamicCast_AsRB_Menu_Brightness_Calibration; // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPopUpConfirmCancelWidget*            K2Node_DynamicCast_AsRB_Pop_Up_Confirm_Cancel_Widget; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_previousIndex;                        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_2;            // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOptionsTab_C*                          K2Node_DynamicCast_AsOptions_Tab;                  // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsGamepad;                           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidget*                          CallFunc_GetFirstFocusableUserWidgetChild_ReturnValue; // 0x0120(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOptionsTab_C*                          CallFunc_Array_Get_Item_1;                         // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuOptionsEntry*                    CallFunc_Array_Get_Item_2;                         // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue;        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue_1;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue_1;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuWidget*                          CallFunc_BP_GetCurrentPage_ReturnValue_1;          // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuBrightnessCalibration*           K2Node_DynamicCast_AsRB_Menu_Brightness_Calibration_1; // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu) == 0x000008, "Wrong alignment on OptionsMenu_C_ExecuteUbergraph_OptionsMenu");
static_assert(sizeof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu) == 0x000198, "Wrong size on OptionsMenu_C_ExecuteUbergraph_OptionsMenu");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, EntryPoint) == 0x000000, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Loop_Counter_Variable_2) == 0x000044, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Add_IntInt_ReturnValue_2) == 0x00004C, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Array_Index_Variable_1) == 0x000050, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, Temp_int_Array_Index_Variable_2) == 0x000054, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_Event_IsDesignTime) == 0x000058, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_ComponentBoundEvent_Button_2) == 0x000060, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_ComponentBoundEvent_Button_1) == 0x000068, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_ComponentBoundEvent_Button) == 0x000070, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetActiveWidget_ReturnValue) == 0x000078, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000080, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsRB_Menu_Options_Tab) == 0x000088, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsRB_Menu_Options_Tab' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsRB_Menu_Options_Tab_1) == 0x000098, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsRB_Menu_Options_Tab_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_IsResettingToDefault_ReturnValue) == 0x0000A1, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_IsResettingToDefault_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000A8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000B0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000C0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetMenuManager_ReturnValue) == 0x0000C8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_BP_GetCurrentPage_ReturnValue) == 0x0000D8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_BP_GetCurrentPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsRB_Menu_Brightness_Calibration) == 0x0000E0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsRB_Menu_Brightness_Calibration' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess_2) == 0x0000E8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsRB_Pop_Up_Confirm_Cancel_Widget) == 0x0000F0, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsRB_Pop_Up_Confirm_Cancel_Widget' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Array_Length_ReturnValue) == 0x0000FC, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_Event_previousIndex) == 0x000100, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_Event_previousIndex' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000104, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetActiveWidget_ReturnValue_2) == 0x000108, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetActiveWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsOptions_Tab) == 0x000110, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsOptions_Tab' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess_4) == 0x000118, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_Event_bIsGamepad) == 0x000119, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_Event_bIsGamepad' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetFirstFocusableUserWidgetChild_ReturnValue) == 0x000120, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetFirstFocusableUserWidgetChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_IsValid_ReturnValue_1) == 0x000128, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000130, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Array_Get_Item_1) == 0x000138, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Array_Length_ReturnValue_1) == 0x000140, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Less_IntInt_ReturnValue_1) == 0x000144, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Array_Get_Item_2) == 0x000148, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Array_Length_ReturnValue_2) == 0x000150, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_Less_IntInt_ReturnValue_2) == 0x000154, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetRBGameModeMainMenu_ReturnValue) == 0x000158, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetRBGameModeMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_IsValid_ReturnValue_2) == 0x000160, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000161, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetRBGameModeMainMenu_ReturnValue_1) == 0x000168, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetRBGameModeMainMenu_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000170, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_GetMenuManager_ReturnValue_1) == 0x000178, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_GetMenuManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, CallFunc_BP_GetCurrentPage_ReturnValue_1) == 0x000180, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::CallFunc_BP_GetCurrentPage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_AsRB_Menu_Brightness_Calibration_1) == 0x000188, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_AsRB_Menu_Brightness_Calibration_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteUbergraph_OptionsMenu, K2Node_DynamicCast_bSuccess_5) == 0x000190, "Member 'OptionsMenu_C_ExecuteUbergraph_OptionsMenu::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Event_InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenu_C_Event_InputSourceChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_Event_InputSourceChanged) == 0x000001, "Wrong alignment on OptionsMenu_C_Event_InputSourceChanged");
static_assert(sizeof(OptionsMenu_C_Event_InputSourceChanged) == 0x000001, "Wrong size on OptionsMenu_C_Event_InputSourceChanged");
static_assert(offsetof(OptionsMenu_C_Event_InputSourceChanged, bIsGamepad) == 0x000000, "Member 'OptionsMenu_C_Event_InputSourceChanged::bIsGamepad' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Event_OnMenuTabSwitched
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenu_C_Event_OnMenuTabSwitched final
{
public:
	int32                                         PreviousIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_Event_OnMenuTabSwitched) == 0x000004, "Wrong alignment on OptionsMenu_C_Event_OnMenuTabSwitched");
static_assert(sizeof(OptionsMenu_C_Event_OnMenuTabSwitched) == 0x000004, "Wrong size on OptionsMenu_C_Event_OnMenuTabSwitched");
static_assert(offsetof(OptionsMenu_C_Event_OnMenuTabSwitched, PreviousIndex) == 0x000000, "Member 'OptionsMenu_C_Event_OnMenuTabSwitched::PreviousIndex' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenu_C_BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenu_C_BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(sizeof(OptionsMenu_C_BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong size on OptionsMenu_C_BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(offsetof(OptionsMenu_C_BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'OptionsMenu_C_BndEvt__RBMenuButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.BndEvt__RBMenuButton_177_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenu_C_BndEvt__RBMenuButton_177_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_BndEvt__RBMenuButton_177_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenu_C_BndEvt__RBMenuButton_177_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(OptionsMenu_C_BndEvt__RBMenuButton_177_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong size on OptionsMenu_C_BndEvt__RBMenuButton_177_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(OptionsMenu_C_BndEvt__RBMenuButton_177_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'OptionsMenu_C_BndEvt__RBMenuButton_177_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.BndEvt__RBMenuButton_83_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenu_C_BndEvt__RBMenuButton_83_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_BndEvt__RBMenuButton_83_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on OptionsMenu_C_BndEvt__RBMenuButton_83_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(OptionsMenu_C_BndEvt__RBMenuButton_83_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on OptionsMenu_C_BndEvt__RBMenuButton_83_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(OptionsMenu_C_BndEvt__RBMenuButton_83_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'OptionsMenu_C_BndEvt__RBMenuButton_83_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_PreConstruct) == 0x000001, "Wrong alignment on OptionsMenu_C_PreConstruct");
static_assert(sizeof(OptionsMenu_C_PreConstruct) == 0x000001, "Wrong size on OptionsMenu_C_PreConstruct");
static_assert(offsetof(OptionsMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'OptionsMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.ExecuteChangesDecision
// 0x0018 (0x0018 - 0x0000)
struct OptionsMenu_C_ExecuteChangesDecision final
{
public:
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuOptionsTab*                      K2Node_DynamicCast_AsRB_Menu_Options_Tab;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_ExecuteChangesDecision) == 0x000008, "Wrong alignment on OptionsMenu_C_ExecuteChangesDecision");
static_assert(sizeof(OptionsMenu_C_ExecuteChangesDecision) == 0x000018, "Wrong size on OptionsMenu_C_ExecuteChangesDecision");
static_assert(offsetof(OptionsMenu_C_ExecuteChangesDecision, CallFunc_GetActiveWidget_ReturnValue) == 0x000000, "Member 'OptionsMenu_C_ExecuteChangesDecision::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteChangesDecision, K2Node_DynamicCast_AsRB_Menu_Options_Tab) == 0x000008, "Member 'OptionsMenu_C_ExecuteChangesDecision::K2Node_DynamicCast_AsRB_Menu_Options_Tab' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ExecuteChangesDecision, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'OptionsMenu_C_ExecuteChangesDecision::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.OnSubButtonClicked
// 0x0048 (0x0048 - 0x0000)
struct OptionsMenu_C_OnSubButtonClicked final
{
public:
	class URBMenuOptionsEntry*                    Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousIndex;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMenuClassBeenPushedAlready_ReturnValue; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UControllerMappingMenu_C*               CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMenuClassBeenPushedAlready_ReturnValue_1; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputBindingsMenu_C*                   CallFunc_Create_ReturnValue_1;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMenuClassBeenPushedAlready_ReturnValue_2; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBrightnessCalibrationMenu_C*           CallFunc_Create_ReturnValue_2;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGameUserSettings*                    CallFunc_GetRBGameUserSettings_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHDRCurrentlyEnabled_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ConditionalShowApplyDialog_Return;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_OnSubButtonClicked) == 0x000008, "Wrong alignment on OptionsMenu_C_OnSubButtonClicked");
static_assert(sizeof(OptionsMenu_C_OnSubButtonClicked) == 0x000048, "Wrong size on OptionsMenu_C_OnSubButtonClicked");
static_assert(offsetof(OptionsMenu_C_OnSubButtonClicked, Entry) == 0x000000, "Member 'OptionsMenu_C_OnSubButtonClicked::Entry' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnSubButtonClicked, PreviousIndex) == 0x000008, "Member 'OptionsMenu_C_OnSubButtonClicked::PreviousIndex' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnSubButtonClicked, CallFunc_HasMenuClassBeenPushedAlready_ReturnValue) == 0x00000C, "Member 'OptionsMenu_C_OnSubButtonClicked::CallFunc_HasMenuClassBeenPushedAlready_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnSubButtonClicked, CallFunc_Create_ReturnValue) == 0x000010, "Member 'OptionsMenu_C_OnSubButtonClicked::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnSubButtonClicked, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'OptionsMenu_C_OnSubButtonClicked::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnSubButtonClicked, CallFunc_HasMenuClassBeenPushedAlready_ReturnValue_1) == 0x000019, "Member 'OptionsMenu_C_OnSubButtonClicked::CallFunc_HasMenuClassBeenPushedAlready_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnSubButtonClicked, CallFunc_Create_ReturnValue_1) == 0x000020, "Member 'OptionsMenu_C_OnSubButtonClicked::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnSubButtonClicked, CallFunc_HasMenuClassBeenPushedAlready_ReturnValue_2) == 0x000028, "Member 'OptionsMenu_C_OnSubButtonClicked::CallFunc_HasMenuClassBeenPushedAlready_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnSubButtonClicked, CallFunc_Create_ReturnValue_2) == 0x000030, "Member 'OptionsMenu_C_OnSubButtonClicked::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnSubButtonClicked, CallFunc_GetRBGameUserSettings_ReturnValue) == 0x000038, "Member 'OptionsMenu_C_OnSubButtonClicked::CallFunc_GetRBGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnSubButtonClicked, CallFunc_IsHDRCurrentlyEnabled_ReturnValue) == 0x000040, "Member 'OptionsMenu_C_OnSubButtonClicked::CallFunc_IsHDRCurrentlyEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_OnSubButtonClicked, CallFunc_ConditionalShowApplyDialog_Return) == 0x000041, "Member 'OptionsMenu_C_OnSubButtonClicked::CallFunc_ConditionalShowApplyDialog_Return' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Event_UpdateNavigation
// 0x0068 (0x0068 - 0x0000)
struct OptionsMenu_C_Event_UpdateNavigation final
{
public:
	bool                                          CanExitMenu_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0048(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_Event_UpdateNavigation) == 0x000008, "Wrong alignment on OptionsMenu_C_Event_UpdateNavigation");
static_assert(sizeof(OptionsMenu_C_Event_UpdateNavigation) == 0x000068, "Wrong size on OptionsMenu_C_Event_UpdateNavigation");
static_assert(offsetof(OptionsMenu_C_Event_UpdateNavigation, CanExitMenu_0) == 0x000000, "Member 'OptionsMenu_C_Event_UpdateNavigation::CanExitMenu_0' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Event_UpdateNavigation, Temp_bool_Variable) == 0x000001, "Member 'OptionsMenu_C_Event_UpdateNavigation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Event_UpdateNavigation, Temp_text_Variable) == 0x000008, "Member 'OptionsMenu_C_Event_UpdateNavigation::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Event_UpdateNavigation, Temp_text_Variable_1) == 0x000020, "Member 'OptionsMenu_C_Event_UpdateNavigation::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Event_UpdateNavigation, CallFunc_GetRBGameModeMainMenu_ReturnValue) == 0x000038, "Member 'OptionsMenu_C_Event_UpdateNavigation::CallFunc_GetRBGameModeMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Event_UpdateNavigation, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'OptionsMenu_C_Event_UpdateNavigation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Event_UpdateNavigation, K2Node_Select_Default) == 0x000048, "Member 'OptionsMenu_C_Event_UpdateNavigation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Event_UpdateNavigation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000060, "Member 'OptionsMenu_C_Event_UpdateNavigation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.PreNavigationChangeAction
// 0x0003 (0x0003 - 0x0000)
struct OptionsMenu_C_PreNavigationChangeAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ConditionalShowApplyDialog_Return;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_PreNavigationChangeAction) == 0x000001, "Wrong alignment on OptionsMenu_C_PreNavigationChangeAction");
static_assert(sizeof(OptionsMenu_C_PreNavigationChangeAction) == 0x000003, "Wrong size on OptionsMenu_C_PreNavigationChangeAction");
static_assert(offsetof(OptionsMenu_C_PreNavigationChangeAction, ReturnValue) == 0x000000, "Member 'OptionsMenu_C_PreNavigationChangeAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_PreNavigationChangeAction, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000001, "Member 'OptionsMenu_C_PreNavigationChangeAction::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_PreNavigationChangeAction, CallFunc_ConditionalShowApplyDialog_Return) == 0x000002, "Member 'OptionsMenu_C_PreNavigationChangeAction::CallFunc_ConditionalShowApplyDialog_Return' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Get_ApplyChangeBtn_Visibility_0
// 0x0020 (0x0020 - 0x0000)
struct OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuOptionsTab*                      K2Node_DynamicCast_AsRB_Menu_Options_Tab;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasUnsavedChanges_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0) == 0x000008, "Wrong alignment on OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0");
static_assert(sizeof(OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0) == 0x000020, "Wrong size on OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0");
static_assert(offsetof(OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0, ReturnValue) == 0x000000, "Member 'OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0, Temp_bool_Variable) == 0x000001, "Member 'OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0, Temp_byte_Variable) == 0x000002, "Member 'OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0, Temp_byte_Variable_1) == 0x000003, "Member 'OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0, K2Node_DynamicCast_AsRB_Menu_Options_Tab) == 0x000010, "Member 'OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0::K2Node_DynamicCast_AsRB_Menu_Options_Tab' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0, CallFunc_HasUnsavedChanges_ReturnValue) == 0x000019, "Member 'OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0::CallFunc_HasUnsavedChanges_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0, K2Node_Select_Default) == 0x00001A, "Member 'OptionsMenu_C_Get_ApplyChangeBtn_Visibility_0::K2Node_Select_Default' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.ConditionalShowApplyDialog
// 0x0068 (0x0068 - 0x0000)
struct OptionsMenu_C_ConditionalShowApplyDialog final
{
public:
	class FText                                   Prompt;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Return;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPopUpConfirmCancelWidget*            CallFunc_CreatePopUpConfirmCancel_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuOptionsTab*                      K2Node_DynamicCast_AsRB_Menu_Options_Tab;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasUnsavedChanges_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_ConditionalShowApplyDialog) == 0x000008, "Wrong alignment on OptionsMenu_C_ConditionalShowApplyDialog");
static_assert(sizeof(OptionsMenu_C_ConditionalShowApplyDialog) == 0x000068, "Wrong size on OptionsMenu_C_ConditionalShowApplyDialog");
static_assert(offsetof(OptionsMenu_C_ConditionalShowApplyDialog, Prompt) == 0x000000, "Member 'OptionsMenu_C_ConditionalShowApplyDialog::Prompt' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ConditionalShowApplyDialog, Return) == 0x000018, "Member 'OptionsMenu_C_ConditionalShowApplyDialog::Return' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ConditionalShowApplyDialog, CallFunc_CreatePopUpConfirmCancel_ReturnValue) == 0x000020, "Member 'OptionsMenu_C_ConditionalShowApplyDialog::CallFunc_CreatePopUpConfirmCancel_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ConditionalShowApplyDialog, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'OptionsMenu_C_ConditionalShowApplyDialog::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ConditionalShowApplyDialog, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'OptionsMenu_C_ConditionalShowApplyDialog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ConditionalShowApplyDialog, CallFunc_GetActiveWidget_ReturnValue) == 0x000040, "Member 'OptionsMenu_C_ConditionalShowApplyDialog::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ConditionalShowApplyDialog, K2Node_DynamicCast_AsRB_Menu_Options_Tab) == 0x000048, "Member 'OptionsMenu_C_ConditionalShowApplyDialog::K2Node_DynamicCast_AsRB_Menu_Options_Tab' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ConditionalShowApplyDialog, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'OptionsMenu_C_ConditionalShowApplyDialog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ConditionalShowApplyDialog, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'OptionsMenu_C_ConditionalShowApplyDialog::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ConditionalShowApplyDialog, CallFunc_HasUnsavedChanges_ReturnValue) == 0x000064, "Member 'OptionsMenu_C_ConditionalShowApplyDialog::CallFunc_HasUnsavedChanges_ReturnValue' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.CreateOptionTabs
// 0x0288 (0x0288 - 0x0000)
struct OptionsMenu_C_CreateOptionTabs final
{
public:
	bool                                          HasOneValidEntry;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URBMenuOptionsEntry*>            CurrentCategoriesEntries;                          // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         CurrentTabIndex;                                   // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptionsCategory_C*                     CurrentCategory;                                   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOptionsTab_C*                          CurrentTab;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptionsCategory_C*                     CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
