#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OrientedDecalActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass OrientedDecalActor.OrientedDecalActor_C
// 0x0018 (0x0258 - 0x0240)
class AOrientedDecalActor_C : public ADecalActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInterface*                     OrientedDecalMaterial;                             // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_OrientedDecalActor(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetState(bool bStateA);
	void SetShouldBeIgnoredForLots(bool bValue);
	void PrepareState(bool bStateA, class AActor* RandomOwner);
	void UserConstructionScript();
	void CreateDynamicOrientedMaterial();
	bool GetStateName(class FString* StateA, class FString* StateB);

	bool ShouldBeIgnoredForLots() const;
	bool IsStateA() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OrientedDecalActor_C">();
	}
	static class AOrientedDecalActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOrientedDecalActor_C>();
	}
};
static_assert(alignof(AOrientedDecalActor_C) == 0x000008, "Wrong alignment on AOrientedDecalActor_C");
static_assert(sizeof(AOrientedDecalActor_C) == 0x000258, "Wrong size on AOrientedDecalActor_C");
static_assert(offsetof(AOrientedDecalActor_C, UberGraphFrame) == 0x000240, "Member 'AOrientedDecalActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AOrientedDecalActor_C, OrientedDecalMaterial) == 0x000248, "Member 'AOrientedDecalActor_C::OrientedDecalMaterial' has a wrong offset!");
static_assert(offsetof(AOrientedDecalActor_C, DynamicMaterial) == 0x000250, "Member 'AOrientedDecalActor_C::DynamicMaterial' has a wrong offset!");

}

