#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OverheadInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OverheadInfo.OverheadInfo_C
// 0x0060 (0x03B8 - 0x0358)
class UOverheadInfo_C final : public URBHUDOverheadInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ClassIcon;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ClassIconSizeBox;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               HealthBox;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateHealthBar_C*                       MateHealthBar;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MateInfosBox;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MateName;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         NameHBox;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ObjectiveItemsBox;                                 // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TradeItem;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVoiceChatOverheadWidget_C*             VoiceChatOverheadWidget;                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsFadingOut_0;                                    // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_OverheadInfo(int32 EntryPoint);
	void Event_Hide();
	void Event_Show();
	void Construct();
	void UpdateTradeItem();
	void SetImposterName(const class FString& CopiedName);
	void InithHealthBarVisibility();
	void UpdatePartyState();
	void UpdateElementVisibility();
	void UpdateActiveSkillType();
	void UpdateDistanceEffects_DEPRECATED_NOT_USED();
	void UpdateDisplay_old_DEPRECATED_NOT_USED();
	void Event_HUDSettingsUpdated();
	void Event_PlayerPartyStateUpdated();
	void Event_CurrentLoadoutChanged();
	void Event_PlayerMaxHealthChanged(float NewMaxHealth);
	void Event_PlayerIndicatorTypeChanged(EPlayerIndicatorType PlayerIndicatorType);
	void Event_PlayerStateUpdated();
	void Event_ImposterUpdated();
	void Event_PlayerHealthChanged(float NewHealth, bool bSkipAnims);
	void Event_InventoryUpdated(EInventoryUpdateEventType InventoryEventType);
	void UpdateActiveSkillIconDisplay(EActiveSkillType Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OverheadInfo_C">();
	}
	static class UOverheadInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOverheadInfo_C>();
	}
};
static_assert(alignof(UOverheadInfo_C) == 0x000008, "Wrong alignment on UOverheadInfo_C");
static_assert(sizeof(UOverheadInfo_C) == 0x0003B8, "Wrong size on UOverheadInfo_C");
static_assert(offsetof(UOverheadInfo_C, UberGraphFrame) == 0x000358, "Member 'UOverheadInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOverheadInfo_C, ClassIcon) == 0x000360, "Member 'UOverheadInfo_C::ClassIcon' has a wrong offset!");
static_assert(offsetof(UOverheadInfo_C, ClassIconSizeBox) == 0x000368, "Member 'UOverheadInfo_C::ClassIconSizeBox' has a wrong offset!");
static_assert(offsetof(UOverheadInfo_C, HealthBox) == 0x000370, "Member 'UOverheadInfo_C::HealthBox' has a wrong offset!");
static_assert(offsetof(UOverheadInfo_C, MateHealthBar) == 0x000378, "Member 'UOverheadInfo_C::MateHealthBar' has a wrong offset!");
static_assert(offsetof(UOverheadInfo_C, MateInfosBox) == 0x000380, "Member 'UOverheadInfo_C::MateInfosBox' has a wrong offset!");
static_assert(offsetof(UOverheadInfo_C, MateName) == 0x000388, "Member 'UOverheadInfo_C::MateName' has a wrong offset!");
static_assert(offsetof(UOverheadInfo_C, NameHBox) == 0x000390, "Member 'UOverheadInfo_C::NameHBox' has a wrong offset!");
static_assert(offsetof(UOverheadInfo_C, ObjectiveItemsBox) == 0x000398, "Member 'UOverheadInfo_C::ObjectiveItemsBox' has a wrong offset!");
static_assert(offsetof(UOverheadInfo_C, TradeItem) == 0x0003A0, "Member 'UOverheadInfo_C::TradeItem' has a wrong offset!");
static_assert(offsetof(UOverheadInfo_C, VoiceChatOverheadWidget) == 0x0003A8, "Member 'UOverheadInfo_C::VoiceChatOverheadWidget' has a wrong offset!");
static_assert(offsetof(UOverheadInfo_C, bIsFadingOut_0) == 0x0003B0, "Member 'UOverheadInfo_C::bIsFadingOut_0' has a wrong offset!");

}

