#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaintBombMinus01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PaintBomb-01_BP.PaintBomb-01_BP_C.ExecuteUbergraph_PaintBomb-01_BP
// 0x02C8 (0x02C8 - 0x0000)
struct PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Duration_1;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Radius_2;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_TriggeringPawn;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B1[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B2[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Duration;                       // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Radius_1;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B3[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Time;                           // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Radius;                         // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B4[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0184(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0194(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B5[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x01A8(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x01B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B6[0x1];                                     // 0x0243(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B7[0x4];                                     // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP) == 0x000008, "Wrong alignment on PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP");
static_assert(sizeof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP) == 0x0002C8, "Wrong size on PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, EntryPoint) == 0x000000, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, K2Node_CustomEvent_Duration_1) == 0x000010, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::K2Node_CustomEvent_Duration_1' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, K2Node_CustomEvent_Radius_2) == 0x000014, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::K2Node_CustomEvent_Radius_2' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, K2Node_CustomEvent_Color) == 0x000018, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::K2Node_CustomEvent_Color' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, K2Node_CustomEvent_TriggeringPawn) == 0x000028, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::K2Node_CustomEvent_TriggeringPawn' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00004C, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000058, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_Add_VectorVector_ReturnValue) == 0x000064, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, Temp_int_Loop_Counter_Variable_1) == 0x000074, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_Array_Get_Item) == 0x000080, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x00008C, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, K2Node_CustomEvent_Duration) == 0x000094, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, K2Node_CustomEvent_Radius_1) == 0x000098, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::K2Node_CustomEvent_Radius_1' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000A0, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_MakeVector_ReturnValue_1) == 0x0000A8, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000B4, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000C0, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_MakeVector_ReturnValue_2) == 0x000148, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000154, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, K2Node_CustomEvent_Time) == 0x000158, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::K2Node_CustomEvent_Time' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, K2Node_CustomEvent_Radius) == 0x00015C, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::K2Node_CustomEvent_Radius' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000160, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, Temp_int_Array_Index_Variable_1) == 0x000164, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000168, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_Array_Get_Item_1) == 0x00016C, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000178, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, K2Node_MakeStruct_LinearColor) == 0x000184, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, K2Node_MakeStruct_LinearColor_1) == 0x000194, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, Temp_object_Variable) == 0x0001A8, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_LineTraceSingle_OutHit) == 0x0001B8, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_LineTraceSingle_ReturnValue) == 0x000240, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_bBlockingHit) == 0x000241, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_bInitialOverlap) == 0x000242, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_Time) == 0x000244, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_Distance) == 0x000248, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_Location) == 0x00024C, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_ImpactPoint) == 0x000258, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_Normal) == 0x000264, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_ImpactNormal) == 0x000270, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_PhysMat) == 0x000280, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_HitActor) == 0x000288, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_HitComponent) == 0x000290, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_HitBoneName) == 0x000298, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_HitItem) == 0x0002A0, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_ElementIndex) == 0x0002A4, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_FaceIndex) == 0x0002A8, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_TraceStart) == 0x0002AC, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP, CallFunc_BreakHitResult_TraceEnd) == 0x0002B8, "Member 'PaintBombMinus01_BP_C_ExecuteUbergraph_PaintBombMinus01_BP::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");

// Function PaintBomb-01_BP.PaintBomb-01_BP_C.Mist
// 0x0008 (0x0008 - 0x0000)
struct PaintBombMinus01_BP_C_Mist final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_Radius;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PaintBombMinus01_BP_C_Mist) == 0x000004, "Wrong alignment on PaintBombMinus01_BP_C_Mist");
static_assert(sizeof(PaintBombMinus01_BP_C_Mist) == 0x000008, "Wrong size on PaintBombMinus01_BP_C_Mist");
static_assert(offsetof(PaintBombMinus01_BP_C_Mist, Time) == 0x000000, "Member 'PaintBombMinus01_BP_C_Mist::Time' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_Mist, Param_Radius) == 0x000004, "Member 'PaintBombMinus01_BP_C_Mist::Param_Radius' has a wrong offset!");

// Function PaintBomb-01_BP.PaintBomb-01_BP_C.SetDecal
// 0x0008 (0x0008 - 0x0000)
struct PaintBombMinus01_BP_C_SetDecal final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_Radius;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PaintBombMinus01_BP_C_SetDecal) == 0x000004, "Wrong alignment on PaintBombMinus01_BP_C_SetDecal");
static_assert(sizeof(PaintBombMinus01_BP_C_SetDecal) == 0x000008, "Wrong size on PaintBombMinus01_BP_C_SetDecal");
static_assert(offsetof(PaintBombMinus01_BP_C_SetDecal, Duration) == 0x000000, "Member 'PaintBombMinus01_BP_C_SetDecal::Duration' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_SetDecal, Param_Radius) == 0x000004, "Member 'PaintBombMinus01_BP_C_SetDecal::Param_Radius' has a wrong offset!");

// Function PaintBomb-01_BP.PaintBomb-01_BP_C.Boom
// 0x0020 (0x0020 - 0x0000)
struct PaintBombMinus01_BP_C_Boom final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_Radius;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  TriggeringPawn;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PaintBombMinus01_BP_C_Boom) == 0x000008, "Wrong alignment on PaintBombMinus01_BP_C_Boom");
static_assert(sizeof(PaintBombMinus01_BP_C_Boom) == 0x000020, "Wrong size on PaintBombMinus01_BP_C_Boom");
static_assert(offsetof(PaintBombMinus01_BP_C_Boom, Duration) == 0x000000, "Member 'PaintBombMinus01_BP_C_Boom::Duration' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_Boom, Param_Radius) == 0x000004, "Member 'PaintBombMinus01_BP_C_Boom::Param_Radius' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_Boom, Color) == 0x000008, "Member 'PaintBombMinus01_BP_C_Boom::Color' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_Boom, TriggeringPawn) == 0x000018, "Member 'PaintBombMinus01_BP_C_Boom::TriggeringPawn' has a wrong offset!");

// Function PaintBomb-01_BP.PaintBomb-01_BP_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct PaintBombMinus01_BP_C_UserConstructionScript final
{
public:
	TArray<class UDecalComponent*>                K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(PaintBombMinus01_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on PaintBombMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(PaintBombMinus01_BP_C_UserConstructionScript) == 0x000010, "Wrong size on PaintBombMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(PaintBombMinus01_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'PaintBombMinus01_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");

// Function PaintBomb-01_BP.PaintBomb-01_BP_C.AddDecals
// 0x0140 (0x0140 - 0x0000)
struct PaintBombMinus01_BP_C_AddDecals final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Normal;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RandomLocation;                                    // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B8[0xC];                                     // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B9[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30BA[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APaintBombDecal_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LevelRandomIntRange_ReturnValue;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x00B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PaintBombMinus01_BP_C_AddDecals) == 0x000010, "Wrong alignment on PaintBombMinus01_BP_C_AddDecals");
static_assert(sizeof(PaintBombMinus01_BP_C_AddDecals) == 0x000140, "Wrong size on PaintBombMinus01_BP_C_AddDecals");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, Location) == 0x000000, "Member 'PaintBombMinus01_BP_C_AddDecals::Location' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, Normal) == 0x00000C, "Member 'PaintBombMinus01_BP_C_AddDecals::Normal' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, RandomLocation) == 0x000018, "Member 'PaintBombMinus01_BP_C_AddDecals::RandomLocation' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, CallFunc_MakeRotFromZ_ReturnValue) == 0x000024, "Member 'PaintBombMinus01_BP_C_AddDecals::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, CallFunc_RandomFloatInRange_ReturnValue) == 0x000030, "Member 'PaintBombMinus01_BP_C_AddDecals::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'PaintBombMinus01_BP_C_AddDecals::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, CallFunc_MakeRotator_ReturnValue) == 0x000070, "Member 'PaintBombMinus01_BP_C_AddDecals::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'PaintBombMinus01_BP_C_AddDecals::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, CallFunc_RandomInteger_ReturnValue) == 0x000088, "Member 'PaintBombMinus01_BP_C_AddDecals::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, CallFunc_FinishSpawningActor_ReturnValue) == 0x000090, "Member 'PaintBombMinus01_BP_C_AddDecals::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000098, "Member 'PaintBombMinus01_BP_C_AddDecals::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'PaintBombMinus01_BP_C_AddDecals::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, CallFunc_Array_Add_ReturnValue) == 0x0000A4, "Member 'PaintBombMinus01_BP_C_AddDecals::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A8, "Member 'PaintBombMinus01_BP_C_AddDecals::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, CallFunc_LevelRandomIntRange_ReturnValue) == 0x0000AC, "Member 'PaintBombMinus01_BP_C_AddDecals::CallFunc_LevelRandomIntRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x0000B0, "Member 'PaintBombMinus01_BP_C_AddDecals::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_AddDecals, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000138, "Member 'PaintBombMinus01_BP_C_AddDecals::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function PaintBomb-01_BP.PaintBomb-01_BP_C.UpdateFog
// 0x0010 (0x0010 - 0x0000)
struct PaintBombMinus01_BP_C_UpdateFog final
{
public:
	float                                         Density;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_Radius;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PaintBombMinus01_BP_C_UpdateFog) == 0x000004, "Wrong alignment on PaintBombMinus01_BP_C_UpdateFog");
static_assert(sizeof(PaintBombMinus01_BP_C_UpdateFog) == 0x000010, "Wrong size on PaintBombMinus01_BP_C_UpdateFog");
static_assert(offsetof(PaintBombMinus01_BP_C_UpdateFog, Density) == 0x000000, "Member 'PaintBombMinus01_BP_C_UpdateFog::Density' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_UpdateFog, Param_Radius) == 0x000004, "Member 'PaintBombMinus01_BP_C_UpdateFog::Param_Radius' has a wrong offset!");
static_assert(offsetof(PaintBombMinus01_BP_C_UpdateFog, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'PaintBombMinus01_BP_C_UpdateFog::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
