#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PaintBombMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PaintBomb-01_BP.PaintBomb-01_BP_C
// 0x00E8 (0x0318 - 0x0230)
class APaintBombMinus01_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBVolumetricFogDynamicDensityVolumeComponent* RBVolumetricFogDynamicDensityVolume;               // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        PaintDecal0;                                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        PaintDecal6;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        PaintDecal5;                                       // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        PaintDecal4;                                       // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        PaintDecal3;                                       // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        PaintDecal2;                                       // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        PaintDecal1;                                       // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Ring;                                              // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_35EB4F934C318FB144B7CEA72B3FBFEB; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_35EB4F934C318FB144B7CEA72B3FBFEB; // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A7[0x3];                                     // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MistTimeline_NewTrack_0_25BE09A44DE7BD92D095759D8ACFA6DC; // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MistTimeline__Direction_25BE09A44DE7BD92D095759D8ACFA6DC; // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A8[0x3];                                     // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MistTimeline;                                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        LineTraces;                                        // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceConstant*>      DecalsList;                                        // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UDecalComponent*>                GroundDecals;                                      // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FVector                                DecalSizeCustom;                                   // 0x02D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A9[0x4];                                     // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AOrientedDecalActor_C*>          DecalActors;                                       // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FLinearColor                           DecalColor;                                        // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ParticleEmitter;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewVar_0;                                          // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PaintBombMinus01_BP(int32 EntryPoint);
	void Mist(float Time, float Param_Radius);
	void SetDecal(float Duration, float Param_Radius);
	void Boom(float Duration, float Param_Radius, const struct FLinearColor& Color, class APawn* TriggeringPawn);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void MistTimeline__UpdateFunc();
	void MistTimeline__FinishedFunc();
	void UserConstructionScript();
	void AddDecals(const struct FVector& Location, const struct FVector& Normal);
	void UpdateFog(float Density, float Param_Radius);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PaintBomb-01_BP_C">();
	}
	static class APaintBombMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APaintBombMinus01_BP_C>();
	}
};
static_assert(alignof(APaintBombMinus01_BP_C) == 0x000008, "Wrong alignment on APaintBombMinus01_BP_C");
static_assert(sizeof(APaintBombMinus01_BP_C) == 0x000318, "Wrong size on APaintBombMinus01_BP_C");
static_assert(offsetof(APaintBombMinus01_BP_C, UberGraphFrame) == 0x000230, "Member 'APaintBombMinus01_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, RBVolumetricFogDynamicDensityVolume) == 0x000238, "Member 'APaintBombMinus01_BP_C::RBVolumetricFogDynamicDensityVolume' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, PaintDecal0) == 0x000240, "Member 'APaintBombMinus01_BP_C::PaintDecal0' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, PaintDecal6) == 0x000248, "Member 'APaintBombMinus01_BP_C::PaintDecal6' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, PaintDecal5) == 0x000250, "Member 'APaintBombMinus01_BP_C::PaintDecal5' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, PaintDecal4) == 0x000258, "Member 'APaintBombMinus01_BP_C::PaintDecal4' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, PaintDecal3) == 0x000260, "Member 'APaintBombMinus01_BP_C::PaintDecal3' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, PaintDecal2) == 0x000268, "Member 'APaintBombMinus01_BP_C::PaintDecal2' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, PaintDecal1) == 0x000270, "Member 'APaintBombMinus01_BP_C::PaintDecal1' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, Ring) == 0x000278, "Member 'APaintBombMinus01_BP_C::Ring' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, DefaultSceneRoot) == 0x000280, "Member 'APaintBombMinus01_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, Timeline_0_NewTrack_0_35EB4F934C318FB144B7CEA72B3FBFEB) == 0x000288, "Member 'APaintBombMinus01_BP_C::Timeline_0_NewTrack_0_35EB4F934C318FB144B7CEA72B3FBFEB' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, Timeline_0__Direction_35EB4F934C318FB144B7CEA72B3FBFEB) == 0x00028C, "Member 'APaintBombMinus01_BP_C::Timeline_0__Direction_35EB4F934C318FB144B7CEA72B3FBFEB' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, Timeline_0) == 0x000290, "Member 'APaintBombMinus01_BP_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, MistTimeline_NewTrack_0_25BE09A44DE7BD92D095759D8ACFA6DC) == 0x000298, "Member 'APaintBombMinus01_BP_C::MistTimeline_NewTrack_0_25BE09A44DE7BD92D095759D8ACFA6DC' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, MistTimeline__Direction_25BE09A44DE7BD92D095759D8ACFA6DC) == 0x00029C, "Member 'APaintBombMinus01_BP_C::MistTimeline__Direction_25BE09A44DE7BD92D095759D8ACFA6DC' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, MistTimeline) == 0x0002A0, "Member 'APaintBombMinus01_BP_C::MistTimeline' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, LineTraces) == 0x0002A8, "Member 'APaintBombMinus01_BP_C::LineTraces' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, DecalsList) == 0x0002B8, "Member 'APaintBombMinus01_BP_C::DecalsList' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, GroundDecals) == 0x0002C8, "Member 'APaintBombMinus01_BP_C::GroundDecals' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, DecalSizeCustom) == 0x0002D8, "Member 'APaintBombMinus01_BP_C::DecalSizeCustom' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, DecalActors) == 0x0002E8, "Member 'APaintBombMinus01_BP_C::DecalActors' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, DecalColor) == 0x0002F8, "Member 'APaintBombMinus01_BP_C::DecalColor' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, ParticleEmitter) == 0x000308, "Member 'APaintBombMinus01_BP_C::ParticleEmitter' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, NewVar_0) == 0x000310, "Member 'APaintBombMinus01_BP_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(APaintBombMinus01_BP_C, Radius) == 0x000314, "Member 'APaintBombMinus01_BP_C::Radius' has a wrong offset!");

}

