#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Parent_DestructibleDoor_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Parent_DestructibleDoor_BP.Parent_DestructibleDoor_BP_C.EnableDamageSectionsShadow
// 0x001C (0x001C - 0x0000)
struct Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow final
{
public:
	bool                                          CastShadow;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32FA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow) == 0x000004, "Wrong alignment on Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow");
static_assert(sizeof(Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow) == 0x00001C, "Wrong size on Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow, CastShadow) == 0x000000, "Member 'Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow::CastShadow' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow, CallFunc_Array_Get_Item) == 0x000014, "Member 'Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'Parent_DestructibleDoor_BP_C_EnableDamageSectionsShadow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Parent_DestructibleDoor_BP.Parent_DestructibleDoor_BP_C.PostWindowBreakAkEvent
// 0x0050 (0x0050 - 0x0000)
struct Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32FB[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBDoor*                                K2Node_DynamicCast_AsRB_Door;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32FC[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSoundComponent*                      CallFunc_GetSoundComponent_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent) == 0x000008, "Wrong alignment on Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent");
static_assert(sizeof(Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent) == 0x000050, "Wrong size on Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent, Temp_delegate_Variable) == 0x000000, "Member 'Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent, Temp_struct_Variable) == 0x000010, "Member 'Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent, CallFunc_GetAttachParentActor_ReturnValue) == 0x000020, "Member 'Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent, K2Node_DynamicCast_AsRB_Door) == 0x000030, "Member 'Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent::K2Node_DynamicCast_AsRB_Door' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent, CallFunc_GetSoundComponent_ReturnValue) == 0x000040, "Member 'Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent::CallFunc_GetSoundComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent, CallFunc_PostAkEvent_ReturnValue) == 0x000048, "Member 'Parent_DestructibleDoor_BP_C_PostWindowBreakAkEvent::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function Parent_DestructibleDoor_BP.Parent_DestructibleDoor_BP_C.SetParticleRotation
// 0x0178 (0x0178 - 0x0000)
struct Parent_DestructibleDoor_BP_C_SetParticleRotation final
{
public:
	class ARBPawn*                                Front;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0028(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x00C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SignOfFloat_ReturnValue;                  // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Parent_DestructibleDoor_BP_C_SetParticleRotation) == 0x000008, "Wrong alignment on Parent_DestructibleDoor_BP_C_SetParticleRotation");
static_assert(sizeof(Parent_DestructibleDoor_BP_C_SetParticleRotation) == 0x000178, "Wrong size on Parent_DestructibleDoor_BP_C_SetParticleRotation");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetParticleRotation, Front) == 0x000000, "Member 'Parent_DestructibleDoor_BP_C_SetParticleRotation::Front' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetParticleRotation, ParticleSystem) == 0x000008, "Member 'Parent_DestructibleDoor_BP_C_SetParticleRotation::ParticleSystem' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetParticleRotation, CallFunc_MakeRotator_ReturnValue) == 0x000010, "Member 'Parent_DestructibleDoor_BP_C_SetParticleRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetParticleRotation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'Parent_DestructibleDoor_BP_C_SetParticleRotation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetParticleRotation, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000028, "Member 'Parent_DestructibleDoor_BP_C_SetParticleRotation::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetParticleRotation, CallFunc_MakeRotator_ReturnValue_1) == 0x0000B0, "Member 'Parent_DestructibleDoor_BP_C_SetParticleRotation::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetParticleRotation, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000BC, "Member 'Parent_DestructibleDoor_BP_C_SetParticleRotation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetParticleRotation, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0000C8, "Member 'Parent_DestructibleDoor_BP_C_SetParticleRotation::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetParticleRotation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000150, "Member 'Parent_DestructibleDoor_BP_C_SetParticleRotation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetParticleRotation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00015C, "Member 'Parent_DestructibleDoor_BP_C_SetParticleRotation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetParticleRotation, CallFunc_Dot_VectorVector_ReturnValue) == 0x000168, "Member 'Parent_DestructibleDoor_BP_C_SetParticleRotation::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetParticleRotation, CallFunc_SignOfFloat_ReturnValue) == 0x00016C, "Member 'Parent_DestructibleDoor_BP_C_SetParticleRotation::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetParticleRotation, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000170, "Member 'Parent_DestructibleDoor_BP_C_SetParticleRotation::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function Parent_DestructibleDoor_BP.Parent_DestructibleDoor_BP_C.SetMovementTransforms
// 0x0070 (0x0070 - 0x0000)
struct Parent_DestructibleDoor_BP_C_SetMovementTransforms final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32FD[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(Parent_DestructibleDoor_BP_C_SetMovementTransforms) == 0x000010, "Wrong alignment on Parent_DestructibleDoor_BP_C_SetMovementTransforms");
static_assert(sizeof(Parent_DestructibleDoor_BP_C_SetMovementTransforms) == 0x000070, "Wrong size on Parent_DestructibleDoor_BP_C_SetMovementTransforms");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetMovementTransforms, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'Parent_DestructibleDoor_BP_C_SetMovementTransforms::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetMovementTransforms, CallFunc_BreakTransform_Location) == 0x00000C, "Member 'Parent_DestructibleDoor_BP_C_SetMovementTransforms::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetMovementTransforms, CallFunc_BreakTransform_Rotation) == 0x000018, "Member 'Parent_DestructibleDoor_BP_C_SetMovementTransforms::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetMovementTransforms, CallFunc_BreakTransform_Scale) == 0x000024, "Member 'Parent_DestructibleDoor_BP_C_SetMovementTransforms::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetMovementTransforms, CallFunc_Add_VectorVector_ReturnValue) == 0x000030, "Member 'Parent_DestructibleDoor_BP_C_SetMovementTransforms::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_SetMovementTransforms, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'Parent_DestructibleDoor_BP_C_SetMovementTransforms::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function Parent_DestructibleDoor_BP.Parent_DestructibleDoor_BP_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct Parent_DestructibleDoor_BP_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsInEditor_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32FE[0xF];                                     // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(Parent_DestructibleDoor_BP_C_UserConstructionScript) == 0x000010, "Wrong alignment on Parent_DestructibleDoor_BP_C_UserConstructionScript");
static_assert(sizeof(Parent_DestructibleDoor_BP_C_UserConstructionScript) == 0x000040, "Wrong size on Parent_DestructibleDoor_BP_C_UserConstructionScript");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_UserConstructionScript, CallFunc_IsInEditor_ReturnValue) == 0x000000, "Member 'Parent_DestructibleDoor_BP_C_UserConstructionScript::CallFunc_IsInEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_UserConstructionScript, CallFunc_GetRelativeTransform_ReturnValue) == 0x000010, "Member 'Parent_DestructibleDoor_BP_C_UserConstructionScript::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");

// Function Parent_DestructibleDoor_BP.Parent_DestructibleDoor_BP_C.Event On Bash
// 0x0010 (0x0010 - 0x0000)
struct Parent_DestructibleDoor_BP_C_Event_On_Bash final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bApplyDamageVisual;                                // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EBashDoorType                                 bashType;                                          // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Parent_DestructibleDoor_BP_C_Event_On_Bash) == 0x000008, "Wrong alignment on Parent_DestructibleDoor_BP_C_Event_On_Bash");
static_assert(sizeof(Parent_DestructibleDoor_BP_C_Event_On_Bash) == 0x000010, "Wrong size on Parent_DestructibleDoor_BP_C_Event_On_Bash");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_Event_On_Bash, Pawn) == 0x000000, "Member 'Parent_DestructibleDoor_BP_C_Event_On_Bash::Pawn' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_Event_On_Bash, bSuccess) == 0x000008, "Member 'Parent_DestructibleDoor_BP_C_Event_On_Bash::bSuccess' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_Event_On_Bash, bApplyDamageVisual) == 0x000009, "Member 'Parent_DestructibleDoor_BP_C_Event_On_Bash::bApplyDamageVisual' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_Event_On_Bash, bashType) == 0x00000A, "Member 'Parent_DestructibleDoor_BP_C_Event_On_Bash::bashType' has a wrong offset!");

// Function Parent_DestructibleDoor_BP.Parent_DestructibleDoor_BP_C.ExecuteUbergraph_Parent_DestructibleDoor_BP
// 0x0020 (0x0020 - 0x0000)
struct Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBashDoorType                                 Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32FF[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_CustomEvent_pawn;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bApplyDamageVisual;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBashDoorType                                 K2Node_CustomEvent_BashType;                       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3300[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP) == 0x000008, "Wrong alignment on Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP");
static_assert(sizeof(Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP) == 0x000020, "Wrong size on Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP, EntryPoint) == 0x000000, "Member 'Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP, Temp_byte_Variable) == 0x000004, "Member 'Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP, K2Node_CustomEvent_pawn) == 0x000008, "Member 'Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP::K2Node_CustomEvent_pawn' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP, K2Node_CustomEvent_bSuccess) == 0x000010, "Member 'Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP, K2Node_CustomEvent_bApplyDamageVisual) == 0x000011, "Member 'Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP::K2Node_CustomEvent_bApplyDamageVisual' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP, K2Node_CustomEvent_BashType) == 0x000012, "Member 'Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP::K2Node_CustomEvent_BashType' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP, K2Node_Select_Default) == 0x000018, "Member 'Parent_DestructibleDoor_BP_C_ExecuteUbergraph_Parent_DestructibleDoor_BP::K2Node_Select_Default' has a wrong offset!");

// Function Parent_DestructibleDoor_BP.Parent_DestructibleDoor_BP_C.GetPingItemName
// 0x0020 (0x0020 - 0x0000)
struct Parent_DestructibleDoor_BP_C_GetPingItemName final
{
public:
	class FText                                   OutName;                                           // 0x0000(0x0018)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Parent_DestructibleDoor_BP_C_GetPingItemName) == 0x000008, "Wrong alignment on Parent_DestructibleDoor_BP_C_GetPingItemName");
static_assert(sizeof(Parent_DestructibleDoor_BP_C_GetPingItemName) == 0x000020, "Wrong size on Parent_DestructibleDoor_BP_C_GetPingItemName");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPingItemName, OutName) == 0x000000, "Member 'Parent_DestructibleDoor_BP_C_GetPingItemName::OutName' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPingItemName, ReturnValue) == 0x000018, "Member 'Parent_DestructibleDoor_BP_C_GetPingItemName::ReturnValue' has a wrong offset!");

// Function Parent_DestructibleDoor_BP.Parent_DestructibleDoor_BP_C.GetPingEnabled
// 0x00C8 (0x00C8 - 0x0000)
struct Parent_DestructibleDoor_BP_C_GetPingEnabled final
{
public:
	class ARBPlayer*                              PingOwner;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0008(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          OutIsEnabled;                                      // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0091(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3301[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADoorBase_BP_C*                         K2Node_DynamicCast_AsDoor_Base_BP;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3302[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRBPingableObject>     CallFunc_GetPingEnabled_self_CastInput;            // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPingEnabled_outIsEnabled;              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPingEnabled_ReturnValue;               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Parent_DestructibleDoor_BP_C_GetPingEnabled) == 0x000008, "Wrong alignment on Parent_DestructibleDoor_BP_C_GetPingEnabled");
static_assert(sizeof(Parent_DestructibleDoor_BP_C_GetPingEnabled) == 0x0000C8, "Wrong size on Parent_DestructibleDoor_BP_C_GetPingEnabled");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPingEnabled, PingOwner) == 0x000000, "Member 'Parent_DestructibleDoor_BP_C_GetPingEnabled::PingOwner' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPingEnabled, HitResult) == 0x000008, "Member 'Parent_DestructibleDoor_BP_C_GetPingEnabled::HitResult' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPingEnabled, OutIsEnabled) == 0x000090, "Member 'Parent_DestructibleDoor_BP_C_GetPingEnabled::OutIsEnabled' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPingEnabled, ReturnValue) == 0x000091, "Member 'Parent_DestructibleDoor_BP_C_GetPingEnabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPingEnabled, CallFunc_GetOwner_ReturnValue) == 0x000098, "Member 'Parent_DestructibleDoor_BP_C_GetPingEnabled::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPingEnabled, K2Node_DynamicCast_AsDoor_Base_BP) == 0x0000A0, "Member 'Parent_DestructibleDoor_BP_C_GetPingEnabled::K2Node_DynamicCast_AsDoor_Base_BP' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPingEnabled, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'Parent_DestructibleDoor_BP_C_GetPingEnabled::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPingEnabled, CallFunc_IsValid_ReturnValue) == 0x0000A9, "Member 'Parent_DestructibleDoor_BP_C_GetPingEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPingEnabled, CallFunc_GetPingEnabled_self_CastInput) == 0x0000B0, "Member 'Parent_DestructibleDoor_BP_C_GetPingEnabled::CallFunc_GetPingEnabled_self_CastInput' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPingEnabled, CallFunc_GetPingEnabled_outIsEnabled) == 0x0000C0, "Member 'Parent_DestructibleDoor_BP_C_GetPingEnabled::CallFunc_GetPingEnabled_outIsEnabled' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPingEnabled, CallFunc_GetPingEnabled_ReturnValue) == 0x0000C1, "Member 'Parent_DestructibleDoor_BP_C_GetPingEnabled::CallFunc_GetPingEnabled_ReturnValue' has a wrong offset!");

// Function Parent_DestructibleDoor_BP.Parent_DestructibleDoor_BP_C.GetPlayerPingData
// 0x0118 (0x0118 - 0x0000)
struct Parent_DestructibleDoor_BP_C_GetPlayerPingData final
{
public:
	class ARBPlayer*                              PingOwner;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0008(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FPlayerPingData                        OutData;                                           // 0x0090(0x0028)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3303[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADoorBase_BP_C*                         K2Node_DynamicCast_AsDoor_Base_BP;                 // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3304[0x6];                                     // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRBPingableObject>     CallFunc_GetPlayerPingData_self_CastInput;         // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FPlayerPingData                        CallFunc_GetPlayerPingData_outData;                // 0x00E8(0x0028)()
	bool                                          CallFunc_GetPlayerPingData_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Parent_DestructibleDoor_BP_C_GetPlayerPingData) == 0x000008, "Wrong alignment on Parent_DestructibleDoor_BP_C_GetPlayerPingData");
static_assert(sizeof(Parent_DestructibleDoor_BP_C_GetPlayerPingData) == 0x000118, "Wrong size on Parent_DestructibleDoor_BP_C_GetPlayerPingData");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPlayerPingData, PingOwner) == 0x000000, "Member 'Parent_DestructibleDoor_BP_C_GetPlayerPingData::PingOwner' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPlayerPingData, HitResult) == 0x000008, "Member 'Parent_DestructibleDoor_BP_C_GetPlayerPingData::HitResult' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPlayerPingData, OutData) == 0x000090, "Member 'Parent_DestructibleDoor_BP_C_GetPlayerPingData::OutData' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPlayerPingData, ReturnValue) == 0x0000B8, "Member 'Parent_DestructibleDoor_BP_C_GetPlayerPingData::ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPlayerPingData, CallFunc_GetOwner_ReturnValue) == 0x0000C0, "Member 'Parent_DestructibleDoor_BP_C_GetPlayerPingData::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPlayerPingData, K2Node_DynamicCast_AsDoor_Base_BP) == 0x0000C8, "Member 'Parent_DestructibleDoor_BP_C_GetPlayerPingData::K2Node_DynamicCast_AsDoor_Base_BP' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPlayerPingData, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'Parent_DestructibleDoor_BP_C_GetPlayerPingData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPlayerPingData, CallFunc_IsValid_ReturnValue) == 0x0000D1, "Member 'Parent_DestructibleDoor_BP_C_GetPlayerPingData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPlayerPingData, CallFunc_GetPlayerPingData_self_CastInput) == 0x0000D8, "Member 'Parent_DestructibleDoor_BP_C_GetPlayerPingData::CallFunc_GetPlayerPingData_self_CastInput' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPlayerPingData, CallFunc_GetPlayerPingData_outData) == 0x0000E8, "Member 'Parent_DestructibleDoor_BP_C_GetPlayerPingData::CallFunc_GetPlayerPingData_outData' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPlayerPingData, CallFunc_GetPlayerPingData_ReturnValue) == 0x000110, "Member 'Parent_DestructibleDoor_BP_C_GetPlayerPingData::CallFunc_GetPlayerPingData_ReturnValue' has a wrong offset!");

// Function Parent_DestructibleDoor_BP.Parent_DestructibleDoor_BP_C.GetPlayerPingWorldLocation
// 0x00D8 (0x00D8 - 0x0000)
struct Parent_DestructibleDoor_BP_C_GetPlayerPingWorldLocation final
{
public:
	class ARBPlayer*                              PingOwner;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0008(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                OutLocation;                                       // 0x0090(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x009C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3305[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADoorBase_BP_C*                         K2Node_DynamicCast_AsDoor_Base_BP;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3306[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRBPingableObject>     CallFunc_GetPlayerPingWorldLocation_self_CastInput; // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetPlayerPingWorldLocation_outLocation;   // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerPingWorldLocation_ReturnValue;   // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Parent_DestructibleDoor_BP_C_GetPlayerPingWorldLocation) == 0x000008, "Wrong alignment on Parent_DestructibleDoor_BP_C_GetPlayerPingWorldLocation");
static_assert(sizeof(Parent_DestructibleDoor_BP_C_GetPlayerPingWorldLocation) == 0x0000D8, "Wrong size on Parent_DestructibleDoor_BP_C_GetPlayerPingWorldLocation");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPlayerPingWorldLocation, PingOwner) == 0x000000, "Member 'Parent_DestructibleDoor_BP_C_GetPlayerPingWorldLocation::PingOwner' has a wrong offset!");
static_assert(offsetof(Parent_DestructibleDoor_BP_C_GetPlayerPingWorldLocation, HitResult) == 0x000008, "Member 'Parent_DestructibleDoor_BP_C_GetPlayerPingWorldLocation::HitResult' has a wrong offset!");
