#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyInviteHudWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PartyInviteHudWidget.PartyInviteHudWidget_C.ExecuteUbergraph_PartyInviteHudWidget
// 0x0140 (0x0140 - 0x0000)
struct PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_displayTime;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_totalDisplayTime;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3038[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3039[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_303A[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0110(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0120(0x0018)()
	bool                                          K2Node_Event_bIsGamepad;                           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget) == 0x000008, "Wrong alignment on PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget");
static_assert(sizeof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget) == 0x000140, "Wrong size on PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, EntryPoint) == 0x000000, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, K2Node_Event_displayTime) == 0x000004, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::K2Node_Event_displayTime' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, K2Node_Event_totalDisplayTime) == 0x000008, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::K2Node_Event_totalDisplayTime' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000020, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000028, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, K2Node_Event_IsDesignTime) == 0x000050, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, K2Node_MakeArray_Array) == 0x000098, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, K2Node_CreateDelegate_OutputDelegate) == 0x0000A8, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D0, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, K2Node_MakeArray_Array_1) == 0x000110, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, CallFunc_Format_ReturnValue_1) == 0x000120, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget, K2Node_Event_bIsGamepad) == 0x000138, "Member 'PartyInviteHudWidget_C_ExecuteUbergraph_PartyInviteHudWidget::K2Node_Event_bIsGamepad' has a wrong offset!");

// Function PartyInviteHudWidget.PartyInviteHudWidget_C.Event_InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct PartyInviteHudWidget_C_Event_InputSourceChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyInviteHudWidget_C_Event_InputSourceChanged) == 0x000001, "Wrong alignment on PartyInviteHudWidget_C_Event_InputSourceChanged");
static_assert(sizeof(PartyInviteHudWidget_C_Event_InputSourceChanged) == 0x000001, "Wrong size on PartyInviteHudWidget_C_Event_InputSourceChanged");
static_assert(offsetof(PartyInviteHudWidget_C_Event_InputSourceChanged, bIsGamepad) == 0x000000, "Member 'PartyInviteHudWidget_C_Event_InputSourceChanged::bIsGamepad' has a wrong offset!");

// Function PartyInviteHudWidget.PartyInviteHudWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PartyInviteHudWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyInviteHudWidget_C_PreConstruct) == 0x000001, "Wrong alignment on PartyInviteHudWidget_C_PreConstruct");
static_assert(sizeof(PartyInviteHudWidget_C_PreConstruct) == 0x000001, "Wrong size on PartyInviteHudWidget_C_PreConstruct");
static_assert(offsetof(PartyInviteHudWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PartyInviteHudWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PartyInviteHudWidget.PartyInviteHudWidget_C.Event_UpdateDisplayTime
// 0x0008 (0x0008 - 0x0000)
struct PartyInviteHudWidget_C_Event_UpdateDisplayTime final
{
public:
	float                                         DisplayTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_TotalDisplayTime;                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyInviteHudWidget_C_Event_UpdateDisplayTime) == 0x000004, "Wrong alignment on PartyInviteHudWidget_C_Event_UpdateDisplayTime");
static_assert(sizeof(PartyInviteHudWidget_C_Event_UpdateDisplayTime) == 0x000008, "Wrong size on PartyInviteHudWidget_C_Event_UpdateDisplayTime");
static_assert(offsetof(PartyInviteHudWidget_C_Event_UpdateDisplayTime, DisplayTime) == 0x000000, "Member 'PartyInviteHudWidget_C_Event_UpdateDisplayTime::DisplayTime' has a wrong offset!");
static_assert(offsetof(PartyInviteHudWidget_C_Event_UpdateDisplayTime, Param_TotalDisplayTime) == 0x000004, "Member 'PartyInviteHudWidget_C_Event_UpdateDisplayTime::Param_TotalDisplayTime' has a wrong offset!");

}

