#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyFindGroupSizeButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PartyFindGroupSizeButton.PartyFindGroupSizeButton_C
// 0x0070 (0x02D0 - 0x0260)
class UPartyFindGroupSizeButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Background;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ButtonText;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               CheckBoxContainer;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Checkmark;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SelectButton;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bEnabled;                                          // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelected;                                         // 0x0299(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHovered;                                          // 0x029A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3657[0x5];                                     // 0x029B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   ButtonTextValue;                                   // 0x02B0(0x0018)(Edit, BlueprintVisible)
	float                                         WrapTextAt;                                        // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void SetEnabled(bool bInEnabled);
	void GamepadNav_MenuConfirm_Release();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetHovered(bool Hovered);
	void SetButtonText(const class FText& Param_ButtonText);
	void SetSelected(bool bInSelected);
	void UpdateState();
	void PreConstruct(bool IsDesignTime);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void BndEvt__SelectButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_PartyFindGroupSizeButton(int32 EntryPoint);
	void OnClicked__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PartyFindGroupSizeButton_C">();
	}
	static class UPartyFindGroupSizeButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartyFindGroupSizeButton_C>();
	}
};
static_assert(alignof(UPartyFindGroupSizeButton_C) == 0x000008, "Wrong alignment on UPartyFindGroupSizeButton_C");
static_assert(sizeof(UPartyFindGroupSizeButton_C) == 0x0002D0, "Wrong size on UPartyFindGroupSizeButton_C");
static_assert(offsetof(UPartyFindGroupSizeButton_C, UberGraphFrame) == 0x000260, "Member 'UPartyFindGroupSizeButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPartyFindGroupSizeButton_C, Hover) == 0x000268, "Member 'UPartyFindGroupSizeButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UPartyFindGroupSizeButton_C, Background) == 0x000270, "Member 'UPartyFindGroupSizeButton_C::Background' has a wrong offset!");
static_assert(offsetof(UPartyFindGroupSizeButton_C, ButtonText) == 0x000278, "Member 'UPartyFindGroupSizeButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UPartyFindGroupSizeButton_C, CheckBoxContainer) == 0x000280, "Member 'UPartyFindGroupSizeButton_C::CheckBoxContainer' has a wrong offset!");
static_assert(offsetof(UPartyFindGroupSizeButton_C, Checkmark) == 0x000288, "Member 'UPartyFindGroupSizeButton_C::Checkmark' has a wrong offset!");
static_assert(offsetof(UPartyFindGroupSizeButton_C, SelectButton) == 0x000290, "Member 'UPartyFindGroupSizeButton_C::SelectButton' has a wrong offset!");
static_assert(offsetof(UPartyFindGroupSizeButton_C, bEnabled) == 0x000298, "Member 'UPartyFindGroupSizeButton_C::bEnabled' has a wrong offset!");
static_assert(offsetof(UPartyFindGroupSizeButton_C, bSelected) == 0x000299, "Member 'UPartyFindGroupSizeButton_C::bSelected' has a wrong offset!");
static_assert(offsetof(UPartyFindGroupSizeButton_C, bHovered) == 0x00029A, "Member 'UPartyFindGroupSizeButton_C::bHovered' has a wrong offset!");
static_assert(offsetof(UPartyFindGroupSizeButton_C, OnClicked) == 0x0002A0, "Member 'UPartyFindGroupSizeButton_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UPartyFindGroupSizeButton_C, ButtonTextValue) == 0x0002B0, "Member 'UPartyFindGroupSizeButton_C::ButtonTextValue' has a wrong offset!");
static_assert(offsetof(UPartyFindGroupSizeButton_C, WrapTextAt) == 0x0002C8, "Member 'UPartyFindGroupSizeButton_C::WrapTextAt' has a wrong offset!");

}

