#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyInviteHudWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PartyInviteHudWidget.PartyInviteHudWidget_C
// 0x0070 (0x0348 - 0x02D8)
class UPartyInviteHudWidget_C final : public URBPartyInviteNotificationUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnim;                                          // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonNotificationWidget_C*            CommonNotificationWidget;                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalTime;                                         // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AcceptedColor;                                     // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RefusedColor;                                      // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TestPlayerName;                                    // 0x0320(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             HardcoreIconTexture;                               // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             RegularIconTexture;                                // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PartyInviteHudWidget(int32 EntryPoint);
	void Event_InputSourceChanged(bool bIsGamepad);
	void BndEvt__PartyInviteHudWidget_CommonNotificationWidget_K2Node_ComponentBoundEvent_2_OnBlockButtonClicked__DelegateSignature();
	void Event_Blocked();
	void BndEvt__PartyInviteHudWidget_CommonNotificationWidget_K2Node_ComponentBoundEvent_1_OnDeclinedButtonClicked__DelegateSignature();
	void BndEvt__PartyInviteHudWidget_CommonNotificationWidget_K2Node_ComponentBoundEvent_0_OnAcceptedButtonClicked__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void Event_Refused();
	void Event_Accepted();
	void Event_Hide();
	void Event_UpdateDisplayTime(float DisplayTime, float Param_TotalDisplayTime);
	void Event_Show();
	void Finished_1B7ED78D47D24A29ECB5FF94734C6C40();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PartyInviteHudWidget_C">();
	}
	static class UPartyInviteHudWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartyInviteHudWidget_C>();
	}
};
static_assert(alignof(UPartyInviteHudWidget_C) == 0x000008, "Wrong alignment on UPartyInviteHudWidget_C");
static_assert(sizeof(UPartyInviteHudWidget_C) == 0x000348, "Wrong size on UPartyInviteHudWidget_C");
static_assert(offsetof(UPartyInviteHudWidget_C, UberGraphFrame) == 0x0002D8, "Member 'UPartyInviteHudWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPartyInviteHudWidget_C, HideAnim) == 0x0002E0, "Member 'UPartyInviteHudWidget_C::HideAnim' has a wrong offset!");
static_assert(offsetof(UPartyInviteHudWidget_C, ShowAnim) == 0x0002E8, "Member 'UPartyInviteHudWidget_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UPartyInviteHudWidget_C, CommonNotificationWidget) == 0x0002F0, "Member 'UPartyInviteHudWidget_C::CommonNotificationWidget' has a wrong offset!");
static_assert(offsetof(UPartyInviteHudWidget_C, CurrentTime) == 0x0002F8, "Member 'UPartyInviteHudWidget_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(UPartyInviteHudWidget_C, TotalTime) == 0x0002FC, "Member 'UPartyInviteHudWidget_C::TotalTime' has a wrong offset!");
static_assert(offsetof(UPartyInviteHudWidget_C, AcceptedColor) == 0x000300, "Member 'UPartyInviteHudWidget_C::AcceptedColor' has a wrong offset!");
static_assert(offsetof(UPartyInviteHudWidget_C, RefusedColor) == 0x000310, "Member 'UPartyInviteHudWidget_C::RefusedColor' has a wrong offset!");
static_assert(offsetof(UPartyInviteHudWidget_C, TestPlayerName) == 0x000320, "Member 'UPartyInviteHudWidget_C::TestPlayerName' has a wrong offset!");
static_assert(offsetof(UPartyInviteHudWidget_C, HardcoreIconTexture) == 0x000338, "Member 'UPartyInviteHudWidget_C::HardcoreIconTexture' has a wrong offset!");
static_assert(offsetof(UPartyInviteHudWidget_C, RegularIconTexture) == 0x000340, "Member 'UPartyInviteHudWidget_C::RegularIconTexture' has a wrong offset!");

}

