#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyFindGroupSizeButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function PartyFindGroupSizeButton.PartyFindGroupSizeButton_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct PartyFindGroupSizeButton_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(PartyFindGroupSizeButton_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on PartyFindGroupSizeButton_C_OnRemovedFromFocusPath");
static_assert(sizeof(PartyFindGroupSizeButton_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on PartyFindGroupSizeButton_C_OnRemovedFromFocusPath");
static_assert(offsetof(PartyFindGroupSizeButton_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'PartyFindGroupSizeButton_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function PartyFindGroupSizeButton.PartyFindGroupSizeButton_C.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct PartyFindGroupSizeButton_C_SetEnabled final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyFindGroupSizeButton_C_SetEnabled) == 0x000001, "Wrong alignment on PartyFindGroupSizeButton_C_SetEnabled");
static_assert(sizeof(PartyFindGroupSizeButton_C_SetEnabled) == 0x000001, "Wrong size on PartyFindGroupSizeButton_C_SetEnabled");
static_assert(offsetof(PartyFindGroupSizeButton_C_SetEnabled, bInEnabled) == 0x000000, "Member 'PartyFindGroupSizeButton_C_SetEnabled::bInEnabled' has a wrong offset!");

// Function PartyFindGroupSizeButton.PartyFindGroupSizeButton_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct PartyFindGroupSizeButton_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0108(0x00B8)()
};
static_assert(alignof(PartyFindGroupSizeButton_C_OnFocusReceived) == 0x000008, "Wrong alignment on PartyFindGroupSizeButton_C_OnFocusReceived");
static_assert(sizeof(PartyFindGroupSizeButton_C_OnFocusReceived) == 0x0001C0, "Wrong size on PartyFindGroupSizeButton_C_OnFocusReceived");
static_assert(offsetof(PartyFindGroupSizeButton_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'PartyFindGroupSizeButton_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'PartyFindGroupSizeButton_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'PartyFindGroupSizeButton_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_OnFocusReceived, K2Node_CreateDelegate_OutputDelegate) == 0x0000F8, "Member 'PartyFindGroupSizeButton_C_OnFocusReceived::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000108, "Member 'PartyFindGroupSizeButton_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function PartyFindGroupSizeButton.PartyFindGroupSizeButton_C.SetHovered
// 0x0028 (0x0028 - 0x0000)
struct PartyFindGroupSizeButton_C_SetHovered final
{
public:
	bool                                          Hovered;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3658[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyFindGroupSizeButton_C_SetHovered) == 0x000008, "Wrong alignment on PartyFindGroupSizeButton_C_SetHovered");
static_assert(sizeof(PartyFindGroupSizeButton_C_SetHovered) == 0x000028, "Wrong size on PartyFindGroupSizeButton_C_SetHovered");
static_assert(offsetof(PartyFindGroupSizeButton_C_SetHovered, Hovered) == 0x000000, "Member 'PartyFindGroupSizeButton_C_SetHovered::Hovered' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_SetHovered, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'PartyFindGroupSizeButton_C_SetHovered::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_SetHovered, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'PartyFindGroupSizeButton_C_SetHovered::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

// Function PartyFindGroupSizeButton.PartyFindGroupSizeButton_C.SetButtonText
// 0x0018 (0x0018 - 0x0000)
struct PartyFindGroupSizeButton_C_SetButtonText final
{
public:
	class FText                                   Param_ButtonText;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PartyFindGroupSizeButton_C_SetButtonText) == 0x000008, "Wrong alignment on PartyFindGroupSizeButton_C_SetButtonText");
static_assert(sizeof(PartyFindGroupSizeButton_C_SetButtonText) == 0x000018, "Wrong size on PartyFindGroupSizeButton_C_SetButtonText");
static_assert(offsetof(PartyFindGroupSizeButton_C_SetButtonText, Param_ButtonText) == 0x000000, "Member 'PartyFindGroupSizeButton_C_SetButtonText::Param_ButtonText' has a wrong offset!");

// Function PartyFindGroupSizeButton.PartyFindGroupSizeButton_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct PartyFindGroupSizeButton_C_SetSelected final
{
public:
	bool                                          bInSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyFindGroupSizeButton_C_SetSelected) == 0x000001, "Wrong alignment on PartyFindGroupSizeButton_C_SetSelected");
static_assert(sizeof(PartyFindGroupSizeButton_C_SetSelected) == 0x000001, "Wrong size on PartyFindGroupSizeButton_C_SetSelected");
static_assert(offsetof(PartyFindGroupSizeButton_C_SetSelected, bInSelected) == 0x000000, "Member 'PartyFindGroupSizeButton_C_SetSelected::bInSelected' has a wrong offset!");

// Function PartyFindGroupSizeButton.PartyFindGroupSizeButton_C.UpdateState
// 0x00F0 (0x00F0 - 0x0000)
struct PartyFindGroupSizeButton_C_UpdateState final
{
public:
	struct FSlateColor                            DisabledColor;                                     // 0x0000(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            NormalColor;                                       // 0x0028(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            HoveredColor;                                      // 0x0050(0x0028)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3659[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365A[0x1];                                     // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x0090(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x00B8(0x0028)()
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_365B[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyFindGroupSizeButton_C_UpdateState) == 0x000008, "Wrong alignment on PartyFindGroupSizeButton_C_UpdateState");
static_assert(sizeof(PartyFindGroupSizeButton_C_UpdateState) == 0x0000F0, "Wrong size on PartyFindGroupSizeButton_C_UpdateState");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, DisabledColor) == 0x000000, "Member 'PartyFindGroupSizeButton_C_UpdateState::DisabledColor' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, NormalColor) == 0x000028, "Member 'PartyFindGroupSizeButton_C_UpdateState::NormalColor' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, HoveredColor) == 0x000050, "Member 'PartyFindGroupSizeButton_C_UpdateState::HoveredColor' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, Temp_bool_Variable) == 0x000078, "Member 'PartyFindGroupSizeButton_C_UpdateState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, Temp_bool_Variable_1) == 0x000079, "Member 'PartyFindGroupSizeButton_C_UpdateState::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, Temp_byte_Variable) == 0x00007A, "Member 'PartyFindGroupSizeButton_C_UpdateState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, Temp_byte_Variable_1) == 0x00007B, "Member 'PartyFindGroupSizeButton_C_UpdateState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, Temp_bool_Variable_2) == 0x00007C, "Member 'PartyFindGroupSizeButton_C_UpdateState::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, Temp_float_Variable) == 0x000080, "Member 'PartyFindGroupSizeButton_C_UpdateState::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, Temp_float_Variable_1) == 0x000084, "Member 'PartyFindGroupSizeButton_C_UpdateState::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, Temp_bool_Variable_3) == 0x000088, "Member 'PartyFindGroupSizeButton_C_UpdateState::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, Temp_bool_Variable_4) == 0x000089, "Member 'PartyFindGroupSizeButton_C_UpdateState::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, Temp_byte_Variable_2) == 0x00008A, "Member 'PartyFindGroupSizeButton_C_UpdateState::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, Temp_byte_Variable_3) == 0x00008B, "Member 'PartyFindGroupSizeButton_C_UpdateState::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, CallFunc_BooleanAND_ReturnValue) == 0x00008C, "Member 'PartyFindGroupSizeButton_C_UpdateState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, CallFunc_IsValid_ReturnValue) == 0x00008D, "Member 'PartyFindGroupSizeButton_C_UpdateState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, K2Node_Select_Default) == 0x00008E, "Member 'PartyFindGroupSizeButton_C_UpdateState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, K2Node_Select_Default_1) == 0x000090, "Member 'PartyFindGroupSizeButton_C_UpdateState::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, K2Node_Select_Default_2) == 0x0000B8, "Member 'PartyFindGroupSizeButton_C_UpdateState::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, CallFunc_BooleanAND_ReturnValue_1) == 0x0000E0, "Member 'PartyFindGroupSizeButton_C_UpdateState::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, K2Node_Select_Default_3) == 0x0000E4, "Member 'PartyFindGroupSizeButton_C_UpdateState::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_UpdateState, K2Node_Select_Default_4) == 0x0000E8, "Member 'PartyFindGroupSizeButton_C_UpdateState::K2Node_Select_Default_4' has a wrong offset!");

// Function PartyFindGroupSizeButton.PartyFindGroupSizeButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PartyFindGroupSizeButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyFindGroupSizeButton_C_PreConstruct) == 0x000001, "Wrong alignment on PartyFindGroupSizeButton_C_PreConstruct");
static_assert(sizeof(PartyFindGroupSizeButton_C_PreConstruct) == 0x000001, "Wrong size on PartyFindGroupSizeButton_C_PreConstruct");
static_assert(offsetof(PartyFindGroupSizeButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PartyFindGroupSizeButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PartyFindGroupSizeButton.PartyFindGroupSizeButton_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct PartyFindGroupSizeButton_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PartyFindGroupSizeButton_C_OnMouseEnter) == 0x000008, "Wrong alignment on PartyFindGroupSizeButton_C_OnMouseEnter");
static_assert(sizeof(PartyFindGroupSizeButton_C_OnMouseEnter) == 0x0000A8, "Wrong size on PartyFindGroupSizeButton_C_OnMouseEnter");
static_assert(offsetof(PartyFindGroupSizeButton_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'PartyFindGroupSizeButton_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'PartyFindGroupSizeButton_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function PartyFindGroupSizeButton.PartyFindGroupSizeButton_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct PartyFindGroupSizeButton_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PartyFindGroupSizeButton_C_OnMouseLeave) == 0x000008, "Wrong alignment on PartyFindGroupSizeButton_C_OnMouseLeave");
static_assert(sizeof(PartyFindGroupSizeButton_C_OnMouseLeave) == 0x000070, "Wrong size on PartyFindGroupSizeButton_C_OnMouseLeave");
static_assert(offsetof(PartyFindGroupSizeButton_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'PartyFindGroupSizeButton_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function PartyFindGroupSizeButton.PartyFindGroupSizeButton_C.ExecuteUbergraph_PartyFindGroupSizeButton
// 0x0120 (0x0120 - 0x0000)
struct PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_365C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B0(0x0070)(ConstParm)
};
static_assert(alignof(PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton) == 0x000008, "Wrong alignment on PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton");
static_assert(sizeof(PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton) == 0x000120, "Wrong size on PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton");
static_assert(offsetof(PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton, EntryPoint) == 0x000000, "Member 'PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton, K2Node_Event_MyGeometry) == 0x000008, "Member 'PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton, K2Node_Event_MouseEvent) == 0x0000B0, "Member 'PartyFindGroupSizeButton_C_ExecuteUbergraph_PartyFindGroupSizeButton::K2Node_Event_MouseEvent' has a wrong offset!");

}

