#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkListTabs

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "OPP_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PerkListTabs.PerkListTabs_C
// 0x0030 (0x0290 - 0x0260)
class UPerkListTabs_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UActionIconWidget_C*                    LeftTabButton;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UActionIconWidget_C*                    RightTabButton;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TabsBox;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPerkCategoryChangeRequested;                     // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SetSelectedTab(EPerkCategory NewCategory);
	void Setup();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnTabButtonClicked(EPerkCategory Category);
	void ExecuteUbergraph_PerkListTabs(int32 EntryPoint);
	void OnPerkCategoryChangeRequested__DelegateSignature(EPerkCategory NewCategory);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PerkListTabs_C">();
	}
	static class UPerkListTabs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerkListTabs_C>();
	}
};
static_assert(alignof(UPerkListTabs_C) == 0x000008, "Wrong alignment on UPerkListTabs_C");
static_assert(sizeof(UPerkListTabs_C) == 0x000290, "Wrong size on UPerkListTabs_C");
static_assert(offsetof(UPerkListTabs_C, UberGraphFrame) == 0x000260, "Member 'UPerkListTabs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPerkListTabs_C, LeftTabButton) == 0x000268, "Member 'UPerkListTabs_C::LeftTabButton' has a wrong offset!");
static_assert(offsetof(UPerkListTabs_C, RightTabButton) == 0x000270, "Member 'UPerkListTabs_C::RightTabButton' has a wrong offset!");
static_assert(offsetof(UPerkListTabs_C, TabsBox) == 0x000278, "Member 'UPerkListTabs_C::TabsBox' has a wrong offset!");
static_assert(offsetof(UPerkListTabs_C, OnPerkCategoryChangeRequested) == 0x000280, "Member 'UPerkListTabs_C::OnPerkCategoryChangeRequested' has a wrong offset!");

}

