#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pharmacist_QuestGiver_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Pharmacist_QuestGiver_BP.Pharmacist_QuestGiver_BP_C.ExecuteUbergraph_Pharmacist_QuestGiver_BP
// 0x0038 (0x0038 - 0x0000)
struct Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38A9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPharmacist_Novel_AnimBP_Child_C*       K2Node_DynamicCast_AsPharmacist_Novel_Anim_BP_Child; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38AA[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPharmacist_Novel_AnimBP_Child_C*       K2Node_DynamicCast_AsPharmacist_Novel_Anim_BP_Child_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP) == 0x000008, "Wrong alignment on Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP");
static_assert(sizeof(Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP) == 0x000038, "Wrong size on Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP");
static_assert(offsetof(Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP, EntryPoint) == 0x000000, "Member 'Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000010, "Member 'Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP, K2Node_DynamicCast_AsPharmacist_Novel_Anim_BP_Child) == 0x000018, "Member 'Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP::K2Node_DynamicCast_AsPharmacist_Novel_Anim_BP_Child' has a wrong offset!");
static_assert(offsetof(Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP, K2Node_DynamicCast_AsPharmacist_Novel_Anim_BP_Child_1) == 0x000028, "Member 'Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP::K2Node_DynamicCast_AsPharmacist_Novel_Anim_BP_Child_1' has a wrong offset!");
static_assert(offsetof(Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'Pharmacist_QuestGiver_BP_C_ExecuteUbergraph_Pharmacist_QuestGiver_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

