#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pharmacist_Skirt_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Pharmacist_Skirt_Skeleton_AnimBlueprint.Pharmacist_Skirt_Skeleton_AnimBlueprint_C
// 0x08D0 (0x0B90 - 0x02C0)
class UPharmacist_Skirt_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_342B[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x02F8(0x01D8)(ContainsInstancedReference)
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x04D0(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x05C0(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x06B0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0808(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x0830(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0850(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0878(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x0898(0x00C8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x0960(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0980(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x09A0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x09C0(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x09E0(0x01B0)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_Pharmacist_Skirt_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pharmacist_Skirt_Skeleton_AnimBlueprint_C">();
	}
	static class UPharmacist_Skirt_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPharmacist_Skirt_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UPharmacist_Skirt_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C) == 0x000B90, "Wrong size on UPharmacist_Skirt_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_CopyPoseFromMesh) == 0x0002F8, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_CopyBone_1) == 0x0004D0, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_CopyBone_1' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_CopyBone) == 0x0005C0, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_CopyBone' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x0006B0, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose_1) == 0x000808, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace_2) == 0x000830, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x000850, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000878, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_TwoWayBlend) == 0x000898, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x000960, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000980, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x0009A0, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x0009C0, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UPharmacist_Skirt_Skeleton_AnimBlueprint_C, AnimGraphNode_LookAt) == 0x0009E0, "Member 'UPharmacist_Skirt_Skeleton_AnimBlueprint_C::AnimGraphNode_LookAt' has a wrong offset!");

}

