#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerStatEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function PlayerStatEntry.PlayerStatEntry_C.Setup
// 0x0038 (0x0038 - 0x0000)
struct PlayerStatEntry_C_Setup final
{
public:
	class FText                                   Param_DisplayName;                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Param_ValueText;                                   // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             Param_IconTexture;                                 // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStatEntry_C_Setup) == 0x000008, "Wrong alignment on PlayerStatEntry_C_Setup");
static_assert(sizeof(PlayerStatEntry_C_Setup) == 0x000038, "Wrong size on PlayerStatEntry_C_Setup");
static_assert(offsetof(PlayerStatEntry_C_Setup, Param_DisplayName) == 0x000000, "Member 'PlayerStatEntry_C_Setup::Param_DisplayName' has a wrong offset!");
static_assert(offsetof(PlayerStatEntry_C_Setup, Param_ValueText) == 0x000018, "Member 'PlayerStatEntry_C_Setup::Param_ValueText' has a wrong offset!");
static_assert(offsetof(PlayerStatEntry_C_Setup, Param_IconTexture) == 0x000030, "Member 'PlayerStatEntry_C_Setup::Param_IconTexture' has a wrong offset!");

// Function PlayerStatEntry.PlayerStatEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PlayerStatEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerStatEntry_C_PreConstruct) == 0x000001, "Wrong alignment on PlayerStatEntry_C_PreConstruct");
static_assert(sizeof(PlayerStatEntry_C_PreConstruct) == 0x000001, "Wrong size on PlayerStatEntry_C_PreConstruct");
static_assert(offsetof(PlayerStatEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PlayerStatEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PlayerStatEntry.PlayerStatEntry_C.ExecuteUbergraph_PlayerStatEntry
// 0x0008 (0x0008 - 0x0000)
struct PlayerStatEntry_C_ExecuteUbergraph_PlayerStatEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerStatEntry_C_ExecuteUbergraph_PlayerStatEntry) == 0x000004, "Wrong alignment on PlayerStatEntry_C_ExecuteUbergraph_PlayerStatEntry");
static_assert(sizeof(PlayerStatEntry_C_ExecuteUbergraph_PlayerStatEntry) == 0x000008, "Wrong size on PlayerStatEntry_C_ExecuteUbergraph_PlayerStatEntry");
static_assert(offsetof(PlayerStatEntry_C_ExecuteUbergraph_PlayerStatEntry, EntryPoint) == 0x000000, "Member 'PlayerStatEntry_C_ExecuteUbergraph_PlayerStatEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerStatEntry_C_ExecuteUbergraph_PlayerStatEntry, K2Node_Event_IsDesignTime) == 0x000004, "Member 'PlayerStatEntry_C_ExecuteUbergraph_PlayerStatEntry::K2Node_Event_IsDesignTime' has a wrong offset!");

}

