#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerVisualDamageStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct PlayerVisualDamageStruct.PlayerVisualDamageStruct
// 0x0020 (0x0020 - 0x0000)
struct FPlayerVisualDamageStruct final
{
public:
	TArray<class FName>                           Bones_6_C747AE5A46548E83D42A21B4570211CB;          // 0x0000(0x0010)(Edit, BlueprintVisible)
	float                                         Radius_7_785CDE8147D9F592EF8146ACE61C83F7;         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageIntensity_10_ECC126F447F4594065D7469A6C6865B2; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumHits_13_FF1B16D046E438A9513ABE89CA040125;       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartingIndex_16_C0C46E6A482364B5192E12B1A9DFC5C7; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPlayerVisualDamageStruct) == 0x000008, "Wrong alignment on FPlayerVisualDamageStruct");
static_assert(sizeof(FPlayerVisualDamageStruct) == 0x000020, "Wrong size on FPlayerVisualDamageStruct");
static_assert(offsetof(FPlayerVisualDamageStruct, Bones_6_C747AE5A46548E83D42A21B4570211CB) == 0x000000, "Member 'FPlayerVisualDamageStruct::Bones_6_C747AE5A46548E83D42A21B4570211CB' has a wrong offset!");
static_assert(offsetof(FPlayerVisualDamageStruct, Radius_7_785CDE8147D9F592EF8146ACE61C83F7) == 0x000010, "Member 'FPlayerVisualDamageStruct::Radius_7_785CDE8147D9F592EF8146ACE61C83F7' has a wrong offset!");
static_assert(offsetof(FPlayerVisualDamageStruct, DamageIntensity_10_ECC126F447F4594065D7469A6C6865B2) == 0x000014, "Member 'FPlayerVisualDamageStruct::DamageIntensity_10_ECC126F447F4594065D7469A6C6865B2' has a wrong offset!");
static_assert(offsetof(FPlayerVisualDamageStruct, NumHits_13_FF1B16D046E438A9513ABE89CA040125) == 0x000018, "Member 'FPlayerVisualDamageStruct::NumHits_13_FF1B16D046E438A9513ABE89CA040125' has a wrong offset!");
static_assert(offsetof(FPlayerVisualDamageStruct, StartingIndex_16_C0C46E6A482364B5192E12B1A9DFC5C7) == 0x00001C, "Member 'FPlayerVisualDamageStruct::StartingIndex_16_C0C46E6A482364B5192E12B1A9DFC5C7' has a wrong offset!");

}

