#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerCellItemBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerCellItemBase.PlayerCellItemBase_C
// 0x00E0 (0x0330 - 0x0250)
class APlayerCellItemBase_C : public ARBPlayerCellItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DisplayStaticMeshComponent;                        // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBPlayerCellItemDefinition*            PreviewDefinition;                                 // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugTransform;                                   // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3848[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DebugTransform;                                    // 0x0290(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	int32                                         AffectedMaterialID;                                // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StaticmeshTag;                                     // 0x02C4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3849[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         AttachedStaticmeshes;                              // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         FOV;                                               // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384A[0x4];                                     // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RefActor;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBPlayerCellItemDefinition*            PendingTarget;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPendingAsyncPreview;                              // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHasPendingTarget;                                 // 0x02F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_384B[0x6];                                     // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SpawnTransformActorRef;                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 WallMeshRef;                                       // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraFocusOffset;                                 // 0x0310(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384C[0x4];                                     // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerCellItemDefinition*            CurrentPCD;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ResetPreviewStaticMeshMaterials();
	void GetCameraFocusWorldLocation(struct FVector* WorldLocation);
	void ApplyMaterial(class URBPlayerCellItemDefinition* PlayerCellDefinition);
	void ApplyStaticMesh(class URBPlayerCellItemDefinition* CellItemDefinition);
	void Reset();
	void PreviewBlueprintClass_Editor(TSoftClassPtr<class UClass> Param_Class, class URBPlayerCellItemDefinition* CellItemDefinition);
	void GetSpawnTransform(struct FTransform* WorldLocation);
	void OnPreviewDone();
	void ApplyTransformToConfig();
	void TryDestroyPreviousProp();
	void ChangeMaterialOnStaticmesh(class UPrimitiveComponent* Comp, class UObject* Material);
	void GetConfigTransform();
	void Refresh();
	void PreviewCellItemDefinition_Editor(class URBPlayerCellItemDefinition* CellItemDefinition);
	void UserConstructionScript();
	void OnLoaded_979288504F90989FEEAAD0BBDC449001(class UObject* Loaded);
	void OnLoaded_4E18DE394F253951F2F6CCB149B0597D(class UObject* Loaded);
	void OnLoaded_2A9FE965428939AA3930E497B1EEF09B(class UObject* Loaded);
	void OnLoaded_7C1E3CB34C287AB4FE7F69A712E41A69(TSubclassOf<class UObject> Loaded);
	void Event_AssignItem(class URBPlayerCellItemDefinition* ItemDefinition);
	void PreviewItem(class URBPlayerCellItemDefinition* Target);
	void ApplyNewMaterial(class URBPlayerCellItemDefinition* ItemDefinition);
	void ApplyNewStaticmesh(class URBPlayerCellItemDefinition* ItemDefinition);
	void ApplyBlueprintClass(class URBPlayerCellItemDefinition* ItemDefinition);
	void Event_ClearItem();
	void ExecuteUbergraph_PlayerCellItemBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerCellItemBase_C">();
	}
	static class APlayerCellItemBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerCellItemBase_C>();
	}
};
static_assert(alignof(APlayerCellItemBase_C) == 0x000010, "Wrong alignment on APlayerCellItemBase_C");
static_assert(sizeof(APlayerCellItemBase_C) == 0x000330, "Wrong size on APlayerCellItemBase_C");
static_assert(offsetof(APlayerCellItemBase_C, UberGraphFrame) == 0x000250, "Member 'APlayerCellItemBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, TextRender) == 0x000258, "Member 'APlayerCellItemBase_C::TextRender' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, ChildActor) == 0x000260, "Member 'APlayerCellItemBase_C::ChildActor' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, DisplayStaticMeshComponent) == 0x000268, "Member 'APlayerCellItemBase_C::DisplayStaticMeshComponent' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, Scene) == 0x000270, "Member 'APlayerCellItemBase_C::Scene' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, Billboard) == 0x000278, "Member 'APlayerCellItemBase_C::Billboard' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, PreviewDefinition) == 0x000280, "Member 'APlayerCellItemBase_C::PreviewDefinition' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, bDebugTransform) == 0x000288, "Member 'APlayerCellItemBase_C::bDebugTransform' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, DebugTransform) == 0x000290, "Member 'APlayerCellItemBase_C::DebugTransform' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, AffectedMaterialID) == 0x0002C0, "Member 'APlayerCellItemBase_C::AffectedMaterialID' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, StaticmeshTag) == 0x0002C4, "Member 'APlayerCellItemBase_C::StaticmeshTag' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, AttachedStaticmeshes) == 0x0002D0, "Member 'APlayerCellItemBase_C::AttachedStaticmeshes' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, FOV) == 0x0002E0, "Member 'APlayerCellItemBase_C::FOV' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, RefActor) == 0x0002E8, "Member 'APlayerCellItemBase_C::RefActor' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, PendingTarget) == 0x0002F0, "Member 'APlayerCellItemBase_C::PendingTarget' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, bPendingAsyncPreview) == 0x0002F8, "Member 'APlayerCellItemBase_C::bPendingAsyncPreview' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, bHasPendingTarget) == 0x0002F9, "Member 'APlayerCellItemBase_C::bHasPendingTarget' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, SpawnTransformActorRef) == 0x000300, "Member 'APlayerCellItemBase_C::SpawnTransformActorRef' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, WallMeshRef) == 0x000308, "Member 'APlayerCellItemBase_C::WallMeshRef' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, CameraFocusOffset) == 0x000310, "Member 'APlayerCellItemBase_C::CameraFocusOffset' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, CurrentPCD) == 0x000320, "Member 'APlayerCellItemBase_C::CurrentPCD' has a wrong offset!");

}

