#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerFace_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlayerFace_AnimBlueprint.PlayerFace_AnimBlueprint_C.ExecuteUbergraph_PlayerFace_AnimBlueprint
// 0x0088 (0x0088 - 0x0000)
struct PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ARBPlayer* RBPlayer)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_CustomEvent_rbPlayer;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPoseAsset*                             CallFunc_GetFacePoseAsset_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer_BP_C*                         K2Node_DynamicCast_AsRB_Player_BP;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPoseAsset*                             CallFunc_GetFacePoseAsset_ReturnValue_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint) == 0x000008, "Wrong alignment on PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint");
static_assert(sizeof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint) == 0x000088, "Wrong size on PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, EntryPoint) == 0x000000, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, CallFunc_GetRBGameStateLobby_ReturnValue) == 0x000008, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::CallFunc_GetRBGameStateLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000012, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000013, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000014, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000028, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, K2Node_CustomEvent_rbPlayer) == 0x000030, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::K2Node_CustomEvent_rbPlayer' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, CallFunc_GetFacePoseAsset_ReturnValue) == 0x000038, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::CallFunc_GetFacePoseAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue) == 0x000040, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, CallFunc_GetOwningActor_ReturnValue) == 0x000048, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, K2Node_DynamicCast_AsRB_Player_BP) == 0x000058, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::K2Node_DynamicCast_AsRB_Player_BP' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, CallFunc_GetFacePoseAsset_ReturnValue_1) == 0x000068, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::CallFunc_GetFacePoseAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000070, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_1) == 0x000078, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000080, "Member 'PlayerFace_AnimBlueprint_C_ExecuteUbergraph_PlayerFace_AnimBlueprint::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");

// Function PlayerFace_AnimBlueprint.PlayerFace_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct PlayerFace_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerFace_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on PlayerFace_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(PlayerFace_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on PlayerFace_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'PlayerFace_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function PlayerFace_AnimBlueprint.PlayerFace_AnimBlueprint_C.Update Face Poses
// 0x0008 (0x0008 - 0x0000)
struct PlayerFace_AnimBlueprint_C_Update_Face_Poses final
{
public:
	class ARBPlayer*                              RBPlayer;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerFace_AnimBlueprint_C_Update_Face_Poses) == 0x000008, "Wrong alignment on PlayerFace_AnimBlueprint_C_Update_Face_Poses");
static_assert(sizeof(PlayerFace_AnimBlueprint_C_Update_Face_Poses) == 0x000008, "Wrong size on PlayerFace_AnimBlueprint_C_Update_Face_Poses");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_Update_Face_Poses, RBPlayer) == 0x000000, "Member 'PlayerFace_AnimBlueprint_C_Update_Face_Poses::RBPlayer' has a wrong offset!");

// Function PlayerFace_AnimBlueprint.PlayerFace_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct PlayerFace_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(PlayerFace_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on PlayerFace_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(PlayerFace_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on PlayerFace_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(PlayerFace_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'PlayerFace_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

