#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerStatus

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function PlayerStatus.PlayerStatus_C.ExecuteUbergraph_PlayerStatus
// 0x0050 (0x0050 - 0x0000)
struct PlayerStatus_C_ExecuteUbergraph_PlayerStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStatus_C_ExecuteUbergraph_PlayerStatus) == 0x000008, "Wrong alignment on PlayerStatus_C_ExecuteUbergraph_PlayerStatus");
static_assert(sizeof(PlayerStatus_C_ExecuteUbergraph_PlayerStatus) == 0x000050, "Wrong size on PlayerStatus_C_ExecuteUbergraph_PlayerStatus");
static_assert(offsetof(PlayerStatus_C_ExecuteUbergraph_PlayerStatus, EntryPoint) == 0x000000, "Member 'PlayerStatus_C_ExecuteUbergraph_PlayerStatus::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_ExecuteUbergraph_PlayerStatus, K2Node_Event_MyGeometry) == 0x000004, "Member 'PlayerStatus_C_ExecuteUbergraph_PlayerStatus::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_ExecuteUbergraph_PlayerStatus, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'PlayerStatus_C_ExecuteUbergraph_PlayerStatus::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_ExecuteUbergraph_PlayerStatus, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'PlayerStatus_C_ExecuteUbergraph_PlayerStatus::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_ExecuteUbergraph_PlayerStatus, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000048, "Member 'PlayerStatus_C_ExecuteUbergraph_PlayerStatus::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function PlayerStatus.PlayerStatus_C.Tick
// 0x003C (0x003C - 0x0000)
struct PlayerStatus_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStatus_C_Tick) == 0x000004, "Wrong alignment on PlayerStatus_C_Tick");
static_assert(sizeof(PlayerStatus_C_Tick) == 0x00003C, "Wrong size on PlayerStatus_C_Tick");
static_assert(offsetof(PlayerStatus_C_Tick, MyGeometry) == 0x000000, "Member 'PlayerStatus_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_Tick, InDeltaTime) == 0x000038, "Member 'PlayerStatus_C_Tick::InDeltaTime' has a wrong offset!");

// Function PlayerStatus.PlayerStatus_C.UpdateProgress
// 0x000C (0x000C - 0x0000)
struct PlayerStatus_C_UpdateProgress final
{
public:
	float                                         KnockdownBleedoutTime;                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TimeLeft;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerStatus_C_UpdateProgress) == 0x000004, "Wrong alignment on PlayerStatus_C_UpdateProgress");
static_assert(sizeof(PlayerStatus_C_UpdateProgress) == 0x00000C, "Wrong size on PlayerStatus_C_UpdateProgress");
static_assert(offsetof(PlayerStatus_C_UpdateProgress, KnockdownBleedoutTime) == 0x000000, "Member 'PlayerStatus_C_UpdateProgress::KnockdownBleedoutTime' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_UpdateProgress, TimeLeft) == 0x000004, "Member 'PlayerStatus_C_UpdateProgress::TimeLeft' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_UpdateProgress, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'PlayerStatus_C_UpdateProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PlayerStatus.PlayerStatus_C.OnPlayerStatusChanged
// 0x0018 (0x0018 - 0x0000)
struct PlayerStatus_C_OnPlayerStatusChanged final
{
public:
	EPlayerIndicatorType                          NewPlayerStatus;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AF6[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerStatus_C_OnPlayerStatusChanged) == 0x000008, "Wrong alignment on PlayerStatus_C_OnPlayerStatusChanged");
static_assert(sizeof(PlayerStatus_C_OnPlayerStatusChanged) == 0x000018, "Wrong size on PlayerStatus_C_OnPlayerStatusChanged");
static_assert(offsetof(PlayerStatus_C_OnPlayerStatusChanged, NewPlayerStatus) == 0x000000, "Member 'PlayerStatus_C_OnPlayerStatusChanged::NewPlayerStatus' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_OnPlayerStatusChanged, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000004, "Member 'PlayerStatus_C_OnPlayerStatusChanged::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_OnPlayerStatusChanged, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'PlayerStatus_C_OnPlayerStatusChanged::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_OnPlayerStatusChanged, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'PlayerStatus_C_OnPlayerStatusChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PlayerStatus.PlayerStatus_C.OnCompletingObjectiveChanged
// 0x0001 (0x0001 - 0x0000)
struct PlayerStatus_C_OnCompletingObjectiveChanged final
{
public:
	bool                                          IsCompletingObjective;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerStatus_C_OnCompletingObjectiveChanged) == 0x000001, "Wrong alignment on PlayerStatus_C_OnCompletingObjectiveChanged");
static_assert(sizeof(PlayerStatus_C_OnCompletingObjectiveChanged) == 0x000001, "Wrong size on PlayerStatus_C_OnCompletingObjectiveChanged");
static_assert(offsetof(PlayerStatus_C_OnCompletingObjectiveChanged, IsCompletingObjective) == 0x000000, "Member 'PlayerStatus_C_OnCompletingObjectiveChanged::IsCompletingObjective' has a wrong offset!");

// Function PlayerStatus.PlayerStatus_C.UpdateStatusIcon
// 0x0020 (0x0020 - 0x0000)
struct PlayerStatus_C_UpdateStatusIcon final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsIndicatorOfObjectiveType_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AF7[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetStatusIconTexture_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerStatus_C_UpdateStatusIcon) == 0x000008, "Wrong alignment on PlayerStatus_C_UpdateStatusIcon");
static_assert(sizeof(PlayerStatus_C_UpdateStatusIcon) == 0x000020, "Wrong size on PlayerStatus_C_UpdateStatusIcon");
static_assert(offsetof(PlayerStatus_C_UpdateStatusIcon, Temp_bool_Variable) == 0x000000, "Member 'PlayerStatus_C_UpdateStatusIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_UpdateStatusIcon, CallFunc_BP_IsIndicatorOfObjectiveType_ReturnValue) == 0x000001, "Member 'PlayerStatus_C_UpdateStatusIcon::CallFunc_BP_IsIndicatorOfObjectiveType_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_UpdateStatusIcon, CallFunc_GetStatusIconTexture_ReturnValue) == 0x000008, "Member 'PlayerStatus_C_UpdateStatusIcon::CallFunc_GetStatusIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_UpdateStatusIcon, K2Node_Select_Default) == 0x000010, "Member 'PlayerStatus_C_UpdateStatusIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_UpdateStatusIcon, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'PlayerStatus_C_UpdateStatusIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PlayerStatus.PlayerStatus_C.GetStatusIconTexture
// 0x01F0 (0x01F0 - 0x0000)
struct PlayerStatus_C_GetStatusIconTexture final
{
public:
	EPlayerIndicatorType                          PlayerIndicatorType;                               // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsObjective;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AF8[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalPawnHasASyringe;                              // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerIndicatorType                          Temp_byte_Variable;                                // 0x0011(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AF9[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPickup*                              CallFunc_GetHoldConsumeActionItem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AFA[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AFB[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_Map_Find_Value;                           // 0x0040(0x0088)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerIndicatorType                          K2Node_Select_Default;                             // 0x00C9(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AFC[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_Map_Find_Value_1;                         // 0x00D0(0x0088)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AFD[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select_Default_1;                           // 0x0160(0x0088)()
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerStatus_C_GetStatusIconTexture) == 0x000008, "Wrong alignment on PlayerStatus_C_GetStatusIconTexture");
static_assert(sizeof(PlayerStatus_C_GetStatusIconTexture) == 0x0001F0, "Wrong size on PlayerStatus_C_GetStatusIconTexture");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, PlayerIndicatorType) == 0x000000, "Member 'PlayerStatus_C_GetStatusIconTexture::PlayerIndicatorType' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, bIsObjective) == 0x000001, "Member 'PlayerStatus_C_GetStatusIconTexture::bIsObjective' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, ReturnValue) == 0x000008, "Member 'PlayerStatus_C_GetStatusIconTexture::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, LocalPawnHasASyringe) == 0x000010, "Member 'PlayerStatus_C_GetStatusIconTexture::LocalPawnHasASyringe' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, Temp_byte_Variable) == 0x000011, "Member 'PlayerStatus_C_GetStatusIconTexture::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, Temp_bool_Variable) == 0x000012, "Member 'PlayerStatus_C_GetStatusIconTexture::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_MakeLiteralByte_ReturnValue) == 0x000013, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_BooleanOR_ReturnValue) == 0x000015, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000016, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000017, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000019, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_GetHoldConsumeActionItem_ReturnValue) == 0x000020, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_GetHoldConsumeActionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000029, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, Temp_bool_Variable_1) == 0x00002A, "Member 'PlayerStatus_C_GetStatusIconTexture::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00002B, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000030, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_Map_Find_Value) == 0x000040, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_Map_Find_ReturnValue) == 0x0000C8, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, K2Node_Select_Default) == 0x0000C9, "Member 'PlayerStatus_C_GetStatusIconTexture::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_Map_Find_Value_1) == 0x0000D0, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_Map_Find_ReturnValue_1) == 0x000158, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, K2Node_Select_Default_1) == 0x000160, "Member 'PlayerStatus_C_GetStatusIconTexture::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PlayerStatus_C_GetStatusIconTexture, CallFunc_GetBrushResourceAsTexture2D_ReturnValue) == 0x0001E8, "Member 'PlayerStatus_C_GetStatusIconTexture::CallFunc_GetBrushResourceAsTexture2D_ReturnValue' has a wrong offset!");

}

