#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerPingIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerPingIcon.PlayerPingIcon_C
// 0x0040 (0x0390 - 0x0350)
class UPlayerPingIcon_C final : public URBHUDPlayerPingIconWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PingBounce;                                        // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               IconSize;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               IconSize_1;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIcon;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ItemIconSize;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ObjectiveIcon;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ObjectiveIcon_1;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerPingIcon(int32 EntryPoint);
	void Construct();
	void Event_Hide();
	void SetupIcon(class UTexture2D* Icon);
	void UpdateDisplay();
	void UpdateDesiredSize();
	void UpdateOpacity();

	bool ShouldShow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerPingIcon_C">();
	}
	static class UPlayerPingIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerPingIcon_C>();
	}
};
static_assert(alignof(UPlayerPingIcon_C) == 0x000008, "Wrong alignment on UPlayerPingIcon_C");
static_assert(sizeof(UPlayerPingIcon_C) == 0x000390, "Wrong size on UPlayerPingIcon_C");
static_assert(offsetof(UPlayerPingIcon_C, UberGraphFrame) == 0x000350, "Member 'UPlayerPingIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerPingIcon_C, PingBounce) == 0x000358, "Member 'UPlayerPingIcon_C::PingBounce' has a wrong offset!");
static_assert(offsetof(UPlayerPingIcon_C, IconSize) == 0x000360, "Member 'UPlayerPingIcon_C::IconSize' has a wrong offset!");
static_assert(offsetof(UPlayerPingIcon_C, IconSize_1) == 0x000368, "Member 'UPlayerPingIcon_C::IconSize_1' has a wrong offset!");
static_assert(offsetof(UPlayerPingIcon_C, ItemIcon) == 0x000370, "Member 'UPlayerPingIcon_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UPlayerPingIcon_C, ItemIconSize) == 0x000378, "Member 'UPlayerPingIcon_C::ItemIconSize' has a wrong offset!");
static_assert(offsetof(UPlayerPingIcon_C, ObjectiveIcon) == 0x000380, "Member 'UPlayerPingIcon_C::ObjectiveIcon' has a wrong offset!");
static_assert(offsetof(UPlayerPingIcon_C, ObjectiveIcon_1) == 0x000388, "Member 'UPlayerPingIcon_C::ObjectiveIcon_1' has a wrong offset!");

}

