#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerFace_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Player_Face_States_structs.hpp"
#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "Shared_Face_BaseEmotion_Enum_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PlayerFace_AnimBlueprint.PlayerFace_AnimBlueprint_C
// 0x1EB0 (0x2230 - 0x0380)
class UPlayerFace_AnimBlueprint_C final : public URBFaceAnimInstancePlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x03B8(0x01D8)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0590(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x06E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0710(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0738(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0760(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0788(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x07B0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x07D8(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x0898(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x08C0(0x0080)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode_4;                     // 0x0940(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x09E0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x0A10(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0A90(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0AD8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0B20(0x0028)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive;                 // 0x0B48(0x0038)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x0B80(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0C40(0x0028)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode_3;                     // 0x0C68(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x0D08(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x0D88(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x0E08(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x0E88(0x0080)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x0F08(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0FC0(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x1068(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x10E8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x1168(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x11E8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x1268(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x12E8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x1368(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x13E8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x1468(0x0080)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x14E8(0x00B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x15A0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1620(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x16A0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1720(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x17A0(0x0080)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x1820(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x18D8(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1980(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x19B0(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1A60(0x0028)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode_2;                     // 0x1A88(0x00A0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1B28(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x1BF0(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1CB0(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x1CE0(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1DA0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1DC8(0x0080)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode_1;                     // 0x1E48(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1EE8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1F18(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1F98(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2058(0x0028)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode;                       // 0x2080(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2120(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2150(0x00B0)()
	class UPoseAsset*                             Poses;                                             // 0x2200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          LipSyncAnim;                                       // 0x2208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasPoses;                                          // 0x2210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsExpressing;                                      // 0x2211(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2212[0x6];                                     // 0x2212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          ScriptedFaceAnim;                                  // 0x2218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDead;                                            // 0x2220(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSleeping;                                        // 0x2221(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EPlayer_Face_States                           FaceState;                                         // 0x2222(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEyesClosed;                                      // 0x2223(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EPlayerSpecificGesture                        WhichExpression;                                   // 0x2224(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInLobby;                                         // 0x2225(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EShared_Face_BaseEmotion_Enum                 BaseEmotion;                                       // 0x2226(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerFace_AnimBlueprint(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ScriptedFaceFeed();
	void LipSyncFeed();
	void Update_Face_Poses(class ARBPlayer* RBPlayer);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PlayerFace_AnimBlueprint_AnimGraphNode_TransitionResult_37DA42E7450E6B51C2A43EB963CB4A22();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PlayerFace_AnimBlueprint_AnimGraphNode_TransitionResult_DABDC9EF4637AF13A004E48636383B91();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PlayerFace_AnimBlueprint_AnimGraphNode_TransitionResult_97923E4F415468C899C8A59523741E7C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PlayerFace_AnimBlueprint_AnimGraphNode_TransitionResult_906E9C5C4AE767841E8623BAFD40A08F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PlayerFace_AnimBlueprint_AnimGraphNode_TransitionResult_50F1F86C468D09FE8EA9C184C3541823();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PlayerFace_AnimBlueprint_AnimGraphNode_TransitionResult_136AC66C4A8A31FE4BA347BFBD036A74();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerFace_AnimBlueprint_C">();
	}
	static class UPlayerFace_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerFace_AnimBlueprint_C>();
	}
};
static_assert(alignof(UPlayerFace_AnimBlueprint_C) == 0x000010, "Wrong alignment on UPlayerFace_AnimBlueprint_C");
static_assert(sizeof(UPlayerFace_AnimBlueprint_C) == 0x002230, "Wrong size on UPlayerFace_AnimBlueprint_C");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, UberGraphFrame) == 0x000380, "Member 'UPlayerFace_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_Root) == 0x000388, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_CopyPoseFromMesh) == 0x0003B8, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x000590, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_TransitionResult_5) == 0x0006E8, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_TransitionResult_4) == 0x000710, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_TransitionResult_3) == 0x000738, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_TransitionResult_2) == 0x000760, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_TransitionResult_1) == 0x000788, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_TransitionResult) == 0x0007B0, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend_4) == 0x0007D8, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend_4' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_UseCachedPose_5) == 0x000898, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_21) == 0x0008C0, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_21' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_PoseBlendNode_4) == 0x000940, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_PoseBlendNode_4' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_StateResult_4) == 0x0009E0, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_20) == 0x000A10, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_20' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_Slot_1) == 0x000A90, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_Slot) == 0x000AD8, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_UseCachedPose_4) == 0x000B20, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_MakeDynamicAdditive) == 0x000B48, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_MakeDynamicAdditive' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend_3) == 0x000B80, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend_3' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_UseCachedPose_3) == 0x000C40, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_PoseBlendNode_3) == 0x000C68, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_PoseBlendNode_3' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_19) == 0x000D08, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_19' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_18) == 0x000D88, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_18' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_17) == 0x000E08, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_17' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_16) == 0x000E88, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_16' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_BlendListByEnum_2) == 0x000F08, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_BlendListByEnum_2' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_BlendListByBool_1) == 0x000FC0, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_15) == 0x001068, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_14) == 0x0010E8, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_13) == 0x001168, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_12) == 0x0011E8, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_11) == 0x001268, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_10) == 0x0012E8, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_9) == 0x001368, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_8) == 0x0013E8, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_7) == 0x001468, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_BlendListByEnum_1) == 0x0014E8, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_BlendListByEnum_1' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_6) == 0x0015A0, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_5) == 0x001620, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_4) == 0x0016A0, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_3) == 0x001720, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_2) == 0x0017A0, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_BlendListByEnum) == 0x001820, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_BlendListByBool) == 0x0018D8, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_StateResult_3) == 0x001980, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_StateMachine_1) == 0x0019B0, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_UseCachedPose_2) == 0x001A60, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_PoseBlendNode_2) == 0x001A88, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_PoseBlendNode_2' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_ApplyAdditive) == 0x001B28, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend_2) == 0x001BF0, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend_2' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_StateResult_2) == 0x001CB0, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend_1) == 0x001CE0, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_UseCachedPose_1) == 0x001DA0, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer_1) == 0x001DC8, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_PoseBlendNode_1) == 0x001E48, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_PoseBlendNode_1' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_StateResult_1) == 0x001EE8, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x001F18, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend) == 0x001F98, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x002058, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_PoseBlendNode) == 0x002080, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_PoseBlendNode' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_StateResult) == 0x002120, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, AnimGraphNode_StateMachine) == 0x002150, "Member 'UPlayerFace_AnimBlueprint_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, Poses) == 0x002200, "Member 'UPlayerFace_AnimBlueprint_C::Poses' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, LipSyncAnim) == 0x002208, "Member 'UPlayerFace_AnimBlueprint_C::LipSyncAnim' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, HasPoses) == 0x002210, "Member 'UPlayerFace_AnimBlueprint_C::HasPoses' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, IsExpressing) == 0x002211, "Member 'UPlayerFace_AnimBlueprint_C::IsExpressing' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, ScriptedFaceAnim) == 0x002218, "Member 'UPlayerFace_AnimBlueprint_C::ScriptedFaceAnim' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, IsDead) == 0x002220, "Member 'UPlayerFace_AnimBlueprint_C::IsDead' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, IsSleeping) == 0x002221, "Member 'UPlayerFace_AnimBlueprint_C::IsSleeping' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, FaceState) == 0x002222, "Member 'UPlayerFace_AnimBlueprint_C::FaceState' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, IsEyesClosed) == 0x002223, "Member 'UPlayerFace_AnimBlueprint_C::IsEyesClosed' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, WhichExpression) == 0x002224, "Member 'UPlayerFace_AnimBlueprint_C::WhichExpression' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, IsInLobby) == 0x002225, "Member 'UPlayerFace_AnimBlueprint_C::IsInLobby' has a wrong offset!");
static_assert(offsetof(UPlayerFace_AnimBlueprint_C, BaseEmotion) == 0x002226, "Member 'UPlayerFace_AnimBlueprint_C::BaseEmotion' has a wrong offset!");

}

