#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerLoadoutHoverInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerLoadoutHoverInfo.PlayerLoadoutHoverInfo_C
// 0x0070 (0x02D0 - 0x0260)
class UPlayerLoadoutHoverInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBMenuButton_C*                        ActionButton;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        ActionButton2;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         DescriptionText;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ErrorBorder;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ErrorText;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InvisibleBackground;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Root;                                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TypeText;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsLoadout;                                        // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ELoadoutElementType                           LoadoutItemType;                                   // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F7[0x2];                                     // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ItemId;                                            // 0x02B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Tier;                                              // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             RequestNPCSetupActionButton;                       // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void IsTierLocked(bool* bIsTierLocked);
	void SetupActionButton2(const class FString& ActionName, const class FText& ActionText, bool bHold);
	void SetupActionButton(const class FString& ActionName, const class FText& ActionText, bool bHold);
	void SetupError(const class FText& Error);
	void SetupCoreUpgrade(class FName Param_ItemId, int32 Param_Tier);
	void SetupPerk(class FName Param_ItemId, int32 SlotIndex);
	void SetupRigUpgrade(class FName Param_ItemId, int32 SlotIndex);
	void SetupRig(class FName Param_ItemId);
	void OnLoadoutItemUnhovered();
	void OnLoadoutItemHovered(ELoadoutElementType Param_LoadoutItemType, const class FName& Param_ItemId, int32 Param_Tier);
	void Refresh();
	void Construct();
	void Destruct();
	void UpdateNPCActionButton(ELoadoutElementType NewCategory, bool SecondActionButton);
	void ExecuteUbergraph_PlayerLoadoutHoverInfo(int32 EntryPoint);
	void RequestNPCSetupActionButton__DelegateSignature(bool SecondActionButton);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerLoadoutHoverInfo_C">();
	}
	static class UPlayerLoadoutHoverInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerLoadoutHoverInfo_C>();
	}
};
static_assert(alignof(UPlayerLoadoutHoverInfo_C) == 0x000008, "Wrong alignment on UPlayerLoadoutHoverInfo_C");
static_assert(sizeof(UPlayerLoadoutHoverInfo_C) == 0x0002D0, "Wrong size on UPlayerLoadoutHoverInfo_C");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, UberGraphFrame) == 0x000260, "Member 'UPlayerLoadoutHoverInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, ActionButton) == 0x000268, "Member 'UPlayerLoadoutHoverInfo_C::ActionButton' has a wrong offset!");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, ActionButton2) == 0x000270, "Member 'UPlayerLoadoutHoverInfo_C::ActionButton2' has a wrong offset!");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, DescriptionText) == 0x000278, "Member 'UPlayerLoadoutHoverInfo_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, ErrorBorder) == 0x000280, "Member 'UPlayerLoadoutHoverInfo_C::ErrorBorder' has a wrong offset!");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, ErrorText) == 0x000288, "Member 'UPlayerLoadoutHoverInfo_C::ErrorText' has a wrong offset!");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, InvisibleBackground) == 0x000290, "Member 'UPlayerLoadoutHoverInfo_C::InvisibleBackground' has a wrong offset!");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, NameText) == 0x000298, "Member 'UPlayerLoadoutHoverInfo_C::NameText' has a wrong offset!");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, Root) == 0x0002A0, "Member 'UPlayerLoadoutHoverInfo_C::Root' has a wrong offset!");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, TypeText) == 0x0002A8, "Member 'UPlayerLoadoutHoverInfo_C::TypeText' has a wrong offset!");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, bIsLoadout) == 0x0002B0, "Member 'UPlayerLoadoutHoverInfo_C::bIsLoadout' has a wrong offset!");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, LoadoutItemType) == 0x0002B1, "Member 'UPlayerLoadoutHoverInfo_C::LoadoutItemType' has a wrong offset!");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, ItemId) == 0x0002B4, "Member 'UPlayerLoadoutHoverInfo_C::ItemId' has a wrong offset!");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, Tier) == 0x0002BC, "Member 'UPlayerLoadoutHoverInfo_C::Tier' has a wrong offset!");
static_assert(offsetof(UPlayerLoadoutHoverInfo_C, RequestNPCSetupActionButton) == 0x0002C0, "Member 'UPlayerLoadoutHoverInfo_C::RequestNPCSetupActionButton' has a wrong offset!");

}

