#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerPingIcon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PlayerPingIcon.PlayerPingIcon_C.ExecuteUbergraph_PlayerPingIcon
// 0x0040 (0x0040 - 0x0000)
struct PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A3C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Event_icon;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A3D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon) == 0x000008, "Wrong alignment on PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon");
static_assert(sizeof(PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon) == 0x000040, "Wrong size on PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon");
static_assert(offsetof(PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon, EntryPoint) == 0x000000, "Member 'PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon, K2Node_Event_icon) == 0x000008, "Member 'PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon::K2Node_Event_icon' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000020, "Member 'PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon, CallFunc_Map_Find_Value) == 0x000028, "Member 'PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon, CallFunc_Map_Find_ReturnValue) == 0x000038, "Member 'PlayerPingIcon_C_ExecuteUbergraph_PlayerPingIcon::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function PlayerPingIcon.PlayerPingIcon_C.SetupIcon
// 0x0008 (0x0008 - 0x0000)
struct PlayerPingIcon_C_SetupIcon final
{
public:
	class UTexture2D*                             Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerPingIcon_C_SetupIcon) == 0x000008, "Wrong alignment on PlayerPingIcon_C_SetupIcon");
static_assert(sizeof(PlayerPingIcon_C_SetupIcon) == 0x000008, "Wrong size on PlayerPingIcon_C_SetupIcon");
static_assert(offsetof(PlayerPingIcon_C_SetupIcon, Icon) == 0x000000, "Member 'PlayerPingIcon_C_SetupIcon::Icon' has a wrong offset!");

// Function PlayerPingIcon.PlayerPingIcon_C.UpdateDesiredSize
// 0x0030 (0x0030 - 0x0000)
struct PlayerPingIcon_C_UpdateDesiredSize final
{
public:
	float                                         CallFunc_BreakVector2D_X;                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerPingIcon_C_UpdateDesiredSize) == 0x000008, "Wrong alignment on PlayerPingIcon_C_UpdateDesiredSize");
static_assert(sizeof(PlayerPingIcon_C_UpdateDesiredSize) == 0x000030, "Wrong size on PlayerPingIcon_C_UpdateDesiredSize");
static_assert(offsetof(PlayerPingIcon_C_UpdateDesiredSize, CallFunc_BreakVector2D_X) == 0x000000, "Member 'PlayerPingIcon_C_UpdateDesiredSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_UpdateDesiredSize, CallFunc_BreakVector2D_Y) == 0x000004, "Member 'PlayerPingIcon_C_UpdateDesiredSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_UpdateDesiredSize, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000008, "Member 'PlayerPingIcon_C_UpdateDesiredSize::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_UpdateDesiredSize, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'PlayerPingIcon_C_UpdateDesiredSize::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_UpdateDesiredSize, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000014, "Member 'PlayerPingIcon_C_UpdateDesiredSize::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_UpdateDesiredSize, K2Node_MakeStruct_Margin) == 0x000018, "Member 'PlayerPingIcon_C_UpdateDesiredSize::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_UpdateDesiredSize, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000028, "Member 'PlayerPingIcon_C_UpdateDesiredSize::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");

// Function PlayerPingIcon.PlayerPingIcon_C.UpdateOpacity
// 0x0004 (0x0004 - 0x0000)
struct PlayerPingIcon_C_UpdateOpacity final
{
public:
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerPingIcon_C_UpdateOpacity) == 0x000004, "Wrong alignment on PlayerPingIcon_C_UpdateOpacity");
static_assert(sizeof(PlayerPingIcon_C_UpdateOpacity) == 0x000004, "Wrong size on PlayerPingIcon_C_UpdateOpacity");
static_assert(offsetof(PlayerPingIcon_C_UpdateOpacity, CallFunc_SelectFloat_ReturnValue) == 0x000000, "Member 'PlayerPingIcon_C_UpdateOpacity::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function PlayerPingIcon.PlayerPingIcon_C.ShouldShow
// 0x0018 (0x0018 - 0x0000)
struct PlayerPingIcon_C_ShouldShow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A3E[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldShow_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerPingIcon_C_ShouldShow) == 0x000008, "Wrong alignment on PlayerPingIcon_C_ShouldShow");
static_assert(sizeof(PlayerPingIcon_C_ShouldShow) == 0x000018, "Wrong size on PlayerPingIcon_C_ShouldShow");
static_assert(offsetof(PlayerPingIcon_C_ShouldShow, ReturnValue) == 0x000000, "Member 'PlayerPingIcon_C_ShouldShow::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_ShouldShow, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'PlayerPingIcon_C_ShouldShow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_ShouldShow, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000008, "Member 'PlayerPingIcon_C_ShouldShow::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_ShouldShow, CallFunc_Not_PreBool_ReturnValue_1) == 0x000010, "Member 'PlayerPingIcon_C_ShouldShow::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_ShouldShow, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000011, "Member 'PlayerPingIcon_C_ShouldShow::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_ShouldShow, CallFunc_ShouldShow_ReturnValue) == 0x000012, "Member 'PlayerPingIcon_C_ShouldShow::CallFunc_ShouldShow_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_ShouldShow, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'PlayerPingIcon_C_ShouldShow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_ShouldShow, CallFunc_BooleanAND_ReturnValue_1) == 0x000014, "Member 'PlayerPingIcon_C_ShouldShow::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerPingIcon_C_ShouldShow, CallFunc_BooleanAND_ReturnValue_2) == 0x000015, "Member 'PlayerPingIcon_C_ShouldShow::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

}

