#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerLoadoutsTab

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.HandleAllUpgradesSeenButtonClick
// 0x0008 (0x0008 - 0x0000)
struct PlayerLoadoutsTab_C_HandleAllUpgradesSeenButtonClick final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerLoadoutsTab_C_HandleAllUpgradesSeenButtonClick) == 0x000008, "Wrong alignment on PlayerLoadoutsTab_C_HandleAllUpgradesSeenButtonClick");
static_assert(sizeof(PlayerLoadoutsTab_C_HandleAllUpgradesSeenButtonClick) == 0x000008, "Wrong size on PlayerLoadoutsTab_C_HandleAllUpgradesSeenButtonClick");
static_assert(offsetof(PlayerLoadoutsTab_C_HandleAllUpgradesSeenButtonClick, Button) == 0x000000, "Member 'PlayerLoadoutsTab_C_HandleAllUpgradesSeenButtonClick::Button' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.HandleMenuTabRight
// 0x0002 (0x0002 - 0x0000)
struct PlayerLoadoutsTab_C_HandleMenuTabRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerLoadoutsTab_C_HandleMenuTabRight) == 0x000001, "Wrong alignment on PlayerLoadoutsTab_C_HandleMenuTabRight");
static_assert(sizeof(PlayerLoadoutsTab_C_HandleMenuTabRight) == 0x000002, "Wrong size on PlayerLoadoutsTab_C_HandleMenuTabRight");
static_assert(offsetof(PlayerLoadoutsTab_C_HandleMenuTabRight, ReturnValue) == 0x000000, "Member 'PlayerLoadoutsTab_C_HandleMenuTabRight::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_HandleMenuTabRight, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'PlayerLoadoutsTab_C_HandleMenuTabRight::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.HandleMenuTabLeft
// 0x0002 (0x0002 - 0x0000)
struct PlayerLoadoutsTab_C_HandleMenuTabLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerLoadoutsTab_C_HandleMenuTabLeft) == 0x000001, "Wrong alignment on PlayerLoadoutsTab_C_HandleMenuTabLeft");
static_assert(sizeof(PlayerLoadoutsTab_C_HandleMenuTabLeft) == 0x000002, "Wrong size on PlayerLoadoutsTab_C_HandleMenuTabLeft");
static_assert(offsetof(PlayerLoadoutsTab_C_HandleMenuTabLeft, ReturnValue) == 0x000000, "Member 'PlayerLoadoutsTab_C_HandleMenuTabLeft::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_HandleMenuTabLeft, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'PlayerLoadoutsTab_C_HandleMenuTabLeft::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.SetCategoryFocus
// 0x0018 (0x0018 - 0x0000)
struct PlayerLoadoutsTab_C_SetCategoryFocus final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELoadoutElementType                           Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1194[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerLoadoutsTab_C_SetCategoryFocus) == 0x000008, "Wrong alignment on PlayerLoadoutsTab_C_SetCategoryFocus");
static_assert(sizeof(PlayerLoadoutsTab_C_SetCategoryFocus) == 0x000018, "Wrong size on PlayerLoadoutsTab_C_SetCategoryFocus");
static_assert(offsetof(PlayerLoadoutsTab_C_SetCategoryFocus, Temp_bool_Variable) == 0x000000, "Member 'PlayerLoadoutsTab_C_SetCategoryFocus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_SetCategoryFocus, Temp_byte_Variable) == 0x000001, "Member 'PlayerLoadoutsTab_C_SetCategoryFocus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_SetCategoryFocus, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000002, "Member 'PlayerLoadoutsTab_C_SetCategoryFocus::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_SetCategoryFocus, CallFunc_Greater_IntInt_ReturnValue) == 0x000003, "Member 'PlayerLoadoutsTab_C_SetCategoryFocus::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_SetCategoryFocus, K2Node_Select_Default) == 0x000008, "Member 'PlayerLoadoutsTab_C_SetCategoryFocus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_SetCategoryFocus, K2Node_Select_Default_1) == 0x000010, "Member 'PlayerLoadoutsTab_C_SetCategoryFocus::K2Node_Select_Default_1' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct PlayerLoadoutsTab_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(PlayerLoadoutsTab_C_OnFocusReceived) == 0x000008, "Wrong alignment on PlayerLoadoutsTab_C_OnFocusReceived");
static_assert(sizeof(PlayerLoadoutsTab_C_OnFocusReceived) == 0x0001B0, "Wrong size on PlayerLoadoutsTab_C_OnFocusReceived");
static_assert(offsetof(PlayerLoadoutsTab_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'PlayerLoadoutsTab_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'PlayerLoadoutsTab_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'PlayerLoadoutsTab_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'PlayerLoadoutsTab_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.OnMenuRightClick
// 0x0010 (0x0010 - 0x0000)
struct PlayerLoadoutsTab_C_OnMenuRightClick final
{
public:
	class URBMenuWithTabsWidget*                  CallFunc_GetMenuWithTabsParent_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMenuFocused_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerLoadoutsTab_C_OnMenuRightClick) == 0x000008, "Wrong alignment on PlayerLoadoutsTab_C_OnMenuRightClick");
static_assert(sizeof(PlayerLoadoutsTab_C_OnMenuRightClick) == 0x000010, "Wrong size on PlayerLoadoutsTab_C_OnMenuRightClick");
static_assert(offsetof(PlayerLoadoutsTab_C_OnMenuRightClick, CallFunc_GetMenuWithTabsParent_ReturnValue) == 0x000000, "Member 'PlayerLoadoutsTab_C_OnMenuRightClick::CallFunc_GetMenuWithTabsParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_OnMenuRightClick, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000008, "Member 'PlayerLoadoutsTab_C_OnMenuRightClick::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_OnMenuRightClick, CallFunc_IsMenuFocused_ReturnValue) == 0x000009, "Member 'PlayerLoadoutsTab_C_OnMenuRightClick::CallFunc_IsMenuFocused_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_OnMenuRightClick, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000A, "Member 'PlayerLoadoutsTab_C_OnMenuRightClick::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_OnMenuRightClick, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'PlayerLoadoutsTab_C_OnMenuRightClick::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_OnMenuRightClick, CallFunc_BooleanAND_ReturnValue_1) == 0x00000C, "Member 'PlayerLoadoutsTab_C_OnMenuRightClick::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_OnMenuRightClick, CallFunc_BooleanAND_ReturnValue_2) == 0x00000D, "Member 'PlayerLoadoutsTab_C_OnMenuRightClick::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.IsReadyToClose
// 0x0002 (0x0002 - 0x0000)
struct PlayerLoadoutsTab_C_IsReadyToClose final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerLoadoutsTab_C_IsReadyToClose) == 0x000001, "Wrong alignment on PlayerLoadoutsTab_C_IsReadyToClose");
static_assert(sizeof(PlayerLoadoutsTab_C_IsReadyToClose) == 0x000002, "Wrong size on PlayerLoadoutsTab_C_IsReadyToClose");
static_assert(offsetof(PlayerLoadoutsTab_C_IsReadyToClose, ReturnValue) == 0x000000, "Member 'PlayerLoadoutsTab_C_IsReadyToClose::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_IsReadyToClose, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'PlayerLoadoutsTab_C_IsReadyToClose::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.GetPageSpecificButtons
// 0x0010 (0x0010 - 0x0000)
struct PlayerLoadoutsTab_C_GetPageSpecificButtons final
{
public:
	TArray<class UUserWidget*>                    OutButtons;                                        // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(PlayerLoadoutsTab_C_GetPageSpecificButtons) == 0x000008, "Wrong alignment on PlayerLoadoutsTab_C_GetPageSpecificButtons");
static_assert(sizeof(PlayerLoadoutsTab_C_GetPageSpecificButtons) == 0x000010, "Wrong size on PlayerLoadoutsTab_C_GetPageSpecificButtons");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSpecificButtons, OutButtons) == 0x000000, "Member 'PlayerLoadoutsTab_C_GetPageSpecificButtons::OutButtons' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.SaveLoadout
// 0x0030 (0x0030 - 0x0000)
struct PlayerLoadoutsTab_C_SaveLoadout final
{
public:
	struct FRBPlayerLoadout                       CallFunc_GetMenuLoadout_ReturnValue;               // 0x0000(0x0018)()
	bool                                          CallFunc_CanEditLoadouts_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1195[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerLoadoutManager*                CallFunc_GetRBPlayerLoadoutManager_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBController*                          CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerLoadoutsTab_C_SaveLoadout) == 0x000008, "Wrong alignment on PlayerLoadoutsTab_C_SaveLoadout");
static_assert(sizeof(PlayerLoadoutsTab_C_SaveLoadout) == 0x000030, "Wrong size on PlayerLoadoutsTab_C_SaveLoadout");
static_assert(offsetof(PlayerLoadoutsTab_C_SaveLoadout, CallFunc_GetMenuLoadout_ReturnValue) == 0x000000, "Member 'PlayerLoadoutsTab_C_SaveLoadout::CallFunc_GetMenuLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_SaveLoadout, CallFunc_CanEditLoadouts_ReturnValue) == 0x000018, "Member 'PlayerLoadoutsTab_C_SaveLoadout::CallFunc_CanEditLoadouts_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_SaveLoadout, CallFunc_GetRBPlayerLoadoutManager_ReturnValue) == 0x000020, "Member 'PlayerLoadoutsTab_C_SaveLoadout::CallFunc_GetRBPlayerLoadoutManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_SaveLoadout, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000028, "Member 'PlayerLoadoutsTab_C_SaveLoadout::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.ChangeCategory
// 0x00D0 (0x00D0 - 0x0000)
struct PlayerLoadoutsTab_C_ChangeCategory final
{
public:
	ELoadoutElementType                           Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1196[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1197[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELoadoutElementType                           Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1198[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasRecentlyBoughtAnyUpgrade_ReturnValue;  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1199[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class URBMenuButton_C* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class ARBSAS*                                 CallFunc_GetCurrentSAS_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119A[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119B[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuWithTabsWidget*                  CallFunc_GetMenuWithTabsParent_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USASLoadoutMenu_C*                      K2Node_DynamicCast_AsSAS_Loadout_Menu;             // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119C[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterSheet_C*                      K2Node_DynamicCast_AsCharacter_Sheet;              // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerLoadoutsTab_C_ChangeCategory) == 0x000008, "Wrong alignment on PlayerLoadoutsTab_C_ChangeCategory");
static_assert(sizeof(PlayerLoadoutsTab_C_ChangeCategory) == 0x0000D0, "Wrong size on PlayerLoadoutsTab_C_ChangeCategory");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, Category) == 0x000000, "Member 'PlayerLoadoutsTab_C_ChangeCategory::Category' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, Temp_text_Variable) == 0x000008, "Member 'PlayerLoadoutsTab_C_ChangeCategory::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'PlayerLoadoutsTab_C_ChangeCategory::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, CallFunc_Create_ReturnValue) == 0x000028, "Member 'PlayerLoadoutsTab_C_ChangeCategory::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, Temp_byte_Variable) == 0x000030, "Member 'PlayerLoadoutsTab_C_ChangeCategory::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, Temp_object_Variable) == 0x000038, "Member 'PlayerLoadoutsTab_C_ChangeCategory::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, Temp_object_Variable_1) == 0x000040, "Member 'PlayerLoadoutsTab_C_ChangeCategory::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, Temp_object_Variable_2) == 0x000048, "Member 'PlayerLoadoutsTab_C_ChangeCategory::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, Temp_object_Variable_3) == 0x000050, "Member 'PlayerLoadoutsTab_C_ChangeCategory::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, Temp_object_Variable_4) == 0x000058, "Member 'PlayerLoadoutsTab_C_ChangeCategory::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, CallFunc_HasRecentlyBoughtAnyUpgrade_ReturnValue) == 0x000060, "Member 'PlayerLoadoutsTab_C_ChangeCategory::CallFunc_HasRecentlyBoughtAnyUpgrade_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'PlayerLoadoutsTab_C_ChangeCategory::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, CallFunc_Array_Add_ReturnValue) == 0x000074, "Member 'PlayerLoadoutsTab_C_ChangeCategory::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, K2Node_CreateDelegate_OutputDelegate_1) == 0x000078, "Member 'PlayerLoadoutsTab_C_ChangeCategory::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, CallFunc_GetCurrentSAS_ReturnValue) == 0x000088, "Member 'PlayerLoadoutsTab_C_ChangeCategory::CallFunc_GetCurrentSAS_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'PlayerLoadoutsTab_C_ChangeCategory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, K2Node_Select_Default) == 0x000098, "Member 'PlayerLoadoutsTab_C_ChangeCategory::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A0, "Member 'PlayerLoadoutsTab_C_ChangeCategory::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, CallFunc_GetMenuWithTabsParent_ReturnValue) == 0x0000A8, "Member 'PlayerLoadoutsTab_C_ChangeCategory::CallFunc_GetMenuWithTabsParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, K2Node_DynamicCast_AsSAS_Loadout_Menu) == 0x0000B0, "Member 'PlayerLoadoutsTab_C_ChangeCategory::K2Node_DynamicCast_AsSAS_Loadout_Menu' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'PlayerLoadoutsTab_C_ChangeCategory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, K2Node_DynamicCast_AsCharacter_Sheet) == 0x0000C0, "Member 'PlayerLoadoutsTab_C_ChangeCategory::K2Node_DynamicCast_AsCharacter_Sheet' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ChangeCategory, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'PlayerLoadoutsTab_C_ChangeCategory::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_1_OnRigClicked__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_1_OnRigClicked__DelegateSignature final
{
public:
	class FName                                   ItemId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActiveSkillType                              ActiveSkillType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_1_OnRigClicked__DelegateSignature) == 0x000004, "Wrong alignment on PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_1_OnRigClicked__DelegateSignature");
static_assert(sizeof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_1_OnRigClicked__DelegateSignature) == 0x00000C, "Wrong size on PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_1_OnRigClicked__DelegateSignature");
static_assert(offsetof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_1_OnRigClicked__DelegateSignature, ItemId) == 0x000000, "Member 'PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_1_OnRigClicked__DelegateSignature::ItemId' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_1_OnRigClicked__DelegateSignature, ActiveSkillType) == 0x000008, "Member 'PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_1_OnRigClicked__DelegateSignature::ActiveSkillType' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.BndEvt__PlayerLoadoutsTab_CoreUpgradeTierList_K2Node_ComponentBoundEvent_2_OnTierClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_CoreUpgradeTierList_K2Node_ComponentBoundEvent_2_OnTierClicked__DelegateSignature final
{
public:
	int32                                         Tier;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_CoreUpgradeTierList_K2Node_ComponentBoundEvent_2_OnTierClicked__DelegateSignature) == 0x000004, "Wrong alignment on PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_CoreUpgradeTierList_K2Node_ComponentBoundEvent_2_OnTierClicked__DelegateSignature");
static_assert(sizeof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_CoreUpgradeTierList_K2Node_ComponentBoundEvent_2_OnTierClicked__DelegateSignature) == 0x000004, "Wrong size on PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_CoreUpgradeTierList_K2Node_ComponentBoundEvent_2_OnTierClicked__DelegateSignature");
static_assert(offsetof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_CoreUpgradeTierList_K2Node_ComponentBoundEvent_2_OnTierClicked__DelegateSignature, Tier) == 0x000000, "Member 'PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_CoreUpgradeTierList_K2Node_ComponentBoundEvent_2_OnTierClicked__DelegateSignature::Tier' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.BndEvt__PlayerLoadoutsTab_LoadoutRecap_K2Node_ComponentBoundEvent_3_OnPerkSlotsButtonClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_LoadoutRecap_K2Node_ComponentBoundEvent_3_OnPerkSlotsButtonClicked__DelegateSignature final
{
public:
	EPerkCategory                                 PerkCategory;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_LoadoutRecap_K2Node_ComponentBoundEvent_3_OnPerkSlotsButtonClicked__DelegateSignature) == 0x000001, "Wrong alignment on PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_LoadoutRecap_K2Node_ComponentBoundEvent_3_OnPerkSlotsButtonClicked__DelegateSignature");
static_assert(sizeof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_LoadoutRecap_K2Node_ComponentBoundEvent_3_OnPerkSlotsButtonClicked__DelegateSignature) == 0x000001, "Wrong size on PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_LoadoutRecap_K2Node_ComponentBoundEvent_3_OnPerkSlotsButtonClicked__DelegateSignature");
static_assert(offsetof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_LoadoutRecap_K2Node_ComponentBoundEvent_3_OnPerkSlotsButtonClicked__DelegateSignature, PerkCategory) == 0x000000, "Member 'PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_LoadoutRecap_K2Node_ComponentBoundEvent_3_OnPerkSlotsButtonClicked__DelegateSignature::PerkCategory' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.BndEvt__PlayerLoadoutsTab_PerkList_K2Node_ComponentBoundEvent_4_OnUpgradeClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_PerkList_K2Node_ComponentBoundEvent_4_OnUpgradeClicked__DelegateSignature final
{
public:
	class FName                                   ItemId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_PerkList_K2Node_ComponentBoundEvent_4_OnUpgradeClicked__DelegateSignature) == 0x000004, "Wrong alignment on PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_PerkList_K2Node_ComponentBoundEvent_4_OnUpgradeClicked__DelegateSignature");
static_assert(sizeof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_PerkList_K2Node_ComponentBoundEvent_4_OnUpgradeClicked__DelegateSignature) == 0x000008, "Wrong size on PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_PerkList_K2Node_ComponentBoundEvent_4_OnUpgradeClicked__DelegateSignature");
static_assert(offsetof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_PerkList_K2Node_ComponentBoundEvent_4_OnUpgradeClicked__DelegateSignature, ItemId) == 0x000000, "Member 'PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_PerkList_K2Node_ComponentBoundEvent_4_OnUpgradeClicked__DelegateSignature::ItemId' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_6_OnRigHovered__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_6_OnRigHovered__DelegateSignature final
{
public:
	class FName                                   ItemId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActiveSkillType                              ActiveSkillType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_6_OnRigHovered__DelegateSignature) == 0x000004, "Wrong alignment on PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_6_OnRigHovered__DelegateSignature");
static_assert(sizeof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_6_OnRigHovered__DelegateSignature) == 0x00000C, "Wrong size on PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_6_OnRigHovered__DelegateSignature");
static_assert(offsetof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_6_OnRigHovered__DelegateSignature, ItemId) == 0x000000, "Member 'PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_6_OnRigHovered__DelegateSignature::ItemId' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_6_OnRigHovered__DelegateSignature, ActiveSkillType) == 0x000008, "Member 'PlayerLoadoutsTab_C_BndEvt__PlayerLoadoutsTab_RigList_K2Node_ComponentBoundEvent_6_OnRigHovered__DelegateSignature::ActiveSkillType' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.OnTabButtonClicked
// 0x0001 (0x0001 - 0x0000)
struct PlayerLoadoutsTab_C_OnTabButtonClicked final
{
public:
	EPerkCategory                                 NewCategory;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerLoadoutsTab_C_OnTabButtonClicked) == 0x000001, "Wrong alignment on PlayerLoadoutsTab_C_OnTabButtonClicked");
static_assert(sizeof(PlayerLoadoutsTab_C_OnTabButtonClicked) == 0x000001, "Wrong size on PlayerLoadoutsTab_C_OnTabButtonClicked");
static_assert(offsetof(PlayerLoadoutsTab_C_OnTabButtonClicked, NewCategory) == 0x000000, "Member 'PlayerLoadoutsTab_C_OnTabButtonClicked::NewCategory' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.OnPerkListCategoryChanged
// 0x0001 (0x0001 - 0x0000)
struct PlayerLoadoutsTab_C_OnPerkListCategoryChanged final
{
public:
	EPerkCategory                                 NewCategory;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerLoadoutsTab_C_OnPerkListCategoryChanged) == 0x000001, "Wrong alignment on PlayerLoadoutsTab_C_OnPerkListCategoryChanged");
static_assert(sizeof(PlayerLoadoutsTab_C_OnPerkListCategoryChanged) == 0x000001, "Wrong size on PlayerLoadoutsTab_C_OnPerkListCategoryChanged");
static_assert(offsetof(PlayerLoadoutsTab_C_OnPerkListCategoryChanged, NewCategory) == 0x000000, "Member 'PlayerLoadoutsTab_C_OnPerkListCategoryChanged::NewCategory' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.ExecuteUbergraph_PlayerLoadoutsTab
// 0x00A0 (0x00A0 - 0x0000)
struct PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELoadoutElementType                           Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELoadoutElementType                           Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELoadoutElementType                           Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELoadoutElementType                           Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELoadoutElementType                           Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELoadoutElementType                           Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119D[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPerkCategory NewCategory)>    K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_119E[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBPlayerLoadout                       CallFunc_GetMenuLoadout_ReturnValue;               // 0x0020(0x0018)()
	class FName                                   K2Node_ComponentBoundEvent_itemId_2;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActiveSkillType                              K2Node_ComponentBoundEvent_activeSkillType_1;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ToggleActiveSkillInMenuloadout_ReturnValue; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119F[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_tier;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELoadoutElementType                           K2Node_Select_Default;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPerkCategory                                 K2Node_ComponentBoundEvent_PerkCategory;           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A0[0x1];                                     // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_itemId_1;               // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TogglePerkInMenuLoadout_ReturnValue;      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A1[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_ComponentBoundEvent_itemId;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActiveSkillType                              K2Node_ComponentBoundEvent_activeSkillType;        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEditLoadouts_ReturnValue;              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanEditLoadouts_ReturnValue_1;            // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPerkCategory                                 K2Node_CustomEvent_newCategory_1;                  // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPerkCategory                                 K2Node_CustomEvent_newCategory;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A2[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetNavigationOverrideWidget_ReturnValue;  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPerkListTabs_C*                        K2Node_DynamicCast_AsPerk_List_Tabs;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A3[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPerkListTabs_C*                        K2Node_DynamicCast_AsPerk_List_Tabs_1;             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab) == 0x000008, "Wrong alignment on PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab");
static_assert(sizeof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab) == 0x0000A0, "Wrong size on PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, EntryPoint) == 0x000000, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, Temp_byte_Variable) == 0x000004, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, Temp_byte_Variable_1) == 0x000005, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, Temp_byte_Variable_2) == 0x000006, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, Temp_byte_Variable_3) == 0x000007, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, Temp_byte_Variable_4) == 0x000008, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, Temp_byte_Variable_5) == 0x000009, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, CallFunc_GetMenuLoadout_ReturnValue) == 0x000020, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::CallFunc_GetMenuLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_ComponentBoundEvent_itemId_2) == 0x000038, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_ComponentBoundEvent_itemId_2' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_ComponentBoundEvent_activeSkillType_1) == 0x000040, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_ComponentBoundEvent_activeSkillType_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, CallFunc_ToggleActiveSkillInMenuloadout_ReturnValue) == 0x000041, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::CallFunc_ToggleActiveSkillInMenuloadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_ComponentBoundEvent_tier) == 0x000044, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_ComponentBoundEvent_tier' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_Select_Default) == 0x000048, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, CallFunc_Greater_IntInt_ReturnValue) == 0x000049, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_ComponentBoundEvent_PerkCategory) == 0x00004A, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_ComponentBoundEvent_PerkCategory' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_ComponentBoundEvent_itemId_1) == 0x00004C, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_ComponentBoundEvent_itemId_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, CallFunc_TogglePerkInMenuLoadout_ReturnValue) == 0x000054, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::CallFunc_TogglePerkInMenuLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_ComponentBoundEvent_itemId) == 0x000068, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_ComponentBoundEvent_itemId' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_ComponentBoundEvent_activeSkillType) == 0x000070, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_ComponentBoundEvent_activeSkillType' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, CallFunc_CanEditLoadouts_ReturnValue) == 0x000071, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::CallFunc_CanEditLoadouts_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, CallFunc_CanEditLoadouts_ReturnValue_1) == 0x000072, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::CallFunc_CanEditLoadouts_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_CustomEvent_newCategory_1) == 0x000073, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_CustomEvent_newCategory_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_CustomEvent_newCategory) == 0x000074, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_CustomEvent_newCategory' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, CallFunc_GetNavigationOverrideWidget_ReturnValue) == 0x000078, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::CallFunc_GetNavigationOverrideWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_DynamicCast_AsPerk_List_Tabs) == 0x000080, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_DynamicCast_AsPerk_List_Tabs' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_DynamicCast_AsPerk_List_Tabs_1) == 0x000090, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_DynamicCast_AsPerk_List_Tabs_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'PlayerLoadoutsTab_C_ExecuteUbergraph_PlayerLoadoutsTab::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.GetNavigationOverrideWidget
// 0x0030 (0x0030 - 0x0000)
struct PlayerLoadoutsTab_C_GetNavigationOverrideWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A4[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetNavigationOverrideWidget_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A5[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerLoadoutsTab_C_GetNavigationOverrideWidget) == 0x000008, "Wrong alignment on PlayerLoadoutsTab_C_GetNavigationOverrideWidget");
static_assert(sizeof(PlayerLoadoutsTab_C_GetNavigationOverrideWidget) == 0x000030, "Wrong size on PlayerLoadoutsTab_C_GetNavigationOverrideWidget");
static_assert(offsetof(PlayerLoadoutsTab_C_GetNavigationOverrideWidget, ReturnValue) == 0x000000, "Member 'PlayerLoadoutsTab_C_GetNavigationOverrideWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetNavigationOverrideWidget, Temp_bool_Variable) == 0x000008, "Member 'PlayerLoadoutsTab_C_GetNavigationOverrideWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetNavigationOverrideWidget, Temp_object_Variable) == 0x000010, "Member 'PlayerLoadoutsTab_C_GetNavigationOverrideWidget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetNavigationOverrideWidget, CallFunc_GetNavigationOverrideWidget_ReturnValue) == 0x000018, "Member 'PlayerLoadoutsTab_C_GetNavigationOverrideWidget::CallFunc_GetNavigationOverrideWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetNavigationOverrideWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000020, "Member 'PlayerLoadoutsTab_C_GetNavigationOverrideWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetNavigationOverrideWidget, K2Node_Select_Default) == 0x000028, "Member 'PlayerLoadoutsTab_C_GetNavigationOverrideWidget::K2Node_Select_Default' has a wrong offset!");

// Function PlayerLoadoutsTab.PlayerLoadoutsTab_C.GetPageSubtitle
// 0x0208 (0x0208 - 0x0000)
struct PlayerLoadoutsTab_C_GetPageSubtitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A6[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	ELoadoutElementType                           Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A7[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0070(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A8[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00F8(0x0018)()
	struct FActiveSkillCommonParams               CallFunc_GetActiveSkillCommonParams_ReturnValue;   // 0x0110(0x0078)(ConstParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0188(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01D8(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x01F0(0x0018)()
};
static_assert(alignof(PlayerLoadoutsTab_C_GetPageSubtitle) == 0x000008, "Wrong alignment on PlayerLoadoutsTab_C_GetPageSubtitle");
static_assert(sizeof(PlayerLoadoutsTab_C_GetPageSubtitle) == 0x000208, "Wrong size on PlayerLoadoutsTab_C_GetPageSubtitle");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, ReturnValue) == 0x000000, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, Temp_bool_Variable) == 0x000018, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, Temp_text_Variable) == 0x000020, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, Temp_byte_Variable) == 0x000038, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, Temp_text_Variable_1) == 0x000040, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, Temp_text_Variable_2) == 0x000058, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, Temp_text_Variable_3) == 0x000070, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C8, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, K2Node_MakeArray_Array) == 0x0000D0, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, K2Node_Select_Default) == 0x0000F8, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, CallFunc_GetActiveSkillCommonParams_ReturnValue) == 0x000110, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::CallFunc_GetActiveSkillCommonParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, K2Node_MakeStruct_FormatArgumentData_1) == 0x000188, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, K2Node_MakeArray_Array_1) == 0x0001C8, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutsTab_C_GetPageSubtitle, CallFunc_Format_ReturnValue_1) == 0x0001D8, "Member 'PlayerLoadoutsTab_C_GetPageSubtitle::CallFunc_Format_ReturnValue_1' has a wrong offset!");
