#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgramPosterCarrousel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.UpdateScrollboxBehavior
// 0x0005 (0x0005 - 0x0000)
struct ProgramPosterCarrousel_C_UpdateScrollboxBehavior final
{
public:
	bool                                          IsUsingGamePad;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EConsumeMouseWheel                            Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConsumeMouseWheel                            Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConsumeMouseWheel                            K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrousel_C_UpdateScrollboxBehavior) == 0x000001, "Wrong alignment on ProgramPosterCarrousel_C_UpdateScrollboxBehavior");
static_assert(sizeof(ProgramPosterCarrousel_C_UpdateScrollboxBehavior) == 0x000005, "Wrong size on ProgramPosterCarrousel_C_UpdateScrollboxBehavior");
static_assert(offsetof(ProgramPosterCarrousel_C_UpdateScrollboxBehavior, IsUsingGamePad) == 0x000000, "Member 'ProgramPosterCarrousel_C_UpdateScrollboxBehavior::IsUsingGamePad' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_UpdateScrollboxBehavior, Temp_bool_Variable) == 0x000001, "Member 'ProgramPosterCarrousel_C_UpdateScrollboxBehavior::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_UpdateScrollboxBehavior, Temp_byte_Variable) == 0x000002, "Member 'ProgramPosterCarrousel_C_UpdateScrollboxBehavior::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_UpdateScrollboxBehavior, Temp_byte_Variable_1) == 0x000003, "Member 'ProgramPosterCarrousel_C_UpdateScrollboxBehavior::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_UpdateScrollboxBehavior, K2Node_Select_Default) == 0x000004, "Member 'ProgramPosterCarrousel_C_UpdateScrollboxBehavior::K2Node_Select_Default' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.GetRightCycleVisibility
// 0x0010 (0x0010 - 0x0000)
struct ProgramPosterCarrousel_C_GetRightCycleVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrousel_C_GetRightCycleVisibility) == 0x000004, "Wrong alignment on ProgramPosterCarrousel_C_GetRightCycleVisibility");
static_assert(sizeof(ProgramPosterCarrousel_C_GetRightCycleVisibility) == 0x000010, "Wrong size on ProgramPosterCarrousel_C_GetRightCycleVisibility");
static_assert(offsetof(ProgramPosterCarrousel_C_GetRightCycleVisibility, ReturnValue) == 0x000000, "Member 'ProgramPosterCarrousel_C_GetRightCycleVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetRightCycleVisibility, Temp_bool_Variable) == 0x000001, "Member 'ProgramPosterCarrousel_C_GetRightCycleVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetRightCycleVisibility, Temp_byte_Variable) == 0x000002, "Member 'ProgramPosterCarrousel_C_GetRightCycleVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetRightCycleVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'ProgramPosterCarrousel_C_GetRightCycleVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetRightCycleVisibility, CallFunc_GetScrollOffset_ReturnValue) == 0x000004, "Member 'ProgramPosterCarrousel_C_GetRightCycleVisibility::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetRightCycleVisibility, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000008, "Member 'ProgramPosterCarrousel_C_GetRightCycleVisibility::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetRightCycleVisibility, CallFunc_Less_FloatFloat_ReturnValue) == 0x00000C, "Member 'ProgramPosterCarrousel_C_GetRightCycleVisibility::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetRightCycleVisibility, K2Node_Select_Default) == 0x00000D, "Member 'ProgramPosterCarrousel_C_GetRightCycleVisibility::K2Node_Select_Default' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.GetLeftCycleVisibility
// 0x000C (0x000C - 0x0000)
struct ProgramPosterCarrousel_C_GetLeftCycleVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrousel_C_GetLeftCycleVisibility) == 0x000004, "Wrong alignment on ProgramPosterCarrousel_C_GetLeftCycleVisibility");
static_assert(sizeof(ProgramPosterCarrousel_C_GetLeftCycleVisibility) == 0x00000C, "Wrong size on ProgramPosterCarrousel_C_GetLeftCycleVisibility");
static_assert(offsetof(ProgramPosterCarrousel_C_GetLeftCycleVisibility, ReturnValue) == 0x000000, "Member 'ProgramPosterCarrousel_C_GetLeftCycleVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetLeftCycleVisibility, Temp_bool_Variable) == 0x000001, "Member 'ProgramPosterCarrousel_C_GetLeftCycleVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetLeftCycleVisibility, Temp_byte_Variable) == 0x000002, "Member 'ProgramPosterCarrousel_C_GetLeftCycleVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetLeftCycleVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'ProgramPosterCarrousel_C_GetLeftCycleVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetLeftCycleVisibility, CallFunc_GetScrollOffset_ReturnValue) == 0x000004, "Member 'ProgramPosterCarrousel_C_GetLeftCycleVisibility::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetLeftCycleVisibility, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'ProgramPosterCarrousel_C_GetLeftCycleVisibility::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetLeftCycleVisibility, K2Node_Select_Default) == 0x000009, "Member 'ProgramPosterCarrousel_C_GetLeftCycleVisibility::K2Node_Select_Default' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.GetLastHoveredPoster
// 0x0010 (0x0010 - 0x0000)
struct ProgramPosterCarrousel_C_GetLastHoveredPoster final
{
public:
	class UProgramPosterCarrouselEntry_C*         OutLastHoveredPoster;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgramPosterCarrouselEntry_C*         CallFunc_GetPosterForId_Poster;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrousel_C_GetLastHoveredPoster) == 0x000008, "Wrong alignment on ProgramPosterCarrousel_C_GetLastHoveredPoster");
static_assert(sizeof(ProgramPosterCarrousel_C_GetLastHoveredPoster) == 0x000010, "Wrong size on ProgramPosterCarrousel_C_GetLastHoveredPoster");
static_assert(offsetof(ProgramPosterCarrousel_C_GetLastHoveredPoster, OutLastHoveredPoster) == 0x000000, "Member 'ProgramPosterCarrousel_C_GetLastHoveredPoster::OutLastHoveredPoster' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetLastHoveredPoster, CallFunc_GetPosterForId_Poster) == 0x000008, "Member 'ProgramPosterCarrousel_C_GetLastHoveredPoster::CallFunc_GetPosterForId_Poster' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.OnFocusReceived
// 0x01D8 (0x01D8 - 0x0000)
struct ProgramPosterCarrousel_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class UProgramPosterCarrouselEntry_C*         CallFunc_GetLastHoveredPoster_outLastHoveredPoster; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FocusNavTestCheck_FocusCheck;             // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3674[0x6];                                     // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgramPosterCarrouselEntry_C*         CallFunc_GetCurrentlySelectedPoster_SelectedPoster; // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3675[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0120(0x00B8)()
};
static_assert(alignof(ProgramPosterCarrousel_C_OnFocusReceived) == 0x000008, "Wrong alignment on ProgramPosterCarrousel_C_OnFocusReceived");
static_assert(sizeof(ProgramPosterCarrousel_C_OnFocusReceived) == 0x0001D8, "Wrong size on ProgramPosterCarrousel_C_OnFocusReceived");
static_assert(offsetof(ProgramPosterCarrousel_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'ProgramPosterCarrousel_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'ProgramPosterCarrousel_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'ProgramPosterCarrousel_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_OnFocusReceived, CallFunc_GetLastHoveredPoster_outLastHoveredPoster) == 0x0000F8, "Member 'ProgramPosterCarrousel_C_OnFocusReceived::CallFunc_GetLastHoveredPoster_outLastHoveredPoster' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x000100, "Member 'ProgramPosterCarrousel_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_OnFocusReceived, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'ProgramPosterCarrousel_C_OnFocusReceived::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_OnFocusReceived, CallFunc_FocusNavTestCheck_FocusCheck) == 0x000109, "Member 'ProgramPosterCarrousel_C_OnFocusReceived::CallFunc_FocusNavTestCheck_FocusCheck' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_OnFocusReceived, CallFunc_GetCurrentlySelectedPoster_SelectedPoster) == 0x000110, "Member 'ProgramPosterCarrousel_C_OnFocusReceived::CallFunc_GetCurrentlySelectedPoster_SelectedPoster' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_OnFocusReceived, CallFunc_IsValid_ReturnValue_1) == 0x000118, "Member 'ProgramPosterCarrousel_C_OnFocusReceived::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000120, "Member 'ProgramPosterCarrousel_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.GetCurrentlySelectedPoster
// 0x0050 (0x0050 - 0x0000)
struct ProgramPosterCarrousel_C_GetCurrentlySelectedPoster final
{
public:
	class UProgramPosterCarrouselEntry_C*         SelectedPoster;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3676[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3677[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3678[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgramPosterCarrouselEntry_C*         K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgramPosterCarrousel_C_GetCurrentlySelectedPoster) == 0x000008, "Wrong alignment on ProgramPosterCarrousel_C_GetCurrentlySelectedPoster");
static_assert(sizeof(ProgramPosterCarrousel_C_GetCurrentlySelectedPoster) == 0x000050, "Wrong size on ProgramPosterCarrousel_C_GetCurrentlySelectedPoster");
static_assert(offsetof(ProgramPosterCarrousel_C_GetCurrentlySelectedPoster, SelectedPoster) == 0x000000, "Member 'ProgramPosterCarrousel_C_GetCurrentlySelectedPoster::SelectedPoster' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetCurrentlySelectedPoster, Temp_int_Array_Index_Variable) == 0x000008, "Member 'ProgramPosterCarrousel_C_GetCurrentlySelectedPoster::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetCurrentlySelectedPoster, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'ProgramPosterCarrousel_C_GetCurrentlySelectedPoster::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetCurrentlySelectedPoster, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'ProgramPosterCarrousel_C_GetCurrentlySelectedPoster::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetCurrentlySelectedPoster, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'ProgramPosterCarrousel_C_GetCurrentlySelectedPoster::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetCurrentlySelectedPoster, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'ProgramPosterCarrousel_C_GetCurrentlySelectedPoster::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetCurrentlySelectedPoster, CallFunc_Array_Get_Item) == 0x000030, "Member 'ProgramPosterCarrousel_C_GetCurrentlySelectedPoster::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetCurrentlySelectedPoster, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'ProgramPosterCarrousel_C_GetCurrentlySelectedPoster::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetCurrentlySelectedPoster, K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry) == 0x000040, "Member 'ProgramPosterCarrousel_C_GetCurrentlySelectedPoster::K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetCurrentlySelectedPoster, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'ProgramPosterCarrousel_C_GetCurrentlySelectedPoster::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.HandleLeftCycle
// 0x0010 (0x0010 - 0x0000)
struct ProgramPosterCarrousel_C_HandleLeftCycle final
{
public:
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrousel_C_HandleLeftCycle) == 0x000004, "Wrong alignment on ProgramPosterCarrousel_C_HandleLeftCycle");
static_assert(sizeof(ProgramPosterCarrousel_C_HandleLeftCycle) == 0x000010, "Wrong size on ProgramPosterCarrousel_C_HandleLeftCycle");
static_assert(offsetof(ProgramPosterCarrousel_C_HandleLeftCycle, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000000, "Member 'ProgramPosterCarrousel_C_HandleLeftCycle::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_HandleLeftCycle, CallFunc_GetScrollOffset_ReturnValue) == 0x000004, "Member 'ProgramPosterCarrousel_C_HandleLeftCycle::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_HandleLeftCycle, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'ProgramPosterCarrousel_C_HandleLeftCycle::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_HandleLeftCycle, CallFunc_FMax_ReturnValue) == 0x00000C, "Member 'ProgramPosterCarrousel_C_HandleLeftCycle::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.HandleRightCycle
// 0x0010 (0x0010 - 0x0000)
struct ProgramPosterCarrousel_C_HandleRightCycle final
{
public:
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrousel_C_HandleRightCycle) == 0x000004, "Wrong alignment on ProgramPosterCarrousel_C_HandleRightCycle");
static_assert(sizeof(ProgramPosterCarrousel_C_HandleRightCycle) == 0x000010, "Wrong size on ProgramPosterCarrousel_C_HandleRightCycle");
static_assert(offsetof(ProgramPosterCarrousel_C_HandleRightCycle, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000000, "Member 'ProgramPosterCarrousel_C_HandleRightCycle::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_HandleRightCycle, CallFunc_GetScrollOffset_ReturnValue) == 0x000004, "Member 'ProgramPosterCarrousel_C_HandleRightCycle::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_HandleRightCycle, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'ProgramPosterCarrousel_C_HandleRightCycle::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_HandleRightCycle, CallFunc_FMin_ReturnValue) == 0x00000C, "Member 'ProgramPosterCarrousel_C_HandleRightCycle::CallFunc_FMin_ReturnValue' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.GetFirstAvailablePoster
// 0x0050 (0x0050 - 0x0000)
struct ProgramPosterCarrousel_C_GetFirstAvailablePoster final
{
public:
	class UProgramPosterCarrouselEntry_C*         Poster;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3679[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_367A[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_367B[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgramPosterCarrouselEntry_C*         K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgramPosterCarrousel_C_GetFirstAvailablePoster) == 0x000008, "Wrong alignment on ProgramPosterCarrousel_C_GetFirstAvailablePoster");
static_assert(sizeof(ProgramPosterCarrousel_C_GetFirstAvailablePoster) == 0x000050, "Wrong size on ProgramPosterCarrousel_C_GetFirstAvailablePoster");
static_assert(offsetof(ProgramPosterCarrousel_C_GetFirstAvailablePoster, Poster) == 0x000000, "Member 'ProgramPosterCarrousel_C_GetFirstAvailablePoster::Poster' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetFirstAvailablePoster, Temp_int_Array_Index_Variable) == 0x000008, "Member 'ProgramPosterCarrousel_C_GetFirstAvailablePoster::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetFirstAvailablePoster, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'ProgramPosterCarrousel_C_GetFirstAvailablePoster::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetFirstAvailablePoster, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'ProgramPosterCarrousel_C_GetFirstAvailablePoster::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetFirstAvailablePoster, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'ProgramPosterCarrousel_C_GetFirstAvailablePoster::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetFirstAvailablePoster, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'ProgramPosterCarrousel_C_GetFirstAvailablePoster::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetFirstAvailablePoster, CallFunc_Array_Get_Item) == 0x000030, "Member 'ProgramPosterCarrousel_C_GetFirstAvailablePoster::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetFirstAvailablePoster, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'ProgramPosterCarrousel_C_GetFirstAvailablePoster::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetFirstAvailablePoster, K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry) == 0x000040, "Member 'ProgramPosterCarrousel_C_GetFirstAvailablePoster::K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetFirstAvailablePoster, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'ProgramPosterCarrousel_C_GetFirstAvailablePoster::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.GetPosterForId
// 0x0058 (0x0058 - 0x0000)
struct ProgramPosterCarrousel_C_GetPosterForId final
{
public:
	class FName                                   ProgramId;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgramPosterCarrouselEntry_C*         Poster;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_367C[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_367D[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_367E[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgramPosterCarrouselEntry_C*         K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgramPosterCarrousel_C_GetPosterForId) == 0x000008, "Wrong alignment on ProgramPosterCarrousel_C_GetPosterForId");
static_assert(sizeof(ProgramPosterCarrousel_C_GetPosterForId) == 0x000058, "Wrong size on ProgramPosterCarrousel_C_GetPosterForId");
static_assert(offsetof(ProgramPosterCarrousel_C_GetPosterForId, ProgramId) == 0x000000, "Member 'ProgramPosterCarrousel_C_GetPosterForId::ProgramId' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetPosterForId, Poster) == 0x000008, "Member 'ProgramPosterCarrousel_C_GetPosterForId::Poster' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetPosterForId, Temp_int_Array_Index_Variable) == 0x000010, "Member 'ProgramPosterCarrousel_C_GetPosterForId::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetPosterForId, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'ProgramPosterCarrousel_C_GetPosterForId::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetPosterForId, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'ProgramPosterCarrousel_C_GetPosterForId::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetPosterForId, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'ProgramPosterCarrousel_C_GetPosterForId::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetPosterForId, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'ProgramPosterCarrousel_C_GetPosterForId::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetPosterForId, CallFunc_Array_Get_Item) == 0x000038, "Member 'ProgramPosterCarrousel_C_GetPosterForId::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetPosterForId, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'ProgramPosterCarrousel_C_GetPosterForId::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetPosterForId, K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry) == 0x000048, "Member 'ProgramPosterCarrousel_C_GetPosterForId::K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetPosterForId, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ProgramPosterCarrousel_C_GetPosterForId::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_GetPosterForId, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000051, "Member 'ProgramPosterCarrousel_C_GetPosterForId::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.ClearDelegates
// 0x0048 (0x0048 - 0x0000)
struct ProgramPosterCarrousel_C_ClearDelegates final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_367F[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3680[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3681[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgramPosterCarrouselEntry_C*         K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgramPosterCarrousel_C_ClearDelegates) == 0x000008, "Wrong alignment on ProgramPosterCarrousel_C_ClearDelegates");
static_assert(sizeof(ProgramPosterCarrousel_C_ClearDelegates) == 0x000048, "Wrong size on ProgramPosterCarrousel_C_ClearDelegates");
static_assert(offsetof(ProgramPosterCarrousel_C_ClearDelegates, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ProgramPosterCarrousel_C_ClearDelegates::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_ClearDelegates, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ProgramPosterCarrousel_C_ClearDelegates::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_ClearDelegates, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ProgramPosterCarrousel_C_ClearDelegates::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_ClearDelegates, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'ProgramPosterCarrousel_C_ClearDelegates::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_ClearDelegates, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ProgramPosterCarrousel_C_ClearDelegates::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_ClearDelegates, CallFunc_Array_Get_Item) == 0x000028, "Member 'ProgramPosterCarrousel_C_ClearDelegates::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_ClearDelegates, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'ProgramPosterCarrousel_C_ClearDelegates::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_ClearDelegates, K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry) == 0x000038, "Member 'ProgramPosterCarrousel_C_ClearDelegates::K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_ClearDelegates, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'ProgramPosterCarrousel_C_ClearDelegates::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.HandlePosterUnhover
// 0x0008 (0x0008 - 0x0000)
struct ProgramPosterCarrousel_C_HandlePosterUnhover final
{
public:
	class FName                                   ProgramId;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrousel_C_HandlePosterUnhover) == 0x000004, "Wrong alignment on ProgramPosterCarrousel_C_HandlePosterUnhover");
static_assert(sizeof(ProgramPosterCarrousel_C_HandlePosterUnhover) == 0x000008, "Wrong size on ProgramPosterCarrousel_C_HandlePosterUnhover");
static_assert(offsetof(ProgramPosterCarrousel_C_HandlePosterUnhover, ProgramId) == 0x000000, "Member 'ProgramPosterCarrousel_C_HandlePosterUnhover::ProgramId' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.HandlePosterHover
// 0x0008 (0x0008 - 0x0000)
struct ProgramPosterCarrousel_C_HandlePosterHover final
{
public:
	class FName                                   ProgramId;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrousel_C_HandlePosterHover) == 0x000004, "Wrong alignment on ProgramPosterCarrousel_C_HandlePosterHover");
static_assert(sizeof(ProgramPosterCarrousel_C_HandlePosterHover) == 0x000008, "Wrong size on ProgramPosterCarrousel_C_HandlePosterHover");
static_assert(offsetof(ProgramPosterCarrousel_C_HandlePosterHover, ProgramId) == 0x000000, "Member 'ProgramPosterCarrousel_C_HandlePosterHover::ProgramId' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.HandlePosterClick
// 0x0008 (0x0008 - 0x0000)
struct ProgramPosterCarrousel_C_HandlePosterClick final
{
public:
	class FName                                   ProgramId;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrousel_C_HandlePosterClick) == 0x000004, "Wrong alignment on ProgramPosterCarrousel_C_HandlePosterClick");
static_assert(sizeof(ProgramPosterCarrousel_C_HandlePosterClick) == 0x000008, "Wrong size on ProgramPosterCarrousel_C_HandlePosterClick");
static_assert(offsetof(ProgramPosterCarrousel_C_HandlePosterClick, ProgramId) == 0x000000, "Member 'ProgramPosterCarrousel_C_HandlePosterClick::ProgramId' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.Refresh
// 0x0028 (0x0028 - 0x0000)
struct ProgramPosterCarrousel_C_Refresh final
{
public:
	bool                                          IsMatchOwner;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3682[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3683[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgramPosterCarrouselEntry_C*         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgramPosterCarrousel_C_Refresh) == 0x000008, "Wrong alignment on ProgramPosterCarrousel_C_Refresh");
static_assert(sizeof(ProgramPosterCarrousel_C_Refresh) == 0x000028, "Wrong size on ProgramPosterCarrousel_C_Refresh");
static_assert(offsetof(ProgramPosterCarrousel_C_Refresh, IsMatchOwner) == 0x000000, "Member 'ProgramPosterCarrousel_C_Refresh::IsMatchOwner' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Refresh, Temp_int_Array_Index_Variable) == 0x000004, "Member 'ProgramPosterCarrousel_C_Refresh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Refresh, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'ProgramPosterCarrousel_C_Refresh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Refresh, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ProgramPosterCarrousel_C_Refresh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Refresh, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'ProgramPosterCarrousel_C_Refresh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Refresh, CallFunc_Array_Get_Item) == 0x000018, "Member 'ProgramPosterCarrousel_C_Refresh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Refresh, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'ProgramPosterCarrousel_C_Refresh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.Setup
// 0x00A0 (0x00A0 - 0x0000)
struct ProgramPosterCarrousel_C_Setup final
{
public:
	int32                                         SetupIndex;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgramPosterCarrouselEntry_C*         CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3684[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3685[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName TrialId)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName TrialId)>          K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName TrialId)>          K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3686[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3687[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgramPosterCarrouselEntry_C*         K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgramPosterCarrousel_C_Setup) == 0x000008, "Wrong alignment on ProgramPosterCarrousel_C_Setup");
static_assert(sizeof(ProgramPosterCarrousel_C_Setup) == 0x0000A0, "Wrong size on ProgramPosterCarrousel_C_Setup");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, SetupIndex) == 0x000000, "Member 'ProgramPosterCarrousel_C_Setup::SetupIndex' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ProgramPosterCarrousel_C_Setup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ProgramPosterCarrousel_C_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'ProgramPosterCarrousel_C_Setup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'ProgramPosterCarrousel_C_Setup::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'ProgramPosterCarrousel_C_Setup::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, CallFunc_Array_Get_Item) == 0x000018, "Member 'ProgramPosterCarrousel_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ProgramPosterCarrousel_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, CallFunc_AddChild_ReturnValue) == 0x000028, "Member 'ProgramPosterCarrousel_C_Setup::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'ProgramPosterCarrousel_C_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'ProgramPosterCarrousel_C_Setup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'ProgramPosterCarrousel_C_Setup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'ProgramPosterCarrousel_C_Setup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'ProgramPosterCarrousel_C_Setup::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, CallFunc_GetAllChildren_ReturnValue) == 0x000068, "Member 'ProgramPosterCarrousel_C_Setup::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'ProgramPosterCarrousel_C_Setup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'ProgramPosterCarrousel_C_Setup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, CallFunc_Less_IntInt_ReturnValue_1) == 0x000088, "Member 'ProgramPosterCarrousel_C_Setup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry) == 0x000090, "Member 'ProgramPosterCarrousel_C_Setup::K2Node_DynamicCast_AsProgram_Poster_Carrousel_Entry' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrousel_C_Setup, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'ProgramPosterCarrousel_C_Setup::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ProgramPosterCarrousel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgramPosterCarrousel_C_PreConstruct) == 0x000001, "Wrong alignment on ProgramPosterCarrousel_C_PreConstruct");
static_assert(sizeof(ProgramPosterCarrousel_C_PreConstruct) == 0x000001, "Wrong size on ProgramPosterCarrousel_C_PreConstruct");
static_assert(offsetof(ProgramPosterCarrousel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ProgramPosterCarrousel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.Event_InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct ProgramPosterCarrousel_C_Event_InputSourceChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgramPosterCarrousel_C_Event_InputSourceChanged) == 0x000001, "Wrong alignment on ProgramPosterCarrousel_C_Event_InputSourceChanged");
static_assert(sizeof(ProgramPosterCarrousel_C_Event_InputSourceChanged) == 0x000001, "Wrong size on ProgramPosterCarrousel_C_Event_InputSourceChanged");
static_assert(offsetof(ProgramPosterCarrousel_C_Event_InputSourceChanged, bIsGamepad) == 0x000000, "Member 'ProgramPosterCarrousel_C_Event_InputSourceChanged::bIsGamepad' has a wrong offset!");

// Function ProgramPosterCarrousel.ProgramPosterCarrousel_C.ExecuteUbergraph_ProgramPosterCarrousel
// 0x0028 (0x0028 - 0x0000)
struct ProgramPosterCarrousel_C_ExecuteUbergraph_ProgramPosterCarrousel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3688[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3689[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgramPosterCarrouselEntry_C*         CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_368A[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsGamepad;                           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgramPosterCarrousel_C_ExecuteUbergraph_ProgramPosterCarrousel) == 0x000008, "Wrong alignment on ProgramPosterCarrousel_C_ExecuteUbergraph_ProgramPosterCarrousel");
static_assert(sizeof(ProgramPosterCarrousel_C_ExecuteUbergraph_ProgramPosterCarrousel) == 0x000028, "Wrong size on ProgramPosterCarrousel_C_ExecuteUbergraph_ProgramPosterCarrousel");
static_assert(offsetof(ProgramPosterCarrousel_C_ExecuteUbergraph_ProgramPosterCarrousel, EntryPoint) == 0x000000, "Member 'ProgramPosterCarrousel_C_ExecuteUbergraph_ProgramPosterCarrousel::EntryPoint' has a wrong offset!");
