#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgramTrialEntryContentWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgramTrialEntryContentWidget.ProgramTrialEntryContentWidget_C
// 0x00C0 (0x0320 - 0x0260)
class UProgramTrialEntryContentWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pulse;                                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BackgroundBorder;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentBox;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_61;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockImage;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ScoreText;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TrialNameText;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrialTypeWidget;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVariatorCountPreviewWidget_C*          VariatorCountPreviewWidget;                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   TrialId;                                           // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TrialName;                                         // 0x02C0(0x0018)(Edit, BlueprintVisible)
	class FText                                   TrialType;                                         // 0x02D8(0x0018)(Edit, BlueprintVisible)
	bool                                          bLocked;                                           // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCompleted;                                        // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BestScore;                                         // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnTrialSelected;                                   // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bHovered;                                          // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelected;                                         // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x6];                                        // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgramTrialBlockWidget_C*             ParentBlock;                                       // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFocused;                                          // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Is_Match_Owner;                                    // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetFocused(bool bInFocused);
	void SetHovered(bool bInHovered);
	void SetSelected(bool bInSelected);
	void SetIsMatchOwner(bool bIsMatchOwner);
	void Init(class UProgramTrialBlockWidget_C* Param_ParentBlock, const struct FRBTrialInfoRow& TrialInfo, bool Param_bLocked, bool Param_bCompleted, float Param_BestScore, bool Param_bSelected, bool bIsMatchOwner);
	void Setup();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__ProgramTrialEntryContentWidget_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ProgramTrialEntryContentWidget_Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ProgramTrialEntryContentWidget_Button_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_ProgramTrialEntryContentWidget(int32 EntryPoint);
	void OnTrialSelected__DelegateSignature(class FName Param_TrialId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgramTrialEntryContentWidget_C">();
	}
	static class UProgramTrialEntryContentWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgramTrialEntryContentWidget_C>();
	}
};
static_assert(alignof(UProgramTrialEntryContentWidget_C) == 0x000008, "Wrong alignment on UProgramTrialEntryContentWidget_C");
static_assert(sizeof(UProgramTrialEntryContentWidget_C) == 0x000320, "Wrong size on UProgramTrialEntryContentWidget_C");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, UberGraphFrame) == 0x000260, "Member 'UProgramTrialEntryContentWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, Pulse) == 0x000268, "Member 'UProgramTrialEntryContentWidget_C::Pulse' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, BackgroundBorder) == 0x000270, "Member 'UProgramTrialEntryContentWidget_C::BackgroundBorder' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, Button_0) == 0x000278, "Member 'UProgramTrialEntryContentWidget_C::Button_0' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, ContentBox) == 0x000280, "Member 'UProgramTrialEntryContentWidget_C::ContentBox' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, Image_61) == 0x000288, "Member 'UProgramTrialEntryContentWidget_C::Image_61' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, LockImage) == 0x000290, "Member 'UProgramTrialEntryContentWidget_C::LockImage' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, ScoreText) == 0x000298, "Member 'UProgramTrialEntryContentWidget_C::ScoreText' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, TrialNameText) == 0x0002A0, "Member 'UProgramTrialEntryContentWidget_C::TrialNameText' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, TrialTypeWidget) == 0x0002A8, "Member 'UProgramTrialEntryContentWidget_C::TrialTypeWidget' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, VariatorCountPreviewWidget) == 0x0002B0, "Member 'UProgramTrialEntryContentWidget_C::VariatorCountPreviewWidget' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, TrialId) == 0x0002B8, "Member 'UProgramTrialEntryContentWidget_C::TrialId' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, TrialName) == 0x0002C0, "Member 'UProgramTrialEntryContentWidget_C::TrialName' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, TrialType) == 0x0002D8, "Member 'UProgramTrialEntryContentWidget_C::TrialType' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, bLocked) == 0x0002F0, "Member 'UProgramTrialEntryContentWidget_C::bLocked' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, bCompleted) == 0x0002F1, "Member 'UProgramTrialEntryContentWidget_C::bCompleted' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, BestScore) == 0x0002F4, "Member 'UProgramTrialEntryContentWidget_C::BestScore' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, OnTrialSelected) == 0x0002F8, "Member 'UProgramTrialEntryContentWidget_C::OnTrialSelected' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, bHovered) == 0x000308, "Member 'UProgramTrialEntryContentWidget_C::bHovered' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, bSelected) == 0x000309, "Member 'UProgramTrialEntryContentWidget_C::bSelected' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, ParentBlock) == 0x000310, "Member 'UProgramTrialEntryContentWidget_C::ParentBlock' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, bFocused) == 0x000318, "Member 'UProgramTrialEntryContentWidget_C::bFocused' has a wrong offset!");
static_assert(offsetof(UProgramTrialEntryContentWidget_C, Is_Match_Owner) == 0x000319, "Member 'UProgramTrialEntryContentWidget_C::Is_Match_Owner' has a wrong offset!");

}

