#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgramPosterCarrouselEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function ProgramPosterCarrouselEntry.ProgramPosterCarrouselEntry_C.UpdateTooltip
// 0x0048 (0x0048 - 0x0000)
struct ProgramPosterCarrouselEntry_C_UpdateTooltip final
{
public:
	class FText                                   MenuFocusActionText;                               // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FName                                   MenuFocusAction;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)(ConstParm)
	class USimpleActionTooltip_C*                 CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgramPosterCarrouselEntry_C_UpdateTooltip) == 0x000008, "Wrong alignment on ProgramPosterCarrouselEntry_C_UpdateTooltip");
static_assert(sizeof(ProgramPosterCarrouselEntry_C_UpdateTooltip) == 0x000048, "Wrong size on ProgramPosterCarrouselEntry_C_UpdateTooltip");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_UpdateTooltip, MenuFocusActionText) == 0x000000, "Member 'ProgramPosterCarrouselEntry_C_UpdateTooltip::MenuFocusActionText' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_UpdateTooltip, MenuFocusAction) == 0x000018, "Member 'ProgramPosterCarrouselEntry_C_UpdateTooltip::MenuFocusAction' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_UpdateTooltip, Temp_text_Variable) == 0x000020, "Member 'ProgramPosterCarrouselEntry_C_UpdateTooltip::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_UpdateTooltip, CallFunc_Create_ReturnValue) == 0x000038, "Member 'ProgramPosterCarrouselEntry_C_UpdateTooltip::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_UpdateTooltip, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'ProgramPosterCarrouselEntry_C_UpdateTooltip::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ProgramPosterCarrouselEntry.ProgramPosterCarrouselEntry_C.GetToolTipWidget
// 0x0030 (0x0030 - 0x0000)
struct ProgramPosterCarrouselEntry_C_GetToolTipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)(ConstParm)
	class USimpleActionTooltip_C*                 CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgramPosterCarrouselEntry_C_GetToolTipWidget) == 0x000008, "Wrong alignment on ProgramPosterCarrouselEntry_C_GetToolTipWidget");
static_assert(sizeof(ProgramPosterCarrouselEntry_C_GetToolTipWidget) == 0x000030, "Wrong size on ProgramPosterCarrouselEntry_C_GetToolTipWidget");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_GetToolTipWidget, ReturnValue) == 0x000000, "Member 'ProgramPosterCarrouselEntry_C_GetToolTipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_GetToolTipWidget, Temp_text_Variable) == 0x000008, "Member 'ProgramPosterCarrouselEntry_C_GetToolTipWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_GetToolTipWidget, CallFunc_Create_ReturnValue) == 0x000020, "Member 'ProgramPosterCarrouselEntry_C_GetToolTipWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_GetToolTipWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'ProgramPosterCarrouselEntry_C_GetToolTipWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_GetToolTipWidget, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'ProgramPosterCarrouselEntry_C_GetToolTipWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ProgramPosterCarrouselEntry.ProgramPosterCarrouselEntry_C.SetSelected
// 0x0007 (0x0007 - 0x0000)
struct ProgramPosterCarrouselEntry_C_SetSelected final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgramPosterCarrouselEntry_C_SetSelected) == 0x000001, "Wrong alignment on ProgramPosterCarrouselEntry_C_SetSelected");
static_assert(sizeof(ProgramPosterCarrouselEntry_C_SetSelected) == 0x000007, "Wrong size on ProgramPosterCarrouselEntry_C_SetSelected");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_SetSelected, bSelected) == 0x000000, "Member 'ProgramPosterCarrouselEntry_C_SetSelected::bSelected' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'ProgramPosterCarrouselEntry_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_SetSelected, Temp_byte_Variable) == 0x000002, "Member 'ProgramPosterCarrouselEntry_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_SetSelected, Temp_byte_Variable_1) == 0x000003, "Member 'ProgramPosterCarrouselEntry_C_SetSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_SetSelected, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'ProgramPosterCarrouselEntry_C_SetSelected::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_SetSelected, K2Node_Select_Default) == 0x000005, "Member 'ProgramPosterCarrouselEntry_C_SetSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_SetSelected, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000006, "Member 'ProgramPosterCarrouselEntry_C_SetSelected::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function ProgramPosterCarrouselEntry.ProgramPosterCarrouselEntry_C.Refresh
// 0x0018 (0x0018 - 0x0000)
struct ProgramPosterCarrouselEntry_C_Refresh final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3690[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBLocalProfile*                        CallFunc_GetProfile_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasProgramBeenSeenInMenu_ReturnValue;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrouselEntry_C_Refresh) == 0x000008, "Wrong alignment on ProgramPosterCarrouselEntry_C_Refresh");
static_assert(sizeof(ProgramPosterCarrouselEntry_C_Refresh) == 0x000018, "Wrong size on ProgramPosterCarrouselEntry_C_Refresh");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Refresh, Temp_bool_Variable) == 0x000000, "Member 'ProgramPosterCarrouselEntry_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Refresh, Temp_byte_Variable) == 0x000001, "Member 'ProgramPosterCarrouselEntry_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Refresh, Temp_byte_Variable_1) == 0x000002, "Member 'ProgramPosterCarrouselEntry_C_Refresh::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Refresh, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'ProgramPosterCarrouselEntry_C_Refresh::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Refresh, CallFunc_GetProfile_ReturnValue) == 0x000008, "Member 'ProgramPosterCarrouselEntry_C_Refresh::CallFunc_GetProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Refresh, CallFunc_HasProgramBeenSeenInMenu_ReturnValue) == 0x000010, "Member 'ProgramPosterCarrouselEntry_C_Refresh::CallFunc_HasProgramBeenSeenInMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Refresh, CallFunc_Not_PreBool_ReturnValue_1) == 0x000011, "Member 'ProgramPosterCarrouselEntry_C_Refresh::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Refresh, CallFunc_Not_PreBool_ReturnValue_2) == 0x000012, "Member 'ProgramPosterCarrouselEntry_C_Refresh::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Refresh, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'ProgramPosterCarrouselEntry_C_Refresh::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Refresh, CallFunc_BooleanAND_ReturnValue_1) == 0x000014, "Member 'ProgramPosterCarrouselEntry_C_Refresh::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Refresh, K2Node_Select_Default) == 0x000015, "Member 'ProgramPosterCarrouselEntry_C_Refresh::K2Node_Select_Default' has a wrong offset!");

// Function ProgramPosterCarrouselEntry.ProgramPosterCarrouselEntry_C.OnFocusLost
// 0x000C (0x000C - 0x0000)
struct ProgramPosterCarrouselEntry_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          CallFunc_FocusNavTestCheck_FocusCheck;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgramPosterCarrouselEntry_C_OnFocusLost) == 0x000004, "Wrong alignment on ProgramPosterCarrouselEntry_C_OnFocusLost");
static_assert(sizeof(ProgramPosterCarrouselEntry_C_OnFocusLost) == 0x00000C, "Wrong size on ProgramPosterCarrouselEntry_C_OnFocusLost");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'ProgramPosterCarrouselEntry_C_OnFocusLost::InFocusEvent' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_OnFocusLost, CallFunc_FocusNavTestCheck_FocusCheck) == 0x000008, "Member 'ProgramPosterCarrouselEntry_C_OnFocusLost::CallFunc_FocusNavTestCheck_FocusCheck' has a wrong offset!");

// Function ProgramPosterCarrouselEntry.ProgramPosterCarrouselEntry_C.OnFocusReceived
// 0x01C8 (0x01C8 - 0x0000)
struct ProgramPosterCarrouselEntry_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_FocusNavTestCheck_FocusCheck;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3691[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3692[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0110(0x00B8)()
};
static_assert(alignof(ProgramPosterCarrouselEntry_C_OnFocusReceived) == 0x000008, "Wrong alignment on ProgramPosterCarrouselEntry_C_OnFocusReceived");
static_assert(sizeof(ProgramPosterCarrouselEntry_C_OnFocusReceived) == 0x0001C8, "Wrong size on ProgramPosterCarrouselEntry_C_OnFocusReceived");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'ProgramPosterCarrouselEntry_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'ProgramPosterCarrouselEntry_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'ProgramPosterCarrouselEntry_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_OnFocusReceived, CallFunc_FocusNavTestCheck_FocusCheck) == 0x0000F8, "Member 'ProgramPosterCarrouselEntry_C_OnFocusReceived::CallFunc_FocusNavTestCheck_FocusCheck' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_OnFocusReceived, K2Node_CreateDelegate_OutputDelegate) == 0x0000FC, "Member 'ProgramPosterCarrouselEntry_C_OnFocusReceived::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000110, "Member 'ProgramPosterCarrouselEntry_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function ProgramPosterCarrouselEntry.ProgramPosterCarrouselEntry_C.Setup
// 0x0218 (0x0218 - 0x0000)
struct ProgramPosterCarrouselEntry_C_Setup final
{
public:
	struct FRBProgramInfoRow                      ProgramInfo;                                       // 0x0000(0x0148)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Param_bLocked;                                     // 0x0148(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3693[0x5];                                     // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0150(0x0028)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3694[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_TryLoadSyncSoftRef_NewParam;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsProgramEnabled_ReturnValue;             // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3695[0x3];                                     // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0198(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x01B0(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3696[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x01D0(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3697[0x5];                                     // 0x01EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsProgramEnabled_ReturnValue_1;           // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3698[0x3];                                     // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_2;                           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0216(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrouselEntry_C_Setup) == 0x000008, "Wrong alignment on ProgramPosterCarrouselEntry_C_Setup");
static_assert(sizeof(ProgramPosterCarrouselEntry_C_Setup) == 0x000218, "Wrong size on ProgramPosterCarrouselEntry_C_Setup");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, ProgramInfo) == 0x000000, "Member 'ProgramPosterCarrouselEntry_C_Setup::ProgramInfo' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Param_bLocked) == 0x000148, "Member 'ProgramPosterCarrouselEntry_C_Setup::Param_bLocked' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_bool_Variable) == 0x000149, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_byte_Variable) == 0x00014A, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, K2Node_MakeStruct_SlateColor) == 0x000150, "Member 'ProgramPosterCarrouselEntry_C_Setup::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, CallFunc_TextIsEmpty_ReturnValue) == 0x000178, "Member 'ProgramPosterCarrouselEntry_C_Setup::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, CallFunc_TryLoadSyncSoftRef_NewParam) == 0x000180, "Member 'ProgramPosterCarrouselEntry_C_Setup::CallFunc_TryLoadSyncSoftRef_NewParam' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, K2Node_DynamicCast_AsTexture_2D) == 0x000188, "Member 'ProgramPosterCarrouselEntry_C_Setup::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'ProgramPosterCarrouselEntry_C_Setup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, CallFunc_IsProgramEnabled_ReturnValue) == 0x000191, "Member 'ProgramPosterCarrouselEntry_C_Setup::CallFunc_IsProgramEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_byte_Variable_1) == 0x000192, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_bool_Variable_1) == 0x000193, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, K2Node_Select_Default) == 0x000194, "Member 'ProgramPosterCarrouselEntry_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_text_Variable) == 0x000198, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_text_Variable_1) == 0x0001B0, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_bool_Variable_2) == 0x0001C8, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, K2Node_Select_Default_1) == 0x0001D0, "Member 'ProgramPosterCarrouselEntry_C_Setup::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_byte_Variable_2) == 0x0001E8, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_byte_Variable_3) == 0x0001E9, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_bool_Variable_3) == 0x0001EA, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_object_Variable) == 0x0001F0, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_object_Variable_1) == 0x0001F8, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_bool_Variable_4) == 0x000200, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, CallFunc_IsProgramEnabled_ReturnValue_1) == 0x000201, "Member 'ProgramPosterCarrouselEntry_C_Setup::CallFunc_IsProgramEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_byte_Variable_4) == 0x000202, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, Temp_byte_Variable_5) == 0x000203, "Member 'ProgramPosterCarrouselEntry_C_Setup::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, CallFunc_BooleanAND_ReturnValue) == 0x000204, "Member 'ProgramPosterCarrouselEntry_C_Setup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, K2Node_Select_Default_2) == 0x000208, "Member 'ProgramPosterCarrouselEntry_C_Setup::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, CallFunc_BooleanOR_ReturnValue) == 0x000210, "Member 'ProgramPosterCarrouselEntry_C_Setup::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, CallFunc_Not_PreBool_ReturnValue) == 0x000211, "Member 'ProgramPosterCarrouselEntry_C_Setup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, CallFunc_BooleanAND_ReturnValue_1) == 0x000212, "Member 'ProgramPosterCarrouselEntry_C_Setup::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, CallFunc_BooleanOR_ReturnValue_1) == 0x000213, "Member 'ProgramPosterCarrouselEntry_C_Setup::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, K2Node_Select_Default_3) == 0x000214, "Member 'ProgramPosterCarrouselEntry_C_Setup::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, CallFunc_BooleanOR_ReturnValue_2) == 0x000215, "Member 'ProgramPosterCarrouselEntry_C_Setup::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_Setup, K2Node_Select_Default_4) == 0x000216, "Member 'ProgramPosterCarrouselEntry_C_Setup::K2Node_Select_Default_4' has a wrong offset!");

// Function ProgramPosterCarrouselEntry.ProgramPosterCarrouselEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ProgramPosterCarrouselEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProgramPosterCarrouselEntry_C_PreConstruct) == 0x000001, "Wrong alignment on ProgramPosterCarrouselEntry_C_PreConstruct");
static_assert(sizeof(ProgramPosterCarrouselEntry_C_PreConstruct) == 0x000001, "Wrong size on ProgramPosterCarrouselEntry_C_PreConstruct");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ProgramPosterCarrouselEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ProgramPosterCarrouselEntry.ProgramPosterCarrouselEntry_C.ExecuteUbergraph_ProgramPosterCarrouselEntry
// 0x0028 (0x0028 - 0x0000)
struct ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3699[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369A[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry) == 0x000008, "Wrong alignment on ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry");
static_assert(sizeof(ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry) == 0x000028, "Wrong size on ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry, EntryPoint) == 0x000000, "Member 'ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry, K2Node_Event_IsDesignTime) == 0x000018, "Member 'ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000024, "Member 'ProgramPosterCarrouselEntry_C_ExecuteUbergraph_ProgramPosterCarrouselEntry::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function ProgramPosterCarrouselEntry.ProgramPosterCarrouselEntry_C.OnProgramUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ProgramPosterCarrouselEntry_C_OnProgramUnhovered__DelegateSignature final
{
public:
	class FName                                   TrialId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrouselEntry_C_OnProgramUnhovered__DelegateSignature) == 0x000004, "Wrong alignment on ProgramPosterCarrouselEntry_C_OnProgramUnhovered__DelegateSignature");
static_assert(sizeof(ProgramPosterCarrouselEntry_C_OnProgramUnhovered__DelegateSignature) == 0x000008, "Wrong size on ProgramPosterCarrouselEntry_C_OnProgramUnhovered__DelegateSignature");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_OnProgramUnhovered__DelegateSignature, TrialId) == 0x000000, "Member 'ProgramPosterCarrouselEntry_C_OnProgramUnhovered__DelegateSignature::TrialId' has a wrong offset!");

// Function ProgramPosterCarrouselEntry.ProgramPosterCarrouselEntry_C.OnProgramHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ProgramPosterCarrouselEntry_C_OnProgramHovered__DelegateSignature final
{
public:
	class FName                                   TrialId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrouselEntry_C_OnProgramHovered__DelegateSignature) == 0x000004, "Wrong alignment on ProgramPosterCarrouselEntry_C_OnProgramHovered__DelegateSignature");
static_assert(sizeof(ProgramPosterCarrouselEntry_C_OnProgramHovered__DelegateSignature) == 0x000008, "Wrong size on ProgramPosterCarrouselEntry_C_OnProgramHovered__DelegateSignature");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_OnProgramHovered__DelegateSignature, TrialId) == 0x000000, "Member 'ProgramPosterCarrouselEntry_C_OnProgramHovered__DelegateSignature::TrialId' has a wrong offset!");

// Function ProgramPosterCarrouselEntry.ProgramPosterCarrouselEntry_C.OnProgramClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ProgramPosterCarrouselEntry_C_OnProgramClicked__DelegateSignature final
{
public:
	class FName                                   TrialId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProgramPosterCarrouselEntry_C_OnProgramClicked__DelegateSignature) == 0x000004, "Wrong alignment on ProgramPosterCarrouselEntry_C_OnProgramClicked__DelegateSignature");
static_assert(sizeof(ProgramPosterCarrouselEntry_C_OnProgramClicked__DelegateSignature) == 0x000008, "Wrong size on ProgramPosterCarrouselEntry_C_OnProgramClicked__DelegateSignature");
static_assert(offsetof(ProgramPosterCarrouselEntry_C_OnProgramClicked__DelegateSignature, TrialId) == 0x000000, "Member 'ProgramPosterCarrouselEntry_C_OnProgramClicked__DelegateSignature::TrialId' has a wrong offset!");

}

