#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProMod_Parent

#include "Basic.hpp"

#include "PipeModuleDetailParameters_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StretchableModulesPartsRandomization_structs.hpp"
#include "LockAxis_structs.hpp"


namespace SDK::Params
{

// Function ProMod_Parent.ProMod_Parent_C.FixUp
// 0x0002 (0x0002 - 0x0000)
struct ProMod_Parent_C_FixUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CleanOwningActors_bChanged;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProMod_Parent_C_FixUp) == 0x000001, "Wrong alignment on ProMod_Parent_C_FixUp");
static_assert(sizeof(ProMod_Parent_C_FixUp) == 0x000002, "Wrong size on ProMod_Parent_C_FixUp");
static_assert(offsetof(ProMod_Parent_C_FixUp, ReturnValue) == 0x000000, "Member 'ProMod_Parent_C_FixUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_FixUp, CallFunc_CleanOwningActors_bChanged) == 0x000001, "Member 'ProMod_Parent_C_FixUp::CallFunc_CleanOwningActors_bChanged' has a wrong offset!");

// Function ProMod_Parent.ProMod_Parent_C.SetupCollision
// 0x0010 (0x0010 - 0x0000)
struct ProMod_Parent_C_SetupCollision final
{
public:
	class UPrimitiveComponent*                    Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDetail;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProMod_Parent_C_SetupCollision) == 0x000008, "Wrong alignment on ProMod_Parent_C_SetupCollision");
static_assert(sizeof(ProMod_Parent_C_SetupCollision) == 0x000010, "Wrong size on ProMod_Parent_C_SetupCollision");
static_assert(offsetof(ProMod_Parent_C_SetupCollision, Target) == 0x000000, "Member 'ProMod_Parent_C_SetupCollision::Target' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_SetupCollision, bIsDetail) == 0x000008, "Member 'ProMod_Parent_C_SetupCollision::bIsDetail' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_SetupCollision, Temp_bool_Variable) == 0x000009, "Member 'ProMod_Parent_C_SetupCollision::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_SetupCollision, Temp_byte_Variable) == 0x00000A, "Member 'ProMod_Parent_C_SetupCollision::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_SetupCollision, Temp_byte_Variable_1) == 0x00000B, "Member 'ProMod_Parent_C_SetupCollision::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_SetupCollision, K2Node_Select_Default) == 0x00000C, "Member 'ProMod_Parent_C_SetupCollision::K2Node_Select_Default' has a wrong offset!");

// Function ProMod_Parent.ProMod_Parent_C.ApplyNewMeshSettings
// 0x0008 (0x0008 - 0x0000)
struct ProMod_Parent_C_ApplyNewMeshSettings final
{
public:
	class UMeshComponent*                         NewMeshComponent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProMod_Parent_C_ApplyNewMeshSettings) == 0x000008, "Wrong alignment on ProMod_Parent_C_ApplyNewMeshSettings");
static_assert(sizeof(ProMod_Parent_C_ApplyNewMeshSettings) == 0x000008, "Wrong size on ProMod_Parent_C_ApplyNewMeshSettings");
static_assert(offsetof(ProMod_Parent_C_ApplyNewMeshSettings, NewMeshComponent) == 0x000000, "Member 'ProMod_Parent_C_ApplyNewMeshSettings::NewMeshComponent' has a wrong offset!");

// Function ProMod_Parent.ProMod_Parent_C.MakePipeConnection2
// 0x03F0 (0x03F0 - 0x0000)
struct ProMod_Parent_C_MakePipeConnection2 final
{
public:
	bool                                          bInvertRoles;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ADA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                IntersectionPoint;                                 // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProMod_Parent_C*                       PipeModuleToSkip;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExternalRefresh;                                 // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ADB[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PivotDistanceFromTarget;                           // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_EndPipeThreshold;                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetEnd;                                         // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CleanOwningActors_bChanged;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RegisterToPipeModuleManager_Valid;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ADC[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ADD[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent_1;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ADE[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AProMod_Parent_C>        CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0078(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent_2;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ADF[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AProMod_Parent_C>        CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1; // 0x00B8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AE0[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent_3;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AE1[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_4; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AE2[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent_4;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCornerPipe_isCornerPipe;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AE3[0x2];                                     // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_IsCornerPipe_TargetLocation1;             // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_IsCornerPipe_TargetEndWorldLocation1;     // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_IsCornerPipe_ActorEndWorldLocation1;      // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_IsCornerPipe_ActorWorldLocation1;         // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE4[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProMod_Parent_C*                       CallFunc_IsCornerPipe_TargetPipe1;                 // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCornerPipe_bShouldFlipSpline;           // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AE5[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_5; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent_5;             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidIntersection_Valid;                // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AE6[0x2];                                     // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_IsValidIntersection_IntersectionPos;      // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AE7[0x2];                                     // 0x0186(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_6; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProMod_Manager_C*                      K2Node_DynamicCast_AsPro_Mod_Manager;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AE8[0x7];                                     // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_7; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent_6;             // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AE9[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AProMod_Parent_C>        CallFunc_Array_Get_Item;                           // 0x01B8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidIntersection_Valid_1;              // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AEA[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_IsValidIntersection_IntersectionPos_1;    // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_8; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent_7;             // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SortCompareActorsByName_ReturnValue;      // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSameChannel_IsValid;                    // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AEB[0x2];                                     // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AEC[0x4];                                     // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AED[0x5];                                     // 0x0223(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_9; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent_8;             // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AEE[0x3];                                     // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetConnectorRotation_Rotation;            // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_10; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AEF[0x4];                                     // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent_9;             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AF0[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetConnectorRotation_Rotation_1;          // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AF1[0x3];                                     // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_11; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent_10;            // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AF2[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_12; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentAtFullExtentFromTarget_IsAtFullExtent; // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AF3[0x3];                                     // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_IsCurrentAtFullExtentFromTarget_PivotDistanceFromTarget; // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent_11;            // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCurrentAtFullExtentFromTarget_IsAtFullExtent_1; // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AF4[0x2];                                     // 0x02AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_IsCurrentAtFullExtentFromTarget_PivotDistanceFromTarget_1; // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_13; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent_12;            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCornerPipe_isCornerPipe_1;              // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AF5[0x2];                                     // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_IsCornerPipe_TargetLocation1_1;           // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_IsCornerPipe_TargetEndWorldLocation1_1;   // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_IsCornerPipe_ActorEndWorldLocation1_1;    // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_IsCornerPipe_ActorWorldLocation1_1;       // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AF6[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProMod_Parent_C*                       CallFunc_IsCornerPipe_TargetPipe1_1;               // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCornerPipe_bShouldFlipSpline_1;         // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AF7[0x3];                                     // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AF8[0x8];                                     // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0310(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_InvertTransform_ReturnValue;              // 0x0340(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AF9[0x4];                                     // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0380(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x03B0(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddStaticMesh_ReturnValue;                // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddStaticMesh_ReturnValue_1;              // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProMod_Parent_C_MakePipeConnection2) == 0x000010, "Wrong alignment on ProMod_Parent_C_MakePipeConnection2");
static_assert(sizeof(ProMod_Parent_C_MakePipeConnection2) == 0x0003F0, "Wrong size on ProMod_Parent_C_MakePipeConnection2");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, bInvertRoles) == 0x000000, "Member 'ProMod_Parent_C_MakePipeConnection2::bInvertRoles' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, IntersectionPoint) == 0x000004, "Member 'ProMod_Parent_C_MakePipeConnection2::IntersectionPoint' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, PipeModuleToSkip) == 0x000010, "Member 'ProMod_Parent_C_MakePipeConnection2::PipeModuleToSkip' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, IsExternalRefresh) == 0x000018, "Member 'ProMod_Parent_C_MakePipeConnection2::IsExternalRefresh' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, PivotDistanceFromTarget) == 0x00001C, "Member 'ProMod_Parent_C_MakePipeConnection2::PivotDistanceFromTarget' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, Param_EndPipeThreshold) == 0x000020, "Member 'ProMod_Parent_C_MakePipeConnection2::Param_EndPipeThreshold' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, TargetEnd) == 0x000024, "Member 'ProMod_Parent_C_MakePipeConnection2::TargetEnd' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, TargetLocation) == 0x000030, "Member 'ProMod_Parent_C_MakePipeConnection2::TargetLocation' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'ProMod_Parent_C_MakePipeConnection2::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_CleanOwningActors_bChanged) == 0x000040, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_CleanOwningActors_bChanged' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_RegisterToPipeModuleManager_Valid) == 0x000041, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_RegisterToPipeModuleManager_Valid' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000048, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000050, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_AsPro_Mod_Parent) == 0x000058, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_AsPro_Mod_Parent' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_AsPro_Mod_Parent_1) == 0x000068, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_AsPro_Mod_Parent_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000078, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x0000A0, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_AsPro_Mod_Parent_2) == 0x0000A8, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_AsPro_Mod_Parent_2' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1) == 0x0000B8, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Array_Contains_ReturnValue) == 0x0000E0, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3) == 0x0000E8, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_AsPro_Mod_Parent_3) == 0x0000F0, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_AsPro_Mod_Parent_3' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_4) == 0x000100, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Array_Contains_ReturnValue_1) == 0x000108, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_AsPro_Mod_Parent_4) == 0x000110, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_AsPro_Mod_Parent_4' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_bSuccess_4) == 0x000118, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCornerPipe_isCornerPipe) == 0x000119, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCornerPipe_isCornerPipe' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCornerPipe_TargetLocation1) == 0x00011C, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCornerPipe_TargetLocation1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCornerPipe_TargetEndWorldLocation1) == 0x000128, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCornerPipe_TargetEndWorldLocation1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCornerPipe_ActorEndWorldLocation1) == 0x000134, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCornerPipe_ActorEndWorldLocation1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCornerPipe_ActorWorldLocation1) == 0x000140, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCornerPipe_ActorWorldLocation1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCornerPipe_TargetPipe1) == 0x000150, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCornerPipe_TargetPipe1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCornerPipe_bShouldFlipSpline) == 0x000158, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCornerPipe_bShouldFlipSpline' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_5) == 0x000160, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_AsPro_Mod_Parent_5) == 0x000168, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_AsPro_Mod_Parent_5' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_bSuccess_5) == 0x000170, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsValidIntersection_Valid) == 0x000171, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsValidIntersection_Valid' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsValidIntersection_IntersectionPos) == 0x000174, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsValidIntersection_IntersectionPos' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Array_AddUnique_ReturnValue) == 0x000180, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_BooleanOR_ReturnValue) == 0x000184, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_BooleanOR_ReturnValue_1) == 0x000185, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_6) == 0x000188, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_AsPro_Mod_Manager) == 0x000190, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_AsPro_Mod_Manager' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_bSuccess_6) == 0x000198, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_7) == 0x0001A0, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_AsPro_Mod_Parent_6) == 0x0001A8, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_AsPro_Mod_Parent_6' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_bSuccess_7) == 0x0001B0, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Array_Get_Item) == 0x0001B8, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsValidIntersection_Valid_1) == 0x0001E0, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsValidIntersection_Valid_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsValidIntersection_IntersectionPos_1) == 0x0001E4, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsValidIntersection_IntersectionPos_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_8) == 0x0001F0, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_AsPro_Mod_Parent_7) == 0x0001F8, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_AsPro_Mod_Parent_7' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_bSuccess_8) == 0x000200, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsValid_ReturnValue) == 0x000201, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_SortCompareActorsByName_ReturnValue) == 0x000202, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_SortCompareActorsByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000203, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsSameChannel_IsValid) == 0x000204, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsSameChannel_IsValid' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Not_PreBool_ReturnValue) == 0x000205, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_GetObjectClass_ReturnValue) == 0x000208, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Array_Length_ReturnValue) == 0x000210, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_GetObjectClass_ReturnValue_1) == 0x000218, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000220, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_BooleanAND_ReturnValue) == 0x000221, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_BooleanAND_ReturnValue_1) == 0x000222, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_9) == 0x000228, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_AsPro_Mod_Parent_8) == 0x000230, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_AsPro_Mod_Parent_8' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_bSuccess_9) == 0x000238, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_GetConnectorRotation_Rotation) == 0x00023C, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_GetConnectorRotation_Rotation' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_10) == 0x000248, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, Temp_int_Loop_Counter_Variable) == 0x000250, "Member 'ProMod_Parent_C_MakePipeConnection2::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_AsPro_Mod_Parent_9) == 0x000258, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_AsPro_Mod_Parent_9' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_bSuccess_10) == 0x000260, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_GetConnectorRotation_Rotation_1) == 0x000264, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_GetConnectorRotation_Rotation_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Less_IntInt_ReturnValue) == 0x000270, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Add_IntInt_ReturnValue) == 0x000274, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_11) == 0x000278, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_AsPro_Mod_Parent_10) == 0x000280, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_AsPro_Mod_Parent_10' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_bSuccess_11) == 0x000288, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_12) == 0x000290, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCurrentAtFullExtentFromTarget_IsAtFullExtent) == 0x000298, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCurrentAtFullExtentFromTarget_IsAtFullExtent' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCurrentAtFullExtentFromTarget_PivotDistanceFromTarget) == 0x00029C, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCurrentAtFullExtentFromTarget_PivotDistanceFromTarget' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_AsPro_Mod_Parent_11) == 0x0002A0, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_AsPro_Mod_Parent_11' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_bSuccess_12) == 0x0002A8, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCurrentAtFullExtentFromTarget_IsAtFullExtent_1) == 0x0002A9, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCurrentAtFullExtentFromTarget_IsAtFullExtent_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCurrentAtFullExtentFromTarget_PivotDistanceFromTarget_1) == 0x0002AC, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCurrentAtFullExtentFromTarget_PivotDistanceFromTarget_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_13) == 0x0002B0, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_AsPro_Mod_Parent_12) == 0x0002B8, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_AsPro_Mod_Parent_12' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, K2Node_DynamicCast_bSuccess_13) == 0x0002C0, "Member 'ProMod_Parent_C_MakePipeConnection2::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCornerPipe_isCornerPipe_1) == 0x0002C1, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCornerPipe_isCornerPipe_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCornerPipe_TargetLocation1_1) == 0x0002C4, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCornerPipe_TargetLocation1_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCornerPipe_TargetEndWorldLocation1_1) == 0x0002D0, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCornerPipe_TargetEndWorldLocation1_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCornerPipe_ActorEndWorldLocation1_1) == 0x0002DC, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCornerPipe_ActorEndWorldLocation1_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCornerPipe_ActorWorldLocation1_1) == 0x0002E8, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCornerPipe_ActorWorldLocation1_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCornerPipe_TargetPipe1_1) == 0x0002F8, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCornerPipe_TargetPipe1_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_IsCornerPipe_bShouldFlipSpline_1) == 0x000300, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_IsCornerPipe_bShouldFlipSpline_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000304, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_GetTransform_ReturnValue) == 0x000310, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_InvertTransform_ReturnValue) == 0x000340, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_InvertTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_TransformLocation_ReturnValue) == 0x000370, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_MakeTransform_ReturnValue) == 0x000380, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_MakeTransform_ReturnValue_1) == 0x0003B0, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_AddStaticMesh_ReturnValue) == 0x0003E0, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_AddStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_MakePipeConnection2, CallFunc_AddStaticMesh_ReturnValue_1) == 0x0003E8, "Member 'ProMod_Parent_C_MakePipeConnection2::CallFunc_AddStaticMesh_ReturnValue_1' has a wrong offset!");

// Function ProMod_Parent.ProMod_Parent_C.CustRunConstruction
// 0x0018 (0x0018 - 0x0000)
struct ProMod_Parent_C_CustRunConstruction final
{
public:
	TArray<TSoftObjectPtr<class AProMod_Parent_C>> Pipes;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_RegisterToPipeModuleManager_Valid;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CleanOwningActors_bChanged;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProMod_Parent_C_CustRunConstruction) == 0x000008, "Wrong alignment on ProMod_Parent_C_CustRunConstruction");
static_assert(sizeof(ProMod_Parent_C_CustRunConstruction) == 0x000018, "Wrong size on ProMod_Parent_C_CustRunConstruction");
static_assert(offsetof(ProMod_Parent_C_CustRunConstruction, Pipes) == 0x000000, "Member 'ProMod_Parent_C_CustRunConstruction::Pipes' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_CustRunConstruction, CallFunc_RegisterToPipeModuleManager_Valid) == 0x000010, "Member 'ProMod_Parent_C_CustRunConstruction::CallFunc_RegisterToPipeModuleManager_Valid' has a wrong offset!");
static_assert(offsetof(ProMod_Parent_C_CustRunConstruction, CallFunc_CleanOwningActors_bChanged) == 0x000011, "Member 'ProMod_Parent_C_CustRunConstruction::CallFunc_CleanOwningActors_bChanged' has a wrong offset!");

// Function ProMod_Parent.ProMod_Parent_C.CleanOwningActors
// 0x00C8 (0x00C8 - 0x0000)
struct ProMod_Parent_C_CleanOwningActors final
{
public:
	bool                                          bChanged;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AFA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LoopIdx;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSomethingChanged;                                 // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AFB[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AFC[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AProMod_Parent_C>        CallFunc_Array_Get_Item;                           // 0x0018(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AFD[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent_1;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidIntersection_Valid;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AFE[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_IsValidIntersection_IntersectionPos;      // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCornerPipe_isCornerPipe;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AFF[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_IsCornerPipe_TargetLocation1;             // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_IsCornerPipe_TargetEndWorldLocation1;     // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_IsCornerPipe_ActorEndWorldLocation1;      // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_IsCornerPipe_ActorWorldLocation1;         // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B00[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProMod_Parent_C*                       CallFunc_IsCornerPipe_TargetPipe1;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCornerPipe_bShouldFlipSpline;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
