#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropaneCrateMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PropaneCrate-01_BP.PropaneCrate-01_BP_C
// 0x0020 (0x0268 - 0x0248)
class APropaneCrateMinus01_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBBoxNavMeshBlockingComponent*         RBBoxNavMeshBlocking;                              // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          FeatureSwitch;                                     // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool OnWorldPopulateFinishedTimeSliced();
	void OnWorldFullyLoaded();
	void OnWorldPopulateFinished();
	void ExecuteUbergraph_PropaneCrateMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PropaneCrate-01_BP_C">();
	}
	static class APropaneCrateMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APropaneCrateMinus01_BP_C>();
	}
};
static_assert(alignof(APropaneCrateMinus01_BP_C) == 0x000008, "Wrong alignment on APropaneCrateMinus01_BP_C");
static_assert(sizeof(APropaneCrateMinus01_BP_C) == 0x000268, "Wrong size on APropaneCrateMinus01_BP_C");
static_assert(offsetof(APropaneCrateMinus01_BP_C, UberGraphFrame) == 0x000248, "Member 'APropaneCrateMinus01_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APropaneCrateMinus01_BP_C, RBBoxNavMeshBlocking) == 0x000250, "Member 'APropaneCrateMinus01_BP_C::RBBoxNavMeshBlocking' has a wrong offset!");
static_assert(offsetof(APropaneCrateMinus01_BP_C, DefaultSceneRoot) == 0x000258, "Member 'APropaneCrateMinus01_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APropaneCrateMinus01_BP_C, FeatureSwitch) == 0x000260, "Member 'APropaneCrateMinus01_BP_C::FeatureSwitch' has a wrong offset!");

}

