#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proxy_Character_CopyPose

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Proxy_Character_CopyPose.Proxy_Character_CopyPose_C
// 0x0210 (0x04D0 - 0x02C0)
class UProxy_Character_CopyPose_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2AAD[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x02F8(0x01D8)(ContainsInstancedReference)

public:
	void ExecuteUbergraph_Proxy_Character_CopyPose(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Proxy_Character_CopyPose_C">();
	}
	static class UProxy_Character_CopyPose_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProxy_Character_CopyPose_C>();
	}
};
static_assert(alignof(UProxy_Character_CopyPose_C) == 0x000010, "Wrong alignment on UProxy_Character_CopyPose_C");
static_assert(sizeof(UProxy_Character_CopyPose_C) == 0x0004D0, "Wrong size on UProxy_Character_CopyPose_C");
static_assert(offsetof(UProxy_Character_CopyPose_C, UberGraphFrame) == 0x0002C0, "Member 'UProxy_Character_CopyPose_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProxy_Character_CopyPose_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UProxy_Character_CopyPose_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UProxy_Character_CopyPose_C, AnimGraphNode_CopyPoseFromMesh) == 0x0002F8, "Member 'UProxy_Character_CopyPose_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");

}

