#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PsychosisBar2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PsychosisBar2.PsychosisBar2_C
// 0x0098 (0x0380 - 0x02E8)
class UPsychosisBar2_C final : public URBHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       IconMorph;                                         // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInFadeOut;                                     // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHudBarElement_Animated_C*              FirstBracket;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PsychosisBar;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHudBarElement_Animated_C*              SecondBracket;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHudBarElement_Animated_C*              ThirdBracket;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UHudBarElement_Animated_C*>      PsychosisBrackets;                                 // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UHudBarElement_Animated_C*              CurrentAnimatedBracket;                            // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartingState;                                     // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FinishingState;                                    // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OngoingTweens;                                     // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EC7[0x3];                                     // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentSanity;                                     // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreviousSanity;                                    // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentState;                                      // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture*>                       StatesIcon;                                        // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SanityIncreased;                                   // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EC8[0x3];                                     // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeOutDelay;                                      // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipDelay;                                         // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PsychosisBar2(int32 EntryPoint);
	void Construct();
	void OnBarHidden();
	void OnPlayerStatusChanged(EPlayerIndicatorType PlayerIndicatorType);
	void OnPsychosisChanged(int32 NewValue, int32 OldValue);
	void Event_OnWatchedPlayerChanged(class ARBPlayer* OldPlayer, class ARBPlayer* NewPlayer);
	void Event_Hide();
	void Event_Show();
	void PreConstruct(bool IsDesignTime);
	void IconMorphCompleted();
	void ChainTweens();
	void ProcessPsychosisEvent(int32 NewValue, int32 OldValue, bool SkipAnims);
	void UpdateIcon();
	void HandlePlayerStatusChanged(EPlayerIndicatorType NewStatus);
	void UpdateColors();
	void SequenceEvent__ENTRYPOINTPsychosisBar2_0();

	bool ShouldShow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PsychosisBar2_C">();
	}
	static class UPsychosisBar2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPsychosisBar2_C>();
	}
};
static_assert(alignof(UPsychosisBar2_C) == 0x000008, "Wrong alignment on UPsychosisBar2_C");
static_assert(sizeof(UPsychosisBar2_C) == 0x000380, "Wrong size on UPsychosisBar2_C");
static_assert(offsetof(UPsychosisBar2_C, UberGraphFrame) == 0x0002E8, "Member 'UPsychosisBar2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, IconMorph) == 0x0002F0, "Member 'UPsychosisBar2_C::IconMorph' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, FadeInFadeOut) == 0x0002F8, "Member 'UPsychosisBar2_C::FadeInFadeOut' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, FirstBracket) == 0x000300, "Member 'UPsychosisBar2_C::FirstBracket' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, Icon) == 0x000308, "Member 'UPsychosisBar2_C::Icon' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, InvalidationBox_0) == 0x000310, "Member 'UPsychosisBar2_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, PsychosisBar) == 0x000318, "Member 'UPsychosisBar2_C::PsychosisBar' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, SecondBracket) == 0x000320, "Member 'UPsychosisBar2_C::SecondBracket' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, ThirdBracket) == 0x000328, "Member 'UPsychosisBar2_C::ThirdBracket' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, PsychosisBrackets) == 0x000330, "Member 'UPsychosisBar2_C::PsychosisBrackets' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, CurrentAnimatedBracket) == 0x000340, "Member 'UPsychosisBar2_C::CurrentAnimatedBracket' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, StartingState) == 0x000348, "Member 'UPsychosisBar2_C::StartingState' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, FinishingState) == 0x00034C, "Member 'UPsychosisBar2_C::FinishingState' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, OngoingTweens) == 0x000350, "Member 'UPsychosisBar2_C::OngoingTweens' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, CurrentSanity) == 0x000354, "Member 'UPsychosisBar2_C::CurrentSanity' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, PreviousSanity) == 0x000358, "Member 'UPsychosisBar2_C::PreviousSanity' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, CurrentState) == 0x00035C, "Member 'UPsychosisBar2_C::CurrentState' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, StatesIcon) == 0x000360, "Member 'UPsychosisBar2_C::StatesIcon' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, SanityIncreased) == 0x000370, "Member 'UPsychosisBar2_C::SanityIncreased' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, FadeOutDelay) == 0x000374, "Member 'UPsychosisBar2_C::FadeOutDelay' has a wrong offset!");
static_assert(offsetof(UPsychosisBar2_C, SkipDelay) == 0x000378, "Member 'UPsychosisBar2_C::SkipDelay' has a wrong offset!");

}

