#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pushable_OnRail_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Pushable_OnRail_BP.Pushable_OnRail_BP_C
// 0x00F0 (0x06B0 - 0x05C0)
class APushable_OnRail_BP_C final : public ARBSplinePushable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   CartRailBrakesMinus01;                             // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CartRailWheelMinus02b;                             // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CartRailWheelMinus01b;                             // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PushableWorldCollision;                            // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBObjectiveActorComponent*             RBObjectiveActor;                                  // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HandIK;                                            // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PushablePawnCollision;                             // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBPushableComponent*                   RBPushable;                                        // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        PushingAnchor;                                     // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CartRailWheelMinusFront;                           // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CartRailWheelMinusRear;                            // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CartRailMinus01;                                   // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ARBLedgeMarker*                         LedgeMarkerFront;                                  // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLedgeMarker*                         LedgeMarkerRight;                                  // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLedgeMarker*                         LedgeMarkerRear;                                   // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLedgeMarker*                         LedgeMarkerLeft;                                   // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                LargeObjectCollector;                              // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UStaticMeshComponent*, float>      WheelMeshes;                                       // 0x0658(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          DisableLedgeMarkers;                               // 0x06A8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ConstructWheelMeshesList();
	void UserConstructionScript();
	void BP_PostMove(const struct FVector& DeltaLocation);
	void BP_PostRotated(const struct FRotator& FrontRotation, const struct FRotator& RearRotation);
	void ExecuteUbergraph_Pushable_OnRail_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pushable_OnRail_BP_C">();
	}
	static class APushable_OnRail_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APushable_OnRail_BP_C>();
	}
};
static_assert(alignof(APushable_OnRail_BP_C) == 0x000010, "Wrong alignment on APushable_OnRail_BP_C");
static_assert(sizeof(APushable_OnRail_BP_C) == 0x0006B0, "Wrong size on APushable_OnRail_BP_C");
static_assert(offsetof(APushable_OnRail_BP_C, UberGraphFrame) == 0x0005C0, "Member 'APushable_OnRail_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, CartRailBrakesMinus01) == 0x0005C8, "Member 'APushable_OnRail_BP_C::CartRailBrakesMinus01' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, CartRailWheelMinus02b) == 0x0005D0, "Member 'APushable_OnRail_BP_C::CartRailWheelMinus02b' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, CartRailWheelMinus01b) == 0x0005D8, "Member 'APushable_OnRail_BP_C::CartRailWheelMinus01b' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, PushableWorldCollision) == 0x0005E0, "Member 'APushable_OnRail_BP_C::PushableWorldCollision' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, RBObjectiveActor) == 0x0005E8, "Member 'APushable_OnRail_BP_C::RBObjectiveActor' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, HandIK) == 0x0005F0, "Member 'APushable_OnRail_BP_C::HandIK' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, Capsule) == 0x0005F8, "Member 'APushable_OnRail_BP_C::Capsule' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, PushablePawnCollision) == 0x000600, "Member 'APushable_OnRail_BP_C::PushablePawnCollision' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, RBPushable) == 0x000608, "Member 'APushable_OnRail_BP_C::RBPushable' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, PushingAnchor) == 0x000610, "Member 'APushable_OnRail_BP_C::PushingAnchor' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, CartRailWheelMinusFront) == 0x000618, "Member 'APushable_OnRail_BP_C::CartRailWheelMinusFront' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, CartRailWheelMinusRear) == 0x000620, "Member 'APushable_OnRail_BP_C::CartRailWheelMinusRear' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, CartRailMinus01) == 0x000628, "Member 'APushable_OnRail_BP_C::CartRailMinus01' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, LedgeMarkerFront) == 0x000630, "Member 'APushable_OnRail_BP_C::LedgeMarkerFront' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, LedgeMarkerRight) == 0x000638, "Member 'APushable_OnRail_BP_C::LedgeMarkerRight' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, LedgeMarkerRear) == 0x000640, "Member 'APushable_OnRail_BP_C::LedgeMarkerRear' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, LedgeMarkerLeft) == 0x000648, "Member 'APushable_OnRail_BP_C::LedgeMarkerLeft' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, LargeObjectCollector) == 0x000650, "Member 'APushable_OnRail_BP_C::LargeObjectCollector' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, WheelMeshes) == 0x000658, "Member 'APushable_OnRail_BP_C::WheelMeshes' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, DisableLedgeMarkers) == 0x0006A8, "Member 'APushable_OnRail_BP_C::DisableLedgeMarkers' has a wrong offset!");

}

