#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBCharacterSheetTabMenuButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.ExecuteUbergraph_RBCharacterSheetTabMenuButton
// 0x0008 (0x0008 - 0x0000)
struct RBCharacterSheetTabMenuButton_C_ExecuteUbergraph_RBCharacterSheetTabMenuButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBCharacterSheetTabMenuButton_C_ExecuteUbergraph_RBCharacterSheetTabMenuButton) == 0x000004, "Wrong alignment on RBCharacterSheetTabMenuButton_C_ExecuteUbergraph_RBCharacterSheetTabMenuButton");
static_assert(sizeof(RBCharacterSheetTabMenuButton_C_ExecuteUbergraph_RBCharacterSheetTabMenuButton) == 0x000008, "Wrong size on RBCharacterSheetTabMenuButton_C_ExecuteUbergraph_RBCharacterSheetTabMenuButton");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_ExecuteUbergraph_RBCharacterSheetTabMenuButton, EntryPoint) == 0x000000, "Member 'RBCharacterSheetTabMenuButton_C_ExecuteUbergraph_RBCharacterSheetTabMenuButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_ExecuteUbergraph_RBCharacterSheetTabMenuButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'RBCharacterSheetTabMenuButton_C_ExecuteUbergraph_RBCharacterSheetTabMenuButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct RBCharacterSheetTabMenuButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBCharacterSheetTabMenuButton_C_PreConstruct) == 0x000001, "Wrong alignment on RBCharacterSheetTabMenuButton_C_PreConstruct");
static_assert(sizeof(RBCharacterSheetTabMenuButton_C_PreConstruct) == 0x000001, "Wrong size on RBCharacterSheetTabMenuButton_C_PreConstruct");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'RBCharacterSheetTabMenuButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.Refresh
// 0x0070 (0x0070 - 0x0000)
struct RBCharacterSheetTabMenuButton_C_Refresh final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x0048(0x0028)()
};
static_assert(alignof(RBCharacterSheetTabMenuButton_C_Refresh) == 0x000008, "Wrong alignment on RBCharacterSheetTabMenuButton_C_Refresh");
static_assert(sizeof(RBCharacterSheetTabMenuButton_C_Refresh) == 0x000070, "Wrong size on RBCharacterSheetTabMenuButton_C_Refresh");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_Refresh, Temp_bool_Variable) == 0x000000, "Member 'RBCharacterSheetTabMenuButton_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_Refresh, Temp_float_Variable) == 0x000004, "Member 'RBCharacterSheetTabMenuButton_C_Refresh::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_Refresh, Temp_float_Variable_1) == 0x000008, "Member 'RBCharacterSheetTabMenuButton_C_Refresh::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_Refresh, Temp_bool_Variable_1) == 0x00000C, "Member 'RBCharacterSheetTabMenuButton_C_Refresh::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_Refresh, Temp_byte_Variable) == 0x00000D, "Member 'RBCharacterSheetTabMenuButton_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_Refresh, Temp_byte_Variable_1) == 0x00000E, "Member 'RBCharacterSheetTabMenuButton_C_Refresh::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_Refresh, Temp_bool_Variable_2) == 0x00000F, "Member 'RBCharacterSheetTabMenuButton_C_Refresh::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_Refresh, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000010, "Member 'RBCharacterSheetTabMenuButton_C_Refresh::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_Refresh, K2Node_Select_Default) == 0x000018, "Member 'RBCharacterSheetTabMenuButton_C_Refresh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_Refresh, K2Node_Select_Default_1) == 0x00001C, "Member 'RBCharacterSheetTabMenuButton_C_Refresh::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_Refresh, K2Node_MakeStruct_Margin) == 0x000020, "Member 'RBCharacterSheetTabMenuButton_C_Refresh::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_Refresh, CallFunc_SelectColor_ReturnValue) == 0x000030, "Member 'RBCharacterSheetTabMenuButton_C_Refresh::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_Refresh, CallFunc_BooleanOR_ReturnValue) == 0x000040, "Member 'RBCharacterSheetTabMenuButton_C_Refresh::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_Refresh, K2Node_Select_Default_2) == 0x000048, "Member 'RBCharacterSheetTabMenuButton_C_Refresh::K2Node_Select_Default_2' has a wrong offset!");

// Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct RBCharacterSheetTabMenuButton_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(RBCharacterSheetTabMenuButton_C_SetText) == 0x000008, "Wrong alignment on RBCharacterSheetTabMenuButton_C_SetText");
static_assert(sizeof(RBCharacterSheetTabMenuButton_C_SetText) == 0x000018, "Wrong size on RBCharacterSheetTabMenuButton_C_SetText");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_SetText, Text) == 0x000000, "Member 'RBCharacterSheetTabMenuButton_C_SetText::Text' has a wrong offset!");

// Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.SetHasNewItems
// 0x0005 (0x0005 - 0x0000)
struct RBCharacterSheetTabMenuButton_C_SetHasNewItems final
{
public:
	bool                                          HasNewItems;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBCharacterSheetTabMenuButton_C_SetHasNewItems) == 0x000001, "Wrong alignment on RBCharacterSheetTabMenuButton_C_SetHasNewItems");
static_assert(sizeof(RBCharacterSheetTabMenuButton_C_SetHasNewItems) == 0x000005, "Wrong size on RBCharacterSheetTabMenuButton_C_SetHasNewItems");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_SetHasNewItems, HasNewItems) == 0x000000, "Member 'RBCharacterSheetTabMenuButton_C_SetHasNewItems::HasNewItems' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_SetHasNewItems, Temp_bool_Variable) == 0x000001, "Member 'RBCharacterSheetTabMenuButton_C_SetHasNewItems::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_SetHasNewItems, Temp_byte_Variable) == 0x000002, "Member 'RBCharacterSheetTabMenuButton_C_SetHasNewItems::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_SetHasNewItems, Temp_byte_Variable_1) == 0x000003, "Member 'RBCharacterSheetTabMenuButton_C_SetHasNewItems::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_SetHasNewItems, K2Node_Select_Default) == 0x000004, "Member 'RBCharacterSheetTabMenuButton_C_SetHasNewItems::K2Node_Select_Default' has a wrong offset!");

// Function RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C.SetHovered
// 0x0001 (0x0001 - 0x0000)
struct RBCharacterSheetTabMenuButton_C_SetHovered final
{
public:
	bool                                          bInHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBCharacterSheetTabMenuButton_C_SetHovered) == 0x000001, "Wrong alignment on RBCharacterSheetTabMenuButton_C_SetHovered");
static_assert(sizeof(RBCharacterSheetTabMenuButton_C_SetHovered) == 0x000001, "Wrong size on RBCharacterSheetTabMenuButton_C_SetHovered");
static_assert(offsetof(RBCharacterSheetTabMenuButton_C_SetHovered, bInHovered) == 0x000000, "Member 'RBCharacterSheetTabMenuButton_C_SetHovered::bInHovered' has a wrong offset!");

}

