#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBCharacterSheetTabMenuButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RBCharacterSheetTabMenuButton.RBCharacterSheetTabMenuButton_C
// 0x00C8 (0x0350 - 0x0288)
class URBCharacterSheetTabMenuButton_C final : public URBMenuTabButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_0;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ButtonTxt;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Delimiter;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MainButton;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewNotification;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x02B8(0x0018)(Edit, BlueprintVisible)
	struct FSlateColor                            SelectedTextColor;                                 // 0x02D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            UnSelectedTextColor;                               // 0x02F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DisabledTextColor;                                 // 0x0320(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bHovered;                                          // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPlayDefaultClickSound;                            // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsLastTabButton;                                  // 0x034A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_RBCharacterSheetTabMenuButton(int32 EntryPoint);
	void Construct();
	void BndEvt__RBCharacterSheetTabMenuButton_MainButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__RBCharacterSheetTabMenuButton_MainButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Event_OnSelectedChanged();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__MainButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Refresh();
	void Disable();
	void SetText(const class FText& Text);
	void SetHasNewItems(bool HasNewItems);
	void SetHovered(bool bInHovered);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBCharacterSheetTabMenuButton_C">();
	}
	static class URBCharacterSheetTabMenuButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URBCharacterSheetTabMenuButton_C>();
	}
};
static_assert(alignof(URBCharacterSheetTabMenuButton_C) == 0x000008, "Wrong alignment on URBCharacterSheetTabMenuButton_C");
static_assert(sizeof(URBCharacterSheetTabMenuButton_C) == 0x000350, "Wrong size on URBCharacterSheetTabMenuButton_C");
static_assert(offsetof(URBCharacterSheetTabMenuButton_C, UberGraphFrame) == 0x000288, "Member 'URBCharacterSheetTabMenuButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URBCharacterSheetTabMenuButton_C, Border_0) == 0x000290, "Member 'URBCharacterSheetTabMenuButton_C::Border_0' has a wrong offset!");
static_assert(offsetof(URBCharacterSheetTabMenuButton_C, ButtonTxt) == 0x000298, "Member 'URBCharacterSheetTabMenuButton_C::ButtonTxt' has a wrong offset!");
static_assert(offsetof(URBCharacterSheetTabMenuButton_C, Delimiter) == 0x0002A0, "Member 'URBCharacterSheetTabMenuButton_C::Delimiter' has a wrong offset!");
static_assert(offsetof(URBCharacterSheetTabMenuButton_C, MainButton) == 0x0002A8, "Member 'URBCharacterSheetTabMenuButton_C::MainButton' has a wrong offset!");
static_assert(offsetof(URBCharacterSheetTabMenuButton_C, NewNotification) == 0x0002B0, "Member 'URBCharacterSheetTabMenuButton_C::NewNotification' has a wrong offset!");
static_assert(offsetof(URBCharacterSheetTabMenuButton_C, ButtonText) == 0x0002B8, "Member 'URBCharacterSheetTabMenuButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(URBCharacterSheetTabMenuButton_C, SelectedTextColor) == 0x0002D0, "Member 'URBCharacterSheetTabMenuButton_C::SelectedTextColor' has a wrong offset!");
static_assert(offsetof(URBCharacterSheetTabMenuButton_C, UnSelectedTextColor) == 0x0002F8, "Member 'URBCharacterSheetTabMenuButton_C::UnSelectedTextColor' has a wrong offset!");
static_assert(offsetof(URBCharacterSheetTabMenuButton_C, DisabledTextColor) == 0x000320, "Member 'URBCharacterSheetTabMenuButton_C::DisabledTextColor' has a wrong offset!");
static_assert(offsetof(URBCharacterSheetTabMenuButton_C, bHovered) == 0x000348, "Member 'URBCharacterSheetTabMenuButton_C::bHovered' has a wrong offset!");
static_assert(offsetof(URBCharacterSheetTabMenuButton_C, bPlayDefaultClickSound) == 0x000349, "Member 'URBCharacterSheetTabMenuButton_C::bPlayDefaultClickSound' has a wrong offset!");
static_assert(offsetof(URBCharacterSheetTabMenuButton_C, bIsLastTabButton) == 0x00034A, "Member 'URBCharacterSheetTabMenuButton_C::bIsLastTabButton' has a wrong offset!");

}

