#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBController_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RBController_BP.RBController_BP_C
// 0x1330 (0x1DA8 - 0x0A78)
class ARBController_BP_C final : public ARBController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FMulticastInlineDelegateProperty_             MouseWheel;                                        // 0x0A80(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class AActor*>                         DebugPerfActors;                                   // 0x0A90(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ARBBot*>                         DebugPerfBots;                                     // 0x0AA0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FAIConfigData                          DebugPerfAIConfig;                                 // 0x0AB0(0x12F8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_RBController_BP(int32 EntryPoint);
	void MouseWheel__DelegateSignature(float Axis, bool Shift, bool Alt);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBController_BP_C">();
	}
	static class ARBController_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARBController_BP_C>();
	}
};
static_assert(alignof(ARBController_BP_C) == 0x000008, "Wrong alignment on ARBController_BP_C");
static_assert(sizeof(ARBController_BP_C) == 0x001DA8, "Wrong size on ARBController_BP_C");
static_assert(offsetof(ARBController_BP_C, UberGraphFrame) == 0x000A78, "Member 'ARBController_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARBController_BP_C, MouseWheel) == 0x000A80, "Member 'ARBController_BP_C::MouseWheel' has a wrong offset!");
static_assert(offsetof(ARBController_BP_C, DebugPerfActors) == 0x000A90, "Member 'ARBController_BP_C::DebugPerfActors' has a wrong offset!");
static_assert(offsetof(ARBController_BP_C, DebugPerfBots) == 0x000AA0, "Member 'ARBController_BP_C::DebugPerfBots' has a wrong offset!");
static_assert(offsetof(ARBController_BP_C, DebugPerfAIConfig) == 0x000AB0, "Member 'ARBController_BP_C::DebugPerfAIConfig' has a wrong offset!");

}

