#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBEvalCorridor_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RBEvalCorridor_BP.RBEvalCorridor_BP_C
// 0x0030 (0x03B0 - 0x0380)
class ARBEvalCorridor_BP_C final : public ARBEvalCorridor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnLocalPlayerEntered;                              // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnLocalPlayerExited;                               // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Event_OnLocalPlayerEntered();
	void Event_OnLocalPlayerExited();
	void ExecuteUbergraph_RBEvalCorridor_BP(int32 EntryPoint);
	void OnLocalPlayerExited__DelegateSignature();
	void OnLocalPlayerEntered__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBEvalCorridor_BP_C">();
	}
	static class ARBEvalCorridor_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARBEvalCorridor_BP_C>();
	}
};
static_assert(alignof(ARBEvalCorridor_BP_C) == 0x000008, "Wrong alignment on ARBEvalCorridor_BP_C");
static_assert(sizeof(ARBEvalCorridor_BP_C) == 0x0003B0, "Wrong size on ARBEvalCorridor_BP_C");
static_assert(offsetof(ARBEvalCorridor_BP_C, UberGraphFrame) == 0x000380, "Member 'ARBEvalCorridor_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARBEvalCorridor_BP_C, Billboard) == 0x000388, "Member 'ARBEvalCorridor_BP_C::Billboard' has a wrong offset!");
static_assert(offsetof(ARBEvalCorridor_BP_C, OnLocalPlayerEntered) == 0x000390, "Member 'ARBEvalCorridor_BP_C::OnLocalPlayerEntered' has a wrong offset!");
static_assert(offsetof(ARBEvalCorridor_BP_C, OnLocalPlayerExited) == 0x0003A0, "Member 'ARBEvalCorridor_BP_C::OnLocalPlayerExited' has a wrong offset!");

}

