#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBMainMenuGameMode_BP

#include "Basic.hpp"

#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RBMainMenuGameMode_BP.RBMainMenuGameMode_BP_C
// 0x0020 (0x0460 - 0x0440)
class ARBMainMenuGameMode_BP_C final : public ARBGameModeMainMenu
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckRequiredXP;                                   // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             CheckRequiredXPChanged;                            // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CheckRequiredXPChanged__DelegateSignature(bool CheckRequiredXP_0);
	void SetCheckRequiredXP(bool CheckRequiredXP_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBMainMenuGameMode_BP_C">();
	}
	static class ARBMainMenuGameMode_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARBMainMenuGameMode_BP_C>();
	}
};
static_assert(alignof(ARBMainMenuGameMode_BP_C) == 0x000008, "Wrong alignment on ARBMainMenuGameMode_BP_C");
static_assert(sizeof(ARBMainMenuGameMode_BP_C) == 0x000460, "Wrong size on ARBMainMenuGameMode_BP_C");
static_assert(offsetof(ARBMainMenuGameMode_BP_C, DefaultSceneRoot) == 0x000440, "Member 'ARBMainMenuGameMode_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ARBMainMenuGameMode_BP_C, CheckRequiredXP) == 0x000448, "Member 'ARBMainMenuGameMode_BP_C::CheckRequiredXP' has a wrong offset!");
static_assert(offsetof(ARBMainMenuGameMode_BP_C, CheckRequiredXPChanged) == 0x000450, "Member 'ARBMainMenuGameMode_BP_C::CheckRequiredXPChanged' has a wrong offset!");

}

