#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBMenuButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function RBMenuButton.RBMenuButton_C.OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RBMenuButton_C_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBMenuButton_C_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on RBMenuButton_C_OnClicked__DelegateSignature");
static_assert(sizeof(RBMenuButton_C_OnClicked__DelegateSignature) == 0x000008, "Wrong size on RBMenuButton_C_OnClicked__DelegateSignature");
static_assert(offsetof(RBMenuButton_C_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'RBMenuButton_C_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function RBMenuButton.RBMenuButton_C.ExecuteUbergraph_RBMenuButton
// 0x0048 (0x0048 - 0x0000)
struct RBMenuButton_C_ExecuteUbergraph_RBMenuButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD1[0x1];                                     // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue_1;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AD2[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBMenuButton_C_ExecuteUbergraph_RBMenuButton) == 0x000008, "Wrong alignment on RBMenuButton_C_ExecuteUbergraph_RBMenuButton");
static_assert(sizeof(RBMenuButton_C_ExecuteUbergraph_RBMenuButton) == 0x000048, "Wrong size on RBMenuButton_C_ExecuteUbergraph_RBMenuButton");
static_assert(offsetof(RBMenuButton_C_ExecuteUbergraph_RBMenuButton, EntryPoint) == 0x000000, "Member 'RBMenuButton_C_ExecuteUbergraph_RBMenuButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_ExecuteUbergraph_RBMenuButton, Temp_delegate_Variable) == 0x000004, "Member 'RBMenuButton_C_ExecuteUbergraph_RBMenuButton::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_ExecuteUbergraph_RBMenuButton, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'RBMenuButton_C_ExecuteUbergraph_RBMenuButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_ExecuteUbergraph_RBMenuButton, Temp_bool_Variable) == 0x000024, "Member 'RBMenuButton_C_ExecuteUbergraph_RBMenuButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_ExecuteUbergraph_RBMenuButton, Temp_byte_Variable) == 0x000025, "Member 'RBMenuButton_C_ExecuteUbergraph_RBMenuButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_ExecuteUbergraph_RBMenuButton, Temp_byte_Variable_1) == 0x000026, "Member 'RBMenuButton_C_ExecuteUbergraph_RBMenuButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_ExecuteUbergraph_RBMenuButton, CallFunc_GetMenuManager_ReturnValue) == 0x000028, "Member 'RBMenuButton_C_ExecuteUbergraph_RBMenuButton::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_ExecuteUbergraph_RBMenuButton, CallFunc_GetMenuManager_ReturnValue_1) == 0x000030, "Member 'RBMenuButton_C_ExecuteUbergraph_RBMenuButton::CallFunc_GetMenuManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_ExecuteUbergraph_RBMenuButton, K2Node_Event_IsDesignTime) == 0x000038, "Member 'RBMenuButton_C_ExecuteUbergraph_RBMenuButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_ExecuteUbergraph_RBMenuButton, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'RBMenuButton_C_ExecuteUbergraph_RBMenuButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_ExecuteUbergraph_RBMenuButton, CallFunc_PostEventGlobal_ReturnValue) == 0x00003C, "Member 'RBMenuButton_C_ExecuteUbergraph_RBMenuButton::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_ExecuteUbergraph_RBMenuButton, K2Node_Select_Default) == 0x000040, "Member 'RBMenuButton_C_ExecuteUbergraph_RBMenuButton::K2Node_Select_Default' has a wrong offset!");

// Function RBMenuButton.RBMenuButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct RBMenuButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBMenuButton_C_PreConstruct) == 0x000001, "Wrong alignment on RBMenuButton_C_PreConstruct");
static_assert(sizeof(RBMenuButton_C_PreConstruct) == 0x000001, "Wrong size on RBMenuButton_C_PreConstruct");
static_assert(offsetof(RBMenuButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'RBMenuButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function RBMenuButton.RBMenuButton_C.UpdateInputImage
// 0x0040 (0x0040 - 0x0000)
struct RBMenuButton_C_UpdateInputImage final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AD3[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBMenuButton_C_UpdateInputImage) == 0x000008, "Wrong alignment on RBMenuButton_C_UpdateInputImage");
static_assert(sizeof(RBMenuButton_C_UpdateInputImage) == 0x000040, "Wrong size on RBMenuButton_C_UpdateInputImage");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, K2Node_MakeStruct_Margin) == 0x000000, "Member 'RBMenuButton_C_UpdateInputImage::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, Temp_bool_Variable) == 0x000010, "Member 'RBMenuButton_C_UpdateInputImage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, Temp_byte_Variable) == 0x000011, "Member 'RBMenuButton_C_UpdateInputImage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, Temp_byte_Variable_1) == 0x000012, "Member 'RBMenuButton_C_UpdateInputImage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'RBMenuButton_C_UpdateInputImage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000018, "Member 'RBMenuButton_C_UpdateInputImage::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, K2Node_MakeStruct_Margin_1) == 0x000020, "Member 'RBMenuButton_C_UpdateInputImage::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, CallFunc_Conv_StringToName_ReturnValue) == 0x000030, "Member 'RBMenuButton_C_UpdateInputImage::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000038, "Member 'RBMenuButton_C_UpdateInputImage::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'RBMenuButton_C_UpdateInputImage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, CallFunc_IsEmpty_ReturnValue) == 0x00003A, "Member 'RBMenuButton_C_UpdateInputImage::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, CallFunc_BooleanAND_ReturnValue_1) == 0x00003B, "Member 'RBMenuButton_C_UpdateInputImage::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, CallFunc_BooleanOR_ReturnValue) == 0x00003C, "Member 'RBMenuButton_C_UpdateInputImage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, CallFunc_BooleanAND_ReturnValue_2) == 0x00003D, "Member 'RBMenuButton_C_UpdateInputImage::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, CallFunc_BooleanOR_ReturnValue_1) == 0x00003E, "Member 'RBMenuButton_C_UpdateInputImage::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateInputImage, K2Node_Select_Default) == 0x00003F, "Member 'RBMenuButton_C_UpdateInputImage::K2Node_Select_Default' has a wrong offset!");

// Function RBMenuButton.RBMenuButton_C.UpdateButtonText
// 0x0020 (0x0020 - 0x0000)
struct RBMenuButton_C_UpdateButtonText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBMenuButton_C_UpdateButtonText) == 0x000008, "Wrong alignment on RBMenuButton_C_UpdateButtonText");
static_assert(sizeof(RBMenuButton_C_UpdateButtonText) == 0x000020, "Wrong size on RBMenuButton_C_UpdateButtonText");
static_assert(offsetof(RBMenuButton_C_UpdateButtonText, Text) == 0x000000, "Member 'RBMenuButton_C_UpdateButtonText::Text' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateButtonText, Temp_bool_Variable) == 0x000018, "Member 'RBMenuButton_C_UpdateButtonText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateButtonText, Temp_byte_Variable) == 0x000019, "Member 'RBMenuButton_C_UpdateButtonText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateButtonText, Temp_byte_Variable_1) == 0x00001A, "Member 'RBMenuButton_C_UpdateButtonText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateButtonText, CallFunc_TextIsEmpty_ReturnValue) == 0x00001B, "Member 'RBMenuButton_C_UpdateButtonText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateButtonText, K2Node_Select_Default) == 0x00001C, "Member 'RBMenuButton_C_UpdateButtonText::K2Node_Select_Default' has a wrong offset!");

// Function RBMenuButton.RBMenuButton_C.SetActionName
// 0x0010 (0x0010 - 0x0000)
struct RBMenuButton_C_SetActionName final
{
public:
	class FString                                 Param_ActionName;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(RBMenuButton_C_SetActionName) == 0x000008, "Wrong alignment on RBMenuButton_C_SetActionName");
static_assert(sizeof(RBMenuButton_C_SetActionName) == 0x000010, "Wrong size on RBMenuButton_C_SetActionName");
static_assert(offsetof(RBMenuButton_C_SetActionName, Param_ActionName) == 0x000000, "Member 'RBMenuButton_C_SetActionName::Param_ActionName' has a wrong offset!");

// Function RBMenuButton.RBMenuButton_C.UpdateButtonTextIcon
// 0x0010 (0x0010 - 0x0000)
struct RBMenuButton_C_UpdateButtonTextIcon final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AD4[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBMenuButton_C_UpdateButtonTextIcon) == 0x000008, "Wrong alignment on RBMenuButton_C_UpdateButtonTextIcon");
static_assert(sizeof(RBMenuButton_C_UpdateButtonTextIcon) == 0x000010, "Wrong size on RBMenuButton_C_UpdateButtonTextIcon");
static_assert(offsetof(RBMenuButton_C_UpdateButtonTextIcon, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'RBMenuButton_C_UpdateButtonTextIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_UpdateButtonTextIcon, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000008, "Member 'RBMenuButton_C_UpdateButtonTextIcon::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");

// Function RBMenuButton.RBMenuButton_C.SetButtonIconDetails
// 0x0020 (0x0020 - 0x0000)
struct RBMenuButton_C_SetButtonIconDetails final
{
public:
	class UTexture2D*                             Param_ButtonIconTexture;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Param_ButtonIconSize;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                Param_ButtonIconPadding;                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBMenuButton_C_SetButtonIconDetails) == 0x000008, "Wrong alignment on RBMenuButton_C_SetButtonIconDetails");
static_assert(sizeof(RBMenuButton_C_SetButtonIconDetails) == 0x000020, "Wrong size on RBMenuButton_C_SetButtonIconDetails");
static_assert(offsetof(RBMenuButton_C_SetButtonIconDetails, Param_ButtonIconTexture) == 0x000000, "Member 'RBMenuButton_C_SetButtonIconDetails::Param_ButtonIconTexture' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_SetButtonIconDetails, Param_ButtonIconSize) == 0x000008, "Member 'RBMenuButton_C_SetButtonIconDetails::Param_ButtonIconSize' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_SetButtonIconDetails, Param_ButtonIconPadding) == 0x000010, "Member 'RBMenuButton_C_SetButtonIconDetails::Param_ButtonIconPadding' has a wrong offset!");

// Function RBMenuButton.RBMenuButton_C.SetIsNew
// 0x0005 (0x0005 - 0x0000)
struct RBMenuButton_C_SetIsNew final
{
public:
	bool                                          IsNew;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBMenuButton_C_SetIsNew) == 0x000001, "Wrong alignment on RBMenuButton_C_SetIsNew");
static_assert(sizeof(RBMenuButton_C_SetIsNew) == 0x000005, "Wrong size on RBMenuButton_C_SetIsNew");
static_assert(offsetof(RBMenuButton_C_SetIsNew, IsNew) == 0x000000, "Member 'RBMenuButton_C_SetIsNew::IsNew' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_SetIsNew, Temp_bool_Variable) == 0x000001, "Member 'RBMenuButton_C_SetIsNew::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_SetIsNew, Temp_byte_Variable) == 0x000002, "Member 'RBMenuButton_C_SetIsNew::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_SetIsNew, Temp_byte_Variable_1) == 0x000003, "Member 'RBMenuButton_C_SetIsNew::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RBMenuButton_C_SetIsNew, K2Node_Select_Default) == 0x000004, "Member 'RBMenuButton_C_SetIsNew::K2Node_Select_Default' has a wrong offset!");

}

