#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBNPC_Big_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NPCSkinData_structs.hpp"
#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RBNPC_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RBNPC_Big_BP.RBNPC_Big_BP_C
// 0x01C0 (0x5A90 - 0x58D0)
class ARBNPC_Big_BP_C final : public ARBNPC_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_RBNPC_Big_BP_C;                     // 0x58D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Head_Mesh_EDITOR;                                  // 0x58D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 FullBody_Mesh_EDITOR;                              // 0x58E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 HairMesh;                                          // 0x58E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head_Mesh;                                         // 0x58F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 FullBody_Mesh;                                     // 0x58F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<ENPCWeapon, struct FVector>              LargeWeaponScales;                                 // 0x5900(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 SelectedVoice;                                     // 0x5950(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FNPCSkinData>                   MaleSkins;                                         // 0x5960(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPoseAsset*                             PoseAsset;                                         // 0x5970(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         ExtraMeshes;                                       // 0x5978(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FNPCSkinData>                   FemaleSkins;                                       // 0x5988(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         MaleVoices;                                        // 0x5998(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         FemaleVoices;                                      // 0x59A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsFemale;                                          // 0x59B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E8[0x7];                                     // 0x59B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNPCSkinData                           SelectedSkin;                                      // 0x59C0(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         SelectedMeshIndex;                                 // 0x5A78(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          DelayedApplyCustomization;                         // 0x5A7C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E9[0x3];                                     // 0x5A7D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedVoiceIndex_Server;                         // 0x5A80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RBNPC_Big_BP(int32 EntryPoint);
	void OnRessourcesLoaded(class AActor* CustomizationOwner, int32 RequestID, EPawnCustomizationRequestType RequestType);
	void ApplySkinMeshes();
	void Event_OnWeaponVisible(ENPCWeapon WeaponType, class ARBNPCWeapon* WeaponActor);
	void RequestSkinRessources();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void OnRep_RandomMesh();
	class UPoseAsset* GetFacePoseAsset();
	void GetRessourcesToLoad(TArray<struct FSoftObjectPath>* Ressources);
	void AddExtraBodyMesh(class USkeletalMesh* NewMesh);
	void CleanMeshes();
	void OnRep_CustomizationNetSeed();
	void UpdateVoiceType_Server();
	void RandomizeCustomization();
	void GetFaceAnimBP(class UEnemyFace_AnimBlueprint_C** EnemyFaceAnimBP);
	void OnReceivedMeshIndex();

	class USkeletalMeshComponent* GetFaceFXSkeletalMeshComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBNPC_Big_BP_C">();
	}
	static class ARBNPC_Big_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARBNPC_Big_BP_C>();
	}
};
static_assert(alignof(ARBNPC_Big_BP_C) == 0x000010, "Wrong alignment on ARBNPC_Big_BP_C");
static_assert(sizeof(ARBNPC_Big_BP_C) == 0x005A90, "Wrong size on ARBNPC_Big_BP_C");
static_assert(offsetof(ARBNPC_Big_BP_C, UberGraphFrame_RBNPC_Big_BP_C) == 0x0058D0, "Member 'ARBNPC_Big_BP_C::UberGraphFrame_RBNPC_Big_BP_C' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, Head_Mesh_EDITOR) == 0x0058D8, "Member 'ARBNPC_Big_BP_C::Head_Mesh_EDITOR' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, FullBody_Mesh_EDITOR) == 0x0058E0, "Member 'ARBNPC_Big_BP_C::FullBody_Mesh_EDITOR' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, HairMesh) == 0x0058E8, "Member 'ARBNPC_Big_BP_C::HairMesh' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, Head_Mesh) == 0x0058F0, "Member 'ARBNPC_Big_BP_C::Head_Mesh' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, FullBody_Mesh) == 0x0058F8, "Member 'ARBNPC_Big_BP_C::FullBody_Mesh' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, LargeWeaponScales) == 0x005900, "Member 'ARBNPC_Big_BP_C::LargeWeaponScales' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, SelectedVoice) == 0x005950, "Member 'ARBNPC_Big_BP_C::SelectedVoice' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, MaleSkins) == 0x005960, "Member 'ARBNPC_Big_BP_C::MaleSkins' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, PoseAsset) == 0x005970, "Member 'ARBNPC_Big_BP_C::PoseAsset' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, ExtraMeshes) == 0x005978, "Member 'ARBNPC_Big_BP_C::ExtraMeshes' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, FemaleSkins) == 0x005988, "Member 'ARBNPC_Big_BP_C::FemaleSkins' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, MaleVoices) == 0x005998, "Member 'ARBNPC_Big_BP_C::MaleVoices' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, FemaleVoices) == 0x0059A8, "Member 'ARBNPC_Big_BP_C::FemaleVoices' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, IsFemale) == 0x0059B8, "Member 'ARBNPC_Big_BP_C::IsFemale' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, SelectedSkin) == 0x0059C0, "Member 'ARBNPC_Big_BP_C::SelectedSkin' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, SelectedMeshIndex) == 0x005A78, "Member 'ARBNPC_Big_BP_C::SelectedMeshIndex' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, DelayedApplyCustomization) == 0x005A7C, "Member 'ARBNPC_Big_BP_C::DelayedApplyCustomization' has a wrong offset!");
static_assert(offsetof(ARBNPC_Big_BP_C, SelectedVoiceIndex_Server) == 0x005A80, "Member 'ARBNPC_Big_BP_C::SelectedVoiceIndex_Server' has a wrong offset!");

}

