#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBNPC_Gooseberry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RBNPC_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RBNPC_Gooseberry.RBNPC_Gooseberry_C
// 0x0050 (0x5A70 - 0x5A20)
class ARBNPC_Gooseberry_C final : public ARBNPC_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_RBNPC_Gooseberry_C;                 // 0x5A20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Futterman;                                         // 0x5A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Gooseberry_Skirt;                                  // 0x5A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head;                                              // 0x5A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 FullBodyMesh;                                      // 0x5A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TimeToPlayNextIdleBreaker;                         // 0x5A48(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4C[0x4];                                     // 0x5A4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             PlayFuttermanIdleBreaker;                          // 0x5A50(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bFaceFXUseFuttermanHead;                           // 0x5A60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void PlayFuttermanIdleBreaker__DelegateSignature();
	void ExecuteUbergraph_RBNPC_Gooseberry(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UpdateTimeToPlayFuttermanIdleBreaker();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	bool TryPlayFacialAnim(const class FString& LineId);
	class UPoseAsset* GetFacePoseAsset();
	void GetFaceAnimBP(class UEnemyFace_AnimBlueprint_C** EnemyFaceAnimBP);
	void SetFuttermanDrillValue(bool DrillValue, bool DrillManual, bool* Success);

	class USkeletalMeshComponent* GetFaceFXSkeletalMeshComponent() const;
	class USkeletalMeshComponent* GetFaceFXSkeletalMeshComponentWithLineId(const class FString& LineId) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBNPC_Gooseberry_C">();
	}
	static class ARBNPC_Gooseberry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARBNPC_Gooseberry_C>();
	}
};
static_assert(alignof(ARBNPC_Gooseberry_C) == 0x000010, "Wrong alignment on ARBNPC_Gooseberry_C");
static_assert(sizeof(ARBNPC_Gooseberry_C) == 0x005A70, "Wrong size on ARBNPC_Gooseberry_C");
static_assert(offsetof(ARBNPC_Gooseberry_C, UberGraphFrame_RBNPC_Gooseberry_C) == 0x005A20, "Member 'ARBNPC_Gooseberry_C::UberGraphFrame_RBNPC_Gooseberry_C' has a wrong offset!");
static_assert(offsetof(ARBNPC_Gooseberry_C, Futterman) == 0x005A28, "Member 'ARBNPC_Gooseberry_C::Futterman' has a wrong offset!");
static_assert(offsetof(ARBNPC_Gooseberry_C, Gooseberry_Skirt) == 0x005A30, "Member 'ARBNPC_Gooseberry_C::Gooseberry_Skirt' has a wrong offset!");
static_assert(offsetof(ARBNPC_Gooseberry_C, Head) == 0x005A38, "Member 'ARBNPC_Gooseberry_C::Head' has a wrong offset!");
static_assert(offsetof(ARBNPC_Gooseberry_C, FullBodyMesh) == 0x005A40, "Member 'ARBNPC_Gooseberry_C::FullBodyMesh' has a wrong offset!");
static_assert(offsetof(ARBNPC_Gooseberry_C, TimeToPlayNextIdleBreaker) == 0x005A48, "Member 'ARBNPC_Gooseberry_C::TimeToPlayNextIdleBreaker' has a wrong offset!");
static_assert(offsetof(ARBNPC_Gooseberry_C, PlayFuttermanIdleBreaker) == 0x005A50, "Member 'ARBNPC_Gooseberry_C::PlayFuttermanIdleBreaker' has a wrong offset!");
static_assert(offsetof(ARBNPC_Gooseberry_C, bFaceFXUseFuttermanHead) == 0x005A60, "Member 'ARBNPC_Gooseberry_C::bFaceFXUseFuttermanHead' has a wrong offset!");

}

