#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBNPC_Big_BP

#include "Basic.hpp"

#include "NPCSkinData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function RBNPC_Big_BP.RBNPC_Big_BP_C.ExecuteUbergraph_RBNPC_Big_BP
// 0x0130 (0x0130 - 0x0000)
struct RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENPCWeapon                                    K2Node_Event_weaponType;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBNPCWeapon*                           K2Node_Event_weaponActor;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Map_Find_Value;                           // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* CustomizationOwner, int32 RequestID, EPawnCustomizationRequestType RequestType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPawnCustomizationManager*            CallFunc_GetPawnCustomizationManager_ReturnValue;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_customizationOwner;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_requestID;                      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPawnCustomizationRequestType                 K2Node_CustomEvent_requestType;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPawnCustomizationManager*            CallFunc_GetPawnCustomizationManager_ReturnValue_1; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftObjectPath>                CallFunc_GetRessourcesToLoad_ressources;           // 0x0070(0x0010)(ReferenceParm)
	int32                                         CallFunc_LoadCustomResources_ReturnValue;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           CallFunc_Array_Get_Item;                           // 0x0090(0x0028)(HasGetValueTypeHash)
	class UPoseAsset*                             K2Node_DynamicCast_AsPose_Asset;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_1;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_2;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_4; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_3;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP) == 0x000008, "Wrong alignment on RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP");
static_assert(sizeof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP) == 0x000130, "Wrong size on RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, EntryPoint) == 0x000000, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_Event_weaponType) == 0x00000C, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_Event_weaponType' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_Event_weaponActor) == 0x000010, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_Event_weaponActor' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_Map_Find_Value) == 0x00001C, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_Map_Find_ReturnValue) == 0x000028, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_GetPawnCustomizationManager_ReturnValue) == 0x000048, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_GetPawnCustomizationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_CustomEvent_customizationOwner) == 0x000050, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_CustomEvent_customizationOwner' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_CustomEvent_requestID) == 0x000058, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_CustomEvent_requestID' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_CustomEvent_requestType) == 0x00005C, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_CustomEvent_requestType' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_GetPawnCustomizationManager_ReturnValue_1) == 0x000060, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_GetPawnCustomizationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_GetRessourcesToLoad_ressources) == 0x000070, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_GetRessourcesToLoad_ressources' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_LoadCustomResources_ReturnValue) == 0x000080, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_LoadCustomResources_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_IsValid_ReturnValue_1) == 0x000084, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000088, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_Array_Get_Item) == 0x000090, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_DynamicCast_AsPose_Asset) == 0x0000B8, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_DynamicCast_AsPose_Asset' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0000C8, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x0000D0, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_Array_Length_ReturnValue) == 0x0000DC, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_IsValid_ReturnValue_2) == 0x0000E0, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_Less_IntInt_ReturnValue) == 0x0000E1, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x0000E8, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3) == 0x0000F0, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_DynamicCast_AsSkeletal_Mesh_1) == 0x0000F8, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_DynamicCast_AsSkeletal_Mesh_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_DynamicCast_AsSkeletal_Mesh_2) == 0x000108, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_DynamicCast_AsSkeletal_Mesh_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_DynamicCast_bSuccess_3) == 0x000110, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_4) == 0x000118, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_DynamicCast_AsSkeletal_Mesh_3) == 0x000120, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_DynamicCast_AsSkeletal_Mesh_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP, K2Node_DynamicCast_bSuccess_4) == 0x000128, "Member 'RBNPC_Big_BP_C_ExecuteUbergraph_RBNPC_Big_BP::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function RBNPC_Big_BP.RBNPC_Big_BP_C.OnRessourcesLoaded
// 0x0010 (0x0010 - 0x0000)
struct RBNPC_Big_BP_C_OnRessourcesLoaded final
{
public:
	class AActor*                                 CustomizationOwner;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequestID;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPawnCustomizationRequestType                 RequestType;                                       // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Big_BP_C_OnRessourcesLoaded) == 0x000008, "Wrong alignment on RBNPC_Big_BP_C_OnRessourcesLoaded");
static_assert(sizeof(RBNPC_Big_BP_C_OnRessourcesLoaded) == 0x000010, "Wrong size on RBNPC_Big_BP_C_OnRessourcesLoaded");
static_assert(offsetof(RBNPC_Big_BP_C_OnRessourcesLoaded, CustomizationOwner) == 0x000000, "Member 'RBNPC_Big_BP_C_OnRessourcesLoaded::CustomizationOwner' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_OnRessourcesLoaded, RequestID) == 0x000008, "Member 'RBNPC_Big_BP_C_OnRessourcesLoaded::RequestID' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_OnRessourcesLoaded, RequestType) == 0x00000C, "Member 'RBNPC_Big_BP_C_OnRessourcesLoaded::RequestType' has a wrong offset!");

// Function RBNPC_Big_BP.RBNPC_Big_BP_C.Event_OnWeaponVisible
// 0x0010 (0x0010 - 0x0000)
struct RBNPC_Big_BP_C_Event_OnWeaponVisible final
{
public:
	ENPCWeapon                                    WeaponType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBNPCWeapon*                           WeaponActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Big_BP_C_Event_OnWeaponVisible) == 0x000008, "Wrong alignment on RBNPC_Big_BP_C_Event_OnWeaponVisible");
static_assert(sizeof(RBNPC_Big_BP_C_Event_OnWeaponVisible) == 0x000010, "Wrong size on RBNPC_Big_BP_C_Event_OnWeaponVisible");
static_assert(offsetof(RBNPC_Big_BP_C_Event_OnWeaponVisible, WeaponType) == 0x000000, "Member 'RBNPC_Big_BP_C_Event_OnWeaponVisible::WeaponType' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_Event_OnWeaponVisible, WeaponActor) == 0x000008, "Member 'RBNPC_Big_BP_C_Event_OnWeaponVisible::WeaponActor' has a wrong offset!");

// Function RBNPC_Big_BP.RBNPC_Big_BP_C.UserConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct RBNPC_Big_BP_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Big_BP_C_UserConstructionScript) == 0x000001, "Wrong alignment on RBNPC_Big_BP_C_UserConstructionScript");
static_assert(sizeof(RBNPC_Big_BP_C_UserConstructionScript) == 0x000002, "Wrong size on RBNPC_Big_BP_C_UserConstructionScript");
static_assert(offsetof(RBNPC_Big_BP_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'RBNPC_Big_BP_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'RBNPC_Big_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function RBNPC_Big_BP.RBNPC_Big_BP_C.GetFacePoseAsset
// 0x0008 (0x0008 - 0x0000)
struct RBNPC_Big_BP_C_GetFacePoseAsset final
{
public:
	class UPoseAsset*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Big_BP_C_GetFacePoseAsset) == 0x000008, "Wrong alignment on RBNPC_Big_BP_C_GetFacePoseAsset");
static_assert(sizeof(RBNPC_Big_BP_C_GetFacePoseAsset) == 0x000008, "Wrong size on RBNPC_Big_BP_C_GetFacePoseAsset");
static_assert(offsetof(RBNPC_Big_BP_C_GetFacePoseAsset, ReturnValue) == 0x000000, "Member 'RBNPC_Big_BP_C_GetFacePoseAsset::ReturnValue' has a wrong offset!");

// Function RBNPC_Big_BP.RBNPC_Big_BP_C.GetRessourcesToLoad
// 0x0110 (0x0110 - 0x0000)
struct RBNPC_Big_BP_C_GetRessourcesToLoad final
{
public:
	TArray<struct FSoftObjectPath>                Ressources;                                        // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FSoftObjectPath>                LocalRessources;                                   // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        CallFunc_MakeSoftObjectPath_ReturnValue;           // 0x0030(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue; // 0x0050(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           CallFunc_Array_Get_Item;                           // 0x0068(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue_1; // 0x0098(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue_2; // 0x00B8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue_3; // 0x00D0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue_4; // 0x00E8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FSoftObjectPath>                K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
};
static_assert(alignof(RBNPC_Big_BP_C_GetRessourcesToLoad) == 0x000008, "Wrong alignment on RBNPC_Big_BP_C_GetRessourcesToLoad");
static_assert(sizeof(RBNPC_Big_BP_C_GetRessourcesToLoad) == 0x000110, "Wrong size on RBNPC_Big_BP_C_GetRessourcesToLoad");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, Ressources) == 0x000000, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::Ressources' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, LocalRessources) == 0x000010, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::LocalRessources' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, Temp_int_Array_Index_Variable) == 0x000020, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, CallFunc_MakeSoftObjectPath_ReturnValue) == 0x000030, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::CallFunc_MakeSoftObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, CallFunc_Array_RemoveItem_ReturnValue) == 0x000048, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue) == 0x000050, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, CallFunc_Array_Get_Item) == 0x000068, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue_1) == 0x000098, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, CallFunc_Array_Add_ReturnValue) == 0x0000B4, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue_2) == 0x0000B8, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue_3) == 0x0000D0, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue_4) == 0x0000E8, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::CallFunc_GetSoftObjectPathFromSoftObjectReference_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_GetRessourcesToLoad, K2Node_MakeArray_Array) == 0x000100, "Member 'RBNPC_Big_BP_C_GetRessourcesToLoad::K2Node_MakeArray_Array' has a wrong offset!");

// Function RBNPC_Big_BP.RBNPC_Big_BP_C.AddExtraBodyMesh
// 0x0050 (0x0050 - 0x0000)
struct RBNPC_Big_BP_C_AddExtraBodyMesh final
{
public:
	class USkeletalMesh*                          NewMesh;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Big_BP_C_AddExtraBodyMesh) == 0x000010, "Wrong alignment on RBNPC_Big_BP_C_AddExtraBodyMesh");
static_assert(sizeof(RBNPC_Big_BP_C_AddExtraBodyMesh) == 0x000050, "Wrong size on RBNPC_Big_BP_C_AddExtraBodyMesh");
static_assert(offsetof(RBNPC_Big_BP_C_AddExtraBodyMesh, NewMesh) == 0x000000, "Member 'RBNPC_Big_BP_C_AddExtraBodyMesh::NewMesh' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_AddExtraBodyMesh, Temp_struct_Variable) == 0x000010, "Member 'RBNPC_Big_BP_C_AddExtraBodyMesh::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_AddExtraBodyMesh, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'RBNPC_Big_BP_C_AddExtraBodyMesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_AddExtraBodyMesh, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'RBNPC_Big_BP_C_AddExtraBodyMesh::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_AddExtraBodyMesh, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00004C, "Member 'RBNPC_Big_BP_C_AddExtraBodyMesh::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function RBNPC_Big_BP.RBNPC_Big_BP_C.CleanMeshes
// 0x0020 (0x0020 - 0x0000)
struct RBNPC_Big_BP_C_CleanMeshes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Big_BP_C_CleanMeshes) == 0x000008, "Wrong alignment on RBNPC_Big_BP_C_CleanMeshes");
static_assert(sizeof(RBNPC_Big_BP_C_CleanMeshes) == 0x000020, "Wrong size on RBNPC_Big_BP_C_CleanMeshes");
static_assert(offsetof(RBNPC_Big_BP_C_CleanMeshes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'RBNPC_Big_BP_C_CleanMeshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_CleanMeshes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'RBNPC_Big_BP_C_CleanMeshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_CleanMeshes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'RBNPC_Big_BP_C_CleanMeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_CleanMeshes, CallFunc_Array_Get_Item) == 0x000010, "Member 'RBNPC_Big_BP_C_CleanMeshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_CleanMeshes, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'RBNPC_Big_BP_C_CleanMeshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_CleanMeshes, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'RBNPC_Big_BP_C_CleanMeshes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_CleanMeshes, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'RBNPC_Big_BP_C_CleanMeshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function RBNPC_Big_BP.RBNPC_Big_BP_C.OnRep_CustomizationNetSeed
// 0x0001 (0x0001 - 0x0000)
struct RBNPC_Big_BP_C_OnRep_CustomizationNetSeed final
{
public:
	bool                                          CallFunc_HasActorNotBegunPlay_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Big_BP_C_OnRep_CustomizationNetSeed) == 0x000001, "Wrong alignment on RBNPC_Big_BP_C_OnRep_CustomizationNetSeed");
static_assert(sizeof(RBNPC_Big_BP_C_OnRep_CustomizationNetSeed) == 0x000001, "Wrong size on RBNPC_Big_BP_C_OnRep_CustomizationNetSeed");
static_assert(offsetof(RBNPC_Big_BP_C_OnRep_CustomizationNetSeed, CallFunc_HasActorNotBegunPlay_ReturnValue) == 0x000000, "Member 'RBNPC_Big_BP_C_OnRep_CustomizationNetSeed::CallFunc_HasActorNotBegunPlay_ReturnValue' has a wrong offset!");

// Function RBNPC_Big_BP.RBNPC_Big_BP_C.UpdateVoiceType_Server
// 0x0024 (0x0024 - 0x0000)
struct RBNPC_Big_BP_C_UpdateVoiceType_Server final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LevelRandomIntRange_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LevelRandomIntRange_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Big_BP_C_UpdateVoiceType_Server) == 0x000004, "Wrong alignment on RBNPC_Big_BP_C_UpdateVoiceType_Server");
static_assert(sizeof(RBNPC_Big_BP_C_UpdateVoiceType_Server) == 0x000024, "Wrong size on RBNPC_Big_BP_C_UpdateVoiceType_Server");
static_assert(offsetof(RBNPC_Big_BP_C_UpdateVoiceType_Server, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'RBNPC_Big_BP_C_UpdateVoiceType_Server::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_UpdateVoiceType_Server, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'RBNPC_Big_BP_C_UpdateVoiceType_Server::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_UpdateVoiceType_Server, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'RBNPC_Big_BP_C_UpdateVoiceType_Server::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_UpdateVoiceType_Server, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'RBNPC_Big_BP_C_UpdateVoiceType_Server::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_UpdateVoiceType_Server, CallFunc_LevelRandomIntRange_ReturnValue) == 0x000010, "Member 'RBNPC_Big_BP_C_UpdateVoiceType_Server::CallFunc_LevelRandomIntRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_UpdateVoiceType_Server, CallFunc_Array_Length_ReturnValue_1) == 0x000014, "Member 'RBNPC_Big_BP_C_UpdateVoiceType_Server::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_UpdateVoiceType_Server, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000018, "Member 'RBNPC_Big_BP_C_UpdateVoiceType_Server::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_UpdateVoiceType_Server, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'RBNPC_Big_BP_C_UpdateVoiceType_Server::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_UpdateVoiceType_Server, CallFunc_LevelRandomIntRange_ReturnValue_1) == 0x000020, "Member 'RBNPC_Big_BP_C_UpdateVoiceType_Server::CallFunc_LevelRandomIntRange_ReturnValue_1' has a wrong offset!");

// Function RBNPC_Big_BP.RBNPC_Big_BP_C.RandomizeCustomization
// 0x01C8 (0x01C8 - 0x0000)
struct RBNPC_Big_BP_C_RandomizeCustomization final
{
public:
	int32                                         VoiceIndex;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 AvailableVoiceIndex;                               // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         RandomIndex;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 AvailableMeshesIndex;                              // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 UsedVoicesIndex;                                   // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 UsedCustoMeshes;                                   // 0x0040(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDisabledNPCCustomizationIds_ReturnValue; // 0x0090(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCustomizationIndexFromId_Index;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LevelRandomIntRange_ReturnValue;          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LevelRandomIntRange_ReturnValue_1;        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutItem;                     // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_3;                         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_143[0x1];                                      // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_9;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GenerateRandomSeedNonDeterministic_ReturnValue; // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_10;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LevelRandomIntRange_ReturnValue_2;        // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_1;              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item_4;                         // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_11;              // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_176[0x2];                                      // 0x0176(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	TArray<class ARBBot*>                         CallFunc_GetAllBots_ReturnValue;                   // 0x0188(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_12;              // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBBot*                                 CallFunc_Array_Get_Item_5;                         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBNPC_Big_BP_C*                        K2Node_DynamicCast_AsRB_NPC_Big_BP;                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Big_BP_C_RandomizeCustomization) == 0x000008, "Wrong alignment on RBNPC_Big_BP_C_RandomizeCustomization");
static_assert(sizeof(RBNPC_Big_BP_C_RandomizeCustomization) == 0x0001C8, "Wrong size on RBNPC_Big_BP_C_RandomizeCustomization");
static_assert(offsetof(RBNPC_Big_BP_C_RandomizeCustomization, VoiceIndex) == 0x000000, "Member 'RBNPC_Big_BP_C_RandomizeCustomization::VoiceIndex' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_RandomizeCustomization, AvailableVoiceIndex) == 0x000008, "Member 'RBNPC_Big_BP_C_RandomizeCustomization::AvailableVoiceIndex' has a wrong offset!");
static_assert(offsetof(RBNPC_Big_BP_C_RandomizeCustomization, RandomIndex) == 0x000018, "Member 'RBNPC_Big_BP_C_RandomizeCustomization::RandomIndex' has a wrong offset!");
