#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBNPC_ScientistMinus03_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RBNPC_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RBNPC_Scientist-03_BP.RBNPC_Scientist-03_BP_C
// 0x0070 (0x5900 - 0x5890)
class ARBNPC_ScientistMinus03_BP_C final : public ARBNPC_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_RBNPC_ScientistMinus03_BP_C;        // 0x5890(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBPropOptimizerComponent*              RBPropOptimizer;                                   // 0x5898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PenMesh;                                           // 0x58A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ClipboardMesh;                                     // 0x58A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 UpperBody;                                         // 0x58B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head;                                              // 0x58B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 LowerBody;                                         // 0x58C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMesh*>                  Heads;                                             // 0x58C8(0x0010)(Edit, BlueprintVisible)
	TArray<class USkeletalMesh*>                  Lowers;                                            // 0x58D8(0x0010)(Edit, BlueprintVisible)
	TArray<class USkeletalMesh*>                  Uppers;                                            // 0x58E8(0x0010)(Edit, BlueprintVisible)

public:
	void GetFaceAnimBP(class UEnemyFace_AnimBlueprint_C** EnemyFaceAnimBP);
	class UPoseAsset* GetFacePoseAsset();
	void ApplyRandomOutfit();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void SetNormalMeshVisibility(bool bVisible);
	void SetPenMeshVisible(bool Visible);
	void ExecuteUbergraph_RBNPC_ScientistMinus03_BP(int32 EntryPoint);

	class USkeletalMeshComponent* GetFaceFXSkeletalMeshComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBNPC_Scientist-03_BP_C">();
	}
	static class ARBNPC_ScientistMinus03_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARBNPC_ScientistMinus03_BP_C>();
	}
};
static_assert(alignof(ARBNPC_ScientistMinus03_BP_C) == 0x000010, "Wrong alignment on ARBNPC_ScientistMinus03_BP_C");
static_assert(sizeof(ARBNPC_ScientistMinus03_BP_C) == 0x005900, "Wrong size on ARBNPC_ScientistMinus03_BP_C");
static_assert(offsetof(ARBNPC_ScientistMinus03_BP_C, UberGraphFrame_RBNPC_ScientistMinus03_BP_C) == 0x005890, "Member 'ARBNPC_ScientistMinus03_BP_C::UberGraphFrame_RBNPC_ScientistMinus03_BP_C' has a wrong offset!");
static_assert(offsetof(ARBNPC_ScientistMinus03_BP_C, RBPropOptimizer) == 0x005898, "Member 'ARBNPC_ScientistMinus03_BP_C::RBPropOptimizer' has a wrong offset!");
static_assert(offsetof(ARBNPC_ScientistMinus03_BP_C, PenMesh) == 0x0058A0, "Member 'ARBNPC_ScientistMinus03_BP_C::PenMesh' has a wrong offset!");
static_assert(offsetof(ARBNPC_ScientistMinus03_BP_C, ClipboardMesh) == 0x0058A8, "Member 'ARBNPC_ScientistMinus03_BP_C::ClipboardMesh' has a wrong offset!");
static_assert(offsetof(ARBNPC_ScientistMinus03_BP_C, UpperBody) == 0x0058B0, "Member 'ARBNPC_ScientistMinus03_BP_C::UpperBody' has a wrong offset!");
static_assert(offsetof(ARBNPC_ScientistMinus03_BP_C, Head) == 0x0058B8, "Member 'ARBNPC_ScientistMinus03_BP_C::Head' has a wrong offset!");
static_assert(offsetof(ARBNPC_ScientistMinus03_BP_C, LowerBody) == 0x0058C0, "Member 'ARBNPC_ScientistMinus03_BP_C::LowerBody' has a wrong offset!");
static_assert(offsetof(ARBNPC_ScientistMinus03_BP_C, Heads) == 0x0058C8, "Member 'ARBNPC_ScientistMinus03_BP_C::Heads' has a wrong offset!");
static_assert(offsetof(ARBNPC_ScientistMinus03_BP_C, Lowers) == 0x0058D8, "Member 'ARBNPC_ScientistMinus03_BP_C::Lowers' has a wrong offset!");
static_assert(offsetof(ARBNPC_ScientistMinus03_BP_C, Uppers) == 0x0058E8, "Member 'ARBNPC_ScientistMinus03_BP_C::Uppers' has a wrong offset!");

}

