#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBNPC_Guard_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RBNPC_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RBNPC_Guard_BP.RBNPC_Guard_BP_C
// 0x0040 (0x58D0 - 0x5890)
class ARBNPC_Guard_BP_C final : public ARBNPC_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_RBNPC_Guard_BP_C;                   // 0x5890(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBPropOptimizerComponent*              RBPropOptimizer;                                   // 0x5898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Guard_Revolver;                                    // 0x58A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head_Mesh;                                         // 0x58A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 FullBody_Mesh;                                     // 0x58B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMesh*>                  Heads;                                             // 0x58B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void GetFaceAnimBP(class UEnemyFace_AnimBlueprint_C** EnemyFaceAnimBP);
	class UPoseAsset* GetFacePoseAsset();
	void ApplyRandomOutfit();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void SetNormalMeshVisibility(bool bVisible);
	void ExecuteUbergraph_RBNPC_Guard_BP(int32 EntryPoint);

	class USkeletalMeshComponent* GetFaceFXSkeletalMeshComponent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBNPC_Guard_BP_C">();
	}
	static class ARBNPC_Guard_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARBNPC_Guard_BP_C>();
	}
};
static_assert(alignof(ARBNPC_Guard_BP_C) == 0x000010, "Wrong alignment on ARBNPC_Guard_BP_C");
static_assert(sizeof(ARBNPC_Guard_BP_C) == 0x0058D0, "Wrong size on ARBNPC_Guard_BP_C");
static_assert(offsetof(ARBNPC_Guard_BP_C, UberGraphFrame_RBNPC_Guard_BP_C) == 0x005890, "Member 'ARBNPC_Guard_BP_C::UberGraphFrame_RBNPC_Guard_BP_C' has a wrong offset!");
static_assert(offsetof(ARBNPC_Guard_BP_C, RBPropOptimizer) == 0x005898, "Member 'ARBNPC_Guard_BP_C::RBPropOptimizer' has a wrong offset!");
static_assert(offsetof(ARBNPC_Guard_BP_C, Guard_Revolver) == 0x0058A0, "Member 'ARBNPC_Guard_BP_C::Guard_Revolver' has a wrong offset!");
static_assert(offsetof(ARBNPC_Guard_BP_C, Head_Mesh) == 0x0058A8, "Member 'ARBNPC_Guard_BP_C::Head_Mesh' has a wrong offset!");
static_assert(offsetof(ARBNPC_Guard_BP_C, FullBody_Mesh) == 0x0058B0, "Member 'ARBNPC_Guard_BP_C::FullBody_Mesh' has a wrong offset!");
static_assert(offsetof(ARBNPC_Guard_BP_C, Heads) == 0x0058B8, "Member 'ARBNPC_Guard_BP_C::Heads' has a wrong offset!");

}

