#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBPlayer_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RBPlayer_BP.RBPlayer_BP_C.ExecuteUbergraph_RBPlayer_BP
// 0x0370 (0x0370 - 0x0000)
struct RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInSAS_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_1;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0060(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0070(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0090(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ARBPickup* OldItem, class ARBPickup* NewItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x00C0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageInfo                            K2Node_Event_info;                                 // 0x00D8(0x0050)(ConstParm, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0128(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_ComponentBoundEvent_bOn;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENVState                                      CallFunc_GetCurrentState_ReturnValue;              // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_CustomEvent_AkEvent;                        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x0150(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_2;            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsNvActive)>              K2Node_CreateDelegate_OutputDelegate_1;            // 0x0164(0x0010)(ZeroConstructor, NoDestructor)
	EItemType                                     K2Node_Event_batteryType;                          // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFootstepData                          K2Node_Event_footstepData;                         // 0x0180(0x0038)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsLocallyControlledOrSpectated_ReturnValue; // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlledOrSpectated_ReturnValue_1; // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsInFirstPerson_ReturnValue;           // 0x01CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsInFirstPerson_ReturnValue_1;         // 0x01CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_Event_addedExtraMeshes;                     // 0x01D8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	EPlayerCustomizationSlot                      K2Node_Event_slot;                                 // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsInFirstPerson_ReturnValue_2;         // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Should_Hide_Customization_Slot_in_1P_ShouldHide; // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB[0x1];                                      // 0x01EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPickup*                              K2Node_CustomEvent_oldItem;                        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPickup*                              K2Node_CustomEvent_newItem;                        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0216(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0217(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_5;          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_6;          // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_CustomEvent_Event;                          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APPManager_BP_C*                        CallFunc_GetPPFXManager_Manager;                   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isNvActive;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWantsNvOn;                           // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENightVisionAnimNotifyType                    K2Node_Event_type;                                 // 0x0246(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0247(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsUnderwater;                        // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsInFirstPerson_ReturnValue_3;         // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_263[0xD];                                      // 0x0263(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0270(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsideredUsingSpectraActiveSkill_ReturnValue; // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FX_ItemConsume_Heal_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_activeSkillActor;                     // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsInFirstPerson_ReturnValue_4;         // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5[0xB];                                      // 0x02D5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x02E0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue;          // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FX_ItemConsume_Respawn_C*           CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0330(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item_2;                         // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34E[0x2];                                      // 0x034E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0350(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsConsideredDead_ReturnValue;             // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP) == 0x000010, "Wrong alignment on RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP");
static_assert(sizeof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP) == 0x000370, "Wrong size on RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, EntryPoint) == 0x000000, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsInSAS_ReturnValue) == 0x000004, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsInSAS_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_object_Variable) == 0x000010, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x000018, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_bool_Variable) == 0x000021, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_object_Variable_1) == 0x000028, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_object_Variable_2) == 0x000030, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_delegate_Variable) == 0x000038, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_delegate_Variable_1) == 0x000048, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_PostEventGlobal_ReturnValue) == 0x000058, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_PostEventGlobal_ReturnValue_1) == 0x00005C, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_PostEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_delegate_Variable_2) == 0x000060, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_delegate_Variable_3) == 0x000070, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_PostEventOnActor_ReturnValue) == 0x000080, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_int_Array_Index_Variable) == 0x000084, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000088, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_struct_Variable) == 0x000090, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_int_Loop_Counter_Variable) == 0x0000A0, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_CreateDelegate_OutputDelegate) == 0x0000A4, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Add_IntInt_ReturnValue) == 0x0000B4, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_int_Array_Index_Variable_1) == 0x0000B8, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_float_Variable) == 0x0000BC, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_delegate_Variable_4) == 0x0000C0, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0000D0, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000D1, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_Event_info) == 0x0000D8, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_Event_info' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_struct_Variable_1) == 0x000128, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_ComponentBoundEvent_bOn) == 0x000138, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_ComponentBoundEvent_bOn' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_GetCurrentState_ReturnValue) == 0x000139, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_GetCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00013A, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_Event_EndPlayReason) == 0x00013B, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_float_Variable_1) == 0x00013C, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_bool_Variable_1) == 0x000140, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_CustomEvent_AkEvent) == 0x000148, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_CustomEvent_AkEvent' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_delegate_Variable_5) == 0x000150, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_PostEventGlobal_ReturnValue_2) == 0x000160, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_PostEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000164, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_Event_batteryType) == 0x000174, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_Event_batteryType' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_PostAkEvent_ReturnValue) == 0x000178, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_Event_footstepData) == 0x000180, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_Event_footstepData' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsLocallyControlledOrSpectated_ReturnValue) == 0x0001B8, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsLocallyControlledOrSpectated_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsLocallyControlledOrSpectated_ReturnValue_1) == 0x0001B9, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsLocallyControlledOrSpectated_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0001BA, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x0001BB, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Array_Get_Item) == 0x0001C0, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Array_Length_ReturnValue) == 0x0001C8, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsValid_ReturnValue) == 0x0001CC, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsValid_ReturnValue_1) == 0x0001CD, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_BP_IsInFirstPerson_ReturnValue) == 0x0001CE, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_BP_IsInFirstPerson_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_BP_IsInFirstPerson_ReturnValue_1) == 0x0001CF, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_BP_IsInFirstPerson_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Not_PreBool_ReturnValue) == 0x0001D0, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_Event_addedExtraMeshes) == 0x0001D8, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_Event_addedExtraMeshes' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_Event_slot) == 0x0001E8, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_Event_slot' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_BP_IsInFirstPerson_ReturnValue_2) == 0x0001E9, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_BP_IsInFirstPerson_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Should_Hide_Customization_Slot_in_1P_ShouldHide) == 0x0001EA, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Should_Hide_Customization_Slot_in_1P_ShouldHide' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Array_Length_ReturnValue_1) == 0x0001EC, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_CustomEvent_oldItem) == 0x0001F0, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_CustomEvent_oldItem' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_CustomEvent_newItem) == 0x0001F8, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_CustomEvent_newItem' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_Event_DeltaSeconds) == 0x000200, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_int_Array_Index_Variable_2) == 0x000204, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Array_Get_Item_1) == 0x000208, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Array_Add_ReturnValue) == 0x000210, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsValid_ReturnValue_2) == 0x000214, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x000215, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_BooleanOR_ReturnValue) == 0x000216, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_BooleanAND_ReturnValue) == 0x000217, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsDedicatedServer_ReturnValue_5) == 0x000218, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsDedicatedServer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsDedicatedServer_ReturnValue_6) == 0x000219, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsDedicatedServer_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_CustomEvent_Event) == 0x000220, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_CustomEvent_Event' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_int_Loop_Counter_Variable_1) == 0x000228, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_PostAkEvent_ReturnValue_1) == 0x00022C, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000230, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000234, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_GetPPFXManager_Manager) == 0x000238, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_GetPPFXManager_Manager' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_CustomEvent_isNvActive) == 0x000240, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_CustomEvent_isNvActive' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsValid_ReturnValue_3) == 0x000241, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsValid_ReturnValue_4) == 0x000242, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsValid_ReturnValue_5) == 0x000243, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsValid_ReturnValue_6) == 0x000244, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_Event_bWantsNvOn) == 0x000245, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_Event_bWantsNvOn' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_Event_type) == 0x000246, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_Event_type' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000247, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_Select_Default) == 0x000248, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Not_PreBool_ReturnValue_1) == 0x00024C, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_MakeStruct_LinearColor) == 0x000250, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_CustomEvent_Enabled) == 0x000260, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_CustomEvent_Enabled' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_Event_bIsUnderwater) == 0x000261, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_Event_bIsUnderwater' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_BP_IsInFirstPerson_ReturnValue_3) == 0x000262, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_BP_IsInFirstPerson_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_GetTransform_ReturnValue) == 0x000270, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0002A0, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsConsideredUsingSpectraActiveSkill_ReturnValue) == 0x0002A8, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsConsideredUsingSpectraActiveSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x0002B0, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_Select_Default_1) == 0x0002B8, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_Event_activeSkillActor) == 0x0002C0, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_Event_activeSkillActor' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, Temp_int_Loop_Counter_Variable_2) == 0x0002C8, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002CC, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Add_IntInt_ReturnValue_2) == 0x0002D0, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_BP_IsInFirstPerson_ReturnValue_4) == 0x0002D4, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_BP_IsInFirstPerson_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_GetTransform_ReturnValue_1) == 0x0002E0, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000310, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_GetRBGameStateLobby_ReturnValue) == 0x000318, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_GetRBGameStateLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000320, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsValid_ReturnValue_7) == 0x000328, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_BooleanOR_ReturnValue_1) == 0x000329, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_GetChildrenComponents_Children) == 0x000330, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Array_Get_Item_2) == 0x000340, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Array_Length_ReturnValue_2) == 0x000348, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_ActorHasTag_ReturnValue) == 0x00034C, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_Less_IntInt_ReturnValue_2) == 0x00034D, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, K2Node_CreateDelegate_OutputDelegate_2) == 0x000350, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_IsConsideredDead_ReturnValue) == 0x000360, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_IsConsideredDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP, CallFunc_BooleanOR_ReturnValue_2) == 0x000361, "Member 'RBPlayer_BP_C_ExecuteUbergraph_RBPlayer_BP::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function RBPlayer_BP.RBPlayer_BP_C.Event_OnActiveSkillActorChanged
// 0x0008 (0x0008 - 0x0000)
struct RBPlayer_BP_C_Event_OnActiveSkillActorChanged final
{
public:
	class AActor*                                 ActiveSkillActor_0;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBPlayer_BP_C_Event_OnActiveSkillActorChanged) == 0x000008, "Wrong alignment on RBPlayer_BP_C_Event_OnActiveSkillActorChanged");
static_assert(sizeof(RBPlayer_BP_C_Event_OnActiveSkillActorChanged) == 0x000008, "Wrong size on RBPlayer_BP_C_Event_OnActiveSkillActorChanged");
static_assert(offsetof(RBPlayer_BP_C_Event_OnActiveSkillActorChanged, ActiveSkillActor_0) == 0x000000, "Member 'RBPlayer_BP_C_Event_OnActiveSkillActorChanged::ActiveSkillActor_0' has a wrong offset!");

// Function RBPlayer_BP.RBPlayer_BP_C.UnderwaterStateChanged
// 0x0001 (0x0001 - 0x0000)
struct RBPlayer_BP_C_UnderwaterStateChanged final
{
public:
	bool                                          bIsUnderwater;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBPlayer_BP_C_UnderwaterStateChanged) == 0x000001, "Wrong alignment on RBPlayer_BP_C_UnderwaterStateChanged");
static_assert(sizeof(RBPlayer_BP_C_UnderwaterStateChanged) == 0x000001, "Wrong size on RBPlayer_BP_C_UnderwaterStateChanged");
static_assert(offsetof(RBPlayer_BP_C_UnderwaterStateChanged, bIsUnderwater) == 0x000000, "Member 'RBPlayer_BP_C_UnderwaterStateChanged::bIsUnderwater' has a wrong offset!");

// Function RBPlayer_BP.RBPlayer_BP_C.SetProxylightEnabled
// 0x0001 (0x0001 - 0x0000)
struct RBPlayer_BP_C_SetProxylightEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBPlayer_BP_C_SetProxylightEnabled) == 0x000001, "Wrong alignment on RBPlayer_BP_C_SetProxylightEnabled");
static_assert(sizeof(RBPlayer_BP_C_SetProxylightEnabled) == 0x000001, "Wrong size on RBPlayer_BP_C_SetProxylightEnabled");
static_assert(offsetof(RBPlayer_BP_C_SetProxylightEnabled, Enabled) == 0x000000, "Member 'RBPlayer_BP_C_SetProxylightEnabled::Enabled' has a wrong offset!");

// Function RBPlayer_BP.RBPlayer_BP_C.Event_OnNVAnimationNotify
// 0x0002 (0x0002 - 0x0000)
struct RBPlayer_BP_C_Event_OnNVAnimationNotify final
{
public:
	bool                                          bWantsNvOn;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ENightVisionAnimNotifyType                    Type;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBPlayer_BP_C_Event_OnNVAnimationNotify) == 0x000001, "Wrong alignment on RBPlayer_BP_C_Event_OnNVAnimationNotify");
static_assert(sizeof(RBPlayer_BP_C_Event_OnNVAnimationNotify) == 0x000002, "Wrong size on RBPlayer_BP_C_Event_OnNVAnimationNotify");
static_assert(offsetof(RBPlayer_BP_C_Event_OnNVAnimationNotify, bWantsNvOn) == 0x000000, "Member 'RBPlayer_BP_C_Event_OnNVAnimationNotify::bWantsNvOn' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_Event_OnNVAnimationNotify, Type) == 0x000001, "Member 'RBPlayer_BP_C_Event_OnNVAnimationNotify::Type' has a wrong offset!");

// Function RBPlayer_BP.RBPlayer_BP_C.OnNVAnimationDone_Event
// 0x0001 (0x0001 - 0x0000)
struct RBPlayer_BP_C_OnNVAnimationDone_Event final
{
public:
	bool                                          IsNvActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBPlayer_BP_C_OnNVAnimationDone_Event) == 0x000001, "Wrong alignment on RBPlayer_BP_C_OnNVAnimationDone_Event");
static_assert(sizeof(RBPlayer_BP_C_OnNVAnimationDone_Event) == 0x000001, "Wrong size on RBPlayer_BP_C_OnNVAnimationDone_Event");
static_assert(offsetof(RBPlayer_BP_C_OnNVAnimationDone_Event, IsNvActive) == 0x000000, "Member 'RBPlayer_BP_C_OnNVAnimationDone_Event::IsNvActive' has a wrong offset!");

// Function RBPlayer_BP.RBPlayer_BP_C.Broadcast2DSound
// 0x0008 (0x0008 - 0x0000)
struct RBPlayer_BP_C_Broadcast2DSound final
{
public:
	class UAkAudioEvent*                          Event;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBPlayer_BP_C_Broadcast2DSound) == 0x000008, "Wrong alignment on RBPlayer_BP_C_Broadcast2DSound");
static_assert(sizeof(RBPlayer_BP_C_Broadcast2DSound) == 0x000008, "Wrong size on RBPlayer_BP_C_Broadcast2DSound");
static_assert(offsetof(RBPlayer_BP_C_Broadcast2DSound, Event) == 0x000000, "Member 'RBPlayer_BP_C_Broadcast2DSound::Event' has a wrong offset!");

// Function RBPlayer_BP.RBPlayer_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct RBPlayer_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBPlayer_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on RBPlayer_BP_C_ReceiveTick");
static_assert(sizeof(RBPlayer_BP_C_ReceiveTick) == 0x000004, "Wrong size on RBPlayer_BP_C_ReceiveTick");
static_assert(offsetof(RBPlayer_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'RBPlayer_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function RBPlayer_BP.RBPlayer_BP_C.UpdateShadowPickupEvent
// 0x0010 (0x0010 - 0x0000)
struct RBPlayer_BP_C_UpdateShadowPickupEvent final
{
public:
	class ARBPickup*                              OldItem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPickup*                              NewItem;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBPlayer_BP_C_UpdateShadowPickupEvent) == 0x000008, "Wrong alignment on RBPlayer_BP_C_UpdateShadowPickupEvent");
static_assert(sizeof(RBPlayer_BP_C_UpdateShadowPickupEvent) == 0x000010, "Wrong size on RBPlayer_BP_C_UpdateShadowPickupEvent");
static_assert(offsetof(RBPlayer_BP_C_UpdateShadowPickupEvent, OldItem) == 0x000000, "Member 'RBPlayer_BP_C_UpdateShadowPickupEvent::OldItem' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_UpdateShadowPickupEvent, NewItem) == 0x000008, "Member 'RBPlayer_BP_C_UpdateShadowPickupEvent::NewItem' has a wrong offset!");

// Function RBPlayer_BP.RBPlayer_BP_C.OnExtraCustomizationMeshesAddedForSlot
// 0x0018 (0x0018 - 0x0000)
struct RBPlayer_BP_C_OnExtraCustomizationMeshesAddedForSlot final
{
public:
	TArray<class USkeletalMeshComponent*>         AddedExtraMeshes;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EPlayerCustomizationSlot                      Slot;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBPlayer_BP_C_OnExtraCustomizationMeshesAddedForSlot) == 0x000008, "Wrong alignment on RBPlayer_BP_C_OnExtraCustomizationMeshesAddedForSlot");
static_assert(sizeof(RBPlayer_BP_C_OnExtraCustomizationMeshesAddedForSlot) == 0x000018, "Wrong size on RBPlayer_BP_C_OnExtraCustomizationMeshesAddedForSlot");
static_assert(offsetof(RBPlayer_BP_C_OnExtraCustomizationMeshesAddedForSlot, AddedExtraMeshes) == 0x000000, "Member 'RBPlayer_BP_C_OnExtraCustomizationMeshesAddedForSlot::AddedExtraMeshes' has a wrong offset!");
static_assert(offsetof(RBPlayer_BP_C_OnExtraCustomizationMeshesAddedForSlot, Slot) == 0x000010, "Member 'RBPlayer_BP_C_OnExtraCustomizationMeshesAddedForSlot::Slot' has a wrong offset!");

// Function RBPlayer_BP.RBPlayer_BP_C.Event_OnFootstep
// 0x0038 (0x0038 - 0x0000)
struct RBPlayer_BP_C_Event_OnFootstep final
{
public:
	struct FFootstepData                          FootstepData;                                      // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(RBPlayer_BP_C_Event_OnFootstep) == 0x000008, "Wrong alignment on RBPlayer_BP_C_Event_OnFootstep");
static_assert(sizeof(RBPlayer_BP_C_Event_OnFootstep) == 0x000038, "Wrong size on RBPlayer_BP_C_Event_OnFootstep");
static_assert(offsetof(RBPlayer_BP_C_Event_OnFootstep, FootstepData) == 0x000000, "Member 'RBPlayer_BP_C_Event_OnFootstep::FootstepData' has a wrong offset!");

// Function RBPlayer_BP.RBPlayer_BP_C.Event_OnLastConsumedBatteryTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct RBPlayer_BP_C_Event_OnLastConsumedBatteryTypeChanged final
{
public:
	EItemType                                     batteryType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBPlayer_BP_C_Event_OnLastConsumedBatteryTypeChanged) == 0x000001, "Wrong alignment on RBPlayer_BP_C_Event_OnLastConsumedBatteryTypeChanged");
static_assert(sizeof(RBPlayer_BP_C_Event_OnLastConsumedBatteryTypeChanged) == 0x000001, "Wrong size on RBPlayer_BP_C_Event_OnLastConsumedBatteryTypeChanged");
static_assert(offsetof(RBPlayer_BP_C_Event_OnLastConsumedBatteryTypeChanged, batteryType) == 0x000000, "Member 'RBPlayer_BP_C_Event_OnLastConsumedBatteryTypeChanged::batteryType' has a wrong offset!");

// Function RBPlayer_BP.RBPlayer_BP_C.PlaySoundOnPlayer
// 0x0008 (0x0008 - 0x0000)
struct RBPlayer_BP_C_PlaySoundOnPlayer final
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBPlayer_BP_C_PlaySoundOnPlayer) == 0x000008, "Wrong alignment on RBPlayer_BP_C_PlaySoundOnPlayer");
static_assert(sizeof(RBPlayer_BP_C_PlaySoundOnPlayer) == 0x000008, "Wrong size on RBPlayer_BP_C_PlaySoundOnPlayer");
static_assert(offsetof(RBPlayer_BP_C_PlaySoundOnPlayer, AkEvent) == 0x000000, "Member 'RBPlayer_BP_C_PlaySoundOnPlayer::AkEvent' has a wrong offset!");

