#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RecessedLightMinus01_BP

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RecessedLight-01_BP.RecessedLight-01_BP_C
// 0x0020 (0x07C0 - 0x07A0)
class ARecessedLightMinus01_BP_C final : public ARBLight_BP_C
{
public:
	class USpotLightComponent*                    SpotLight_Static;                                  // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Movable;                                 // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LightCageMinus01;                                  // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RecessedLight-01_BP_C">();
	}
	static class ARecessedLightMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARecessedLightMinus01_BP_C>();
	}
};
static_assert(alignof(ARecessedLightMinus01_BP_C) == 0x000010, "Wrong alignment on ARecessedLightMinus01_BP_C");
static_assert(sizeof(ARecessedLightMinus01_BP_C) == 0x0007C0, "Wrong size on ARecessedLightMinus01_BP_C");
static_assert(offsetof(ARecessedLightMinus01_BP_C, SpotLight_Static) == 0x0007A0, "Member 'ARecessedLightMinus01_BP_C::SpotLight_Static' has a wrong offset!");
static_assert(offsetof(ARecessedLightMinus01_BP_C, SpotLight_Movable) == 0x0007A8, "Member 'ARecessedLightMinus01_BP_C::SpotLight_Movable' has a wrong offset!");
static_assert(offsetof(ARecessedLightMinus01_BP_C, LightCageMinus01) == 0x0007B0, "Member 'ARecessedLightMinus01_BP_C::LightCageMinus01' has a wrong offset!");

}

