#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReleaseCorridorWindowShutterMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ReleaseCorridorWindowShutter-01_BP.ReleaseCorridorWindowShutter-01_BP_C
// 0x0030 (0x0460 - 0x0430)
class AReleaseCorridorWindowShutterMinus01_BP_C final : public ARBTriggerable
{
public:
	uint8                                         Pad_33A5[0x8];                                     // 0x0428(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Anchor;                                            // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         WindowMovement_NewTrack_0_EF3BC1554729872733811B9198FE2843; // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            WindowMovement__Direction_EF3BC1554729872733811B9198FE2843; // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A6[0x3];                                     // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     WindowMovement;                                    // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnWorldPopulateFinishedTimeSliced();
	void WindowMovement__FinishedFunc();
	void WindowMovement__UpdateFunc();
	void OnWorldFullyLoaded();
	void Event_OnTriggered();
	void Event_OnUntriggered();
	void Event_SnapToState();
	void OnWorldPopulateFinished();
	void ExecuteUbergraph_ReleaseCorridorWindowShutterMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReleaseCorridorWindowShutter-01_BP_C">();
	}
	static class AReleaseCorridorWindowShutterMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReleaseCorridorWindowShutterMinus01_BP_C>();
	}
};
static_assert(alignof(AReleaseCorridorWindowShutterMinus01_BP_C) == 0x000010, "Wrong alignment on AReleaseCorridorWindowShutterMinus01_BP_C");
static_assert(sizeof(AReleaseCorridorWindowShutterMinus01_BP_C) == 0x000460, "Wrong size on AReleaseCorridorWindowShutterMinus01_BP_C");
static_assert(offsetof(AReleaseCorridorWindowShutterMinus01_BP_C, UberGraphFrame) == 0x000430, "Member 'AReleaseCorridorWindowShutterMinus01_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AReleaseCorridorWindowShutterMinus01_BP_C, StaticMesh) == 0x000438, "Member 'AReleaseCorridorWindowShutterMinus01_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AReleaseCorridorWindowShutterMinus01_BP_C, Anchor) == 0x000440, "Member 'AReleaseCorridorWindowShutterMinus01_BP_C::Anchor' has a wrong offset!");
static_assert(offsetof(AReleaseCorridorWindowShutterMinus01_BP_C, DefaultSceneRoot) == 0x000448, "Member 'AReleaseCorridorWindowShutterMinus01_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AReleaseCorridorWindowShutterMinus01_BP_C, WindowMovement_NewTrack_0_EF3BC1554729872733811B9198FE2843) == 0x000450, "Member 'AReleaseCorridorWindowShutterMinus01_BP_C::WindowMovement_NewTrack_0_EF3BC1554729872733811B9198FE2843' has a wrong offset!");
static_assert(offsetof(AReleaseCorridorWindowShutterMinus01_BP_C, WindowMovement__Direction_EF3BC1554729872733811B9198FE2843) == 0x000454, "Member 'AReleaseCorridorWindowShutterMinus01_BP_C::WindowMovement__Direction_EF3BC1554729872733811B9198FE2843' has a wrong offset!");
static_assert(offsetof(AReleaseCorridorWindowShutterMinus01_BP_C, WindowMovement) == 0x000458, "Member 'AReleaseCorridorWindowShutterMinus01_BP_C::WindowMovement' has a wrong offset!");

}

