#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReleaseMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReleaseMenu.ReleaseMenu_C
// 0x00A0 (0x03B0 - 0x0310)
class UReleaseMenu_C final : public URBReleaseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExperimentBoardActionButton_C*         BeginButton;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExperimentBoardActionButton_C*         BeginButton_1;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomBorder;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        ExitButton;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FinalText;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HeaderText;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             InmateIdText;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULocalPlayerInfo_v2_C*                  LocalPlayerInfo_v2;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MainText;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       MenuContent;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageTitle;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Signature;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SignatureText;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBorder;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBSoundComponent*                      VoiceSoundComponent;                               // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 VoiceActor;                                        // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlayVoiceline(class UAkAudioEvent* AudioEvent);
	void Init(class AActor* Param_VoiceActor, class URBSoundComponent* Param_VoiceSoundComponent);
	ESlateVisibility Get_BeginButton_1_Visibility_0();
	bool Get_BeginButton_bIsEnabled_0();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	ESlateVisibility GetReleaeButtonVisibility();
	void Setup();
	void Construct();
	void Event_CharacterReleased();
	void BndEvt__ReleaseMenu_ExitButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void BndEvt__ReleaseMenu_GroupFinderBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void ExecuteUbergraph_ReleaseMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReleaseMenu_C">();
	}
	static class UReleaseMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReleaseMenu_C>();
	}
};
static_assert(alignof(UReleaseMenu_C) == 0x000008, "Wrong alignment on UReleaseMenu_C");
static_assert(sizeof(UReleaseMenu_C) == 0x0003B0, "Wrong size on UReleaseMenu_C");
static_assert(offsetof(UReleaseMenu_C, UberGraphFrame) == 0x000310, "Member 'UReleaseMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, Background) == 0x000318, "Member 'UReleaseMenu_C::Background' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, BackgroundImage) == 0x000320, "Member 'UReleaseMenu_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, BeginButton) == 0x000328, "Member 'UReleaseMenu_C::BeginButton' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, BeginButton_1) == 0x000330, "Member 'UReleaseMenu_C::BeginButton_1' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, BottomBorder) == 0x000338, "Member 'UReleaseMenu_C::BottomBorder' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, ExitButton) == 0x000340, "Member 'UReleaseMenu_C::ExitButton' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, FinalText) == 0x000348, "Member 'UReleaseMenu_C::FinalText' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, HeaderText) == 0x000350, "Member 'UReleaseMenu_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, Image) == 0x000358, "Member 'UReleaseMenu_C::Image' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, InmateIdText) == 0x000360, "Member 'UReleaseMenu_C::InmateIdText' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, LocalPlayerInfo_v2) == 0x000368, "Member 'UReleaseMenu_C::LocalPlayerInfo_v2' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, MainText) == 0x000370, "Member 'UReleaseMenu_C::MainText' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, MenuContent) == 0x000378, "Member 'UReleaseMenu_C::MenuContent' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, PageTitle) == 0x000380, "Member 'UReleaseMenu_C::PageTitle' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, Signature) == 0x000388, "Member 'UReleaseMenu_C::Signature' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, SignatureText) == 0x000390, "Member 'UReleaseMenu_C::SignatureText' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, TopBorder) == 0x000398, "Member 'UReleaseMenu_C::TopBorder' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, VoiceSoundComponent) == 0x0003A0, "Member 'UReleaseMenu_C::VoiceSoundComponent' has a wrong offset!");
static_assert(offsetof(UReleaseMenu_C, VoiceActor) == 0x0003A8, "Member 'UReleaseMenu_C::VoiceActor' has a wrong offset!");

}

