#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReleaseMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ReleaseMenu.ReleaseMenu_C.PlayVoiceline
// 0x0010 (0x0010 - 0x0000)
struct ReleaseMenu_C_PlayVoiceline final
{
public:
	class UAkAudioEvent*                          AudioEvent;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsPlaying_ReturnValue;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReleaseMenu_C_PlayVoiceline) == 0x000008, "Wrong alignment on ReleaseMenu_C_PlayVoiceline");
static_assert(sizeof(ReleaseMenu_C_PlayVoiceline) == 0x000010, "Wrong size on ReleaseMenu_C_PlayVoiceline");
static_assert(offsetof(ReleaseMenu_C_PlayVoiceline, AudioEvent) == 0x000000, "Member 'ReleaseMenu_C_PlayVoiceline::AudioEvent' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_PlayVoiceline, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'ReleaseMenu_C_PlayVoiceline::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_PlayVoiceline, CallFunc_BP_IsPlaying_ReturnValue) == 0x000009, "Member 'ReleaseMenu_C_PlayVoiceline::CallFunc_BP_IsPlaying_ReturnValue' has a wrong offset!");

// Function ReleaseMenu.ReleaseMenu_C.Init
// 0x0010 (0x0010 - 0x0000)
struct ReleaseMenu_C_Init final
{
public:
	class AActor*                                 Param_VoiceActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      Param_VoiceSoundComponent;                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReleaseMenu_C_Init) == 0x000008, "Wrong alignment on ReleaseMenu_C_Init");
static_assert(sizeof(ReleaseMenu_C_Init) == 0x000010, "Wrong size on ReleaseMenu_C_Init");
static_assert(offsetof(ReleaseMenu_C_Init, Param_VoiceActor) == 0x000000, "Member 'ReleaseMenu_C_Init::Param_VoiceActor' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_Init, Param_VoiceSoundComponent) == 0x000008, "Member 'ReleaseMenu_C_Init::Param_VoiceSoundComponent' has a wrong offset!");

// Function ReleaseMenu.ReleaseMenu_C.Get_BeginButton_1_Visibility_0
// 0x0018 (0x0018 - 0x0000)
struct ReleaseMenu_C_Get_BeginButton_1_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3878[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLobbyPlayerController*               CallFunc_GetLocalLobbyPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanReleaseCharacter_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReleaseMenu_C_Get_BeginButton_1_Visibility_0) == 0x000008, "Wrong alignment on ReleaseMenu_C_Get_BeginButton_1_Visibility_0");
static_assert(sizeof(ReleaseMenu_C_Get_BeginButton_1_Visibility_0) == 0x000018, "Wrong size on ReleaseMenu_C_Get_BeginButton_1_Visibility_0");
static_assert(offsetof(ReleaseMenu_C_Get_BeginButton_1_Visibility_0, ReturnValue) == 0x000000, "Member 'ReleaseMenu_C_Get_BeginButton_1_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_Get_BeginButton_1_Visibility_0, Temp_bool_Variable) == 0x000001, "Member 'ReleaseMenu_C_Get_BeginButton_1_Visibility_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_Get_BeginButton_1_Visibility_0, Temp_byte_Variable) == 0x000002, "Member 'ReleaseMenu_C_Get_BeginButton_1_Visibility_0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_Get_BeginButton_1_Visibility_0, Temp_byte_Variable_1) == 0x000003, "Member 'ReleaseMenu_C_Get_BeginButton_1_Visibility_0::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_Get_BeginButton_1_Visibility_0, CallFunc_GetLocalLobbyPlayerController_ReturnValue) == 0x000008, "Member 'ReleaseMenu_C_Get_BeginButton_1_Visibility_0::CallFunc_GetLocalLobbyPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_Get_BeginButton_1_Visibility_0, CallFunc_CanReleaseCharacter_ReturnValue) == 0x000010, "Member 'ReleaseMenu_C_Get_BeginButton_1_Visibility_0::CallFunc_CanReleaseCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_Get_BeginButton_1_Visibility_0, K2Node_Select_Default) == 0x000011, "Member 'ReleaseMenu_C_Get_BeginButton_1_Visibility_0::K2Node_Select_Default' has a wrong offset!");

// Function ReleaseMenu.ReleaseMenu_C.Get_BeginButton_bIsEnabled_0
// 0x0018 (0x0018 - 0x0000)
struct ReleaseMenu_C_Get_BeginButton_bIsEnabled_0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3879[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLobbyPlayerController*               CallFunc_GetLocalLobbyPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanReleaseCharacter_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReleaseMenu_C_Get_BeginButton_bIsEnabled_0) == 0x000008, "Wrong alignment on ReleaseMenu_C_Get_BeginButton_bIsEnabled_0");
static_assert(sizeof(ReleaseMenu_C_Get_BeginButton_bIsEnabled_0) == 0x000018, "Wrong size on ReleaseMenu_C_Get_BeginButton_bIsEnabled_0");
static_assert(offsetof(ReleaseMenu_C_Get_BeginButton_bIsEnabled_0, ReturnValue) == 0x000000, "Member 'ReleaseMenu_C_Get_BeginButton_bIsEnabled_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_Get_BeginButton_bIsEnabled_0, CallFunc_GetLocalLobbyPlayerController_ReturnValue) == 0x000008, "Member 'ReleaseMenu_C_Get_BeginButton_bIsEnabled_0::CallFunc_GetLocalLobbyPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_Get_BeginButton_bIsEnabled_0, CallFunc_CanReleaseCharacter_ReturnValue) == 0x000010, "Member 'ReleaseMenu_C_Get_BeginButton_bIsEnabled_0::CallFunc_CanReleaseCharacter_ReturnValue' has a wrong offset!");

// Function ReleaseMenu.ReleaseMenu_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct ReleaseMenu_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(ReleaseMenu_C_OnFocusReceived) == 0x000008, "Wrong alignment on ReleaseMenu_C_OnFocusReceived");
static_assert(sizeof(ReleaseMenu_C_OnFocusReceived) == 0x0001B0, "Wrong size on ReleaseMenu_C_OnFocusReceived");
static_assert(offsetof(ReleaseMenu_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'ReleaseMenu_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'ReleaseMenu_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'ReleaseMenu_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'ReleaseMenu_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function ReleaseMenu.ReleaseMenu_C.GetReleaeButtonVisibility
// 0x0018 (0x0018 - 0x0000)
struct ReleaseMenu_C_GetReleaeButtonVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_387A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLobbyPlayerController*               CallFunc_GetLocalLobbyPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanReleaseCharacter_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReleaseMenu_C_GetReleaeButtonVisibility) == 0x000008, "Wrong alignment on ReleaseMenu_C_GetReleaeButtonVisibility");
static_assert(sizeof(ReleaseMenu_C_GetReleaeButtonVisibility) == 0x000018, "Wrong size on ReleaseMenu_C_GetReleaeButtonVisibility");
static_assert(offsetof(ReleaseMenu_C_GetReleaeButtonVisibility, ReturnValue) == 0x000000, "Member 'ReleaseMenu_C_GetReleaeButtonVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_GetReleaeButtonVisibility, Temp_bool_Variable) == 0x000001, "Member 'ReleaseMenu_C_GetReleaeButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_GetReleaeButtonVisibility, Temp_byte_Variable) == 0x000002, "Member 'ReleaseMenu_C_GetReleaeButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_GetReleaeButtonVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'ReleaseMenu_C_GetReleaeButtonVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_GetReleaeButtonVisibility, CallFunc_GetLocalLobbyPlayerController_ReturnValue) == 0x000008, "Member 'ReleaseMenu_C_GetReleaeButtonVisibility::CallFunc_GetLocalLobbyPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_GetReleaeButtonVisibility, CallFunc_CanReleaseCharacter_ReturnValue) == 0x000010, "Member 'ReleaseMenu_C_GetReleaeButtonVisibility::CallFunc_CanReleaseCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_GetReleaeButtonVisibility, K2Node_Select_Default) == 0x000011, "Member 'ReleaseMenu_C_GetReleaeButtonVisibility::K2Node_Select_Default' has a wrong offset!");

// Function ReleaseMenu.ReleaseMenu_C.Setup
// 0x0090 (0x0090 - 0x0000)
struct ReleaseMenu_C_Setup final
{
public:
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetInmateId_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_387B[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
};
static_assert(alignof(ReleaseMenu_C_Setup) == 0x000008, "Wrong alignment on ReleaseMenu_C_Setup");
static_assert(sizeof(ReleaseMenu_C_Setup) == 0x000090, "Wrong size on ReleaseMenu_C_Setup");
static_assert(offsetof(ReleaseMenu_C_Setup, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000000, "Member 'ReleaseMenu_C_Setup::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_Setup, CallFunc_GetInmateId_ReturnValue) == 0x000008, "Member 'ReleaseMenu_C_Setup::CallFunc_GetInmateId_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_Setup, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'ReleaseMenu_C_Setup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_Setup, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'ReleaseMenu_C_Setup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_Setup, K2Node_MakeArray_Array) == 0x000068, "Member 'ReleaseMenu_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_Setup, CallFunc_Format_ReturnValue) == 0x000078, "Member 'ReleaseMenu_C_Setup::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function ReleaseMenu.ReleaseMenu_C.BndEvt__ReleaseMenu_ExitButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ReleaseMenu_C_BndEvt__ReleaseMenu_ExitButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReleaseMenu_C_BndEvt__ReleaseMenu_ExitButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on ReleaseMenu_C_BndEvt__ReleaseMenu_ExitButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature");
static_assert(sizeof(ReleaseMenu_C_BndEvt__ReleaseMenu_ExitButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature) == 0x000008, "Wrong size on ReleaseMenu_C_BndEvt__ReleaseMenu_ExitButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature");
static_assert(offsetof(ReleaseMenu_C_BndEvt__ReleaseMenu_ExitButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'ReleaseMenu_C_BndEvt__ReleaseMenu_ExitButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function ReleaseMenu.ReleaseMenu_C.ExecuteUbergraph_ReleaseMenu
// 0x0028 (0x0028 - 0x0000)
struct ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_387C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBLocalProfile*                        CallFunc_GetProfile_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasVisitedReleaseBooth_ReturnValue;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu) == 0x000008, "Wrong alignment on ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu");
static_assert(sizeof(ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu) == 0x000028, "Wrong size on ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu");
static_assert(offsetof(ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu, EntryPoint) == 0x000000, "Member 'ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu, CallFunc_GetRBGameStateLobby_ReturnValue) == 0x000010, "Member 'ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu::CallFunc_GetRBGameStateLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu, CallFunc_GetProfile_ReturnValue) == 0x000018, "Member 'ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu::CallFunc_GetProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu, CallFunc_HasVisitedReleaseBooth_ReturnValue) == 0x000021, "Member 'ReleaseMenu_C_ExecuteUbergraph_ReleaseMenu::CallFunc_HasVisitedReleaseBooth_ReturnValue' has a wrong offset!");

}

