#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardMenu

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RewardMenu.RewardMenu_C.ExecuteUbergraph_RewardMenu
// 0x0108 (0x0108 - 0x0000)
struct RewardMenu_C_ExecuteUbergraph_RewardMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxPlayerLevel_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerLevelRequiredXP_ReturnValue;     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_1;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExtraRewardWidget_C*                   CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USelectableRewardWidget_C*              CallFunc_GetRewardWidget_rewardWidget;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRewardWidget_bCreated;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_1;    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button;                 // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00B0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardMenu_C_ExecuteUbergraph_RewardMenu) == 0x000008, "Wrong alignment on RewardMenu_C_ExecuteUbergraph_RewardMenu");
static_assert(sizeof(RewardMenu_C_ExecuteUbergraph_RewardMenu) == 0x000108, "Wrong size on RewardMenu_C_ExecuteUbergraph_RewardMenu");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, EntryPoint) == 0x000000, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, Temp_delegate_Variable) == 0x000004, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_PostEventGlobal_ReturnValue) == 0x000014, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, Temp_int_Variable) == 0x00001C, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x000020, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000028, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_GetMaxPlayerLevel_ReturnValue) == 0x00002C, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_GetMaxPlayerLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_GetPlayerLevelRequiredXP_ReturnValue) == 0x000038, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_GetPlayerLevelRequiredXP_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003C, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x00003D, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003E, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_GetChildrenCount_ReturnValue) == 0x000040, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, Temp_delegate_Variable_1) == 0x000048, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_PostEventGlobal_ReturnValue_1) == 0x000058, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_PostEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, Temp_int_Variable_1) == 0x00005C, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Create_ReturnValue) == 0x000060, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000068, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_GetRewardWidget_rewardWidget) == 0x000070, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_GetRewardWidget_rewardWidget' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_GetRewardWidget_bCreated) == 0x000078, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_GetRewardWidget_bCreated' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000080, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Add_IntInt_ReturnValue_2) == 0x000088, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00008C, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Subtract_IntInt_ReturnValue) == 0x000090, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Max_ReturnValue) == 0x000094, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000098, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_AddChildToHorizontalBox_ReturnValue_1) == 0x0000A0, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_AddChildToHorizontalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, K2Node_ComponentBoundEvent_Button) == 0x0000A8, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, K2Node_Event_MyGeometry) == 0x0000B0, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, K2Node_Event_InDeltaTime) == 0x0000E8, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000EC, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000F0, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_FCeil_ReturnValue) == 0x0000F4, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Min_ReturnValue) == 0x0000F8, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000FC, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_ExecuteUbergraph_RewardMenu, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000100, "Member 'RewardMenu_C_ExecuteUbergraph_RewardMenu::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");

// Function RewardMenu.RewardMenu_C.Tick
// 0x003C (0x003C - 0x0000)
struct RewardMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardMenu_C_Tick) == 0x000004, "Wrong alignment on RewardMenu_C_Tick");
static_assert(sizeof(RewardMenu_C_Tick) == 0x00003C, "Wrong size on RewardMenu_C_Tick");
static_assert(offsetof(RewardMenu_C_Tick, MyGeometry) == 0x000000, "Member 'RewardMenu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_Tick, InDeltaTime) == 0x000038, "Member 'RewardMenu_C_Tick::InDeltaTime' has a wrong offset!");

// Function RewardMenu.RewardMenu_C.BndEvt__RewardMenu_ExitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RewardMenu_C_BndEvt__RewardMenu_ExitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardMenu_C_BndEvt__RewardMenu_ExitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on RewardMenu_C_BndEvt__RewardMenu_ExitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(RewardMenu_C_BndEvt__RewardMenu_ExitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on RewardMenu_C_BndEvt__RewardMenu_ExitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(RewardMenu_C_BndEvt__RewardMenu_ExitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'RewardMenu_C_BndEvt__RewardMenu_ExitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function RewardMenu.RewardMenu_C.SetupXpCounterDisplay
// 0x0100 (0x0100 - 0x0000)
struct RewardMenu_C_SetupXpCounterDisplay final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerLevelRequiredXP_ReturnValue;     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxPlayerLevel_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0080(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
};
static_assert(alignof(RewardMenu_C_SetupXpCounterDisplay) == 0x000008, "Wrong alignment on RewardMenu_C_SetupXpCounterDisplay");
static_assert(sizeof(RewardMenu_C_SetupXpCounterDisplay) == 0x000100, "Wrong size on RewardMenu_C_SetupXpCounterDisplay");
static_assert(offsetof(RewardMenu_C_SetupXpCounterDisplay, Level) == 0x000000, "Member 'RewardMenu_C_SetupXpCounterDisplay::Level' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupXpCounterDisplay, Value) == 0x000004, "Member 'RewardMenu_C_SetupXpCounterDisplay::Value' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupXpCounterDisplay, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'RewardMenu_C_SetupXpCounterDisplay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupXpCounterDisplay, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x000010, "Member 'RewardMenu_C_SetupXpCounterDisplay::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupXpCounterDisplay, CallFunc_GetPlayerLevelRequiredXP_ReturnValue) == 0x000018, "Member 'RewardMenu_C_SetupXpCounterDisplay::CallFunc_GetPlayerLevelRequiredXP_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupXpCounterDisplay, CallFunc_GetMaxPlayerLevel_ReturnValue) == 0x00001C, "Member 'RewardMenu_C_SetupXpCounterDisplay::CallFunc_GetMaxPlayerLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupXpCounterDisplay, CallFunc_Min_ReturnValue) == 0x000020, "Member 'RewardMenu_C_SetupXpCounterDisplay::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupXpCounterDisplay, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'RewardMenu_C_SetupXpCounterDisplay::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupXpCounterDisplay, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'RewardMenu_C_SetupXpCounterDisplay::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupXpCounterDisplay, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'RewardMenu_C_SetupXpCounterDisplay::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupXpCounterDisplay, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000080, "Member 'RewardMenu_C_SetupXpCounterDisplay::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupXpCounterDisplay, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'RewardMenu_C_SetupXpCounterDisplay::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupXpCounterDisplay, K2Node_MakeArray_Array) == 0x0000D8, "Member 'RewardMenu_C_SetupXpCounterDisplay::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupXpCounterDisplay, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'RewardMenu_C_SetupXpCounterDisplay::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function RewardMenu.RewardMenu_C.SetupInitialLevelData
// 0x0138 (0x0138 - 0x0000)
struct RewardMenu_C_SetupInitialLevelData final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRBUIXPGainInfo>                CallFunc_GetUIXPGainInfoList_ReturnValue;          // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxPlayerLevel_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetXp_ReturnValue;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetReleaseCount_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetXp_ReturnValue_1;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerLevel_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerLevelRequiredXP_ReturnValue;     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00B0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0120(0x0018)()
};
static_assert(alignof(RewardMenu_C_SetupInitialLevelData) == 0x000008, "Wrong alignment on RewardMenu_C_SetupInitialLevelData");
static_assert(sizeof(RewardMenu_C_SetupInitialLevelData) == 0x000138, "Wrong size on RewardMenu_C_SetupInitialLevelData");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, Temp_bool_Variable) == 0x000000, "Member 'RewardMenu_C_SetupInitialLevelData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, Temp_byte_Variable) == 0x000001, "Member 'RewardMenu_C_SetupInitialLevelData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, Temp_byte_Variable_1) == 0x000002, "Member 'RewardMenu_C_SetupInitialLevelData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_GetUIXPGainInfoList_ReturnValue) == 0x000008, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_GetUIXPGainInfoList_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_Array_IsEmpty_ReturnValue) == 0x000018, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x000020, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_GetMaxPlayerLevel_ReturnValue) == 0x000028, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_GetMaxPlayerLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000030, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_GetXp_ReturnValue) == 0x000038, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_GetXp_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_GetReleaseCount_ReturnValue) == 0x00003C, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_GetReleaseCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_GetXp_ReturnValue_1) == 0x000040, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_GetXp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_GetPlayerLevel_ReturnValue) == 0x000044, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_GetPlayerLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'RewardMenu_C_SetupInitialLevelData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A4, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_GetPlayerLevelRequiredXP_ReturnValue) == 0x0000A8, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_GetPlayerLevelRequiredXP_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000B0, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, K2Node_Select_Default) == 0x0000C8, "Member 'RewardMenu_C_SetupInitialLevelData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D0, "Member 'RewardMenu_C_SetupInitialLevelData::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, K2Node_MakeArray_Array) == 0x000110, "Member 'RewardMenu_C_SetupInitialLevelData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_SetupInitialLevelData, CallFunc_Format_ReturnValue) == 0x000120, "Member 'RewardMenu_C_SetupInitialLevelData::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function RewardMenu.RewardMenu_C.AddPendingReward
// 0x0028 (0x0028 - 0x0000)
struct RewardMenu_C_AddPendingReward final
{
public:
	struct FRewardUIData                          RewardUIData;                                      // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          bMerged;                                           // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardMenu_C_AddPendingReward) == 0x000008, "Wrong alignment on RewardMenu_C_AddPendingReward");
static_assert(sizeof(RewardMenu_C_AddPendingReward) == 0x000028, "Wrong size on RewardMenu_C_AddPendingReward");
static_assert(offsetof(RewardMenu_C_AddPendingReward, RewardUIData) == 0x000000, "Member 'RewardMenu_C_AddPendingReward::RewardUIData' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_AddPendingReward, bMerged) == 0x000020, "Member 'RewardMenu_C_AddPendingReward::bMerged' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_AddPendingReward, CallFunc_Array_Add_ReturnValue) == 0x000024, "Member 'RewardMenu_C_AddPendingReward::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function RewardMenu.RewardMenu_C.TryStartNextProgressionAnimation
// 0x00A8 (0x00A8 - 0x0000)
struct RewardMenu_C_TryStartNextProgressionAnimation final
{
public:
	int32                                         CashAmount;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FRewardUIData                          K2Node_MakeStruct_RewardUIData;                    // 0x0020(0x0020)(NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USelectableRewardWidget_C*              CallFunc_GetRewardWidget_rewardWidget;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRewardWidget_bCreated;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRBUIXPGainInfo>                CallFunc_GetUIXPGainInfoList_ReturnValue;          // 0x0060(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRewardUIData                          CallFunc_Array_Get_Item;                           // 0x0078(0x0020)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardMenu_C_TryStartNextProgressionAnimation) == 0x000008, "Wrong alignment on RewardMenu_C_TryStartNextProgressionAnimation");
static_assert(sizeof(RewardMenu_C_TryStartNextProgressionAnimation) == 0x0000A8, "Wrong size on RewardMenu_C_TryStartNextProgressionAnimation");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, CashAmount) == 0x000000, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::CashAmount' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, Temp_int_Array_Index_Variable) == 0x000004, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, Temp_delegate_Variable) == 0x000010, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, K2Node_MakeStruct_RewardUIData) == 0x000020, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::K2Node_MakeStruct_RewardUIData' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, CallFunc_PostEventGlobal_ReturnValue) == 0x000040, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, CallFunc_GetRewardWidget_rewardWidget) == 0x000048, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::CallFunc_GetRewardWidget_rewardWidget' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, CallFunc_GetRewardWidget_bCreated) == 0x000050, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::CallFunc_GetRewardWidget_bCreated' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, CallFunc_Greater_IntInt_ReturnValue) == 0x000051, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, Temp_int_Variable) == 0x000054, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000058, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, CallFunc_GetUIXPGainInfoList_ReturnValue) == 0x000060, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::CallFunc_GetUIXPGainInfoList_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000070, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000071, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, CallFunc_Array_Get_Item) == 0x000078, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, K2Node_SwitchEnum_CmpSuccess) == 0x00009C, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, CallFunc_Less_IntInt_ReturnValue) == 0x00009D, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, K2Node_SwitchEnum_CmpSuccess_1) == 0x00009E, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_TryStartNextProgressionAnimation, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A0, "Member 'RewardMenu_C_TryStartNextProgressionAnimation::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function RewardMenu.RewardMenu_C.OnLevelUp
// 0x0078 (0x0078 - 0x0000)
struct RewardMenu_C_OnLevelUp final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRBUIXPGainInfo>                CallFunc_GetUIXPGainInfoList_ReturnValue;          // 0x0028(0x0010)(ConstParm, ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRewardUIData                          CallFunc_Array_Get_Item;                           // 0x0048(0x0020)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RewardMenu_C_OnLevelUp) == 0x000008, "Wrong alignment on RewardMenu_C_OnLevelUp");
static_assert(sizeof(RewardMenu_C_OnLevelUp) == 0x000078, "Wrong size on RewardMenu_C_OnLevelUp");
static_assert(offsetof(RewardMenu_C_OnLevelUp, Temp_delegate_Variable) == 0x000000, "Member 'RewardMenu_C_OnLevelUp::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_OnLevelUp, Temp_int_Variable) == 0x000010, "Member 'RewardMenu_C_OnLevelUp::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_OnLevelUp, CallFunc_PostEventGlobal_ReturnValue) == 0x000014, "Member 'RewardMenu_C_OnLevelUp::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_OnLevelUp, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'RewardMenu_C_OnLevelUp::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_OnLevelUp, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'RewardMenu_C_OnLevelUp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_OnLevelUp, Temp_int_Array_Index_Variable) == 0x000020, "Member 'RewardMenu_C_OnLevelUp::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_OnLevelUp, CallFunc_GetUIXPGainInfoList_ReturnValue) == 0x000028, "Member 'RewardMenu_C_OnLevelUp::CallFunc_GetUIXPGainInfoList_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_OnLevelUp, CallFunc_PlayAnimationForward_ReturnValue) == 0x000038, "Member 'RewardMenu_C_OnLevelUp::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_OnLevelUp, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'RewardMenu_C_OnLevelUp::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_OnLevelUp, CallFunc_Array_Get_Item) == 0x000048, "Member 'RewardMenu_C_OnLevelUp::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_OnLevelUp, CallFunc_Add_IntInt_ReturnValue_2) == 0x000068, "Member 'RewardMenu_C_OnLevelUp::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_OnLevelUp, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'RewardMenu_C_OnLevelUp::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_OnLevelUp, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'RewardMenu_C_OnLevelUp::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function RewardMenu.RewardMenu_C.StartXpSound
// 0x0014 (0x0014 - 0x0000)
struct RewardMenu_C_StartXpSound final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardMenu_C_StartXpSound) == 0x000004, "Wrong alignment on RewardMenu_C_StartXpSound");
static_assert(sizeof(RewardMenu_C_StartXpSound) == 0x000014, "Wrong size on RewardMenu_C_StartXpSound");
static_assert(offsetof(RewardMenu_C_StartXpSound, Temp_delegate_Variable) == 0x000000, "Member 'RewardMenu_C_StartXpSound::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_StartXpSound, CallFunc_PostEventGlobal_ReturnValue) == 0x000010, "Member 'RewardMenu_C_StartXpSound::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");

// Function RewardMenu.RewardMenu_C.StopXpSound
// 0x0014 (0x0014 - 0x0000)
struct RewardMenu_C_StopXpSound final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardMenu_C_StopXpSound) == 0x000004, "Wrong alignment on RewardMenu_C_StopXpSound");
static_assert(sizeof(RewardMenu_C_StopXpSound) == 0x000014, "Wrong size on RewardMenu_C_StopXpSound");
static_assert(offsetof(RewardMenu_C_StopXpSound, Temp_delegate_Variable) == 0x000000, "Member 'RewardMenu_C_StopXpSound::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_StopXpSound, CallFunc_PostEventGlobal_ReturnValue) == 0x000010, "Member 'RewardMenu_C_StopXpSound::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");

// Function RewardMenu.RewardMenu_C.GetRewardWidget
// 0x00A0 (0x00A0 - 0x0000)
struct RewardMenu_C_GetRewardWidget final
{
public:
	struct FRewardUIData                          RewardUIData;                                      // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class USelectableRewardWidget_C*              RewardWidget;                                      // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCreated;                                          // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bMerged;                                           // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FRewardUIData& Reward, class USelectableRewardWidget_C* Widget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FRewardUIData& Reward, class USelectableRewardWidget_C* Widget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class USelectableRewardWidget_C*              CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USelectableRewardWidget_C*              K2Node_DynamicCast_AsSelectable_Reward_Widget;     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanMergeWith_bCanMergeWith;               // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RewardMenu_C_GetRewardWidget) == 0x000008, "Wrong alignment on RewardMenu_C_GetRewardWidget");
static_assert(sizeof(RewardMenu_C_GetRewardWidget) == 0x0000A0, "Wrong size on RewardMenu_C_GetRewardWidget");
static_assert(offsetof(RewardMenu_C_GetRewardWidget, RewardUIData) == 0x000000, "Member 'RewardMenu_C_GetRewardWidget::RewardUIData' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_GetRewardWidget, RewardWidget) == 0x000020, "Member 'RewardMenu_C_GetRewardWidget::RewardWidget' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_GetRewardWidget, bCreated) == 0x000028, "Member 'RewardMenu_C_GetRewardWidget::bCreated' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_GetRewardWidget, bMerged) == 0x000029, "Member 'RewardMenu_C_GetRewardWidget::bMerged' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_GetRewardWidget, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'RewardMenu_C_GetRewardWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_GetRewardWidget, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'RewardMenu_C_GetRewardWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_GetRewardWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'RewardMenu_C_GetRewardWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_GetRewardWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'RewardMenu_C_GetRewardWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_GetRewardWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'RewardMenu_C_GetRewardWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(RewardMenu_C_GetRewardWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'RewardMenu_C_GetRewardWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
