#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RigButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RigButton.RigButton_C.OnMouseButtonDown
// 0x03B8 (0x03B8 - 0x0000)
struct RigButton_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3740[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0168(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3741[0x6];                                     // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0188(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0240(0x00B8)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3742[0x5];                                     // 0x02FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_Select_Default;                             // 0x0300(0x00B8)()
};
static_assert(alignof(RigButton_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on RigButton_C_OnMouseButtonDown");
static_assert(sizeof(RigButton_C_OnMouseButtonDown) == 0x0003B8, "Wrong size on RigButton_C_OnMouseButtonDown");
static_assert(offsetof(RigButton_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'RigButton_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'RigButton_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'RigButton_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnMouseButtonDown, Temp_bool_Variable) == 0x000160, "Member 'RigButton_C_OnMouseButtonDown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000168, "Member 'RigButton_C_OnMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000180, "Member 'RigButton_C_OnMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnMouseButtonDown, CallFunc_Not_PreBool_ReturnValue) == 0x000181, "Member 'RigButton_C_OnMouseButtonDown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000188, "Member 'RigButton_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000240, "Member 'RigButton_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnMouseButtonDown, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002F8, "Member 'RigButton_C_OnMouseButtonDown::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnMouseButtonDown, CallFunc_BooleanAND_ReturnValue) == 0x0002F9, "Member 'RigButton_C_OnMouseButtonDown::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnMouseButtonDown, CallFunc_BooleanAND_ReturnValue_1) == 0x0002FA, "Member 'RigButton_C_OnMouseButtonDown::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnMouseButtonDown, K2Node_Select_Default) == 0x000300, "Member 'RigButton_C_OnMouseButtonDown::K2Node_Select_Default' has a wrong offset!");

// Function RigButton.RigButton_C.SetIsNew
// 0x0008 (0x0008 - 0x0000)
struct RigButton_C_SetIsNew final
{
public:
	bool                                          InIsNew;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          WasNew;                                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RigButton_C_SetIsNew) == 0x000001, "Wrong alignment on RigButton_C_SetIsNew");
static_assert(sizeof(RigButton_C_SetIsNew) == 0x000008, "Wrong size on RigButton_C_SetIsNew");
static_assert(offsetof(RigButton_C_SetIsNew, InIsNew) == 0x000000, "Member 'RigButton_C_SetIsNew::InIsNew' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetIsNew, WasNew) == 0x000001, "Member 'RigButton_C_SetIsNew::WasNew' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetIsNew, Temp_bool_Variable) == 0x000002, "Member 'RigButton_C_SetIsNew::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetIsNew, Temp_byte_Variable) == 0x000003, "Member 'RigButton_C_SetIsNew::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetIsNew, Temp_byte_Variable_1) == 0x000004, "Member 'RigButton_C_SetIsNew::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetIsNew, K2Node_Select_Default) == 0x000005, "Member 'RigButton_C_SetIsNew::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetIsNew, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'RigButton_C_SetIsNew::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetIsNew, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'RigButton_C_SetIsNew::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function RigButton.RigButton_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct RigButton_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(RigButton_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on RigButton_C_OnRemovedFromFocusPath");
static_assert(sizeof(RigButton_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on RigButton_C_OnRemovedFromFocusPath");
static_assert(offsetof(RigButton_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'RigButton_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function RigButton.RigButton_C.IsConsideredHovered
// 0x0001 (0x0001 - 0x0000)
struct RigButton_C_IsConsideredHovered final
{
public:
	bool                                          bConsideredHovered;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RigButton_C_IsConsideredHovered) == 0x000001, "Wrong alignment on RigButton_C_IsConsideredHovered");
static_assert(sizeof(RigButton_C_IsConsideredHovered) == 0x000001, "Wrong size on RigButton_C_IsConsideredHovered");
static_assert(offsetof(RigButton_C_IsConsideredHovered, bConsideredHovered) == 0x000000, "Member 'RigButton_C_IsConsideredHovered::bConsideredHovered' has a wrong offset!");

// Function RigButton.RigButton_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct RigButton_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(RigButton_C_OnFocusReceived) == 0x000008, "Wrong alignment on RigButton_C_OnFocusReceived");
static_assert(sizeof(RigButton_C_OnFocusReceived) == 0x0001B0, "Wrong size on RigButton_C_OnFocusReceived");
static_assert(offsetof(RigButton_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'RigButton_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'RigButton_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'RigButton_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'RigButton_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function RigButton.RigButton_C.ComputeTier
// 0x0258 (0x0258 - 0x0000)
struct RigButton_C_ComputeTier final
{
public:
	int32                                         Tier;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRBItemProgressionData>         CallFunc_FilterItemProgressionData_ReturnValue;    // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3743[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBItemProgressionData                 CallFunc_Array_Get_Item;                           // 0x0038(0x00E8)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3744[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuUpgradeItemInfo                   CallFunc_GetUpgradeItemInfo_ReturnValue;           // 0x0128(0x0128)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RigButton_C_ComputeTier) == 0x000008, "Wrong alignment on RigButton_C_ComputeTier");
static_assert(sizeof(RigButton_C_ComputeTier) == 0x000258, "Wrong size on RigButton_C_ComputeTier");
static_assert(offsetof(RigButton_C_ComputeTier, Tier) == 0x000000, "Member 'RigButton_C_ComputeTier::Tier' has a wrong offset!");
static_assert(offsetof(RigButton_C_ComputeTier, Temp_int_Variable) == 0x000004, "Member 'RigButton_C_ComputeTier::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(RigButton_C_ComputeTier, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'RigButton_C_ComputeTier::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RigButton_C_ComputeTier, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'RigButton_C_ComputeTier::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_ComputeTier, Temp_int_Array_Index_Variable) == 0x000010, "Member 'RigButton_C_ComputeTier::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RigButton_C_ComputeTier, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'RigButton_C_ComputeTier::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_ComputeTier, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x000018, "Member 'RigButton_C_ComputeTier::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_ComputeTier, CallFunc_FilterItemProgressionData_ReturnValue) == 0x000020, "Member 'RigButton_C_ComputeTier::CallFunc_FilterItemProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_ComputeTier, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'RigButton_C_ComputeTier::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_ComputeTier, CallFunc_Array_Get_Item) == 0x000038, "Member 'RigButton_C_ComputeTier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RigButton_C_ComputeTier, CallFunc_Less_IntInt_ReturnValue) == 0x000120, "Member 'RigButton_C_ComputeTier::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_ComputeTier, CallFunc_GetUpgradeItemInfo_ReturnValue) == 0x000128, "Member 'RigButton_C_ComputeTier::CallFunc_GetUpgradeItemInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_ComputeTier, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000250, "Member 'RigButton_C_ComputeTier::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function RigButton.RigButton_C.SetFocused
// 0x0010 (0x0010 - 0x0000)
struct RigButton_C_SetFocused final
{
public:
	bool                                          bInFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWasConsideredHovered;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered_1; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3745[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RigButton_C_SetFocused) == 0x000008, "Wrong alignment on RigButton_C_SetFocused");
static_assert(sizeof(RigButton_C_SetFocused) == 0x000010, "Wrong size on RigButton_C_SetFocused");
static_assert(offsetof(RigButton_C_SetFocused, bInFocused) == 0x000000, "Member 'RigButton_C_SetFocused::bInFocused' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetFocused, bWasConsideredHovered) == 0x000001, "Member 'RigButton_C_SetFocused::bWasConsideredHovered' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetFocused, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000002, "Member 'RigButton_C_SetFocused::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetFocused, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000003, "Member 'RigButton_C_SetFocused::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetFocused, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x000004, "Member 'RigButton_C_SetFocused::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetFocused, CallFunc_IsConsideredHovered_bConsideredHovered_1) == 0x000005, "Member 'RigButton_C_SetFocused::CallFunc_IsConsideredHovered_bConsideredHovered_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetFocused, CallFunc_GetMenuManager_ReturnValue) == 0x000008, "Member 'RigButton_C_SetFocused::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");

// Function RigButton.RigButton_C.SetHovered
// 0x0010 (0x0010 - 0x0000)
struct RigButton_C_SetHovered final
{
public:
	bool                                          bInHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWasConsideredHovered;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered_1; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3746[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RigButton_C_SetHovered) == 0x000008, "Wrong alignment on RigButton_C_SetHovered");
static_assert(sizeof(RigButton_C_SetHovered) == 0x000010, "Wrong size on RigButton_C_SetHovered");
static_assert(offsetof(RigButton_C_SetHovered, bInHovered) == 0x000000, "Member 'RigButton_C_SetHovered::bInHovered' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetHovered, bWasConsideredHovered) == 0x000001, "Member 'RigButton_C_SetHovered::bWasConsideredHovered' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetHovered, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000002, "Member 'RigButton_C_SetHovered::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetHovered, CallFunc_IsConsideredHovered_bConsideredHovered_1) == 0x000003, "Member 'RigButton_C_SetHovered::CallFunc_IsConsideredHovered_bConsideredHovered_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetHovered, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000004, "Member 'RigButton_C_SetHovered::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetHovered, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x000005, "Member 'RigButton_C_SetHovered::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_SetHovered, CallFunc_GetMenuManager_ReturnValue) == 0x000008, "Member 'RigButton_C_SetHovered::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");

// Function RigButton.RigButton_C.Refresh
// 0x0160 (0x0160 - 0x0000)
struct RigButton_C_Refresh final
{
public:
	bool                                          bWasAcquired;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3747[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3748[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBPlayerLoadout                       CallFunc_GetMenuLoadout_ReturnValue;               // 0x0018(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3749[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuUpgradeItemInfo                   CallFunc_GetUpgradeItemInfo_ReturnValue;           // 0x0038(0x0128)()
};
static_assert(alignof(RigButton_C_Refresh) == 0x000008, "Wrong alignment on RigButton_C_Refresh");
static_assert(sizeof(RigButton_C_Refresh) == 0x000160, "Wrong size on RigButton_C_Refresh");
static_assert(offsetof(RigButton_C_Refresh, bWasAcquired) == 0x000000, "Member 'RigButton_C_Refresh::bWasAcquired' has a wrong offset!");
static_assert(offsetof(RigButton_C_Refresh, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'RigButton_C_Refresh::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Refresh, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'RigButton_C_Refresh::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Refresh, CallFunc_GetMenuLoadout_ReturnValue) == 0x000018, "Member 'RigButton_C_Refresh::CallFunc_GetMenuLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Refresh, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'RigButton_C_Refresh::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Refresh, CallFunc_BooleanAND_ReturnValue) == 0x000031, "Member 'RigButton_C_Refresh::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Refresh, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000032, "Member 'RigButton_C_Refresh::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_Refresh, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000033, "Member 'RigButton_C_Refresh::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RigButton_C_Refresh, CallFunc_GetUpgradeItemInfo_ReturnValue) == 0x000038, "Member 'RigButton_C_Refresh::CallFunc_GetUpgradeItemInfo_ReturnValue' has a wrong offset!");

// Function RigButton.RigButton_C.Init
// 0x0248 (0x0248 - 0x0000)
struct RigButton_C_Init final
{
public:
	bool                                          Param_bIsLoadout;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_374A[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ItemId;                                            // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_bIsHeader;                                   // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ECurrencyType                                 Temp_byte_Variable;                                // 0x000D(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374B[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuUpgradeItemInfo                   CallFunc_GetUpgradeItemInfo_ReturnValue;           // 0x0010(0x0128)()
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBItemProgressionData                 CallFunc_GetItemProgressionData_ReturnValue;       // 0x0140(0x00E8)(ConstParm)
	struct FRBPlayerLoadout                       CallFunc_GetMenuLoadout_ReturnValue;               // 0x0228(0x0018)()
	int32                                         CallFunc_Map_Find_Value;                           // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RigButton_C_Init) == 0x000008, "Wrong alignment on RigButton_C_Init");
static_assert(sizeof(RigButton_C_Init) == 0x000248, "Wrong size on RigButton_C_Init");
static_assert(offsetof(RigButton_C_Init, Param_bIsLoadout) == 0x000000, "Member 'RigButton_C_Init::Param_bIsLoadout' has a wrong offset!");
static_assert(offsetof(RigButton_C_Init, ItemId) == 0x000004, "Member 'RigButton_C_Init::ItemId' has a wrong offset!");
static_assert(offsetof(RigButton_C_Init, Param_bIsHeader) == 0x00000C, "Member 'RigButton_C_Init::Param_bIsHeader' has a wrong offset!");
static_assert(offsetof(RigButton_C_Init, Temp_byte_Variable) == 0x00000D, "Member 'RigButton_C_Init::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RigButton_C_Init, CallFunc_GetUpgradeItemInfo_ReturnValue) == 0x000010, "Member 'RigButton_C_Init::CallFunc_GetUpgradeItemInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Init, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x000138, "Member 'RigButton_C_Init::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Init, CallFunc_GetItemProgressionData_ReturnValue) == 0x000140, "Member 'RigButton_C_Init::CallFunc_GetItemProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Init, CallFunc_GetMenuLoadout_ReturnValue) == 0x000228, "Member 'RigButton_C_Init::CallFunc_GetMenuLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Init, CallFunc_Map_Find_Value) == 0x000240, "Member 'RigButton_C_Init::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(RigButton_C_Init, CallFunc_Map_Find_ReturnValue) == 0x000244, "Member 'RigButton_C_Init::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Init, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000245, "Member 'RigButton_C_Init::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function RigButton.RigButton_C.Setup
// 0x0250 (0x0250 - 0x0000)
struct RigButton_C_Setup final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_374C[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EActiveSkillType                              Temp_byte_Variable_6;                              // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_5;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActiveSkillType                              Temp_byte_Variable_7;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374D[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_6;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_7;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_8;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_9;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_10;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_11;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_374E[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_12;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuUpgradeItemState                         Temp_byte_Variable_8;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374F[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_13;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_14;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_15;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_16;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_17;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_18;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_19;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_20;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasUpgradeRecentlyBought_ReturnValue;     // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered_1; // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3750[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00F8(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3751[0x1];                                     // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default_2;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3752[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_3;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3753[0x1];                                     // 0x013F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_7;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default_8;                           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0150(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0190(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01A0(0x0018)()
	class FText                                   K2Node_Select_Default_9;                           // 0x01B8(0x0018)()
	class URBPlayerLoadoutConfig*                 CallFunc_GetPlayerLoadoutConfig_ReturnValue;       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveSkillCommonParams               CallFunc_GetActiveSkillCommonParams_ReturnValue;   // 0x01D8(0x0078)(ConstParm)
};
static_assert(alignof(RigButton_C_Setup) == 0x000008, "Wrong alignment on RigButton_C_Setup");
static_assert(sizeof(RigButton_C_Setup) == 0x000250, "Wrong size on RigButton_C_Setup");
static_assert(offsetof(RigButton_C_Setup, Temp_byte_Variable) == 0x000000, "Member 'RigButton_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_byte_Variable_1) == 0x000001, "Member 'RigButton_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_bool_Variable) == 0x000002, "Member 'RigButton_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_text_Variable) == 0x000008, "Member 'RigButton_C_Setup::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_bool_Variable_1) == 0x000020, "Member 'RigButton_C_Setup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_byte_Variable_2) == 0x000021, "Member 'RigButton_C_Setup::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_byte_Variable_3) == 0x000022, "Member 'RigButton_C_Setup::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_bool_Variable_2) == 0x000023, "Member 'RigButton_C_Setup::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_byte_Variable_4) == 0x000024, "Member 'RigButton_C_Setup::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_byte_Variable_5) == 0x000025, "Member 'RigButton_C_Setup::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_bool_Variable_3) == 0x000026, "Member 'RigButton_C_Setup::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_byte_Variable_6) == 0x000027, "Member 'RigButton_C_Setup::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable) == 0x000028, "Member 'RigButton_C_Setup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_1) == 0x000030, "Member 'RigButton_C_Setup::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_2) == 0x000038, "Member 'RigButton_C_Setup::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_3) == 0x000040, "Member 'RigButton_C_Setup::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_4) == 0x000048, "Member 'RigButton_C_Setup::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_5) == 0x000050, "Member 'RigButton_C_Setup::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_byte_Variable_7) == 0x000058, "Member 'RigButton_C_Setup::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_6) == 0x000060, "Member 'RigButton_C_Setup::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_7) == 0x000068, "Member 'RigButton_C_Setup::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_8) == 0x000070, "Member 'RigButton_C_Setup::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_9) == 0x000078, "Member 'RigButton_C_Setup::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_10) == 0x000080, "Member 'RigButton_C_Setup::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_11) == 0x000088, "Member 'RigButton_C_Setup::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_bool_Variable_4) == 0x000090, "Member 'RigButton_C_Setup::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_12) == 0x000098, "Member 'RigButton_C_Setup::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_byte_Variable_8) == 0x0000A0, "Member 'RigButton_C_Setup::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_13) == 0x0000A8, "Member 'RigButton_C_Setup::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_14) == 0x0000B0, "Member 'RigButton_C_Setup::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_15) == 0x0000B8, "Member 'RigButton_C_Setup::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_16) == 0x0000C0, "Member 'RigButton_C_Setup::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_17) == 0x0000C8, "Member 'RigButton_C_Setup::Temp_object_Variable_17' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_18) == 0x0000D0, "Member 'RigButton_C_Setup::Temp_object_Variable_18' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_19) == 0x0000D8, "Member 'RigButton_C_Setup::Temp_object_Variable_19' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_object_Variable_20) == 0x0000E0, "Member 'RigButton_C_Setup::Temp_object_Variable_20' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_bool_Variable_5) == 0x0000E8, "Member 'RigButton_C_Setup::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_byte_Variable_9) == 0x0000E9, "Member 'RigButton_C_Setup::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_byte_Variable_10) == 0x0000EA, "Member 'RigButton_C_Setup::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_WasUpgradeRecentlyBought_ReturnValue) == 0x0000EB, "Member 'RigButton_C_Setup::CallFunc_WasUpgradeRecentlyBought_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_BooleanAND_ReturnValue) == 0x0000EC, "Member 'RigButton_C_Setup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x0000ED, "Member 'RigButton_C_Setup::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_IsConsideredHovered_bConsideredHovered_1) == 0x0000EE, "Member 'RigButton_C_Setup::CallFunc_IsConsideredHovered_bConsideredHovered_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_Not_PreBool_ReturnValue) == 0x0000EF, "Member 'RigButton_C_Setup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, Temp_bool_Variable_6) == 0x0000F0, "Member 'RigButton_C_Setup::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_Conv_IntToText_ReturnValue) == 0x0000F8, "Member 'RigButton_C_Setup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_BooleanAND_ReturnValue_1) == 0x000110, "Member 'RigButton_C_Setup::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_Not_PreBool_ReturnValue_1) == 0x000111, "Member 'RigButton_C_Setup::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_BooleanOR_ReturnValue) == 0x000112, "Member 'RigButton_C_Setup::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_Not_PreBool_ReturnValue_2) == 0x000113, "Member 'RigButton_C_Setup::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_BooleanAND_ReturnValue_2) == 0x000114, "Member 'RigButton_C_Setup::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, K2Node_Select_Default) == 0x000115, "Member 'RigButton_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_BooleanOR_ReturnValue_1) == 0x000116, "Member 'RigButton_C_Setup::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, K2Node_Select_Default_1) == 0x000118, "Member 'RigButton_C_Setup::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, K2Node_Select_Default_2) == 0x000120, "Member 'RigButton_C_Setup::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000128, "Member 'RigButton_C_Setup::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, K2Node_Select_Default_3) == 0x000130, "Member 'RigButton_C_Setup::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_BooleanAND_ReturnValue_3) == 0x000138, "Member 'RigButton_C_Setup::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, K2Node_Select_Default_4) == 0x000139, "Member 'RigButton_C_Setup::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_Not_PreBool_ReturnValue_3) == 0x00013A, "Member 'RigButton_C_Setup::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_BooleanAND_ReturnValue_4) == 0x00013B, "Member 'RigButton_C_Setup::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_BooleanOR_ReturnValue_2) == 0x00013C, "Member 'RigButton_C_Setup::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, K2Node_Select_Default_5) == 0x00013D, "Member 'RigButton_C_Setup::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, K2Node_Select_Default_6) == 0x00013E, "Member 'RigButton_C_Setup::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, K2Node_Select_Default_7) == 0x000140, "Member 'RigButton_C_Setup::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, K2Node_Select_Default_8) == 0x000148, "Member 'RigButton_C_Setup::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, K2Node_MakeStruct_FormatArgumentData) == 0x000150, "Member 'RigButton_C_Setup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, K2Node_MakeArray_Array) == 0x000190, "Member 'RigButton_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_Format_ReturnValue) == 0x0001A0, "Member 'RigButton_C_Setup::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, K2Node_Select_Default_9) == 0x0001B8, "Member 'RigButton_C_Setup::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_GetPlayerLoadoutConfig_ReturnValue) == 0x0001D0, "Member 'RigButton_C_Setup::CallFunc_GetPlayerLoadoutConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigButton_C_Setup, CallFunc_GetActiveSkillCommonParams_ReturnValue) == 0x0001D8, "Member 'RigButton_C_Setup::CallFunc_GetActiveSkillCommonParams_ReturnValue' has a wrong offset!");

// Function RigButton.RigButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct RigButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RigButton_C_PreConstruct) == 0x000001, "Wrong alignment on RigButton_C_PreConstruct");
static_assert(sizeof(RigButton_C_PreConstruct) == 0x000001, "Wrong size on RigButton_C_PreConstruct");
static_assert(offsetof(RigButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'RigButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function RigButton.RigButton_C.ExecuteUbergraph_RigButton
// 0x0038 (0x0038 - 0x0000)
struct RigButton_C_ExecuteUbergraph_RigButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3754[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3755[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3756[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue_1;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue_1;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RigButton_C_ExecuteUbergraph_RigButton) == 0x000008, "Wrong alignment on RigButton_C_ExecuteUbergraph_RigButton");
static_assert(sizeof(RigButton_C_ExecuteUbergraph_RigButton) == 0x000038, "Wrong size on RigButton_C_ExecuteUbergraph_RigButton");
