#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sanitization_FloorVent_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Sanitization_FloorVent_BP.Sanitization_FloorVent_BP_C.ExecuteUbergraph_Sanitization_FloorVent_BP
// 0x0008 (0x0008 - 0x0000)
struct Sanitization_FloorVent_BP_C_ExecuteUbergraph_Sanitization_FloorVent_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bEnabled;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Sanitization_FloorVent_BP_C_ExecuteUbergraph_Sanitization_FloorVent_BP) == 0x000004, "Wrong alignment on Sanitization_FloorVent_BP_C_ExecuteUbergraph_Sanitization_FloorVent_BP");
static_assert(sizeof(Sanitization_FloorVent_BP_C_ExecuteUbergraph_Sanitization_FloorVent_BP) == 0x000008, "Wrong size on Sanitization_FloorVent_BP_C_ExecuteUbergraph_Sanitization_FloorVent_BP");
static_assert(offsetof(Sanitization_FloorVent_BP_C_ExecuteUbergraph_Sanitization_FloorVent_BP, EntryPoint) == 0x000000, "Member 'Sanitization_FloorVent_BP_C_ExecuteUbergraph_Sanitization_FloorVent_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Sanitization_FloorVent_BP_C_ExecuteUbergraph_Sanitization_FloorVent_BP, K2Node_ComponentBoundEvent_bEnabled) == 0x000004, "Member 'Sanitization_FloorVent_BP_C_ExecuteUbergraph_Sanitization_FloorVent_BP::K2Node_ComponentBoundEvent_bEnabled' has a wrong offset!");

// Function Sanitization_FloorVent_BP.Sanitization_FloorVent_BP_C.BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Sanitization_FloorVent_BP_C_BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Sanitization_FloorVent_BP_C_BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on Sanitization_FloorVent_BP_C_BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature");
static_assert(sizeof(Sanitization_FloorVent_BP_C_BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature) == 0x000001, "Wrong size on Sanitization_FloorVent_BP_C_BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature");
static_assert(offsetof(Sanitization_FloorVent_BP_C_BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature, bEnabled) == 0x000000, "Member 'Sanitization_FloorVent_BP_C_BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature::bEnabled' has a wrong offset!");

// Function Sanitization_FloorVent_BP.Sanitization_FloorVent_BP_C.RefreshVFXActive
// 0x0010 (0x0010 - 0x0000)
struct Sanitization_FloorVent_BP_C_RefreshVFXActive final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C81[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StopLoopingSound_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayLoopingSound_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Sanitization_FloorVent_BP_C_RefreshVFXActive) == 0x000004, "Wrong alignment on Sanitization_FloorVent_BP_C_RefreshVFXActive");
static_assert(sizeof(Sanitization_FloorVent_BP_C_RefreshVFXActive) == 0x000010, "Wrong size on Sanitization_FloorVent_BP_C_RefreshVFXActive");
static_assert(offsetof(Sanitization_FloorVent_BP_C_RefreshVFXActive, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'Sanitization_FloorVent_BP_C_RefreshVFXActive::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sanitization_FloorVent_BP_C_RefreshVFXActive, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Sanitization_FloorVent_BP_C_RefreshVFXActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sanitization_FloorVent_BP_C_RefreshVFXActive, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'Sanitization_FloorVent_BP_C_RefreshVFXActive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Sanitization_FloorVent_BP_C_RefreshVFXActive, CallFunc_StopLoopingSound_ReturnValue) == 0x000004, "Member 'Sanitization_FloorVent_BP_C_RefreshVFXActive::CallFunc_StopLoopingSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sanitization_FloorVent_BP_C_RefreshVFXActive, CallFunc_PlayLoopingSound_ReturnValue) == 0x000008, "Member 'Sanitization_FloorVent_BP_C_RefreshVFXActive::CallFunc_PlayLoopingSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sanitization_FloorVent_BP_C_RefreshVFXActive, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'Sanitization_FloorVent_BP_C_RefreshVFXActive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Sanitization_FloorVent_BP.Sanitization_FloorVent_BP_C.IsTriggered
// 0x0001 (0x0001 - 0x0000)
struct Sanitization_FloorVent_BP_C_IsTriggered final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Sanitization_FloorVent_BP_C_IsTriggered) == 0x000001, "Wrong alignment on Sanitization_FloorVent_BP_C_IsTriggered");
static_assert(sizeof(Sanitization_FloorVent_BP_C_IsTriggered) == 0x000001, "Wrong size on Sanitization_FloorVent_BP_C_IsTriggered");
static_assert(offsetof(Sanitization_FloorVent_BP_C_IsTriggered, ReturnValue) == 0x000000, "Member 'Sanitization_FloorVent_BP_C_IsTriggered::ReturnValue' has a wrong offset!");

}

