#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scientist_Lobby_AquariumAnnouncer_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Scientist_Lobby_AquariumAnnouncer_AnimBP.Scientist_Lobby_AquariumAnnouncer_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Scientist_Lobby_AquariumAnnouncer_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Scientist_Lobby_AquariumAnnouncer_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Scientist_Lobby_AquariumAnnouncer_AnimBP_C_AnimGraph");
static_assert(sizeof(Scientist_Lobby_AquariumAnnouncer_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Scientist_Lobby_AquariumAnnouncer_AnimBP_C_AnimGraph");
static_assert(offsetof(Scientist_Lobby_AquariumAnnouncer_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Scientist_Lobby_AquariumAnnouncer_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Scientist_Lobby_AquariumAnnouncer_AnimBP.Scientist_Lobby_AquariumAnnouncer_AnimBP_C.ExecuteUbergraph_Scientist_Lobby_AquariumAnnouncer_AnimBP
// 0x0004 (0x0004 - 0x0000)
struct Scientist_Lobby_AquariumAnnouncer_AnimBP_C_ExecuteUbergraph_Scientist_Lobby_AquariumAnnouncer_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scientist_Lobby_AquariumAnnouncer_AnimBP_C_ExecuteUbergraph_Scientist_Lobby_AquariumAnnouncer_AnimBP) == 0x000004, "Wrong alignment on Scientist_Lobby_AquariumAnnouncer_AnimBP_C_ExecuteUbergraph_Scientist_Lobby_AquariumAnnouncer_AnimBP");
static_assert(sizeof(Scientist_Lobby_AquariumAnnouncer_AnimBP_C_ExecuteUbergraph_Scientist_Lobby_AquariumAnnouncer_AnimBP) == 0x000004, "Wrong size on Scientist_Lobby_AquariumAnnouncer_AnimBP_C_ExecuteUbergraph_Scientist_Lobby_AquariumAnnouncer_AnimBP");
static_assert(offsetof(Scientist_Lobby_AquariumAnnouncer_AnimBP_C_ExecuteUbergraph_Scientist_Lobby_AquariumAnnouncer_AnimBP, EntryPoint) == 0x000000, "Member 'Scientist_Lobby_AquariumAnnouncer_AnimBP_C_ExecuteUbergraph_Scientist_Lobby_AquariumAnnouncer_AnimBP::EntryPoint' has a wrong offset!");

}

