#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scientist_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Scientist_BP.Scientist_BP_C.RandomizeMeshes
// 0x0078 (0x0078 - 0x0000)
struct Scientist_BP_C_RandomizeMeshes final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E35[0x6];                                      // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class USkeletalMesh>>   K2Node_Select_Default;                             // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E36[0x3];                                      // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeFemale_Result;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E37[0x1];                                      // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E38[0x3];                                      // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class USkeletalMesh>>   K2Node_Select_Default_1;                           // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E39[0x4];                                      // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class USkeletalMesh>>   K2Node_Select_Default_2;                           // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3A[0x3];                                      // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue_1;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3B[0x3];                                      // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue_2;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scientist_BP_C_RandomizeMeshes) == 0x000008, "Wrong alignment on Scientist_BP_C_RandomizeMeshes");
static_assert(sizeof(Scientist_BP_C_RandomizeMeshes) == 0x000078, "Wrong size on Scientist_BP_C_RandomizeMeshes");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, Temp_bool_Variable) == 0x000000, "Member 'Scientist_BP_C_RandomizeMeshes::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, Temp_bool_Variable_1) == 0x000001, "Member 'Scientist_BP_C_RandomizeMeshes::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, K2Node_Select_Default) == 0x000008, "Member 'Scientist_BP_C_RandomizeMeshes::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_RandomBool_ReturnValue) == 0x000018, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_CanBeFemale_Result) == 0x000020, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_CanBeFemale_Result' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_Greater_IntInt_ReturnValue) == 0x000021, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_RandomInteger_ReturnValue) == 0x000024, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_SelectInt_ReturnValue) == 0x000028, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, Temp_bool_Variable_2) == 0x00002C, "Member 'Scientist_BP_C_RandomizeMeshes::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, K2Node_Select_Default_1) == 0x000030, "Member 'Scientist_BP_C_RandomizeMeshes::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, K2Node_Select_Default_2) == 0x000048, "Member 'Scientist_BP_C_RandomizeMeshes::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000058, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_Array_Length_ReturnValue_2) == 0x00005C, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_RandomInteger_ReturnValue_1) == 0x000060, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_RandomInteger_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000064, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_SelectInt_ReturnValue_1) == 0x000068, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_RandomInteger_ReturnValue_2) == 0x00006C, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_RandomInteger_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_SelectInt_ReturnValue_2) == 0x000070, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");

// Function Scientist_BP.Scientist_BP_C.CanBeFemale
// 0x0009 (0x0009 - 0x0000)
struct Scientist_BP_C_CanBeFemale final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_1;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_2;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Scientist_BP_C_CanBeFemale) == 0x000001, "Wrong alignment on Scientist_BP_C_CanBeFemale");
static_assert(sizeof(Scientist_BP_C_CanBeFemale) == 0x000009, "Wrong size on Scientist_BP_C_CanBeFemale");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, Result) == 0x000000, "Member 'Scientist_BP_C_CanBeFemale::Result' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_Array_IsEmpty_ReturnValue) == 0x000001, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_Array_IsEmpty_ReturnValue_1) == 0x000002, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_Array_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_Array_IsEmpty_ReturnValue_2) == 0x000005, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_Array_IsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_Not_PreBool_ReturnValue_2) == 0x000006, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_BooleanAND_ReturnValue_1) == 0x000008, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function Scientist_BP.Scientist_BP_C.OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA
// 0x0008 (0x0008 - 0x0000)
struct Scientist_BP_C_OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scientist_BP_C_OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA) == 0x000008, "Wrong alignment on Scientist_BP_C_OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA");
static_assert(sizeof(Scientist_BP_C_OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA) == 0x000008, "Wrong size on Scientist_BP_C_OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA");
static_assert(offsetof(Scientist_BP_C_OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA, Loaded) == 0x000000, "Member 'Scientist_BP_C_OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA::Loaded' has a wrong offset!");

// Function Scientist_BP.Scientist_BP_C.ApplyMesh
// 0x0020 (0x0020 - 0x0000)
struct Scientist_BP_C_ApplyMesh final
{
public:
	TArray<TSoftObjectPtr<class USkeletalMesh>>   Meshes;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class USkeletalMeshComponent*           Component;                                         // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MeshIndex;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scientist_BP_C_ApplyMesh) == 0x000008, "Wrong alignment on Scientist_BP_C_ApplyMesh");
static_assert(sizeof(Scientist_BP_C_ApplyMesh) == 0x000020, "Wrong size on Scientist_BP_C_ApplyMesh");
static_assert(offsetof(Scientist_BP_C_ApplyMesh, Meshes) == 0x000000, "Member 'Scientist_BP_C_ApplyMesh::Meshes' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ApplyMesh, Component) == 0x000010, "Member 'Scientist_BP_C_ApplyMesh::Component' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ApplyMesh, MeshIndex) == 0x000018, "Member 'Scientist_BP_C_ApplyMesh::MeshIndex' has a wrong offset!");

// Function Scientist_BP.Scientist_BP_C.ExecuteUbergraph_Scientist_BP
// 0x00B8 (0x00B8 - 0x0000)
struct Scientist_BP_C_ExecuteUbergraph_Scientist_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3C[0x4];                                      // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3D[0x4];                                      // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class USkeletalMesh>>   K2Node_CustomEvent_Meshes;                         // 0x0028(0x0010)(ConstParm, ReferenceParm)
	const class USkeletalMeshComponent*           K2Node_CustomEvent_Component;                      // 0x0038(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MeshIndex;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_E3E[0x4];                                      // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           CallFunc_Array_Get_Item;                           // 0x0058(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3F[0x7];                                      // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class USkeletalMesh>>   K2Node_Select_Default;                             // 0x0088(0x0010)(ConstParm, ReferenceParm)
	TArray<TSoftObjectPtr<class USkeletalMesh>>   K2Node_Select_Default_1;                           // 0x0098(0x0010)(ConstParm, ReferenceParm)
	TArray<TSoftObjectPtr<class USkeletalMesh>>   K2Node_Select_Default_2;                           // 0x00A8(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP) == 0x000008, "Wrong alignment on Scientist_BP_C_ExecuteUbergraph_Scientist_BP");
static_assert(sizeof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP) == 0x0000B8, "Wrong size on Scientist_BP_C_ExecuteUbergraph_Scientist_BP");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, EntryPoint) == 0x000000, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, Temp_object_Variable) == 0x000010, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x000018, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, Temp_bool_Variable) == 0x000021, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, Temp_bool_Variable_1) == 0x000022, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, Temp_bool_Variable_2) == 0x000023, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, K2Node_CustomEvent_Meshes) == 0x000028, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::K2Node_CustomEvent_Meshes' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, K2Node_CustomEvent_Component) == 0x000038, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::K2Node_CustomEvent_Component' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, K2Node_CustomEvent_MeshIndex) == 0x000040, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::K2Node_CustomEvent_MeshIndex' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, CallFunc_Array_Get_Item) == 0x000058, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000080, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, K2Node_Select_Default) == 0x000088, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, K2Node_Select_Default_1) == 0x000098, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, K2Node_Select_Default_2) == 0x0000A8, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::K2Node_Select_Default_2' has a wrong offset!");

}

