#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScreenshotPlayer_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ScreenshotPlayer_AnimBP.ScreenshotPlayer_AnimBP_C
// 0x00A0 (0x0360 - 0x02C0)
class UScreenshotPlayer_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3424[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x02F8(0x0050)()
	class AScreenshotPlayer_C*                    Player;                                            // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset;                                            // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3425[0x4];                                     // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Sequence;                                          // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_ScreenshotPlayer_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ScreenshotPlayer_AnimBP_C">();
	}
	static class UScreenshotPlayer_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScreenshotPlayer_AnimBP_C>();
	}
};
static_assert(alignof(UScreenshotPlayer_AnimBP_C) == 0x000010, "Wrong alignment on UScreenshotPlayer_AnimBP_C");
static_assert(sizeof(UScreenshotPlayer_AnimBP_C) == 0x000360, "Wrong size on UScreenshotPlayer_AnimBP_C");
static_assert(offsetof(UScreenshotPlayer_AnimBP_C, UberGraphFrame) == 0x0002C0, "Member 'UScreenshotPlayer_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UScreenshotPlayer_AnimBP_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UScreenshotPlayer_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UScreenshotPlayer_AnimBP_C, AnimGraphNode_SequenceEvaluator) == 0x0002F8, "Member 'UScreenshotPlayer_AnimBP_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UScreenshotPlayer_AnimBP_C, Player) == 0x000348, "Member 'UScreenshotPlayer_AnimBP_C::Player' has a wrong offset!");
static_assert(offsetof(UScreenshotPlayer_AnimBP_C, Offset) == 0x000350, "Member 'UScreenshotPlayer_AnimBP_C::Offset' has a wrong offset!");
static_assert(offsetof(UScreenshotPlayer_AnimBP_C, Sequence) == 0x000358, "Member 'UScreenshotPlayer_AnimBP_C::Sequence' has a wrong offset!");

}

