#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SecondaryObjectiveWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ObjectiveWidgetBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SecondaryObjectiveWidget.SecondaryObjectiveWidget_C
// 0x0040 (0x0370 - 0x0330)
class USecondaryObjectiveWidget_C final : public UObjectiveWidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SecondaryObjectiveWidget_C;         // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Completed;                                         // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CountText;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InProgressIcon;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_SecondaryObjectiveWidget;          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         ObjectiveText;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          HasRecentProgress;                                 // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SecondaryObjectiveWidget(int32 EntryPoint);
	void Event_ProgressChanged(class ARBBaseObjectiveCoordinator* Coordinator, float Progress, bool IsPositiveProgress, const class FText& Param_ObjectiveText);
	void HandleVisibilityEvent(bool Param_IsVisible);
	void GetFadeInAnimation(class UWidgetAnimation** FadeInAnimation);
	void SetCompleted();
	void Initialize(class ARBBaseObjectiveCoordinator* Coordinator);

	bool ShouldShow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SecondaryObjectiveWidget_C">();
	}
	static class USecondaryObjectiveWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USecondaryObjectiveWidget_C>();
	}
};
static_assert(alignof(USecondaryObjectiveWidget_C) == 0x000008, "Wrong alignment on USecondaryObjectiveWidget_C");
static_assert(sizeof(USecondaryObjectiveWidget_C) == 0x000370, "Wrong size on USecondaryObjectiveWidget_C");
static_assert(offsetof(USecondaryObjectiveWidget_C, UberGraphFrame_SecondaryObjectiveWidget_C) == 0x000330, "Member 'USecondaryObjectiveWidget_C::UberGraphFrame_SecondaryObjectiveWidget_C' has a wrong offset!");
static_assert(offsetof(USecondaryObjectiveWidget_C, FadeIn) == 0x000338, "Member 'USecondaryObjectiveWidget_C::FadeIn' has a wrong offset!");
static_assert(offsetof(USecondaryObjectiveWidget_C, Completed) == 0x000340, "Member 'USecondaryObjectiveWidget_C::Completed' has a wrong offset!");
static_assert(offsetof(USecondaryObjectiveWidget_C, CountText) == 0x000348, "Member 'USecondaryObjectiveWidget_C::CountText' has a wrong offset!");
static_assert(offsetof(USecondaryObjectiveWidget_C, InProgressIcon) == 0x000350, "Member 'USecondaryObjectiveWidget_C::InProgressIcon' has a wrong offset!");
static_assert(offsetof(USecondaryObjectiveWidget_C, InvalidationBox_SecondaryObjectiveWidget) == 0x000358, "Member 'USecondaryObjectiveWidget_C::InvalidationBox_SecondaryObjectiveWidget' has a wrong offset!");
static_assert(offsetof(USecondaryObjectiveWidget_C, ObjectiveText) == 0x000360, "Member 'USecondaryObjectiveWidget_C::ObjectiveText' has a wrong offset!");
static_assert(offsetof(USecondaryObjectiveWidget_C, HasRecentProgress) == 0x000368, "Member 'USecondaryObjectiveWidget_C::HasRecentProgress' has a wrong offset!");

}

