#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleConfirmCancelPopupWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SimpleConfirmCancelPopupWidget.SimpleConfirmCancelPopupWidget_C
// 0x0038 (0x0370 - 0x0338)
class USimpleConfirmCancelPopupWidget_C final : public URBPopUpConfirmCancelWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBMenuButton_C*                        CancelBtn;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        ConfirmBtn;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ControlsHorizontalBox;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                GamepadFocusHandler;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MainText;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SimpleConfirmCancelPopupWidget(int32 EntryPoint);
	void BndEvt__SimpleConfirmCancelPopupWidget_GamepadFocusHandler_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Event_OnFocusMenu();
	void Event_InputSourceChanged(bool bIsGamepad);
	void Event_MenuConfirm_Pressed();
	void Event_MenuCancel_Pressed();
	void BndEvt__SimpleConfirmCancelPopupWidget_CancelBtn_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void BndEvt__SimpleConfirmCancelPopupWidget_ConfirmBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void Event_InitializePopup(const class FText& TitleText, const class FText& Param_MainText, const class FText& ConfirmText, const class FText& CancelText);
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SimpleConfirmCancelPopupWidget_C">();
	}
	static class USimpleConfirmCancelPopupWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleConfirmCancelPopupWidget_C>();
	}
};
static_assert(alignof(USimpleConfirmCancelPopupWidget_C) == 0x000008, "Wrong alignment on USimpleConfirmCancelPopupWidget_C");
static_assert(sizeof(USimpleConfirmCancelPopupWidget_C) == 0x000370, "Wrong size on USimpleConfirmCancelPopupWidget_C");
static_assert(offsetof(USimpleConfirmCancelPopupWidget_C, UberGraphFrame) == 0x000338, "Member 'USimpleConfirmCancelPopupWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USimpleConfirmCancelPopupWidget_C, CancelBtn) == 0x000340, "Member 'USimpleConfirmCancelPopupWidget_C::CancelBtn' has a wrong offset!");
static_assert(offsetof(USimpleConfirmCancelPopupWidget_C, ConfirmBtn) == 0x000348, "Member 'USimpleConfirmCancelPopupWidget_C::ConfirmBtn' has a wrong offset!");
static_assert(offsetof(USimpleConfirmCancelPopupWidget_C, ControlsHorizontalBox) == 0x000350, "Member 'USimpleConfirmCancelPopupWidget_C::ControlsHorizontalBox' has a wrong offset!");
static_assert(offsetof(USimpleConfirmCancelPopupWidget_C, GamepadFocusHandler) == 0x000358, "Member 'USimpleConfirmCancelPopupWidget_C::GamepadFocusHandler' has a wrong offset!");
static_assert(offsetof(USimpleConfirmCancelPopupWidget_C, MainText) == 0x000360, "Member 'USimpleConfirmCancelPopupWidget_C::MainText' has a wrong offset!");
static_assert(offsetof(USimpleConfirmCancelPopupWidget_C, Title) == 0x000368, "Member 'USimpleConfirmCancelPopupWidget_C::Title' has a wrong offset!");

}

