#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SingleRewardWidget

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SingleRewardWidget.SingleRewardWidget_C.ExecuteUbergraph_SingleRewardWidget
// 0x0060 (0x0060 - 0x0000)
struct SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D11[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D12[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_thumbnailSoftref;               // 0x0038(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget) == 0x000008, "Wrong alignment on SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget");
static_assert(sizeof(SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget) == 0x000060, "Wrong size on SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget");
static_assert(offsetof(SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget, EntryPoint) == 0x000000, "Member 'SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget, Temp_object_Variable) == 0x000020, "Member 'SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget, K2Node_DynamicCast_AsTexture_2D) == 0x000028, "Member 'SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget, K2Node_Event_IsDesignTime) == 0x000031, "Member 'SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget, K2Node_CustomEvent_thumbnailSoftref) == 0x000038, "Member 'SingleRewardWidget_C_ExecuteUbergraph_SingleRewardWidget::K2Node_CustomEvent_thumbnailSoftref' has a wrong offset!");

// Function SingleRewardWidget.SingleRewardWidget_C.LoadThumbnail
// 0x0028 (0x0028 - 0x0000)
struct SingleRewardWidget_C_LoadThumbnail final
{
public:
	TSoftObjectPtr<class UTexture2D>              ThumbnailSoftRef;                                  // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(SingleRewardWidget_C_LoadThumbnail) == 0x000008, "Wrong alignment on SingleRewardWidget_C_LoadThumbnail");
static_assert(sizeof(SingleRewardWidget_C_LoadThumbnail) == 0x000028, "Wrong size on SingleRewardWidget_C_LoadThumbnail");
static_assert(offsetof(SingleRewardWidget_C_LoadThumbnail, ThumbnailSoftRef) == 0x000000, "Member 'SingleRewardWidget_C_LoadThumbnail::ThumbnailSoftRef' has a wrong offset!");

// Function SingleRewardWidget.SingleRewardWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SingleRewardWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SingleRewardWidget_C_PreConstruct) == 0x000001, "Wrong alignment on SingleRewardWidget_C_PreConstruct");
static_assert(sizeof(SingleRewardWidget_C_PreConstruct) == 0x000001, "Wrong size on SingleRewardWidget_C_PreConstruct");
static_assert(offsetof(SingleRewardWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SingleRewardWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SingleRewardWidget.SingleRewardWidget_C.OnLoaded_0010701F4B6D26334013828A2735795D
// 0x0008 (0x0008 - 0x0000)
struct SingleRewardWidget_C_OnLoaded_0010701F4B6D26334013828A2735795D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SingleRewardWidget_C_OnLoaded_0010701F4B6D26334013828A2735795D) == 0x000008, "Wrong alignment on SingleRewardWidget_C_OnLoaded_0010701F4B6D26334013828A2735795D");
static_assert(sizeof(SingleRewardWidget_C_OnLoaded_0010701F4B6D26334013828A2735795D) == 0x000008, "Wrong size on SingleRewardWidget_C_OnLoaded_0010701F4B6D26334013828A2735795D");
static_assert(offsetof(SingleRewardWidget_C_OnLoaded_0010701F4B6D26334013828A2735795D, Loaded) == 0x000000, "Member 'SingleRewardWidget_C_OnLoaded_0010701F4B6D26334013828A2735795D::Loaded' has a wrong offset!");

// Function SingleRewardWidget.SingleRewardWidget_C.Setup
// 0x0090 (0x0090 - 0x0000)
struct SingleRewardWidget_C_Setup final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D13[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D14[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
};
static_assert(alignof(SingleRewardWidget_C_Setup) == 0x000008, "Wrong alignment on SingleRewardWidget_C_Setup");
static_assert(sizeof(SingleRewardWidget_C_Setup) == 0x000090, "Wrong size on SingleRewardWidget_C_Setup");
static_assert(offsetof(SingleRewardWidget_C_Setup, Temp_bool_Variable) == 0x000000, "Member 'SingleRewardWidget_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Setup, Temp_byte_Variable) == 0x000001, "Member 'SingleRewardWidget_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Setup, Temp_byte_Variable_1) == 0x000002, "Member 'SingleRewardWidget_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Setup, CallFunc_Greater_IntInt_ReturnValue) == 0x000003, "Member 'SingleRewardWidget_C_Setup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Setup, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'SingleRewardWidget_C_Setup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Setup, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'SingleRewardWidget_C_Setup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Setup, K2Node_Select_Default) == 0x000060, "Member 'SingleRewardWidget_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Setup, K2Node_MakeArray_Array) == 0x000068, "Member 'SingleRewardWidget_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Setup, CallFunc_Format_ReturnValue) == 0x000078, "Member 'SingleRewardWidget_C_Setup::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function SingleRewardWidget.SingleRewardWidget_C.PlayNewRewardAnimation
// 0x0008 (0x0008 - 0x0000)
struct SingleRewardWidget_C_PlayNewRewardAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SingleRewardWidget_C_PlayNewRewardAnimation) == 0x000008, "Wrong alignment on SingleRewardWidget_C_PlayNewRewardAnimation");
static_assert(sizeof(SingleRewardWidget_C_PlayNewRewardAnimation) == 0x000008, "Wrong size on SingleRewardWidget_C_PlayNewRewardAnimation");
static_assert(offsetof(SingleRewardWidget_C_PlayNewRewardAnimation, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'SingleRewardWidget_C_PlayNewRewardAnimation::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function SingleRewardWidget.SingleRewardWidget_C.Init
// 0x01D0 (0x01D0 - 0x0000)
struct SingleRewardWidget_C_Init final
{
public:
	struct FRewardUIData                          RewardUIData;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D15[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerIconCustomizationOption*       K2Node_DynamicCast_AsRB_Player_Icon_Customization_Option; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D16[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerCellItemDefinition*            K2Node_DynamicCast_AsRB_Player_Cell_Item_Definition; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D17[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBCustomizationOutfit*                 K2Node_DynamicCast_AsRB_Customization_Outfit;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D18[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerCustomizationOption*           K2Node_DynamicCast_AsRB_Player_Customization_Option; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D19[0x1];                                     // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1A[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0078(0x0028)()
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00C0(0x0028)()
	class URBSettings_Gameplay*                   CallFunc_GetRBSettings_Gameplay_ReturnValue;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCurencySettings                       CallFunc_Map_Find_Value;                           // 0x00F8(0x0030)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1B[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomRewardPoolDisplayDetails        CallFunc_GetRandomRewardPoolDisplayDetails_ReturnValue; // 0x0130(0x0030)(ConstParm, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0160(0x0028)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1C[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0190(0x0028)()
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_2;          // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SingleRewardWidget_C_Init) == 0x000008, "Wrong alignment on SingleRewardWidget_C_Init");
static_assert(sizeof(SingleRewardWidget_C_Init) == 0x0001D0, "Wrong size on SingleRewardWidget_C_Init");
static_assert(offsetof(SingleRewardWidget_C_Init, RewardUIData) == 0x000000, "Member 'SingleRewardWidget_C_Init::RewardUIData' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, Temp_bool_Variable) == 0x000020, "Member 'SingleRewardWidget_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, Temp_byte_Variable) == 0x000021, "Member 'SingleRewardWidget_C_Init::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_DynamicCast_AsRB_Player_Icon_Customization_Option) == 0x000028, "Member 'SingleRewardWidget_C_Init::K2Node_DynamicCast_AsRB_Player_Icon_Customization_Option' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SingleRewardWidget_C_Init::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_DynamicCast_AsRB_Player_Cell_Item_Definition) == 0x000038, "Member 'SingleRewardWidget_C_Init::K2Node_DynamicCast_AsRB_Player_Cell_Item_Definition' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'SingleRewardWidget_C_Init::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_DynamicCast_AsRB_Customization_Outfit) == 0x000048, "Member 'SingleRewardWidget_C_Init::K2Node_DynamicCast_AsRB_Customization_Outfit' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'SingleRewardWidget_C_Init::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_DynamicCast_AsRB_Player_Customization_Option) == 0x000058, "Member 'SingleRewardWidget_C_Init::K2Node_DynamicCast_AsRB_Player_Customization_Option' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_DynamicCast_bSuccess_3) == 0x000060, "Member 'SingleRewardWidget_C_Init::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_SwitchEnum_CmpSuccess) == 0x000061, "Member 'SingleRewardWidget_C_Init::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, Temp_byte_Variable_1) == 0x000062, "Member 'SingleRewardWidget_C_Init::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_MakeStruct_Margin) == 0x000064, "Member 'SingleRewardWidget_C_Init::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_MakeStruct_SlateColor) == 0x000078, "Member 'SingleRewardWidget_C_Init::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_MakeStruct_Margin_1) == 0x0000A0, "Member 'SingleRewardWidget_C_Init::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_MakeStruct_Margin_2) == 0x0000B0, "Member 'SingleRewardWidget_C_Init::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_MakeStruct_SlateColor_1) == 0x0000C0, "Member 'SingleRewardWidget_C_Init::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, CallFunc_GetRBSettings_Gameplay_ReturnValue) == 0x0000E8, "Member 'SingleRewardWidget_C_Init::CallFunc_GetRBSettings_Gameplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x0000F0, "Member 'SingleRewardWidget_C_Init::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, CallFunc_Map_Find_Value) == 0x0000F8, "Member 'SingleRewardWidget_C_Init::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, CallFunc_Map_Find_ReturnValue) == 0x000128, "Member 'SingleRewardWidget_C_Init::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, CallFunc_GetRandomRewardPoolDisplayDetails_ReturnValue) == 0x000130, "Member 'SingleRewardWidget_C_Init::CallFunc_GetRandomRewardPoolDisplayDetails_ReturnValue' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_MakeStruct_SlateColor_2) == 0x000160, "Member 'SingleRewardWidget_C_Init::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_Select_Default) == 0x000188, "Member 'SingleRewardWidget_C_Init::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, K2Node_MakeStruct_SlateColor_3) == 0x000190, "Member 'SingleRewardWidget_C_Init::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0001B8, "Member 'SingleRewardWidget_C_Init::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x0001C0, "Member 'SingleRewardWidget_C_Init::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_Init, CallFunc_SlotAsOverlaySlot_ReturnValue_2) == 0x0001C8, "Member 'SingleRewardWidget_C_Init::CallFunc_SlotAsOverlaySlot_ReturnValue_2' has a wrong offset!");

// Function SingleRewardWidget.SingleRewardWidget_C.CanMergeWith
// 0x0028 (0x0028 - 0x0000)
struct SingleRewardWidget_C_CanMergeWith final
{
public:
	struct FRewardUIData                          RewardUIData;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          bCanMergeWith;                                     // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SingleRewardWidget_C_CanMergeWith) == 0x000008, "Wrong alignment on SingleRewardWidget_C_CanMergeWith");
static_assert(sizeof(SingleRewardWidget_C_CanMergeWith) == 0x000028, "Wrong size on SingleRewardWidget_C_CanMergeWith");
static_assert(offsetof(SingleRewardWidget_C_CanMergeWith, RewardUIData) == 0x000000, "Member 'SingleRewardWidget_C_CanMergeWith::RewardUIData' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_CanMergeWith, bCanMergeWith) == 0x000020, "Member 'SingleRewardWidget_C_CanMergeWith::bCanMergeWith' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_CanMergeWith, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'SingleRewardWidget_C_CanMergeWith::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_CanMergeWith, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000022, "Member 'SingleRewardWidget_C_CanMergeWith::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_CanMergeWith, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000023, "Member 'SingleRewardWidget_C_CanMergeWith::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_CanMergeWith, CallFunc_BooleanAND_ReturnValue) == 0x000024, "Member 'SingleRewardWidget_C_CanMergeWith::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function SingleRewardWidget.SingleRewardWidget_C.MergeWith
// 0x0028 (0x0028 - 0x0000)
struct SingleRewardWidget_C_MergeWith final
{
public:
	struct FRewardUIData                          RewardUIData;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SingleRewardWidget_C_MergeWith) == 0x000008, "Wrong alignment on SingleRewardWidget_C_MergeWith");
static_assert(sizeof(SingleRewardWidget_C_MergeWith) == 0x000028, "Wrong size on SingleRewardWidget_C_MergeWith");
static_assert(offsetof(SingleRewardWidget_C_MergeWith, RewardUIData) == 0x000000, "Member 'SingleRewardWidget_C_MergeWith::RewardUIData' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_MergeWith, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'SingleRewardWidget_C_MergeWith::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function SingleRewardWidget.SingleRewardWidget_C.UpdateRarity
// 0x00D0 (0x00D0 - 0x0000)
struct SingleRewardWidget_C_UpdateRarity final
{
public:
	EPlayerCustomizationRarity                    Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1D[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	class URBPlayerCustomizationConfig*           CallFunc_GetPlayerCustomizationConfig_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCustomizationRarityUIInfo             CallFunc_Map_Find_Value;                           // 0x0038(0x0068)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1E[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x00A8(0x0028)()
};
static_assert(alignof(SingleRewardWidget_C_UpdateRarity) == 0x000008, "Wrong alignment on SingleRewardWidget_C_UpdateRarity");
static_assert(sizeof(SingleRewardWidget_C_UpdateRarity) == 0x0000D0, "Wrong size on SingleRewardWidget_C_UpdateRarity");
static_assert(offsetof(SingleRewardWidget_C_UpdateRarity, Rarity) == 0x000000, "Member 'SingleRewardWidget_C_UpdateRarity::Rarity' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_UpdateRarity, Temp_bool_Variable) == 0x000001, "Member 'SingleRewardWidget_C_UpdateRarity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SingleRewardWidget_C_UpdateRarity, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'SingleRewardWidget_C_UpdateRarity::K2Node_MakeStruct_SlateColor' has a wrong offset!");
