#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_ContextualMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function SocialMenu_ContextualMenu.SocialMenu_ContextualMenu_C.ExecuteUbergraph_SocialMenu_ContextualMenu
// 0x00B8 (0x00B8 - 0x0000)
struct SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D97[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSocialMenuEntry*                     CallFunc_GetAssociatedEntry_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBlocked_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D98[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ERBSocialMenuEntryAction Action)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D99[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetVoiceChatVolume_ReturnValue;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9A[0x1];                                     // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9B[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ERBSocialMenuEntryAction>              CallFunc_GetAvailableActions_ReturnValue;          // 0x0040(0x0010)(ConstParm, ReferenceParm)
	class USocialMenu_ContextualMenu_Action_C*    CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERBSocialMenuEntryAction                      CallFunc_Array_Get_Item;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9C[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetActionText_ReturnValue;                // 0x0060(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9D[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERBSocialMenuEntryAction                      K2Node_CustomEvent_action;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9E[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSocialMenuEntry*                     CallFunc_GetAssociatedEntry_ReturnValue_1;         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_value;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUpdateVoiceChatVolume_ReturnValue;     // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue;               // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9F[0x2];                                     // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA0[0x2];                                     // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA1[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSocialMenuEntry*                     CallFunc_GetAssociatedEntry_ReturnValue_2;         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu) == 0x000008, "Wrong alignment on SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu");
static_assert(sizeof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu) == 0x0000B8, "Wrong size on SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, EntryPoint) == 0x000000, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_GetAssociatedEntry_ReturnValue) == 0x000008, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_GetAssociatedEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_IsBlocked_ReturnValue) == 0x000010, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_IsBlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000024, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_GetVoiceChatVolume_ReturnValue) == 0x000028, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_GetVoiceChatVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, Temp_bool_Variable) == 0x00002C, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, Temp_byte_Variable) == 0x00002D, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, Temp_byte_Variable_1) == 0x00002E, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, Temp_int_Array_Index_Variable) == 0x000030, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_GetAvailableActions_ReturnValue) == 0x000040, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_GetAvailableActions_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_Create_ReturnValue) == 0x000050, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_Array_Get_Item) == 0x000058, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_GetActionText_ReturnValue) == 0x000060, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_GetActionText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_AddChild_ReturnValue) == 0x000080, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, K2Node_CustomEvent_action) == 0x000088, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::K2Node_CustomEvent_action' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_GetAssociatedEntry_ReturnValue_1) == 0x000090, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_GetAssociatedEntry_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, K2Node_ComponentBoundEvent_value) == 0x000098, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::K2Node_ComponentBoundEvent_value' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_CanUpdateVoiceChatVolume_ReturnValue) == 0x00009C, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_CanUpdateVoiceChatVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_IsPlayInEditor_ReturnValue) == 0x00009D, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_IsPlayInEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_GetChildrenCount_ReturnValue) == 0x0000A0, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_BooleanOR_ReturnValue) == 0x0000A4, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A5, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_SelectFloat_ReturnValue) == 0x0000A8, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, K2Node_Select_Default) == 0x0000AC, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu, CallFunc_GetAssociatedEntry_ReturnValue_2) == 0x0000B0, "Member 'SocialMenu_ContextualMenu_C_ExecuteUbergraph_SocialMenu_ContextualMenu::CallFunc_GetAssociatedEntry_ReturnValue_2' has a wrong offset!");

// Function SocialMenu_ContextualMenu.SocialMenu_ContextualMenu_C.BndEvt__SocialMenu_ContextualMenu_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SocialMenu_ContextualMenu_C_BndEvt__SocialMenu_ContextualMenu_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_ContextualMenu_C_BndEvt__SocialMenu_ContextualMenu_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong alignment on SocialMenu_ContextualMenu_C_BndEvt__SocialMenu_ContextualMenu_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature");
static_assert(sizeof(SocialMenu_ContextualMenu_C_BndEvt__SocialMenu_ContextualMenu_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong size on SocialMenu_ContextualMenu_C_BndEvt__SocialMenu_ContextualMenu_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature");
static_assert(offsetof(SocialMenu_ContextualMenu_C_BndEvt__SocialMenu_ContextualMenu_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature, Value) == 0x000000, "Member 'SocialMenu_ContextualMenu_C_BndEvt__SocialMenu_ContextualMenu_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature::Value' has a wrong offset!");

// Function SocialMenu_ContextualMenu.SocialMenu_ContextualMenu_C.OnActionTriggered
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_ContextualMenu_C_OnActionTriggered final
{
public:
	ERBSocialMenuEntryAction                      Action;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_ContextualMenu_C_OnActionTriggered) == 0x000001, "Wrong alignment on SocialMenu_ContextualMenu_C_OnActionTriggered");
static_assert(sizeof(SocialMenu_ContextualMenu_C_OnActionTriggered) == 0x000001, "Wrong size on SocialMenu_ContextualMenu_C_OnActionTriggered");
static_assert(offsetof(SocialMenu_ContextualMenu_C_OnActionTriggered, Action) == 0x000000, "Member 'SocialMenu_ContextualMenu_C_OnActionTriggered::Action' has a wrong offset!");

// Function SocialMenu_ContextualMenu.SocialMenu_ContextualMenu_C.GetActionText
// 0x0048 (0x0048 - 0x0000)
struct SocialMenu_ContextualMenu_C_GetActionText final
{
public:
	ERBSocialMenuEntryAction                      Enumerator;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA3[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProfilePlatform                              CallFunc_GetPlatform_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA4[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProfilePlatform                              CallFunc_GetPlatform_ReturnValue_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_ContextualMenu_C_GetActionText) == 0x000008, "Wrong alignment on SocialMenu_ContextualMenu_C_GetActionText");
static_assert(sizeof(SocialMenu_ContextualMenu_C_GetActionText) == 0x000048, "Wrong size on SocialMenu_ContextualMenu_C_GetActionText");
static_assert(offsetof(SocialMenu_ContextualMenu_C_GetActionText, Enumerator) == 0x000000, "Member 'SocialMenu_ContextualMenu_C_GetActionText::Enumerator' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_GetActionText, ReturnValue) == 0x000008, "Member 'SocialMenu_ContextualMenu_C_GetActionText::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_GetActionText, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'SocialMenu_ContextualMenu_C_GetActionText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_GetActionText, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000028, "Member 'SocialMenu_ContextualMenu_C_GetActionText::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_GetActionText, CallFunc_GetPlatform_ReturnValue) == 0x000030, "Member 'SocialMenu_ContextualMenu_C_GetActionText::CallFunc_GetPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_GetActionText, K2Node_SwitchEnum_CmpSuccess_1) == 0x000031, "Member 'SocialMenu_ContextualMenu_C_GetActionText::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_GetActionText, CallFunc_GetLocalPlayerState_ReturnValue_1) == 0x000038, "Member 'SocialMenu_ContextualMenu_C_GetActionText::CallFunc_GetLocalPlayerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_GetActionText, CallFunc_GetPlatform_ReturnValue_1) == 0x000040, "Member 'SocialMenu_ContextualMenu_C_GetActionText::CallFunc_GetPlatform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_GetActionText, K2Node_SwitchEnum_CmpSuccess_2) == 0x000041, "Member 'SocialMenu_ContextualMenu_C_GetActionText::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");

// Function SocialMenu_ContextualMenu.SocialMenu_ContextualMenu_C.DoCustomNavigation_0
// 0x0010 (0x0010 - 0x0000)
struct SocialMenu_ContextualMenu_C_DoCustomNavigation_0 final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA5[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_ContextualMenu_C_DoCustomNavigation_0) == 0x000008, "Wrong alignment on SocialMenu_ContextualMenu_C_DoCustomNavigation_0");
static_assert(sizeof(SocialMenu_ContextualMenu_C_DoCustomNavigation_0) == 0x000010, "Wrong size on SocialMenu_ContextualMenu_C_DoCustomNavigation_0");
static_assert(offsetof(SocialMenu_ContextualMenu_C_DoCustomNavigation_0, Param_Navigation) == 0x000000, "Member 'SocialMenu_ContextualMenu_C_DoCustomNavigation_0::Param_Navigation' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_DoCustomNavigation_0, ReturnValue) == 0x000008, "Member 'SocialMenu_ContextualMenu_C_DoCustomNavigation_0::ReturnValue' has a wrong offset!");

// Function SocialMenu_ContextualMenu.SocialMenu_ContextualMenu_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct SocialMenu_ContextualMenu_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_ContextualMenu_C_OnFocusReceived) == 0x000008, "Wrong alignment on SocialMenu_ContextualMenu_C_OnFocusReceived");
static_assert(sizeof(SocialMenu_ContextualMenu_C_OnFocusReceived) == 0x0001C0, "Wrong size on SocialMenu_ContextualMenu_C_OnFocusReceived");
static_assert(offsetof(SocialMenu_ContextualMenu_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'SocialMenu_ContextualMenu_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'SocialMenu_ContextualMenu_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'SocialMenu_ContextualMenu_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'SocialMenu_ContextualMenu_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B0, "Member 'SocialMenu_ContextualMenu_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_OnFocusReceived, CallFunc_GetChildrenCount_ReturnValue) == 0x0001B8, "Member 'SocialMenu_ContextualMenu_C_OnFocusReceived::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_C_OnFocusReceived, CallFunc_Greater_IntInt_ReturnValue) == 0x0001BC, "Member 'SocialMenu_ContextualMenu_C_OnFocusReceived::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

