#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_PartyOption

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialMenu_PartyOption.SocialMenu_PartyOption_C
// 0x0080 (0x02E0 - 0x0260)
class USocialMenu_PartyOption_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BackgroundImage;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         EditingBox;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InteractionButton;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                NextValueButton;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OptionNameText;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PreviousValueButton;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ValueText;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnValueUpdated;                                    // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bEnabled;                                          // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHovered;                                          // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B2[0x2];                                      // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentValue;                                      // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           Values;                                            // 0x02B8(0x0010)(Edit, BlueprintVisible)
	class FText                                   OptionName;                                        // 0x02C8(0x0018)(Edit, BlueprintVisible)

public:
	void OnValueUpdated__DelegateSignature(int32 Value);
	void ExecuteUbergraph_SocialMenu_PartyOption(int32 EntryPoint);
	void Cycle(bool Left);
	void BndEvt__SocialMenu_PartyOption_NextValueButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SocialMenu_PartyOption_PreviousValueButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SocialMenu_PartyOption_InteractionButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SocialMenu_PartyOption_InteractionButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__NextValueButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__PreviousValueButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void Setup();
	void SetEnabled(bool bInEnabled);
	void SetValue(int32 Value);
	void SetHovered(bool bInHovered);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void HandleLeftRightNavigation(EUINavigation Navigation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialMenu_PartyOption_C">();
	}
	static class USocialMenu_PartyOption_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialMenu_PartyOption_C>();
	}
};
static_assert(alignof(USocialMenu_PartyOption_C) == 0x000008, "Wrong alignment on USocialMenu_PartyOption_C");
static_assert(sizeof(USocialMenu_PartyOption_C) == 0x0002E0, "Wrong size on USocialMenu_PartyOption_C");
static_assert(offsetof(USocialMenu_PartyOption_C, UberGraphFrame) == 0x000260, "Member 'USocialMenu_PartyOption_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyOption_C, BackgroundImage) == 0x000268, "Member 'USocialMenu_PartyOption_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyOption_C, EditingBox) == 0x000270, "Member 'USocialMenu_PartyOption_C::EditingBox' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyOption_C, InteractionButton) == 0x000278, "Member 'USocialMenu_PartyOption_C::InteractionButton' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyOption_C, NextValueButton) == 0x000280, "Member 'USocialMenu_PartyOption_C::NextValueButton' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyOption_C, OptionNameText) == 0x000288, "Member 'USocialMenu_PartyOption_C::OptionNameText' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyOption_C, PreviousValueButton) == 0x000290, "Member 'USocialMenu_PartyOption_C::PreviousValueButton' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyOption_C, ValueText) == 0x000298, "Member 'USocialMenu_PartyOption_C::ValueText' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyOption_C, OnValueUpdated) == 0x0002A0, "Member 'USocialMenu_PartyOption_C::OnValueUpdated' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyOption_C, bEnabled) == 0x0002B0, "Member 'USocialMenu_PartyOption_C::bEnabled' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyOption_C, bHovered) == 0x0002B1, "Member 'USocialMenu_PartyOption_C::bHovered' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyOption_C, CurrentValue) == 0x0002B4, "Member 'USocialMenu_PartyOption_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyOption_C, Values) == 0x0002B8, "Member 'USocialMenu_PartyOption_C::Values' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyOption_C, OptionName) == 0x0002C8, "Member 'USocialMenu_PartyOption_C::OptionName' has a wrong offset!");

}

