#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_Entry_Self

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialMenu_Entry_Self.SocialMenu_Entry_Self_C
// 0x0088 (0x04F8 - 0x0470)
class USocialMenu_Entry_Self_C final : public URBSocialMenuEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WaitingAnimation;                                  // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            ContextualMenuAnchor;                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UContextualMenuButton_C*                ContextualMenuButton;                              // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InteractionButton;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                LoadingContainer;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingVideoWidget_C*                  LoadingVideoWidget;                                // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_SocialMenu_Entry_Self_C;                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyLeaderIcon;                                   // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlatformIcon;                                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PlayerLevelBox;                                    // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerLevelText;                                   // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProfileIcon;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProfileIconBackground;                             // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsGamepad;                                        // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHovered;                                          // 0x04E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFocused;                                          // 0x04EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA6[0x5];                                     // 0x04EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialMenu_ContextualMenu_C*           ContextualMenu;                                    // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SocialMenu_Entry_Self(int32 EntryPoint);
	void BndEvt__SocialMenu_Entry_Self_InteractionButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SocialMenu_Entry_Self_InteractionButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SocialMenu_Entry_Self_InteractionButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Destruct();
	void OnMenuInputSourceChanged();
	void Construct();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void BndEvt__ContextualMenuButton_K2Node_ComponentBoundEvent_2_EventClicked__DelegateSignature();
	void Event_CloseContextualMenu();
	void Event_OpenContextualMenu();
	void Event_ActionRequested();
	void Event_Refresh();
	void SetPlatformIcon();
	void SetName();
	void SetOnlineStatus();
	void SetBackground();
	void ShowLoading();
	void SetPartyLeaderIcon();
	void SetProfileIcon();
	void SetPlayerLevel();
	class UUserWidget* CreateContextualMenu();
	void RefreshContextualMenu();
	void SetHovered(bool bInHovered);
	void Set_Focused(bool bInFocused);
	void IsConsideredHovered(bool* bConsideredHovered);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialMenu_Entry_Self_C">();
	}
	static class USocialMenu_Entry_Self_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialMenu_Entry_Self_C>();
	}
};
static_assert(alignof(USocialMenu_Entry_Self_C) == 0x000008, "Wrong alignment on USocialMenu_Entry_Self_C");
static_assert(sizeof(USocialMenu_Entry_Self_C) == 0x0004F8, "Wrong size on USocialMenu_Entry_Self_C");
static_assert(offsetof(USocialMenu_Entry_Self_C, UberGraphFrame) == 0x000470, "Member 'USocialMenu_Entry_Self_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, WaitingAnimation) == 0x000478, "Member 'USocialMenu_Entry_Self_C::WaitingAnimation' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, BackgroundImage) == 0x000480, "Member 'USocialMenu_Entry_Self_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, ContextualMenuAnchor) == 0x000488, "Member 'USocialMenu_Entry_Self_C::ContextualMenuAnchor' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, ContextualMenuButton) == 0x000490, "Member 'USocialMenu_Entry_Self_C::ContextualMenuButton' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, InteractionButton) == 0x000498, "Member 'USocialMenu_Entry_Self_C::InteractionButton' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, LoadingContainer) == 0x0004A0, "Member 'USocialMenu_Entry_Self_C::LoadingContainer' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, LoadingVideoWidget) == 0x0004A8, "Member 'USocialMenu_Entry_Self_C::LoadingVideoWidget' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, Name_SocialMenu_Entry_Self_C) == 0x0004B0, "Member 'USocialMenu_Entry_Self_C::Name_SocialMenu_Entry_Self_C' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, PartyLeaderIcon) == 0x0004B8, "Member 'USocialMenu_Entry_Self_C::PartyLeaderIcon' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, PlatformIcon) == 0x0004C0, "Member 'USocialMenu_Entry_Self_C::PlatformIcon' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, PlayerLevelBox) == 0x0004C8, "Member 'USocialMenu_Entry_Self_C::PlayerLevelBox' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, PlayerLevelText) == 0x0004D0, "Member 'USocialMenu_Entry_Self_C::PlayerLevelText' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, ProfileIcon) == 0x0004D8, "Member 'USocialMenu_Entry_Self_C::ProfileIcon' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, ProfileIconBackground) == 0x0004E0, "Member 'USocialMenu_Entry_Self_C::ProfileIconBackground' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, bIsGamepad) == 0x0004E8, "Member 'USocialMenu_Entry_Self_C::bIsGamepad' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, bHovered) == 0x0004E9, "Member 'USocialMenu_Entry_Self_C::bHovered' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, bFocused) == 0x0004EA, "Member 'USocialMenu_Entry_Self_C::bFocused' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_Self_C, ContextualMenu) == 0x0004F0, "Member 'USocialMenu_Entry_Self_C::ContextualMenu' has a wrong offset!");

}

