#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_EntryList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SocialMenu_EntryList.SocialMenu_EntryList_C.UpdateGamepadPageNav
// 0x00D0 (0x00D0 - 0x0000)
struct SocialMenu_EntryList_C_UpdateGamepadPageNav final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369B[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0048(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369C[0x2];                                     // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_EntryList_C_UpdateGamepadPageNav) == 0x000008, "Wrong alignment on SocialMenu_EntryList_C_UpdateGamepadPageNav");
static_assert(sizeof(SocialMenu_EntryList_C_UpdateGamepadPageNav) == 0x0000D0, "Wrong size on SocialMenu_EntryList_C_UpdateGamepadPageNav");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, Temp_bool_Variable) == 0x000000, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, Temp_byte_Variable) == 0x000001, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, Temp_byte_Variable_1) == 0x000002, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, K2Node_MakeStruct_FormatArgumentData_1) == 0x000048, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, K2Node_MakeArray_Array) == 0x000088, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, CallFunc_Format_ReturnValue) == 0x000098, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000B0, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B5, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, CallFunc_SelectFloat_ReturnValue) == 0x0000B8, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, CallFunc_SelectFloat_ReturnValue_1) == 0x0000BC, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, CallFunc_GetMenuManager_ReturnValue) == 0x0000C0, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000C8, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x0000C9, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, CallFunc_BooleanAND_ReturnValue) == 0x0000CA, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateGamepadPageNav, K2Node_Select_Default) == 0x0000CB, "Member 'SocialMenu_EntryList_C_UpdateGamepadPageNav::K2Node_Select_Default' has a wrong offset!");

// Function SocialMenu_EntryList.SocialMenu_EntryList_C.SlotHasFocus
// 0x0050 (0x0050 - 0x0000)
struct SocialMenu_EntryList_C_SlotHasFocus final
{
public:
	int32                                         Column;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Row;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasFocus;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369E[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369F[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_SlotAsUniformGridSlot_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_EntryList_C_SlotHasFocus) == 0x000008, "Wrong alignment on SocialMenu_EntryList_C_SlotHasFocus");
static_assert(sizeof(SocialMenu_EntryList_C_SlotHasFocus) == 0x000050, "Wrong size on SocialMenu_EntryList_C_SlotHasFocus");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, Column) == 0x000000, "Member 'SocialMenu_EntryList_C_SlotHasFocus::Column' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, Row) == 0x000004, "Member 'SocialMenu_EntryList_C_SlotHasFocus::Row' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, bHasFocus) == 0x000008, "Member 'SocialMenu_EntryList_C_SlotHasFocus::bHasFocus' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'SocialMenu_EntryList_C_SlotHasFocus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'SocialMenu_EntryList_C_SlotHasFocus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'SocialMenu_EntryList_C_SlotHasFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'SocialMenu_EntryList_C_SlotHasFocus::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'SocialMenu_EntryList_C_SlotHasFocus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, CallFunc_Array_Get_Item) == 0x000030, "Member 'SocialMenu_EntryList_C_SlotHasFocus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'SocialMenu_EntryList_C_SlotHasFocus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, CallFunc_HasKeyboardFocus_ReturnValue) == 0x000039, "Member 'SocialMenu_EntryList_C_SlotHasFocus::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, CallFunc_SlotAsUniformGridSlot_ReturnValue) == 0x000040, "Member 'SocialMenu_EntryList_C_SlotHasFocus::CallFunc_SlotAsUniformGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'SocialMenu_EntryList_C_SlotHasFocus::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000049, "Member 'SocialMenu_EntryList_C_SlotHasFocus::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'SocialMenu_EntryList_C_SlotHasFocus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SlotHasFocus, CallFunc_BooleanAND_ReturnValue_1) == 0x00004B, "Member 'SocialMenu_EntryList_C_SlotHasFocus::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function SocialMenu_EntryList.SocialMenu_EntryList_C.SetupInitialFocus
// 0x0028 (0x0028 - 0x0000)
struct SocialMenu_EntryList_C_SetupInitialFocus final
{
public:
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A1[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_DynamicCast_AsUser_Widget;                  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_EntryList_C_SetupInitialFocus) == 0x000008, "Wrong alignment on SocialMenu_EntryList_C_SetupInitialFocus");
static_assert(sizeof(SocialMenu_EntryList_C_SetupInitialFocus) == 0x000028, "Wrong size on SocialMenu_EntryList_C_SetupInitialFocus");
static_assert(offsetof(SocialMenu_EntryList_C_SetupInitialFocus, CallFunc_GetChildrenCount_ReturnValue) == 0x000000, "Member 'SocialMenu_EntryList_C_SetupInitialFocus::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupInitialFocus, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'SocialMenu_EntryList_C_SetupInitialFocus::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupInitialFocus, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'SocialMenu_EntryList_C_SetupInitialFocus::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupInitialFocus, K2Node_DynamicCast_AsUser_Widget) == 0x000018, "Member 'SocialMenu_EntryList_C_SetupInitialFocus::K2Node_DynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupInitialFocus, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SocialMenu_EntryList_C_SetupInitialFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SocialMenu_EntryList.SocialMenu_EntryList_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct SocialMenu_EntryList_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(SocialMenu_EntryList_C_OnFocusReceived) == 0x000008, "Wrong alignment on SocialMenu_EntryList_C_OnFocusReceived");
static_assert(sizeof(SocialMenu_EntryList_C_OnFocusReceived) == 0x0001B0, "Wrong size on SocialMenu_EntryList_C_OnFocusReceived");
static_assert(offsetof(SocialMenu_EntryList_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'SocialMenu_EntryList_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'SocialMenu_EntryList_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'SocialMenu_EntryList_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'SocialMenu_EntryList_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function SocialMenu_EntryList.SocialMenu_EntryList_C.GetPreviousPageButtonEnabled
// 0x0003 (0x0003 - 0x0000)
struct SocialMenu_EntryList_C_GetPreviousPageButtonEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_EntryList_C_GetPreviousPageButtonEnabled) == 0x000001, "Wrong alignment on SocialMenu_EntryList_C_GetPreviousPageButtonEnabled");
static_assert(sizeof(SocialMenu_EntryList_C_GetPreviousPageButtonEnabled) == 0x000003, "Wrong size on SocialMenu_EntryList_C_GetPreviousPageButtonEnabled");
static_assert(offsetof(SocialMenu_EntryList_C_GetPreviousPageButtonEnabled, ReturnValue) == 0x000000, "Member 'SocialMenu_EntryList_C_GetPreviousPageButtonEnabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_GetPreviousPageButtonEnabled, CallFunc_Greater_IntInt_ReturnValue) == 0x000001, "Member 'SocialMenu_EntryList_C_GetPreviousPageButtonEnabled::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_GetPreviousPageButtonEnabled, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'SocialMenu_EntryList_C_GetPreviousPageButtonEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function SocialMenu_EntryList.SocialMenu_EntryList_C.GetNextPageButtonEnabled
// 0x000C (0x000C - 0x0000)
struct SocialMenu_EntryList_C_GetNextPageButtonEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A2[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_EntryList_C_GetNextPageButtonEnabled) == 0x000004, "Wrong alignment on SocialMenu_EntryList_C_GetNextPageButtonEnabled");
static_assert(sizeof(SocialMenu_EntryList_C_GetNextPageButtonEnabled) == 0x00000C, "Wrong size on SocialMenu_EntryList_C_GetNextPageButtonEnabled");
static_assert(offsetof(SocialMenu_EntryList_C_GetNextPageButtonEnabled, ReturnValue) == 0x000000, "Member 'SocialMenu_EntryList_C_GetNextPageButtonEnabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_GetNextPageButtonEnabled, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'SocialMenu_EntryList_C_GetNextPageButtonEnabled::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_GetNextPageButtonEnabled, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'SocialMenu_EntryList_C_GetNextPageButtonEnabled::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_GetNextPageButtonEnabled, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'SocialMenu_EntryList_C_GetNextPageButtonEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function SocialMenu_EntryList.SocialMenu_EntryList_C.SetupEditorPreview
// 0x0048 (0x0048 - 0x0000)
struct SocialMenu_EntryList_C_SetupEditorPreview final
{
public:
	EHorizontalAlignment                          Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialMenu_Entry_C*                    CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A4[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A5[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A6[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_1;                           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A7[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A8[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_EntryList_C_SetupEditorPreview) == 0x000008, "Wrong alignment on SocialMenu_EntryList_C_SetupEditorPreview");
static_assert(sizeof(SocialMenu_EntryList_C_SetupEditorPreview) == 0x000048, "Wrong size on SocialMenu_EntryList_C_SetupEditorPreview");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, Temp_byte_Variable) == 0x000000, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, Temp_byte_Variable_1) == 0x000001, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, Temp_bool_Variable) == 0x000002, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, Temp_byte_Variable_2) == 0x000003, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, CallFunc_Create_ReturnValue) == 0x000008, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, Temp_int_Variable) == 0x000010, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, Temp_bool_Variable_1) == 0x000018, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, CallFunc_Divide_IntInt_ReturnValue) == 0x00001C, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000025, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, CallFunc_Multiply_IntInt_ReturnValue) == 0x000028, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, K2Node_Select_Default) == 0x00002C, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000030, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, K2Node_Select_Default_1) == 0x000034, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000035, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, CallFunc_Percent_IntInt_ReturnValue) == 0x000038, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_SetupEditorPreview, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000040, "Member 'SocialMenu_EntryList_C_SetupEditorPreview::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");

// Function SocialMenu_EntryList.SocialMenu_EntryList_C.UpdateEntry
// 0x0060 (0x0060 - 0x0000)
struct SocialMenu_EntryList_C_UpdateEntry final
{
public:
	class UWidget*                                Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Column;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Row;                                               // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSlotHasFocus;                                     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SlotHasFocus_bHasFocus;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          Temp_byte_Variable_2;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_DynamicCast_AsUser_Widget;                  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A9[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36AA[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36AB[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_1;                           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36AC[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_SlotAsUniformGridSlot_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_EntryList_C_UpdateEntry) == 0x000008, "Wrong alignment on SocialMenu_EntryList_C_UpdateEntry");
static_assert(sizeof(SocialMenu_EntryList_C_UpdateEntry) == 0x000060, "Wrong size on SocialMenu_EntryList_C_UpdateEntry");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, Entry) == 0x000000, "Member 'SocialMenu_EntryList_C_UpdateEntry::Entry' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, Column) == 0x000008, "Member 'SocialMenu_EntryList_C_UpdateEntry::Column' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, Row) == 0x00000C, "Member 'SocialMenu_EntryList_C_UpdateEntry::Row' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, bSlotHasFocus) == 0x000010, "Member 'SocialMenu_EntryList_C_UpdateEntry::bSlotHasFocus' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, Temp_bool_Variable) == 0x000011, "Member 'SocialMenu_EntryList_C_UpdateEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, CallFunc_SlotHasFocus_bHasFocus) == 0x000012, "Member 'SocialMenu_EntryList_C_UpdateEntry::CallFunc_SlotHasFocus_bHasFocus' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000013, "Member 'SocialMenu_EntryList_C_UpdateEntry::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, Temp_byte_Variable) == 0x000014, "Member 'SocialMenu_EntryList_C_UpdateEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, Temp_byte_Variable_1) == 0x000015, "Member 'SocialMenu_EntryList_C_UpdateEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, Temp_bool_Variable_1) == 0x000016, "Member 'SocialMenu_EntryList_C_UpdateEntry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, Temp_byte_Variable_2) == 0x000017, "Member 'SocialMenu_EntryList_C_UpdateEntry::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, K2Node_DynamicCast_AsUser_Widget) == 0x000018, "Member 'SocialMenu_EntryList_C_UpdateEntry::K2Node_DynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SocialMenu_EntryList_C_UpdateEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'SocialMenu_EntryList_C_UpdateEntry::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000028, "Member 'SocialMenu_EntryList_C_UpdateEntry::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000030, "Member 'SocialMenu_EntryList_C_UpdateEntry::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, K2Node_Select_Default) == 0x000038, "Member 'SocialMenu_EntryList_C_UpdateEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, CallFunc_GetChildIndex_ReturnValue) == 0x00003C, "Member 'SocialMenu_EntryList_C_UpdateEntry::CallFunc_GetChildIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, K2Node_Select_Default_1) == 0x000040, "Member 'SocialMenu_EntryList_C_UpdateEntry::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, CallFunc_GetChildAt_ReturnValue) == 0x000048, "Member 'SocialMenu_EntryList_C_UpdateEntry::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, CallFunc_SlotAsUniformGridSlot_ReturnValue) == 0x000050, "Member 'SocialMenu_EntryList_C_UpdateEntry::CallFunc_SlotAsUniformGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_UpdateEntry, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000058, "Member 'SocialMenu_EntryList_C_UpdateEntry::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function SocialMenu_EntryList.SocialMenu_EntryList_C.Event_RemoveEntry
// 0x0008 (0x0008 - 0x0000)
struct SocialMenu_EntryList_C_Event_RemoveEntry final
{
public:
	class URBUserWidget*                          Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_EntryList_C_Event_RemoveEntry) == 0x000008, "Wrong alignment on SocialMenu_EntryList_C_Event_RemoveEntry");
static_assert(sizeof(SocialMenu_EntryList_C_Event_RemoveEntry) == 0x000008, "Wrong size on SocialMenu_EntryList_C_Event_RemoveEntry");
static_assert(offsetof(SocialMenu_EntryList_C_Event_RemoveEntry, Entry) == 0x000000, "Member 'SocialMenu_EntryList_C_Event_RemoveEntry::Entry' has a wrong offset!");

// Function SocialMenu_EntryList.SocialMenu_EntryList_C.Event_UpdateEntry
// 0x0010 (0x0010 - 0x0000)
struct SocialMenu_EntryList_C_Event_UpdateEntry final
{
public:
	class URBUserWidget*                          Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Column;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Row;                                               // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_EntryList_C_Event_UpdateEntry) == 0x000008, "Wrong alignment on SocialMenu_EntryList_C_Event_UpdateEntry");
static_assert(sizeof(SocialMenu_EntryList_C_Event_UpdateEntry) == 0x000010, "Wrong size on SocialMenu_EntryList_C_Event_UpdateEntry");
static_assert(offsetof(SocialMenu_EntryList_C_Event_UpdateEntry, Entry) == 0x000000, "Member 'SocialMenu_EntryList_C_Event_UpdateEntry::Entry' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_Event_UpdateEntry, Column) == 0x000008, "Member 'SocialMenu_EntryList_C_Event_UpdateEntry::Column' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_Event_UpdateEntry, Row) == 0x00000C, "Member 'SocialMenu_EntryList_C_Event_UpdateEntry::Row' has a wrong offset!");

// Function SocialMenu_EntryList.SocialMenu_EntryList_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_EntryList_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_EntryList_C_PreConstruct) == 0x000001, "Wrong alignment on SocialMenu_EntryList_C_PreConstruct");
static_assert(sizeof(SocialMenu_EntryList_C_PreConstruct) == 0x000001, "Wrong size on SocialMenu_EntryList_C_PreConstruct");
static_assert(offsetof(SocialMenu_EntryList_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SocialMenu_EntryList_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SocialMenu_EntryList.SocialMenu_EntryList_C.Event_OnDataPending
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_EntryList_C_Event_OnDataPending final
{
public:
	bool                                          bIsDataPending;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_EntryList_C_Event_OnDataPending) == 0x000001, "Wrong alignment on SocialMenu_EntryList_C_Event_OnDataPending");
static_assert(sizeof(SocialMenu_EntryList_C_Event_OnDataPending) == 0x000001, "Wrong size on SocialMenu_EntryList_C_Event_OnDataPending");
static_assert(offsetof(SocialMenu_EntryList_C_Event_OnDataPending, bIsDataPending) == 0x000000, "Member 'SocialMenu_EntryList_C_Event_OnDataPending::bIsDataPending' has a wrong offset!");

// Function SocialMenu_EntryList.SocialMenu_EntryList_C.Event_OnEmptyStateChanged
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_EntryList_C_Event_OnEmptyStateChanged final
{
public:
	bool                                          bIsEmpty;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_EntryList_C_Event_OnEmptyStateChanged) == 0x000001, "Wrong alignment on SocialMenu_EntryList_C_Event_OnEmptyStateChanged");
static_assert(sizeof(SocialMenu_EntryList_C_Event_OnEmptyStateChanged) == 0x000001, "Wrong size on SocialMenu_EntryList_C_Event_OnEmptyStateChanged");
static_assert(offsetof(SocialMenu_EntryList_C_Event_OnEmptyStateChanged, bIsEmpty) == 0x000000, "Member 'SocialMenu_EntryList_C_Event_OnEmptyStateChanged::bIsEmpty' has a wrong offset!");

// Function SocialMenu_EntryList.SocialMenu_EntryList_C.ExecuteUbergraph_SocialMenu_EntryList
// 0x00C0 (0x00C0 - 0x0000)
struct SocialMenu_EntryList_C_ExecuteUbergraph_SocialMenu_EntryList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_36AD[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBUserWidget*                          K2Node_Event_entry_1;                              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBUserWidget*                          K2Node_Event_entry;                                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_column;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_row;                                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USocialMenu_Entry_C*                    K2Node_DynamicCast_AsSocial_Menu_Entry;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsDataPending;                       // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36AE[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsEmpty;                             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36AF[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36B0[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_5;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_6;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36B1[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_EntryList_C_ExecuteUbergraph_SocialMenu_EntryList) == 0x000008, "Wrong alignment on SocialMenu_EntryList_C_ExecuteUbergraph_SocialMenu_EntryList");
static_assert(sizeof(SocialMenu_EntryList_C_ExecuteUbergraph_SocialMenu_EntryList) == 0x0000C0, "Wrong size on SocialMenu_EntryList_C_ExecuteUbergraph_SocialMenu_EntryList");
static_assert(offsetof(SocialMenu_EntryList_C_ExecuteUbergraph_SocialMenu_EntryList, EntryPoint) == 0x000000, "Member 'SocialMenu_EntryList_C_ExecuteUbergraph_SocialMenu_EntryList::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialMenu_EntryList_C_ExecuteUbergraph_SocialMenu_EntryList, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SocialMenu_EntryList_C_ExecuteUbergraph_SocialMenu_EntryList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
