#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_PartyWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialMenu_PartyWidget.SocialMenu_PartyWidget_C
// 0x0078 (0x03C0 - 0x0348)
class USocialMenu_PartyWidget_C final : public URBSocialMenuPartyWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowContent;                                       // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideLoading;                                       // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowLoading;                                       // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USocialMenu_PartyOption_C*              CrossplayOption;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Grid;                                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USocialMenu_PartyOption_C*              IgnoreInviteRequestsOption;                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExperimentBoardActionButton_C*         LeavePartyBtn;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingVideoWidget_C*                  LoadingVideoWidget;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USocialMenu_PartyOption_C*              PartyMembersCanInviteOption;                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USocialMenu_PartyOption_C*              PrivacyOption;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   EmptyText;                                         // 0x03A8(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_SocialMenu_PartyWidget(int32 EntryPoint);
	void Event_EntriesUpdated();
	void BndEvt__SocialMenu_PartyWidget_LeavePartyBtn_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature(int32 Value);
	void BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature(int32 Value);
	void BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature(int32 Value);
	void Event_RefreshPartyOptions();
	void Event_OnDataPending(bool bIsDataPending);
	void PreConstruct(bool IsDesignTime);
	void Event_Clear();
	void Event_UpdateEntry(class URBUserWidget* Entry, int32 Column, int32 Row);
	void Event_RemoveEntry(class URBUserWidget* Entry);
	void Construct();
	void Setup();
	void UpdateEntry(class UWidget* Entry, int32 Column, int32 Row);
	void Setup_Editor_Preview();
	void SetupPartySettings();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetupInitialFocus();
	void SlotHasFocus(int32 Column, int32 Row, bool* bHasFocus);
	ESlateVisibility GetLeavePartyBtnVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialMenu_PartyWidget_C">();
	}
	static class USocialMenu_PartyWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialMenu_PartyWidget_C>();
	}
};
static_assert(alignof(USocialMenu_PartyWidget_C) == 0x000008, "Wrong alignment on USocialMenu_PartyWidget_C");
static_assert(sizeof(USocialMenu_PartyWidget_C) == 0x0003C0, "Wrong size on USocialMenu_PartyWidget_C");
static_assert(offsetof(USocialMenu_PartyWidget_C, UberGraphFrame) == 0x000348, "Member 'USocialMenu_PartyWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyWidget_C, ShowContent) == 0x000350, "Member 'USocialMenu_PartyWidget_C::ShowContent' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyWidget_C, HideLoading) == 0x000358, "Member 'USocialMenu_PartyWidget_C::HideLoading' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyWidget_C, ShowLoading) == 0x000360, "Member 'USocialMenu_PartyWidget_C::ShowLoading' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyWidget_C, CrossplayOption) == 0x000368, "Member 'USocialMenu_PartyWidget_C::CrossplayOption' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyWidget_C, Grid) == 0x000370, "Member 'USocialMenu_PartyWidget_C::Grid' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyWidget_C, IgnoreInviteRequestsOption) == 0x000378, "Member 'USocialMenu_PartyWidget_C::IgnoreInviteRequestsOption' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyWidget_C, LeavePartyBtn) == 0x000380, "Member 'USocialMenu_PartyWidget_C::LeavePartyBtn' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyWidget_C, LoadingVideoWidget) == 0x000388, "Member 'USocialMenu_PartyWidget_C::LoadingVideoWidget' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyWidget_C, PartyMembersCanInviteOption) == 0x000390, "Member 'USocialMenu_PartyWidget_C::PartyMembersCanInviteOption' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyWidget_C, PrivacyOption) == 0x000398, "Member 'USocialMenu_PartyWidget_C::PrivacyOption' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyWidget_C, Title) == 0x0003A0, "Member 'USocialMenu_PartyWidget_C::Title' has a wrong offset!");
static_assert(offsetof(USocialMenu_PartyWidget_C, EmptyText) == 0x0003A8, "Member 'USocialMenu_PartyWidget_C::EmptyText' has a wrong offset!");

}

