#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialSettingsSubmenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function SocialSettingsSubmenu.SocialSettingsSubmenu_C.ExecuteUbergraph_SocialSettingsSubmenu
// 0x0058 (0x0058 - 0x0000)
struct SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_value_2;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_value_1;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_value;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPartyOwner_ReturnValue;                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldShowPartyOptions_ReturnValue;       // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyPrivacy                                 CallFunc_GetPartyPrivacy_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPartyInviteFilter_ReturnValue;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AllowPartyMemberInvites_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayGroupInvitationRequests_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayCrossplaySetting_ReturnValue; // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCrossplayEnabled_ReturnValue;           // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsGamepad;                           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidget*                          CallFunc_GetFirstFocusableUserWidgetChild_ReturnValue; // 0x0048(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu) == 0x000008, "Wrong alignment on SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu");
static_assert(sizeof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu) == 0x000058, "Wrong size on SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, EntryPoint) == 0x000000, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, Temp_byte_Variable) == 0x000004, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, Temp_byte_Variable_1) == 0x000005, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, Temp_bool_Variable) == 0x000006, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, Temp_int_Variable) == 0x000008, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, Temp_int_Variable_1) == 0x00000C, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, Temp_bool_Variable_1) == 0x000010, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, Temp_byte_Variable_2) == 0x000011, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, Temp_byte_Variable_3) == 0x000012, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, Temp_bool_Variable_2) == 0x000013, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, Temp_byte_Variable_4) == 0x000014, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, Temp_byte_Variable_5) == 0x000015, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, K2Node_ComponentBoundEvent_value_2) == 0x000018, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::K2Node_ComponentBoundEvent_value_2' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, K2Node_ComponentBoundEvent_value_1) == 0x00001C, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::K2Node_ComponentBoundEvent_value_1' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, K2Node_ComponentBoundEvent_value) == 0x000020, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::K2Node_ComponentBoundEvent_value' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, Temp_bool_Variable_3) == 0x000024, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, CallFunc_IsPartyOwner_ReturnValue) == 0x000025, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::CallFunc_IsPartyOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, CallFunc_ShouldShowPartyOptions_ReturnValue) == 0x000026, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::CallFunc_ShouldShowPartyOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, K2Node_Select_Default) == 0x000027, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, CallFunc_GetPartyPrivacy_ReturnValue) == 0x000028, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::CallFunc_GetPartyPrivacy_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, CallFunc_GetPartyInviteFilter_ReturnValue) == 0x00002C, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::CallFunc_GetPartyInviteFilter_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, CallFunc_AllowPartyMemberInvites_ReturnValue) == 0x000030, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::CallFunc_AllowPartyMemberInvites_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, K2Node_Select_Default_1) == 0x000034, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, CallFunc_ShouldDisplayGroupInvitationRequests_ReturnValue) == 0x000038, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::CallFunc_ShouldDisplayGroupInvitationRequests_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, K2Node_Select_Default_2) == 0x000039, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, CallFunc_ShouldDisplayCrossplaySetting_ReturnValue) == 0x00003A, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::CallFunc_ShouldDisplayCrossplaySetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, CallFunc_IsCrossplayEnabled_ReturnValue) == 0x00003B, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::CallFunc_IsCrossplayEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, K2Node_Select_Default_3) == 0x00003C, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, CallFunc_SelectInt_ReturnValue) == 0x000040, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, K2Node_Event_bIsGamepad) == 0x000044, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::K2Node_Event_bIsGamepad' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, CallFunc_GetFirstFocusableUserWidgetChild_ReturnValue) == 0x000048, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::CallFunc_GetFirstFocusableUserWidgetChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'SocialSettingsSubmenu_C_ExecuteUbergraph_SocialSettingsSubmenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SocialSettingsSubmenu.SocialSettingsSubmenu_C.Event_InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct SocialSettingsSubmenu_C_Event_InputSourceChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialSettingsSubmenu_C_Event_InputSourceChanged) == 0x000001, "Wrong alignment on SocialSettingsSubmenu_C_Event_InputSourceChanged");
static_assert(sizeof(SocialSettingsSubmenu_C_Event_InputSourceChanged) == 0x000001, "Wrong size on SocialSettingsSubmenu_C_Event_InputSourceChanged");
static_assert(offsetof(SocialSettingsSubmenu_C_Event_InputSourceChanged, bIsGamepad) == 0x000000, "Member 'SocialSettingsSubmenu_C_Event_InputSourceChanged::bIsGamepad' has a wrong offset!");

// Function SocialSettingsSubmenu.SocialSettingsSubmenu_C.BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SocialSettingsSubmenu_C_BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialSettingsSubmenu_C_BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong alignment on SocialSettingsSubmenu_C_BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature");
static_assert(sizeof(SocialSettingsSubmenu_C_BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong size on SocialSettingsSubmenu_C_BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature");
static_assert(offsetof(SocialSettingsSubmenu_C_BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature, Value) == 0x000000, "Member 'SocialSettingsSubmenu_C_BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature::Value' has a wrong offset!");

// Function SocialSettingsSubmenu.SocialSettingsSubmenu_C.BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SocialSettingsSubmenu_C_BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialSettingsSubmenu_C_BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong alignment on SocialSettingsSubmenu_C_BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature");
static_assert(sizeof(SocialSettingsSubmenu_C_BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong size on SocialSettingsSubmenu_C_BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature");
static_assert(offsetof(SocialSettingsSubmenu_C_BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature, Value) == 0x000000, "Member 'SocialSettingsSubmenu_C_BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature::Value' has a wrong offset!");

// Function SocialSettingsSubmenu.SocialSettingsSubmenu_C.BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SocialSettingsSubmenu_C_BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialSettingsSubmenu_C_BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong alignment on SocialSettingsSubmenu_C_BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature");
static_assert(sizeof(SocialSettingsSubmenu_C_BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong size on SocialSettingsSubmenu_C_BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature");
static_assert(offsetof(SocialSettingsSubmenu_C_BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature, Value) == 0x000000, "Member 'SocialSettingsSubmenu_C_BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature::Value' has a wrong offset!");

// Function SocialSettingsSubmenu.SocialSettingsSubmenu_C.OnFocusReceived
// 0x01C8 (0x01C8 - 0x0000)
struct SocialSettingsSubmenu_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UWidget*                          CallFunc_GetFirstFocusableUserWidgetChild_ReturnValue; // 0x0100(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0110(0x00B8)()
};
static_assert(alignof(SocialSettingsSubmenu_C_OnFocusReceived) == 0x000008, "Wrong alignment on SocialSettingsSubmenu_C_OnFocusReceived");
static_assert(sizeof(SocialSettingsSubmenu_C_OnFocusReceived) == 0x0001C8, "Wrong size on SocialSettingsSubmenu_C_OnFocusReceived");
static_assert(offsetof(SocialSettingsSubmenu_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'SocialSettingsSubmenu_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'SocialSettingsSubmenu_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'SocialSettingsSubmenu_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_OnFocusReceived, CallFunc_GetMenuManager_ReturnValue) == 0x0000F8, "Member 'SocialSettingsSubmenu_C_OnFocusReceived::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_OnFocusReceived, CallFunc_GetFirstFocusableUserWidgetChild_ReturnValue) == 0x000100, "Member 'SocialSettingsSubmenu_C_OnFocusReceived::CallFunc_GetFirstFocusableUserWidgetChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_OnFocusReceived, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000108, "Member 'SocialSettingsSubmenu_C_OnFocusReceived::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialSettingsSubmenu_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000110, "Member 'SocialSettingsSubmenu_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function SocialSettingsSubmenu.SocialSettingsSubmenu_C.GetPrivacyValue
// 0x0004 (0x0004 - 0x0000)
struct SocialSettingsSubmenu_C_GetPrivacyValue final
{
public:
	int32                                         PrivacyValue_0;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialSettingsSubmenu_C_GetPrivacyValue) == 0x000004, "Wrong alignment on SocialSettingsSubmenu_C_GetPrivacyValue");
static_assert(sizeof(SocialSettingsSubmenu_C_GetPrivacyValue) == 0x000004, "Wrong size on SocialSettingsSubmenu_C_GetPrivacyValue");
static_assert(offsetof(SocialSettingsSubmenu_C_GetPrivacyValue, PrivacyValue_0) == 0x000000, "Member 'SocialSettingsSubmenu_C_GetPrivacyValue::PrivacyValue_0' has a wrong offset!");

// Function SocialSettingsSubmenu.SocialSettingsSubmenu_C.GetPartyMembersCanInviteValue
// 0x0004 (0x0004 - 0x0000)
struct SocialSettingsSubmenu_C_GetPartyMembersCanInviteValue final
{
public:
	int32                                         PrivacyValue_0;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialSettingsSubmenu_C_GetPartyMembersCanInviteValue) == 0x000004, "Wrong alignment on SocialSettingsSubmenu_C_GetPartyMembersCanInviteValue");
static_assert(sizeof(SocialSettingsSubmenu_C_GetPartyMembersCanInviteValue) == 0x000004, "Wrong size on SocialSettingsSubmenu_C_GetPartyMembersCanInviteValue");
static_assert(offsetof(SocialSettingsSubmenu_C_GetPartyMembersCanInviteValue, PrivacyValue_0) == 0x000000, "Member 'SocialSettingsSubmenu_C_GetPartyMembersCanInviteValue::PrivacyValue_0' has a wrong offset!");

// Function SocialSettingsSubmenu.SocialSettingsSubmenu_C.GetIgnoreInviteRequestsValue
// 0x0004 (0x0004 - 0x0000)
struct SocialSettingsSubmenu_C_GetIgnoreInviteRequestsValue final
{
public:
	int32                                         PrivacyValue_0;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialSettingsSubmenu_C_GetIgnoreInviteRequestsValue) == 0x000004, "Wrong alignment on SocialSettingsSubmenu_C_GetIgnoreInviteRequestsValue");
static_assert(sizeof(SocialSettingsSubmenu_C_GetIgnoreInviteRequestsValue) == 0x000004, "Wrong size on SocialSettingsSubmenu_C_GetIgnoreInviteRequestsValue");
static_assert(offsetof(SocialSettingsSubmenu_C_GetIgnoreInviteRequestsValue, PrivacyValue_0) == 0x000000, "Member 'SocialSettingsSubmenu_C_GetIgnoreInviteRequestsValue::PrivacyValue_0' has a wrong offset!");

}

