#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenuCharacter

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SocialMenuCharacter.SocialMenuCharacter_C.SetBatteryMaterial
// 0x0020 (0x0020 - 0x0000)
struct SocialMenuCharacter_C_SetBatteryMaterial final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3368[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnknown_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3369[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenuCharacter_C_SetBatteryMaterial) == 0x000008, "Wrong alignment on SocialMenuCharacter_C_SetBatteryMaterial");
static_assert(sizeof(SocialMenuCharacter_C_SetBatteryMaterial) == 0x000020, "Wrong size on SocialMenuCharacter_C_SetBatteryMaterial");
static_assert(offsetof(SocialMenuCharacter_C_SetBatteryMaterial, Temp_bool_Variable) == 0x000000, "Member 'SocialMenuCharacter_C_SetBatteryMaterial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetBatteryMaterial, Temp_object_Variable) == 0x000008, "Member 'SocialMenuCharacter_C_SetBatteryMaterial::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetBatteryMaterial, CallFunc_IsUnknown_ReturnValue) == 0x000010, "Member 'SocialMenuCharacter_C_SetBatteryMaterial::CallFunc_IsUnknown_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetBatteryMaterial, K2Node_Select_Default) == 0x000018, "Member 'SocialMenuCharacter_C_SetBatteryMaterial::K2Node_Select_Default' has a wrong offset!");

// Function SocialMenuCharacter.SocialMenuCharacter_C.GetFacePose
// 0x0008 (0x0008 - 0x0000)
struct SocialMenuCharacter_C_GetFacePose final
{
public:
	class UPoseAsset*                             Param_FacePoseAsset;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenuCharacter_C_GetFacePose) == 0x000008, "Wrong alignment on SocialMenuCharacter_C_GetFacePose");
static_assert(sizeof(SocialMenuCharacter_C_GetFacePose) == 0x000008, "Wrong size on SocialMenuCharacter_C_GetFacePose");
static_assert(offsetof(SocialMenuCharacter_C_GetFacePose, Param_FacePoseAsset) == 0x000000, "Member 'SocialMenuCharacter_C_GetFacePose::Param_FacePoseAsset' has a wrong offset!");

// Function SocialMenuCharacter.SocialMenuCharacter_C.TryShow
// 0x0001 (0x0001 - 0x0000)
struct SocialMenuCharacter_C_TryShow final
{
public:
	bool                                          CallFunc_IsWaitingForRessources_ReturnValue;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenuCharacter_C_TryShow) == 0x000001, "Wrong alignment on SocialMenuCharacter_C_TryShow");
static_assert(sizeof(SocialMenuCharacter_C_TryShow) == 0x000001, "Wrong size on SocialMenuCharacter_C_TryShow");
static_assert(offsetof(SocialMenuCharacter_C_TryShow, CallFunc_IsWaitingForRessources_ReturnValue) == 0x000000, "Member 'SocialMenuCharacter_C_TryShow::CallFunc_IsWaitingForRessources_ReturnValue' has a wrong offset!");

// Function SocialMenuCharacter.SocialMenuCharacter_C.RefreshRigs
// 0x0060 (0x0060 - 0x0000)
struct SocialMenuCharacter_C_RefreshRigs final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	EActiveSkillType                              CallFunc_GetActiveSkillType_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_336A[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ARBActiveSkill>             CallFunc_GetActiveSkillClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_336B[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenuCharacter_C_RefreshRigs) == 0x000010, "Wrong alignment on SocialMenuCharacter_C_RefreshRigs");
static_assert(sizeof(SocialMenuCharacter_C_RefreshRigs) == 0x000060, "Wrong size on SocialMenuCharacter_C_RefreshRigs");
static_assert(offsetof(SocialMenuCharacter_C_RefreshRigs, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'SocialMenuCharacter_C_RefreshRigs::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_RefreshRigs, CallFunc_GetActiveSkillType_ReturnValue) == 0x000030, "Member 'SocialMenuCharacter_C_RefreshRigs::CallFunc_GetActiveSkillType_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_RefreshRigs, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'SocialMenuCharacter_C_RefreshRigs::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_RefreshRigs, CallFunc_GetActiveSkillClass_ReturnValue) == 0x000038, "Member 'SocialMenuCharacter_C_RefreshRigs::CallFunc_GetActiveSkillClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_RefreshRigs, K2Node_ClassDynamicCast_AsActor) == 0x000040, "Member 'SocialMenuCharacter_C_RefreshRigs::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_RefreshRigs, K2Node_ClassDynamicCast_bSuccess) == 0x000048, "Member 'SocialMenuCharacter_C_RefreshRigs::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_RefreshRigs, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'SocialMenuCharacter_C_RefreshRigs::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_RefreshRigs, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'SocialMenuCharacter_C_RefreshRigs::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function SocialMenuCharacter.SocialMenuCharacter_C.SetLightingChannels
// 0x0118 (0x0118 - 0x0000)
struct SocialMenuCharacter_C_SetLightingChannels final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESocialMenuSceneActorSlot                     Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_336C[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_336D[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_336E[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_336F[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue_2;    // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_2;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_3;                         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3370[0x2];                                     // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESocialMenuSceneActorSlot                     CallFunc_GetSlot_ReturnValue;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLightingChannels                      K2Node_Select_Default;                             // 0x00D2(0x0001)(NoDestructor)
	uint8                                         Pad_3371[0x5];                                     // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URBSpotLightComponent*>          K2Node_MakeArray_Array_1;                          // 0x00D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class URBSpotLightComponent*                  CallFunc_Array_Get_Item_4;                         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3372[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue_3;    // 0x00F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_5;                         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenuCharacter_C_SetLightingChannels) == 0x000008, "Wrong alignment on SocialMenuCharacter_C_SetLightingChannels");
static_assert(sizeof(SocialMenuCharacter_C_SetLightingChannels) == 0x000118, "Wrong size on SocialMenuCharacter_C_SetLightingChannels");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'SocialMenuCharacter_C_SetLightingChannels::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, Temp_int_Array_Index_Variable) == 0x000008, "Member 'SocialMenuCharacter_C_SetLightingChannels::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, Temp_byte_Variable) == 0x00000C, "Member 'SocialMenuCharacter_C_SetLightingChannels::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'SocialMenuCharacter_C_SetLightingChannels::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'SocialMenuCharacter_C_SetLightingChannels::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, Temp_int_Array_Index_Variable_2) == 0x00001C, "Member 'SocialMenuCharacter_C_SetLightingChannels::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, Temp_int_Loop_Counter_Variable_2) == 0x000020, "Member 'SocialMenuCharacter_C_SetLightingChannels::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, Temp_int_Array_Index_Variable_3) == 0x000028, "Member 'SocialMenuCharacter_C_SetLightingChannels::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, Temp_int_Loop_Counter_Variable_3) == 0x00002C, "Member 'SocialMenuCharacter_C_SetLightingChannels::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Add_IntInt_ReturnValue_3) == 0x000030, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, Temp_int_Loop_Counter_Variable_4) == 0x000034, "Member 'SocialMenuCharacter_C_SetLightingChannels::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Add_IntInt_ReturnValue_4) == 0x000038, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, Temp_int_Array_Index_Variable_4) == 0x00003C, "Member 'SocialMenuCharacter_C_SetLightingChannels::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, Temp_int_Loop_Counter_Variable_5) == 0x000040, "Member 'SocialMenuCharacter_C_SetLightingChannels::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Add_IntInt_ReturnValue_5) == 0x000044, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, K2Node_MakeArray_Array) == 0x000048, "Member 'SocialMenuCharacter_C_SetLightingChannels::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, Temp_int_Array_Index_Variable_5) == 0x000060, "Member 'SocialMenuCharacter_C_SetLightingChannels::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000068, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Array_Get_Item) == 0x000078, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000090, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_K2_GetComponentsByClass_ReturnValue_2) == 0x0000A0, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_K2_GetComponentsByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Array_Get_Item_2) == 0x0000B0, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Array_Get_Item_3) == 0x0000B8, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Array_Length_ReturnValue_2) == 0x0000C4, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C8, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000C9, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Array_Length_ReturnValue_3) == 0x0000CC, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000D0, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_GetSlot_ReturnValue) == 0x0000D1, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_GetSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, K2Node_Select_Default) == 0x0000D2, "Member 'SocialMenuCharacter_C_SetLightingChannels::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, K2Node_MakeArray_Array_1) == 0x0000D8, "Member 'SocialMenuCharacter_C_SetLightingChannels::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Array_Get_Item_4) == 0x0000E8, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Array_Length_ReturnValue_4) == 0x0000F0, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Less_IntInt_ReturnValue_4) == 0x0000F4, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_K2_GetComponentsByClass_ReturnValue_3) == 0x0000F8, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_K2_GetComponentsByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Array_Get_Item_5) == 0x000108, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Array_Length_ReturnValue_5) == 0x000110, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_SetLightingChannels, CallFunc_Less_IntInt_ReturnValue_5) == 0x000114, "Member 'SocialMenuCharacter_C_SetLightingChannels::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");

// Function SocialMenuCharacter.SocialMenuCharacter_C.OverrideActorMaterials
// 0x0090 (0x0090 - 0x0000)
struct SocialMenuCharacter_C_OverrideActorMaterials final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3373[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3374[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3375[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3376[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3377[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenuCharacter_C_OverrideActorMaterials) == 0x000008, "Wrong alignment on SocialMenuCharacter_C_OverrideActorMaterials");
static_assert(sizeof(SocialMenuCharacter_C_OverrideActorMaterials) == 0x000090, "Wrong size on SocialMenuCharacter_C_OverrideActorMaterials");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, Actor) == 0x000000, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::Actor' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, Temp_int_Array_Index_Variable) == 0x000024, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, Temp_int_Variable) == 0x000028, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_Add_IntInt_ReturnValue_2) == 0x000040, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, Temp_int_Array_Index_Variable_1) == 0x000044, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_Array_Get_Item) == 0x000048, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_GetChildrenComponents_Children) == 0x000050, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_Less_IntInt_ReturnValue_1) == 0x000070, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, K2Node_DynamicCast_AsPrimitive_Component) == 0x000078, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_GetNumMaterials_ReturnValue) == 0x000084, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_Subtract_IntInt_ReturnValue) == 0x000088, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_OverrideActorMaterials, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00008C, "Member 'SocialMenuCharacter_C_OverrideActorMaterials::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function SocialMenuCharacter.SocialMenuCharacter_C.SetupMaterialOverride
// 0x0001 (0x0001 - 0x0000)
struct SocialMenuCharacter_C_SetupMaterialOverride final
{
public:
	bool                                          CallFunc_IsUnknown_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenuCharacter_C_SetupMaterialOverride) == 0x000001, "Wrong alignment on SocialMenuCharacter_C_SetupMaterialOverride");
static_assert(sizeof(SocialMenuCharacter_C_SetupMaterialOverride) == 0x000001, "Wrong size on SocialMenuCharacter_C_SetupMaterialOverride");
static_assert(offsetof(SocialMenuCharacter_C_SetupMaterialOverride, CallFunc_IsUnknown_ReturnValue) == 0x000000, "Member 'SocialMenuCharacter_C_SetupMaterialOverride::CallFunc_IsUnknown_ReturnValue' has a wrong offset!");

// Function SocialMenuCharacter.SocialMenuCharacter_C.CleanSpawnedRigs
// 0x0002 (0x0002 - 0x0000)
struct SocialMenuCharacter_C_CleanSpawnedRigs final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenuCharacter_C_CleanSpawnedRigs) == 0x000001, "Wrong alignment on SocialMenuCharacter_C_CleanSpawnedRigs");
static_assert(sizeof(SocialMenuCharacter_C_CleanSpawnedRigs) == 0x000002, "Wrong size on SocialMenuCharacter_C_CleanSpawnedRigs");
static_assert(offsetof(SocialMenuCharacter_C_CleanSpawnedRigs, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'SocialMenuCharacter_C_CleanSpawnedRigs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_CleanSpawnedRigs, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'SocialMenuCharacter_C_CleanSpawnedRigs::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function SocialMenuCharacter.SocialMenuCharacter_C.CleanExtraMeshes
// 0x0020 (0x0020 - 0x0000)
struct SocialMenuCharacter_C_CleanExtraMeshes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3378[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenuCharacter_C_CleanExtraMeshes) == 0x000008, "Wrong alignment on SocialMenuCharacter_C_CleanExtraMeshes");
static_assert(sizeof(SocialMenuCharacter_C_CleanExtraMeshes) == 0x000020, "Wrong size on SocialMenuCharacter_C_CleanExtraMeshes");
static_assert(offsetof(SocialMenuCharacter_C_CleanExtraMeshes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SocialMenuCharacter_C_CleanExtraMeshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_CleanExtraMeshes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SocialMenuCharacter_C_CleanExtraMeshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_CleanExtraMeshes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SocialMenuCharacter_C_CleanExtraMeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_CleanExtraMeshes, CallFunc_Array_Get_Item) == 0x000010, "Member 'SocialMenuCharacter_C_CleanExtraMeshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_CleanExtraMeshes, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'SocialMenuCharacter_C_CleanExtraMeshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_CleanExtraMeshes, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'SocialMenuCharacter_C_CleanExtraMeshes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_CleanExtraMeshes, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'SocialMenuCharacter_C_CleanExtraMeshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function SocialMenuCharacter.SocialMenuCharacter_C.RefreshPlayerCusto
// 0x0018 (0x0018 - 0x0000)
struct SocialMenuCharacter_C_RefreshPlayerCusto final
{
public:
	TArray<class URBPlayerCustomizationOption*>   NewLocalVar_0;                                     // 0x0000(0x0010)(Edit, BlueprintVisible)
	class URBPawnCustomizationManager*            CallFunc_GetPawnCustomizationManager_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenuCharacter_C_RefreshPlayerCusto) == 0x000008, "Wrong alignment on SocialMenuCharacter_C_RefreshPlayerCusto");
static_assert(sizeof(SocialMenuCharacter_C_RefreshPlayerCusto) == 0x000018, "Wrong size on SocialMenuCharacter_C_RefreshPlayerCusto");
static_assert(offsetof(SocialMenuCharacter_C_RefreshPlayerCusto, NewLocalVar_0) == 0x000000, "Member 'SocialMenuCharacter_C_RefreshPlayerCusto::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_RefreshPlayerCusto, CallFunc_GetPawnCustomizationManager_ReturnValue) == 0x000010, "Member 'SocialMenuCharacter_C_RefreshPlayerCusto::CallFunc_GetPawnCustomizationManager_ReturnValue' has a wrong offset!");

// Function SocialMenuCharacter.SocialMenuCharacter_C.Show
// 0x00B0 (0x00B0 - 0x0000)
struct SocialMenuCharacter_C_Show final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3379[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_2;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_337A[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_337B[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_3;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_337C[0x2];                                     // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenuCharacter_C_Show) == 0x000008, "Wrong alignment on SocialMenuCharacter_C_Show");
static_assert(sizeof(SocialMenuCharacter_C_Show) == 0x0000B0, "Wrong size on SocialMenuCharacter_C_Show");
static_assert(offsetof(SocialMenuCharacter_C_Show, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SocialMenuCharacter_C_Show::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SocialMenuCharacter_C_Show::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SocialMenuCharacter_C_Show::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'SocialMenuCharacter_C_Show::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, Temp_int_Loop_Counter_Variable_2) == 0x000010, "Member 'SocialMenuCharacter_C_Show::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'SocialMenuCharacter_C_Show::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Add_IntInt_ReturnValue_2) == 0x000018, "Member 'SocialMenuCharacter_C_Show::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'SocialMenuCharacter_C_Show::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, Temp_int_Array_Index_Variable_2) == 0x000020, "Member 'SocialMenuCharacter_C_Show::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, Temp_int_Loop_Counter_Variable_3) == 0x000024, "Member 'SocialMenuCharacter_C_Show::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Add_IntInt_ReturnValue_3) == 0x000028, "Member 'SocialMenuCharacter_C_Show::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, Temp_int_Array_Index_Variable_3) == 0x00002C, "Member 'SocialMenuCharacter_C_Show::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, K2Node_MakeArray_Array) == 0x000030, "Member 'SocialMenuCharacter_C_Show::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Array_Get_Item) == 0x000040, "Member 'SocialMenuCharacter_C_Show::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'SocialMenuCharacter_C_Show::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'SocialMenuCharacter_C_Show::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000058, "Member 'SocialMenuCharacter_C_Show::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Array_Get_Item_2) == 0x000068, "Member 'SocialMenuCharacter_C_Show::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'SocialMenuCharacter_C_Show::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000078, "Member 'SocialMenuCharacter_C_Show::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'SocialMenuCharacter_C_Show::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Array_Get_Item_3) == 0x000090, "Member 'SocialMenuCharacter_C_Show::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'SocialMenuCharacter_C_Show::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Array_Length_ReturnValue_2) == 0x00009C, "Member 'SocialMenuCharacter_C_Show::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A0, "Member 'SocialMenuCharacter_C_Show::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000A1, "Member 'SocialMenuCharacter_C_Show::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Array_Length_ReturnValue_3) == 0x0000A4, "Member 'SocialMenuCharacter_C_Show::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000A8, "Member 'SocialMenuCharacter_C_Show::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_IsVisible_ReturnValue) == 0x0000A9, "Member 'SocialMenuCharacter_C_Show::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenuCharacter_C_Show, CallFunc_Not_PreBool_ReturnValue) == 0x0000AA, "Member 'SocialMenuCharacter_C_Show::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function SocialMenuCharacter.SocialMenuCharacter_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct SocialMenuCharacter_C_UserConstructionScript final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenuCharacter_C_UserConstructionScript) == 0x000008, "Wrong alignment on SocialMenuCharacter_C_UserConstructionScript");
static_assert(sizeof(SocialMenuCharacter_C_UserConstructionScript) == 0x000008, "Wrong size on SocialMenuCharacter_C_UserConstructionScript");
static_assert(offsetof(SocialMenuCharacter_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'SocialMenuCharacter_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");

// Function SocialMenuCharacter.SocialMenuCharacter_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct SocialMenuCharacter_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenuCharacter_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on SocialMenuCharacter_C_ReceiveEndPlay");
static_assert(sizeof(SocialMenuCharacter_C_ReceiveEndPlay) == 0x000001, "Wrong size on SocialMenuCharacter_C_ReceiveEndPlay");
static_assert(offsetof(SocialMenuCharacter_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'SocialMenuCharacter_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function SocialMenuCharacter.SocialMenuCharacter_C.OnExtraCustomizationMeshesAddedForSlot
// 0x0018 (0x0018 - 0x0000)
struct SocialMenuCharacter_C_OnExtraCustomizationMeshesAddedForSlot final
{
public:
	TArray<class USkeletalMeshComponent*>         AddedExtraMeshes;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EPlayerCustomizationSlot                      Param_Slot;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenuCharacter_C_OnExtraCustomizationMeshesAddedForSlot) == 0x000008, "Wrong alignment on SocialMenuCharacter_C_OnExtraCustomizationMeshesAddedForSlot");
static_assert(sizeof(SocialMenuCharacter_C_OnExtraCustomizationMeshesAddedForSlot) == 0x000018, "Wrong size on SocialMenuCharacter_C_OnExtraCustomizationMeshesAddedForSlot");
