#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_Entry_Party

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.ExecuteUbergraph_SocialMenu_Entry_Party
// 0x0030 (0x0030 - 0x0000)
struct SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0014(0x0008)(NoDestructor)
	uint8                                         Pad_2C12[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanOpenContextualMenu_ReturnValue;        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party) == 0x000008, "Wrong alignment on SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party");
static_assert(sizeof(SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party) == 0x000030, "Wrong size on SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party");
static_assert(offsetof(SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party, EntryPoint) == 0x000000, "Member 'SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party, K2Node_Event_InFocusEvent) == 0x000014, "Member 'SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party, CallFunc_GetMenuManager_ReturnValue) == 0x000020, "Member 'SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x00002A, "Member 'SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party, CallFunc_IsValid_ReturnValue_2) == 0x00002B, "Member 'SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party, CallFunc_CanOpenContextualMenu_ReturnValue) == 0x00002C, "Member 'SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party::CallFunc_CanOpenContextualMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party, CallFunc_IsValid_ReturnValue_3) == 0x00002D, "Member 'SocialMenu_Entry_Party_C_ExecuteUbergraph_SocialMenu_Entry_Party::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct SocialMenu_Entry_Party_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Party_C_OnFocusLost) == 0x000004, "Wrong alignment on SocialMenu_Entry_Party_C_OnFocusLost");
static_assert(sizeof(SocialMenu_Entry_Party_C_OnFocusLost) == 0x000008, "Wrong size on SocialMenu_Entry_Party_C_OnFocusLost");
static_assert(offsetof(SocialMenu_Entry_Party_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'SocialMenu_Entry_Party_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.SetPlatformIcon
// 0x0010 (0x0010 - 0x0000)
struct SocialMenu_Entry_Party_C_SetPlatformIcon final
{
public:
	EProfilePlatform                              CallFunc_GetPlatform_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C13[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetPlatformIconTexture_texture;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_Entry_Party_C_SetPlatformIcon) == 0x000008, "Wrong alignment on SocialMenu_Entry_Party_C_SetPlatformIcon");
static_assert(sizeof(SocialMenu_Entry_Party_C_SetPlatformIcon) == 0x000010, "Wrong size on SocialMenu_Entry_Party_C_SetPlatformIcon");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetPlatformIcon, CallFunc_GetPlatform_ReturnValue) == 0x000000, "Member 'SocialMenu_Entry_Party_C_SetPlatformIcon::CallFunc_GetPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetPlatformIcon, CallFunc_GetPlatformIconTexture_texture) == 0x000008, "Member 'SocialMenu_Entry_Party_C_SetPlatformIcon::CallFunc_GetPlatformIconTexture_texture' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.SetName
// 0x0038 (0x0038 - 0x0000)
struct SocialMenu_Entry_Party_C_SetName final
{
public:
	class FString                                 CallFunc_GetName_ReturnValue;                      // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FormatPlayerDisplayName_formatedDisplayName; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(SocialMenu_Entry_Party_C_SetName) == 0x000008, "Wrong alignment on SocialMenu_Entry_Party_C_SetName");
static_assert(sizeof(SocialMenu_Entry_Party_C_SetName) == 0x000038, "Wrong size on SocialMenu_Entry_Party_C_SetName");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetName, CallFunc_GetName_ReturnValue) == 0x000000, "Member 'SocialMenu_Entry_Party_C_SetName::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetName, CallFunc_FormatPlayerDisplayName_formatedDisplayName) == 0x000010, "Member 'SocialMenu_Entry_Party_C_SetName::CallFunc_FormatPlayerDisplayName_formatedDisplayName' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetName, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'SocialMenu_Entry_Party_C_SetName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.SetInGameStatus
// 0x00D0 (0x00D0 - 0x0000)
struct SocialMenu_Entry_Party_C_SetInGameStatus final
{
public:
	struct FSlateColor                            OfflineTextColor;                                  // 0x0000(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            OnlineStatusColor;                                 // 0x0028(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            OnlineNameColor;                                   // 0x0050(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            OnlineBackgroundTine;                              // 0x0078(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            OfflineBackgroundTint;                             // 0x00A0(0x0028)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsInGame_ReturnValue;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Party_C_SetInGameStatus) == 0x000008, "Wrong alignment on SocialMenu_Entry_Party_C_SetInGameStatus");
static_assert(sizeof(SocialMenu_Entry_Party_C_SetInGameStatus) == 0x0000D0, "Wrong size on SocialMenu_Entry_Party_C_SetInGameStatus");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetInGameStatus, OfflineTextColor) == 0x000000, "Member 'SocialMenu_Entry_Party_C_SetInGameStatus::OfflineTextColor' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetInGameStatus, OnlineStatusColor) == 0x000028, "Member 'SocialMenu_Entry_Party_C_SetInGameStatus::OnlineStatusColor' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetInGameStatus, OnlineNameColor) == 0x000050, "Member 'SocialMenu_Entry_Party_C_SetInGameStatus::OnlineNameColor' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetInGameStatus, OnlineBackgroundTine) == 0x000078, "Member 'SocialMenu_Entry_Party_C_SetInGameStatus::OnlineBackgroundTine' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetInGameStatus, OfflineBackgroundTint) == 0x0000A0, "Member 'SocialMenu_Entry_Party_C_SetInGameStatus::OfflineBackgroundTint' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetInGameStatus, CallFunc_IsInGame_ReturnValue) == 0x0000C8, "Member 'SocialMenu_Entry_Party_C_SetInGameStatus::CallFunc_IsInGame_ReturnValue' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.SetBackground
// 0x0088 (0x0088 - 0x0000)
struct SocialMenu_Entry_Party_C_SetBackground final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C14[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C15[0x5];                                     // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0060(0x0028)()
};
static_assert(alignof(SocialMenu_Entry_Party_C_SetBackground) == 0x000008, "Wrong alignment on SocialMenu_Entry_Party_C_SetBackground");
static_assert(sizeof(SocialMenu_Entry_Party_C_SetBackground) == 0x000088, "Wrong size on SocialMenu_Entry_Party_C_SetBackground");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetBackground, Temp_bool_Variable) == 0x000000, "Member 'SocialMenu_Entry_Party_C_SetBackground::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetBackground, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'SocialMenu_Entry_Party_C_SetBackground::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetBackground, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'SocialMenu_Entry_Party_C_SetBackground::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetBackground, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000058, "Member 'SocialMenu_Entry_Party_C_SetBackground::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetBackground, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'SocialMenu_Entry_Party_C_SetBackground::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetBackground, CallFunc_BooleanOR_ReturnValue) == 0x00005A, "Member 'SocialMenu_Entry_Party_C_SetBackground::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetBackground, K2Node_Select_Default) == 0x000060, "Member 'SocialMenu_Entry_Party_C_SetBackground::K2Node_Select_Default' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.ShowLoading
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_Entry_Party_C_ShowLoading final
{
public:
	bool                                          CallFunc_IsOperationPending_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Party_C_ShowLoading) == 0x000001, "Wrong alignment on SocialMenu_Entry_Party_C_ShowLoading");
static_assert(sizeof(SocialMenu_Entry_Party_C_ShowLoading) == 0x000001, "Wrong size on SocialMenu_Entry_Party_C_ShowLoading");
static_assert(offsetof(SocialMenu_Entry_Party_C_ShowLoading, CallFunc_IsOperationPending_ReturnValue) == 0x000000, "Member 'SocialMenu_Entry_Party_C_ShowLoading::CallFunc_IsOperationPending_ReturnValue' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.SetPartyLeaderIcon
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_Entry_Party_C_SetPartyLeaderIcon final
{
public:
	bool                                          CallFunc_IsPartyOwner_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Party_C_SetPartyLeaderIcon) == 0x000001, "Wrong alignment on SocialMenu_Entry_Party_C_SetPartyLeaderIcon");
static_assert(sizeof(SocialMenu_Entry_Party_C_SetPartyLeaderIcon) == 0x000001, "Wrong size on SocialMenu_Entry_Party_C_SetPartyLeaderIcon");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetPartyLeaderIcon, CallFunc_IsPartyOwner_ReturnValue) == 0x000000, "Member 'SocialMenu_Entry_Party_C_SetPartyLeaderIcon::CallFunc_IsPartyOwner_ReturnValue' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.SetProfileIcon
// 0x0218 (0x0218 - 0x0000)
struct SocialMenu_Entry_Party_C_SetProfileIcon final
{
public:
	struct FSlateBrush                            DefaultProfileIcon;                                // 0x0000(0x0088)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C16[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0090(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00B8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00E0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0108(0x0028)()
	bool                                          Temp_bool_Variable;                                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C17[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0138(0x0028)()
	bool                                          Temp_bool_Variable_1;                              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C18[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C19[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetReleaseCount_ReturnValue;              // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1A[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x01A0(0x0028)()
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1B[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetPlayerIcon_ReturnValue;                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1C[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x01E8(0x0028)()
	class UTexture2D*                             K2Node_Select_Default_3;                           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_Entry_Party_C_SetProfileIcon) == 0x000008, "Wrong alignment on SocialMenu_Entry_Party_C_SetProfileIcon");
static_assert(sizeof(SocialMenu_Entry_Party_C_SetProfileIcon) == 0x000218, "Wrong size on SocialMenu_Entry_Party_C_SetProfileIcon");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, DefaultProfileIcon) == 0x000000, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::DefaultProfileIcon' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, Temp_int_Variable) == 0x000088, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, K2Node_MakeStruct_SlateColor) == 0x000090, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, K2Node_MakeStruct_SlateColor_1) == 0x0000B8, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, K2Node_MakeStruct_SlateColor_2) == 0x0000E0, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, K2Node_MakeStruct_SlateColor_3) == 0x000108, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, Temp_bool_Variable) == 0x000130, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, K2Node_MakeStruct_SlateColor_4) == 0x000138, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, Temp_bool_Variable_1) == 0x000160, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, Temp_object_Variable) == 0x000168, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, Temp_int_Variable_1) == 0x000170, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, Temp_object_Variable_1) == 0x000178, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, Temp_object_Variable_2) == 0x000180, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, Temp_object_Variable_3) == 0x000188, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, Temp_object_Variable_4) == 0x000190, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, CallFunc_GetReleaseCount_ReturnValue) == 0x000198, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::CallFunc_GetReleaseCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, K2Node_Select_Default) == 0x0001A0, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, K2Node_Select_Default_1) == 0x0001C8, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001D0, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, CallFunc_GetPlayerIcon_ReturnValue) == 0x0001D8, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::CallFunc_GetPlayerIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, CallFunc_IsValid_ReturnValue) == 0x0001E0, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, K2Node_Select_Default_2) == 0x0001E8, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetProfileIcon, K2Node_Select_Default_3) == 0x000210, "Member 'SocialMenu_Entry_Party_C_SetProfileIcon::K2Node_Select_Default_3' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.CreateContextualMenu
// 0x0010 (0x0010 - 0x0000)
struct SocialMenu_Entry_Party_C_CreateContextualMenu final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USocialMenu_ContextualMenu_C*           CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_Entry_Party_C_CreateContextualMenu) == 0x000008, "Wrong alignment on SocialMenu_Entry_Party_C_CreateContextualMenu");
static_assert(sizeof(SocialMenu_Entry_Party_C_CreateContextualMenu) == 0x000010, "Wrong size on SocialMenu_Entry_Party_C_CreateContextualMenu");
static_assert(offsetof(SocialMenu_Entry_Party_C_CreateContextualMenu, ReturnValue) == 0x000000, "Member 'SocialMenu_Entry_Party_C_CreateContextualMenu::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_CreateContextualMenu, CallFunc_Create_ReturnValue) == 0x000008, "Member 'SocialMenu_Entry_Party_C_CreateContextualMenu::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.SetPlayerLevel
// 0x00B0 (0x00B0 - 0x0000)
struct SocialMenu_Entry_Party_C_SetPlayerLevel final
{
public:
	struct FSlateBrush                            DefaultProfileIcon;                                // 0x0000(0x0088)(Edit, BlueprintVisible)
	int32                                         CallFunc_GetPlayerLevel_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1D[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0090(0x0018)()
	bool                                          CallFunc_HasPlayerLevel_ReturnValue;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Party_C_SetPlayerLevel) == 0x000008, "Wrong alignment on SocialMenu_Entry_Party_C_SetPlayerLevel");
static_assert(sizeof(SocialMenu_Entry_Party_C_SetPlayerLevel) == 0x0000B0, "Wrong size on SocialMenu_Entry_Party_C_SetPlayerLevel");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetPlayerLevel, DefaultProfileIcon) == 0x000000, "Member 'SocialMenu_Entry_Party_C_SetPlayerLevel::DefaultProfileIcon' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetPlayerLevel, CallFunc_GetPlayerLevel_ReturnValue) == 0x000088, "Member 'SocialMenu_Entry_Party_C_SetPlayerLevel::CallFunc_GetPlayerLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetPlayerLevel, CallFunc_Conv_IntToText_ReturnValue) == 0x000090, "Member 'SocialMenu_Entry_Party_C_SetPlayerLevel::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetPlayerLevel, CallFunc_HasPlayerLevel_ReturnValue) == 0x0000A8, "Member 'SocialMenu_Entry_Party_C_SetPlayerLevel::CallFunc_HasPlayerLevel_ReturnValue' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.RefreshContextualMenu
// 0x0006 (0x0006 - 0x0000)
struct SocialMenu_Entry_Party_C_RefreshContextualMenu final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOpenContextualMenu_ReturnValue;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Party_C_RefreshContextualMenu) == 0x000001, "Wrong alignment on SocialMenu_Entry_Party_C_RefreshContextualMenu");
static_assert(sizeof(SocialMenu_Entry_Party_C_RefreshContextualMenu) == 0x000006, "Wrong size on SocialMenu_Entry_Party_C_RefreshContextualMenu");
static_assert(offsetof(SocialMenu_Entry_Party_C_RefreshContextualMenu, Temp_bool_Variable) == 0x000000, "Member 'SocialMenu_Entry_Party_C_RefreshContextualMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_RefreshContextualMenu, Temp_byte_Variable) == 0x000001, "Member 'SocialMenu_Entry_Party_C_RefreshContextualMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_RefreshContextualMenu, Temp_byte_Variable_1) == 0x000002, "Member 'SocialMenu_Entry_Party_C_RefreshContextualMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_RefreshContextualMenu, CallFunc_CanOpenContextualMenu_ReturnValue) == 0x000003, "Member 'SocialMenu_Entry_Party_C_RefreshContextualMenu::CallFunc_CanOpenContextualMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_RefreshContextualMenu, K2Node_Select_Default) == 0x000004, "Member 'SocialMenu_Entry_Party_C_RefreshContextualMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_RefreshContextualMenu, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'SocialMenu_Entry_Party_C_RefreshContextualMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.SetHovered
// 0x0006 (0x0006 - 0x0000)
struct SocialMenu_Entry_Party_C_SetHovered final
{
public:
	bool                                          bInHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWasConsideredHovered;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered_1; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Party_C_SetHovered) == 0x000001, "Wrong alignment on SocialMenu_Entry_Party_C_SetHovered");
static_assert(sizeof(SocialMenu_Entry_Party_C_SetHovered) == 0x000006, "Wrong size on SocialMenu_Entry_Party_C_SetHovered");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetHovered, bInHovered) == 0x000000, "Member 'SocialMenu_Entry_Party_C_SetHovered::bInHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetHovered, bWasConsideredHovered) == 0x000001, "Member 'SocialMenu_Entry_Party_C_SetHovered::bWasConsideredHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetHovered, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000002, "Member 'SocialMenu_Entry_Party_C_SetHovered::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetHovered, CallFunc_IsConsideredHovered_bConsideredHovered_1) == 0x000003, "Member 'SocialMenu_Entry_Party_C_SetHovered::CallFunc_IsConsideredHovered_bConsideredHovered_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetHovered, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000004, "Member 'SocialMenu_Entry_Party_C_SetHovered::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetHovered, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x000005, "Member 'SocialMenu_Entry_Party_C_SetHovered::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.SetFocused
// 0x0030 (0x0030 - 0x0000)
struct SocialMenu_Entry_Party_C_SetFocused final
{
public:
	bool                                          bInFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWasConsideredHovered;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanOpenContextualMenu_ReturnValue;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1E[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered_1; // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Party_C_SetFocused) == 0x000008, "Wrong alignment on SocialMenu_Entry_Party_C_SetFocused");
static_assert(sizeof(SocialMenu_Entry_Party_C_SetFocused) == 0x000030, "Wrong size on SocialMenu_Entry_Party_C_SetFocused");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetFocused, bInFocused) == 0x000000, "Member 'SocialMenu_Entry_Party_C_SetFocused::bInFocused' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetFocused, bWasConsideredHovered) == 0x000001, "Member 'SocialMenu_Entry_Party_C_SetFocused::bWasConsideredHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetFocused, CallFunc_CanOpenContextualMenu_ReturnValue) == 0x000002, "Member 'SocialMenu_Entry_Party_C_SetFocused::CallFunc_CanOpenContextualMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetFocused, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'SocialMenu_Entry_Party_C_SetFocused::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetFocused, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'SocialMenu_Entry_Party_C_SetFocused::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetFocused, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000028, "Member 'SocialMenu_Entry_Party_C_SetFocused::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetFocused, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000029, "Member 'SocialMenu_Entry_Party_C_SetFocused::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetFocused, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x00002A, "Member 'SocialMenu_Entry_Party_C_SetFocused::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_SetFocused, CallFunc_IsConsideredHovered_bConsideredHovered_1) == 0x00002B, "Member 'SocialMenu_Entry_Party_C_SetFocused::CallFunc_IsConsideredHovered_bConsideredHovered_1' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.IsConsideredHovered
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_Entry_Party_C_IsConsideredHovered final
{
public:
	bool                                          bConsideredHovered;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Party_C_IsConsideredHovered) == 0x000001, "Wrong alignment on SocialMenu_Entry_Party_C_IsConsideredHovered");
static_assert(sizeof(SocialMenu_Entry_Party_C_IsConsideredHovered) == 0x000001, "Wrong size on SocialMenu_Entry_Party_C_IsConsideredHovered");
static_assert(offsetof(SocialMenu_Entry_Party_C_IsConsideredHovered, bConsideredHovered) == 0x000000, "Member 'SocialMenu_Entry_Party_C_IsConsideredHovered::bConsideredHovered' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct SocialMenu_Entry_Party_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(SocialMenu_Entry_Party_C_OnFocusReceived) == 0x000008, "Wrong alignment on SocialMenu_Entry_Party_C_OnFocusReceived");
static_assert(sizeof(SocialMenu_Entry_Party_C_OnFocusReceived) == 0x0001B0, "Wrong size on SocialMenu_Entry_Party_C_OnFocusReceived");
static_assert(offsetof(SocialMenu_Entry_Party_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'SocialMenu_Entry_Party_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'SocialMenu_Entry_Party_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'SocialMenu_Entry_Party_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'SocialMenu_Entry_Party_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function SocialMenu_Entry_Party.SocialMenu_Entry_Party_C.ShowNotificationIcon
// 0x0007 (0x0007 - 0x0000)
struct SocialMenu_Entry_Party_C_ShowNotificationIcon final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFlag_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasFlag_ReturnValue_1;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_Entry_Party_C_ShowNotificationIcon) == 0x000001, "Wrong alignment on SocialMenu_Entry_Party_C_ShowNotificationIcon");
static_assert(sizeof(SocialMenu_Entry_Party_C_ShowNotificationIcon) == 0x000007, "Wrong size on SocialMenu_Entry_Party_C_ShowNotificationIcon");
static_assert(offsetof(SocialMenu_Entry_Party_C_ShowNotificationIcon, Temp_bool_Variable) == 0x000000, "Member 'SocialMenu_Entry_Party_C_ShowNotificationIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_ShowNotificationIcon, Temp_byte_Variable) == 0x000001, "Member 'SocialMenu_Entry_Party_C_ShowNotificationIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Party_C_ShowNotificationIcon, Temp_byte_Variable_1) == 0x000002, "Member 'SocialMenu_Entry_Party_C_ShowNotificationIcon::Temp_byte_Variable_1' has a wrong offset!");
