#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_Entry_Link

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SocialMenu_Entry_Link.SocialMenu_Entry_Link_C.ExecuteUbergraph_SocialMenu_Entry_Link
// 0x0030 (0x0030 - 0x0000)
struct SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0024(0x0008)(NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link) == 0x000008, "Wrong alignment on SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link");
static_assert(sizeof(SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link) == 0x000030, "Wrong size on SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link");
static_assert(offsetof(SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link, EntryPoint) == 0x000000, "Member 'SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link, CallFunc_GetMenuManager_ReturnValue) == 0x000018, "Member 'SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000022, "Member 'SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link, K2Node_Event_InFocusEvent) == 0x000024, "Member 'SocialMenu_Entry_Link_C_ExecuteUbergraph_SocialMenu_Entry_Link::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function SocialMenu_Entry_Link.SocialMenu_Entry_Link_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct SocialMenu_Entry_Link_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Link_C_OnFocusLost) == 0x000004, "Wrong alignment on SocialMenu_Entry_Link_C_OnFocusLost");
static_assert(sizeof(SocialMenu_Entry_Link_C_OnFocusLost) == 0x000008, "Wrong size on SocialMenu_Entry_Link_C_OnFocusLost");
static_assert(offsetof(SocialMenu_Entry_Link_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'SocialMenu_Entry_Link_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function SocialMenu_Entry_Link.SocialMenu_Entry_Link_C.Refresh
// 0x0088 (0x0088 - 0x0000)
struct SocialMenu_Entry_Link_C_Refresh final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	bool                                          CallFunc_CanSendPartyInvite_ReturnValue;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0060(0x0028)()
};
static_assert(alignof(SocialMenu_Entry_Link_C_Refresh) == 0x000008, "Wrong alignment on SocialMenu_Entry_Link_C_Refresh");
static_assert(sizeof(SocialMenu_Entry_Link_C_Refresh) == 0x000088, "Wrong size on SocialMenu_Entry_Link_C_Refresh");
static_assert(offsetof(SocialMenu_Entry_Link_C_Refresh, Temp_bool_Variable) == 0x000000, "Member 'SocialMenu_Entry_Link_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_Refresh, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'SocialMenu_Entry_Link_C_Refresh::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_Refresh, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'SocialMenu_Entry_Link_C_Refresh::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_Refresh, CallFunc_CanSendPartyInvite_ReturnValue) == 0x000058, "Member 'SocialMenu_Entry_Link_C_Refresh::CallFunc_CanSendPartyInvite_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_Refresh, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000059, "Member 'SocialMenu_Entry_Link_C_Refresh::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_Refresh, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'SocialMenu_Entry_Link_C_Refresh::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_Refresh, CallFunc_SelectFloat_ReturnValue) == 0x00005C, "Member 'SocialMenu_Entry_Link_C_Refresh::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_Refresh, K2Node_Select_Default) == 0x000060, "Member 'SocialMenu_Entry_Link_C_Refresh::K2Node_Select_Default' has a wrong offset!");

// Function SocialMenu_Entry_Link.SocialMenu_Entry_Link_C.SetHovered
// 0x0006 (0x0006 - 0x0000)
struct SocialMenu_Entry_Link_C_SetHovered final
{
public:
	bool                                          bInHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWasConsideredHovered;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered_1; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Link_C_SetHovered) == 0x000001, "Wrong alignment on SocialMenu_Entry_Link_C_SetHovered");
static_assert(sizeof(SocialMenu_Entry_Link_C_SetHovered) == 0x000006, "Wrong size on SocialMenu_Entry_Link_C_SetHovered");
static_assert(offsetof(SocialMenu_Entry_Link_C_SetHovered, bInHovered) == 0x000000, "Member 'SocialMenu_Entry_Link_C_SetHovered::bInHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_SetHovered, bWasConsideredHovered) == 0x000001, "Member 'SocialMenu_Entry_Link_C_SetHovered::bWasConsideredHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_SetHovered, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000002, "Member 'SocialMenu_Entry_Link_C_SetHovered::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_SetHovered, CallFunc_IsConsideredHovered_bConsideredHovered_1) == 0x000003, "Member 'SocialMenu_Entry_Link_C_SetHovered::CallFunc_IsConsideredHovered_bConsideredHovered_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_SetHovered, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000004, "Member 'SocialMenu_Entry_Link_C_SetHovered::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_SetHovered, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x000005, "Member 'SocialMenu_Entry_Link_C_SetHovered::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");

// Function SocialMenu_Entry_Link.SocialMenu_Entry_Link_C.SetFocused
// 0x0030 (0x0030 - 0x0000)
struct SocialMenu_Entry_Link_C_SetFocused final
{
public:
	bool                                          bInFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWasConsideredHovered;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered_1; // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Link_C_SetFocused) == 0x000008, "Wrong alignment on SocialMenu_Entry_Link_C_SetFocused");
static_assert(sizeof(SocialMenu_Entry_Link_C_SetFocused) == 0x000030, "Wrong size on SocialMenu_Entry_Link_C_SetFocused");
static_assert(offsetof(SocialMenu_Entry_Link_C_SetFocused, bInFocused) == 0x000000, "Member 'SocialMenu_Entry_Link_C_SetFocused::bInFocused' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_SetFocused, bWasConsideredHovered) == 0x000001, "Member 'SocialMenu_Entry_Link_C_SetFocused::bWasConsideredHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_SetFocused, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'SocialMenu_Entry_Link_C_SetFocused::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_SetFocused, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'SocialMenu_Entry_Link_C_SetFocused::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_SetFocused, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000028, "Member 'SocialMenu_Entry_Link_C_SetFocused::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_SetFocused, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000029, "Member 'SocialMenu_Entry_Link_C_SetFocused::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_SetFocused, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x00002A, "Member 'SocialMenu_Entry_Link_C_SetFocused::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_SetFocused, CallFunc_IsConsideredHovered_bConsideredHovered_1) == 0x00002B, "Member 'SocialMenu_Entry_Link_C_SetFocused::CallFunc_IsConsideredHovered_bConsideredHovered_1' has a wrong offset!");

// Function SocialMenu_Entry_Link.SocialMenu_Entry_Link_C.IsConsideredHovered
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_Entry_Link_C_IsConsideredHovered final
{
public:
	bool                                          bConsideredHovered;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Entry_Link_C_IsConsideredHovered) == 0x000001, "Wrong alignment on SocialMenu_Entry_Link_C_IsConsideredHovered");
static_assert(sizeof(SocialMenu_Entry_Link_C_IsConsideredHovered) == 0x000001, "Wrong size on SocialMenu_Entry_Link_C_IsConsideredHovered");
static_assert(offsetof(SocialMenu_Entry_Link_C_IsConsideredHovered, bConsideredHovered) == 0x000000, "Member 'SocialMenu_Entry_Link_C_IsConsideredHovered::bConsideredHovered' has a wrong offset!");

// Function SocialMenu_Entry_Link.SocialMenu_Entry_Link_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct SocialMenu_Entry_Link_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(SocialMenu_Entry_Link_C_OnFocusReceived) == 0x000008, "Wrong alignment on SocialMenu_Entry_Link_C_OnFocusReceived");
static_assert(sizeof(SocialMenu_Entry_Link_C_OnFocusReceived) == 0x0001B0, "Wrong size on SocialMenu_Entry_Link_C_OnFocusReceived");
static_assert(offsetof(SocialMenu_Entry_Link_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'SocialMenu_Entry_Link_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'SocialMenu_Entry_Link_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'SocialMenu_Entry_Link_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Entry_Link_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'SocialMenu_Entry_Link_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

