#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_Entry_PartyInvite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialMenu_Entry_PartyInvite.SocialMenu_Entry_PartyInvite_C
// 0x00A0 (0x0510 - 0x0470)
class USocialMenu_Entry_PartyInvite_C final : public URBSocialMenuEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WaitingAnimation;                                  // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage_1;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_1;                                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InteractionButton;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                LoadingContainer;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingVideoWidget_C*                  LoadingVideoWidget;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_SocialMenu_Entry_PartyInvite_C;               // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OnlineStatusText;                                  // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlatformIcon;                                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PlayerLevelBox;                                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerLevelText;                                   // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PresenceAndDetailsText;                            // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProfileIcon;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProfileIconBackground;                             // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SendInviteButton;                                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SentOverlay;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsGamepad;                                        // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHovered;                                          // 0x0509(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFocused;                                          // 0x050A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	class FText UpdatePresenceAndDetailsText();
	void GetPartyText(class FText* DetailsText);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void IsConsideredHovered(bool* bConsideredHovered);
	void SetFocused(bool bInFocused);
	void SetHovered(bool bInHovered);
	void SetPlayerLevel();
	class UUserWidget* CreateContextualMenu();
	void SetProfileIcon();
	bool IsPendingFriendRequest();
	void ShowLoading();
	void SetBackground();
	void SetOnlineStatus();
	void SetName();
	void SetPlatformIcon();
	void Event_Refresh();
	void BndEvt__SendInviteButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void Construct();
	void OnMenuInputSourceChanged();
	void Destruct();
	void BndEvt__SocialMenu_Entry_PartyInvite_InteractionButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SocialMenu_Entry_PartyInvite_InteractionButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SocialMenu_Entry_PartyInvite_InteractionButton_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_SocialMenu_Entry_PartyInvite(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialMenu_Entry_PartyInvite_C">();
	}
	static class USocialMenu_Entry_PartyInvite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialMenu_Entry_PartyInvite_C>();
	}
};
static_assert(alignof(USocialMenu_Entry_PartyInvite_C) == 0x000008, "Wrong alignment on USocialMenu_Entry_PartyInvite_C");
static_assert(sizeof(USocialMenu_Entry_PartyInvite_C) == 0x000510, "Wrong size on USocialMenu_Entry_PartyInvite_C");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, UberGraphFrame) == 0x000470, "Member 'USocialMenu_Entry_PartyInvite_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, WaitingAnimation) == 0x000478, "Member 'USocialMenu_Entry_PartyInvite_C::WaitingAnimation' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, BackgroundImage) == 0x000480, "Member 'USocialMenu_Entry_PartyInvite_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, BackgroundImage_1) == 0x000488, "Member 'USocialMenu_Entry_PartyInvite_C::BackgroundImage_1' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, Icon) == 0x000490, "Member 'USocialMenu_Entry_PartyInvite_C::Icon' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, Icon_1) == 0x000498, "Member 'USocialMenu_Entry_PartyInvite_C::Icon_1' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, InteractionButton) == 0x0004A0, "Member 'USocialMenu_Entry_PartyInvite_C::InteractionButton' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, LoadingContainer) == 0x0004A8, "Member 'USocialMenu_Entry_PartyInvite_C::LoadingContainer' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, LoadingVideoWidget) == 0x0004B0, "Member 'USocialMenu_Entry_PartyInvite_C::LoadingVideoWidget' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, Name_SocialMenu_Entry_PartyInvite_C) == 0x0004B8, "Member 'USocialMenu_Entry_PartyInvite_C::Name_SocialMenu_Entry_PartyInvite_C' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, OnlineStatusText) == 0x0004C0, "Member 'USocialMenu_Entry_PartyInvite_C::OnlineStatusText' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, PlatformIcon) == 0x0004C8, "Member 'USocialMenu_Entry_PartyInvite_C::PlatformIcon' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, PlayerLevelBox) == 0x0004D0, "Member 'USocialMenu_Entry_PartyInvite_C::PlayerLevelBox' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, PlayerLevelText) == 0x0004D8, "Member 'USocialMenu_Entry_PartyInvite_C::PlayerLevelText' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, PresenceAndDetailsText) == 0x0004E0, "Member 'USocialMenu_Entry_PartyInvite_C::PresenceAndDetailsText' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, ProfileIcon) == 0x0004E8, "Member 'USocialMenu_Entry_PartyInvite_C::ProfileIcon' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, ProfileIconBackground) == 0x0004F0, "Member 'USocialMenu_Entry_PartyInvite_C::ProfileIconBackground' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, SendInviteButton) == 0x0004F8, "Member 'USocialMenu_Entry_PartyInvite_C::SendInviteButton' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, SentOverlay) == 0x000500, "Member 'USocialMenu_Entry_PartyInvite_C::SentOverlay' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, bIsGamepad) == 0x000508, "Member 'USocialMenu_Entry_PartyInvite_C::bIsGamepad' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, bHovered) == 0x000509, "Member 'USocialMenu_Entry_PartyInvite_C::bHovered' has a wrong offset!");
static_assert(offsetof(USocialMenu_Entry_PartyInvite_C, bFocused) == 0x00050A, "Member 'USocialMenu_Entry_PartyInvite_C::bFocused' has a wrong offset!");

}

