#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_PartyWidget

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.ExecuteUbergraph_SocialMenu_PartyWidget
// 0x0070 (0x0070 - 0x0000)
struct SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D34[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2D35[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBUserWidget*                          K2Node_Event_entry_1;                              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBUserWidget*                          K2Node_Event_entry;                                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_column;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_row;                                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsDataPending;                       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D36[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_value_2;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_value_1;                // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_value;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D37[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPopUpConfirmCancelWidget*            CallFunc_CreatePopUpConfirmCancel_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget) == 0x000008, "Wrong alignment on SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget");
static_assert(sizeof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget) == 0x000070, "Wrong size on SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, EntryPoint) == 0x000000, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, K2Node_Event_entry_1) == 0x000028, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::K2Node_Event_entry_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, K2Node_Event_entry) == 0x000030, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::K2Node_Event_entry' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, K2Node_Event_column) == 0x000038, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::K2Node_Event_column' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, K2Node_Event_row) == 0x00003C, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::K2Node_Event_row' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, CallFunc_RemoveChild_ReturnValue) == 0x000040, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, K2Node_Event_IsDesignTime) == 0x000041, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, K2Node_Event_bIsDataPending) == 0x000042, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::K2Node_Event_bIsDataPending' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000050, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, K2Node_ComponentBoundEvent_value_2) == 0x000058, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::K2Node_ComponentBoundEvent_value_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, K2Node_ComponentBoundEvent_value_1) == 0x00005C, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::K2Node_ComponentBoundEvent_value_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, K2Node_ComponentBoundEvent_value) == 0x000060, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::K2Node_ComponentBoundEvent_value' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget, CallFunc_CreatePopUpConfirmCancel_ReturnValue) == 0x000068, "Member 'SocialMenu_PartyWidget_C_ExecuteUbergraph_SocialMenu_PartyWidget::CallFunc_CreatePopUpConfirmCancel_ReturnValue' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SocialMenu_PartyWidget_C_BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_PartyWidget_C_BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong alignment on SocialMenu_PartyWidget_C_BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature");
static_assert(sizeof(SocialMenu_PartyWidget_C_BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong size on SocialMenu_PartyWidget_C_BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature");
static_assert(offsetof(SocialMenu_PartyWidget_C_BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature, Value) == 0x000000, "Member 'SocialMenu_PartyWidget_C_BndEvt__IgnoreInviteRequestsOption_K2Node_ComponentBoundEvent_2_OnValueUpdated__DelegateSignature::Value' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SocialMenu_PartyWidget_C_BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_PartyWidget_C_BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong alignment on SocialMenu_PartyWidget_C_BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature");
static_assert(sizeof(SocialMenu_PartyWidget_C_BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong size on SocialMenu_PartyWidget_C_BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature");
static_assert(offsetof(SocialMenu_PartyWidget_C_BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature, Value) == 0x000000, "Member 'SocialMenu_PartyWidget_C_BndEvt__PartyMembersCanInviteOption_K2Node_ComponentBoundEvent_1_OnValueUpdated__DelegateSignature::Value' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SocialMenu_PartyWidget_C_BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_PartyWidget_C_BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong alignment on SocialMenu_PartyWidget_C_BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature");
static_assert(sizeof(SocialMenu_PartyWidget_C_BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong size on SocialMenu_PartyWidget_C_BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature");
static_assert(offsetof(SocialMenu_PartyWidget_C_BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature, Value) == 0x000000, "Member 'SocialMenu_PartyWidget_C_BndEvt__PrivacyOption_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature::Value' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.Event_OnDataPending
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_PartyWidget_C_Event_OnDataPending final
{
public:
	bool                                          bIsDataPending;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_PartyWidget_C_Event_OnDataPending) == 0x000001, "Wrong alignment on SocialMenu_PartyWidget_C_Event_OnDataPending");
static_assert(sizeof(SocialMenu_PartyWidget_C_Event_OnDataPending) == 0x000001, "Wrong size on SocialMenu_PartyWidget_C_Event_OnDataPending");
static_assert(offsetof(SocialMenu_PartyWidget_C_Event_OnDataPending, bIsDataPending) == 0x000000, "Member 'SocialMenu_PartyWidget_C_Event_OnDataPending::bIsDataPending' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_PartyWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_PartyWidget_C_PreConstruct) == 0x000001, "Wrong alignment on SocialMenu_PartyWidget_C_PreConstruct");
static_assert(sizeof(SocialMenu_PartyWidget_C_PreConstruct) == 0x000001, "Wrong size on SocialMenu_PartyWidget_C_PreConstruct");
static_assert(offsetof(SocialMenu_PartyWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SocialMenu_PartyWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.Event_UpdateEntry
// 0x0010 (0x0010 - 0x0000)
struct SocialMenu_PartyWidget_C_Event_UpdateEntry final
{
public:
	class URBUserWidget*                          Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Column;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Row;                                               // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_PartyWidget_C_Event_UpdateEntry) == 0x000008, "Wrong alignment on SocialMenu_PartyWidget_C_Event_UpdateEntry");
static_assert(sizeof(SocialMenu_PartyWidget_C_Event_UpdateEntry) == 0x000010, "Wrong size on SocialMenu_PartyWidget_C_Event_UpdateEntry");
static_assert(offsetof(SocialMenu_PartyWidget_C_Event_UpdateEntry, Entry) == 0x000000, "Member 'SocialMenu_PartyWidget_C_Event_UpdateEntry::Entry' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Event_UpdateEntry, Column) == 0x000008, "Member 'SocialMenu_PartyWidget_C_Event_UpdateEntry::Column' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Event_UpdateEntry, Row) == 0x00000C, "Member 'SocialMenu_PartyWidget_C_Event_UpdateEntry::Row' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.Event_RemoveEntry
// 0x0008 (0x0008 - 0x0000)
struct SocialMenu_PartyWidget_C_Event_RemoveEntry final
{
public:
	class URBUserWidget*                          Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_PartyWidget_C_Event_RemoveEntry) == 0x000008, "Wrong alignment on SocialMenu_PartyWidget_C_Event_RemoveEntry");
static_assert(sizeof(SocialMenu_PartyWidget_C_Event_RemoveEntry) == 0x000008, "Wrong size on SocialMenu_PartyWidget_C_Event_RemoveEntry");
static_assert(offsetof(SocialMenu_PartyWidget_C_Event_RemoveEntry, Entry) == 0x000000, "Member 'SocialMenu_PartyWidget_C_Event_RemoveEntry::Entry' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.Setup
// 0x000A (0x000A - 0x0000)
struct SocialMenu_PartyWidget_C_Setup final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUINavigationRule                             Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINavigationRule                             Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINavigationRule                             K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowPartyOptions_ReturnValue;       // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_PartyWidget_C_Setup) == 0x000001, "Wrong alignment on SocialMenu_PartyWidget_C_Setup");
static_assert(sizeof(SocialMenu_PartyWidget_C_Setup) == 0x00000A, "Wrong size on SocialMenu_PartyWidget_C_Setup");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup, Temp_bool_Variable) == 0x000000, "Member 'SocialMenu_PartyWidget_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup, Temp_byte_Variable) == 0x000001, "Member 'SocialMenu_PartyWidget_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup, Temp_byte_Variable_1) == 0x000002, "Member 'SocialMenu_PartyWidget_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup, Temp_bool_Variable_1) == 0x000003, "Member 'SocialMenu_PartyWidget_C_Setup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup, Temp_byte_Variable_2) == 0x000004, "Member 'SocialMenu_PartyWidget_C_Setup::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup, Temp_byte_Variable_3) == 0x000005, "Member 'SocialMenu_PartyWidget_C_Setup::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup, K2Node_Select_Default) == 0x000006, "Member 'SocialMenu_PartyWidget_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup, CallFunc_ShouldShowPartyOptions_ReturnValue) == 0x000007, "Member 'SocialMenu_PartyWidget_C_Setup::CallFunc_ShouldShowPartyOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup, CallFunc_BooleanAND_ReturnValue) == 0x000008, "Member 'SocialMenu_PartyWidget_C_Setup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup, K2Node_Select_Default_1) == 0x000009, "Member 'SocialMenu_PartyWidget_C_Setup::K2Node_Select_Default_1' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.UpdateEntry
// 0x0048 (0x0048 - 0x0000)
struct SocialMenu_PartyWidget_C_UpdateEntry final
{
public:
	class UWidget*                                Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Column;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Row;                                               // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSlotHasFocus;                                     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SlotHasFocus_bHasFocus;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D38[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_DynamicCast_AsUser_Widget;                  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D39[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D3A[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_PartyWidget_C_UpdateEntry) == 0x000008, "Wrong alignment on SocialMenu_PartyWidget_C_UpdateEntry");
static_assert(sizeof(SocialMenu_PartyWidget_C_UpdateEntry) == 0x000048, "Wrong size on SocialMenu_PartyWidget_C_UpdateEntry");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateEntry, Entry) == 0x000000, "Member 'SocialMenu_PartyWidget_C_UpdateEntry::Entry' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateEntry, Column) == 0x000008, "Member 'SocialMenu_PartyWidget_C_UpdateEntry::Column' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateEntry, Row) == 0x00000C, "Member 'SocialMenu_PartyWidget_C_UpdateEntry::Row' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateEntry, bSlotHasFocus) == 0x000010, "Member 'SocialMenu_PartyWidget_C_UpdateEntry::bSlotHasFocus' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateEntry, CallFunc_SlotHasFocus_bHasFocus) == 0x000011, "Member 'SocialMenu_PartyWidget_C_UpdateEntry::CallFunc_SlotHasFocus_bHasFocus' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateEntry, CallFunc_Greater_IntInt_ReturnValue) == 0x000012, "Member 'SocialMenu_PartyWidget_C_UpdateEntry::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateEntry, K2Node_DynamicCast_AsUser_Widget) == 0x000018, "Member 'SocialMenu_PartyWidget_C_UpdateEntry::K2Node_DynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateEntry, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SocialMenu_PartyWidget_C_UpdateEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateEntry, CallFunc_GetChildIndex_ReturnValue) == 0x000024, "Member 'SocialMenu_PartyWidget_C_UpdateEntry::CallFunc_GetChildIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateEntry, CallFunc_GetChildAt_ReturnValue) == 0x000028, "Member 'SocialMenu_PartyWidget_C_UpdateEntry::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateEntry, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000030, "Member 'SocialMenu_PartyWidget_C_UpdateEntry::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateEntry, CallFunc_SlotAsGridSlot_ReturnValue) == 0x000038, "Member 'SocialMenu_PartyWidget_C_UpdateEntry::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateEntry, CallFunc_AddChildToGrid_ReturnValue) == 0x000040, "Member 'SocialMenu_PartyWidget_C_UpdateEntry::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.Setup Editor Preview
// 0x0040 (0x0040 - 0x0000)
struct SocialMenu_PartyWidget_C_Setup_Editor_Preview final
{
public:
	class URBSocialMenuEntry*                     CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D3B[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D3C[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBSocialMenuEntry*                     CallFunc_Create_ReturnValue_1;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue_1;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBSocialMenuEntry*                     CallFunc_Create_ReturnValue_2;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue_2;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_PartyWidget_C_Setup_Editor_Preview) == 0x000008, "Wrong alignment on SocialMenu_PartyWidget_C_Setup_Editor_Preview");
static_assert(sizeof(SocialMenu_PartyWidget_C_Setup_Editor_Preview) == 0x000040, "Wrong size on SocialMenu_PartyWidget_C_Setup_Editor_Preview");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup_Editor_Preview, CallFunc_Create_ReturnValue) == 0x000000, "Member 'SocialMenu_PartyWidget_C_Setup_Editor_Preview::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup_Editor_Preview, Temp_int_Variable) == 0x000008, "Member 'SocialMenu_PartyWidget_C_Setup_Editor_Preview::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup_Editor_Preview, CallFunc_AddChildToGrid_ReturnValue) == 0x000010, "Member 'SocialMenu_PartyWidget_C_Setup_Editor_Preview::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup_Editor_Preview, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'SocialMenu_PartyWidget_C_Setup_Editor_Preview::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup_Editor_Preview, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'SocialMenu_PartyWidget_C_Setup_Editor_Preview::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup_Editor_Preview, CallFunc_Create_ReturnValue_1) == 0x000020, "Member 'SocialMenu_PartyWidget_C_Setup_Editor_Preview::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup_Editor_Preview, CallFunc_AddChildToGrid_ReturnValue_1) == 0x000028, "Member 'SocialMenu_PartyWidget_C_Setup_Editor_Preview::CallFunc_AddChildToGrid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup_Editor_Preview, CallFunc_Create_ReturnValue_2) == 0x000030, "Member 'SocialMenu_PartyWidget_C_Setup_Editor_Preview::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_Setup_Editor_Preview, CallFunc_AddChildToGrid_ReturnValue_2) == 0x000038, "Member 'SocialMenu_PartyWidget_C_Setup_Editor_Preview::CallFunc_AddChildToGrid_ReturnValue_2' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.SetupPartySettings
// 0x0020 (0x0020 - 0x0000)
struct SocialMenu_PartyWidget_C_SetupPartySettings final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldDisplayGroupInvitationRequests_ReturnValue; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldDisplayCrossplaySetting_ReturnValue; // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D3D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPartyInviteFilter_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrossplayEnabled_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D3E[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyOwner_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AllowPartyMemberInvites_ReturnValue;      // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPartyPrivacy                                 CallFunc_GetPartyPrivacy_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_PartyWidget_C_SetupPartySettings) == 0x000004, "Wrong alignment on SocialMenu_PartyWidget_C_SetupPartySettings");
static_assert(sizeof(SocialMenu_PartyWidget_C_SetupPartySettings) == 0x000020, "Wrong size on SocialMenu_PartyWidget_C_SetupPartySettings");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, Temp_bool_Variable) == 0x000000, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, Temp_byte_Variable) == 0x000001, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, Temp_byte_Variable_1) == 0x000002, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, Temp_bool_Variable_1) == 0x000003, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, Temp_byte_Variable_2) == 0x000004, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, Temp_byte_Variable_3) == 0x000005, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, CallFunc_ShouldDisplayGroupInvitationRequests_ReturnValue) == 0x000006, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::CallFunc_ShouldDisplayGroupInvitationRequests_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, CallFunc_ShouldDisplayCrossplaySetting_ReturnValue) == 0x000007, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::CallFunc_ShouldDisplayCrossplaySetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, CallFunc_BooleanAND_ReturnValue) == 0x000008, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, CallFunc_GetPartyInviteFilter_ReturnValue) == 0x00000C, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::CallFunc_GetPartyInviteFilter_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, CallFunc_IsCrossplayEnabled_ReturnValue) == 0x000010, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::CallFunc_IsCrossplayEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, K2Node_Select_Default) == 0x000011, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, CallFunc_SelectInt_ReturnValue) == 0x000014, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, CallFunc_IsPartyOwner_ReturnValue) == 0x000018, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::CallFunc_IsPartyOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, CallFunc_BooleanAND_ReturnValue_1) == 0x000019, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, K2Node_Select_Default_1) == 0x00001A, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, CallFunc_AllowPartyMemberInvites_ReturnValue) == 0x00001B, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::CallFunc_AllowPartyMemberInvites_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, CallFunc_GetPartyPrivacy_ReturnValue) == 0x00001C, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::CallFunc_GetPartyPrivacy_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupPartySettings, K2Node_SwitchEnum_CmpSuccess) == 0x00001D, "Member 'SocialMenu_PartyWidget_C_SetupPartySettings::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct SocialMenu_PartyWidget_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(SocialMenu_PartyWidget_C_OnFocusReceived) == 0x000008, "Wrong alignment on SocialMenu_PartyWidget_C_OnFocusReceived");
static_assert(sizeof(SocialMenu_PartyWidget_C_OnFocusReceived) == 0x0001B0, "Wrong size on SocialMenu_PartyWidget_C_OnFocusReceived");
static_assert(offsetof(SocialMenu_PartyWidget_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'SocialMenu_PartyWidget_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'SocialMenu_PartyWidget_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'SocialMenu_PartyWidget_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'SocialMenu_PartyWidget_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.SetupInitialFocus
// 0x0010 (0x0010 - 0x0000)
struct SocialMenu_PartyWidget_C_SetupInitialFocus final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_PartyWidget_C_SetupInitialFocus) == 0x000008, "Wrong alignment on SocialMenu_PartyWidget_C_SetupInitialFocus");
static_assert(sizeof(SocialMenu_PartyWidget_C_SetupInitialFocus) == 0x000010, "Wrong size on SocialMenu_PartyWidget_C_SetupInitialFocus");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupInitialFocus, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'SocialMenu_PartyWidget_C_SetupInitialFocus::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupInitialFocus, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'SocialMenu_PartyWidget_C_SetupInitialFocus::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupInitialFocus, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'SocialMenu_PartyWidget_C_SetupInitialFocus::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SetupInitialFocus, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'SocialMenu_PartyWidget_C_SetupInitialFocus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.SlotHasFocus
// 0x0048 (0x0048 - 0x0000)
struct SocialMenu_PartyWidget_C_SlotHasFocus final
{
public:
	int32                                         Column;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Row;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasFocus;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D3F[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D40[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_PartyWidget_C_SlotHasFocus) == 0x000008, "Wrong alignment on SocialMenu_PartyWidget_C_SlotHasFocus");
static_assert(sizeof(SocialMenu_PartyWidget_C_SlotHasFocus) == 0x000048, "Wrong size on SocialMenu_PartyWidget_C_SlotHasFocus");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, Column) == 0x000000, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::Column' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, Row) == 0x000004, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::Row' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, bHasFocus) == 0x000008, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::bHasFocus' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, CallFunc_Array_Get_Item) == 0x000028, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, CallFunc_SlotAsGridSlot_ReturnValue) == 0x000038, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000041, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, CallFunc_HasKeyboardFocus_ReturnValue) == 0x000042, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000043, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, CallFunc_BooleanAND_ReturnValue) == 0x000044, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_SlotHasFocus, CallFunc_BooleanAND_ReturnValue_1) == 0x000045, "Member 'SocialMenu_PartyWidget_C_SlotHasFocus::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.UpdateLeavePartyBtnVisibility
// 0x0005 (0x0005 - 0x0000)
struct SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanLeaveParty_ReturnValue;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility) == 0x000001, "Wrong alignment on SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility");
static_assert(sizeof(SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility) == 0x000005, "Wrong size on SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility, Temp_bool_Variable) == 0x000000, "Member 'SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility, Temp_byte_Variable) == 0x000001, "Member 'SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility, CallFunc_CanLeaveParty_ReturnValue) == 0x000003, "Member 'SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility::CallFunc_CanLeaveParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility, K2Node_Select_Default) == 0x000004, "Member 'SocialMenu_PartyWidget_C_UpdateLeavePartyBtnVisibility::K2Node_Select_Default' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.OnPrivacyValueUpdated
// 0x0010 (0x0010 - 0x0000)
struct SocialMenu_PartyWidget_C_OnPrivacyValueUpdated final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyPrivacy                                 Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyPrivacy                                 Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyPrivacy                                 Temp_byte_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyPrivacy                                 CallFunc_GetPartyPrivacy_ReturnValue;              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyPrivacy                                 K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_PartyWidget_C_OnPrivacyValueUpdated) == 0x000004, "Wrong alignment on SocialMenu_PartyWidget_C_OnPrivacyValueUpdated");
static_assert(sizeof(SocialMenu_PartyWidget_C_OnPrivacyValueUpdated) == 0x000010, "Wrong size on SocialMenu_PartyWidget_C_OnPrivacyValueUpdated");
static_assert(offsetof(SocialMenu_PartyWidget_C_OnPrivacyValueUpdated, NewValue) == 0x000000, "Member 'SocialMenu_PartyWidget_C_OnPrivacyValueUpdated::NewValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_OnPrivacyValueUpdated, Temp_int_Variable) == 0x000004, "Member 'SocialMenu_PartyWidget_C_OnPrivacyValueUpdated::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_OnPrivacyValueUpdated, Temp_byte_Variable) == 0x000008, "Member 'SocialMenu_PartyWidget_C_OnPrivacyValueUpdated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_OnPrivacyValueUpdated, Temp_byte_Variable_1) == 0x000009, "Member 'SocialMenu_PartyWidget_C_OnPrivacyValueUpdated::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_OnPrivacyValueUpdated, Temp_byte_Variable_2) == 0x00000A, "Member 'SocialMenu_PartyWidget_C_OnPrivacyValueUpdated::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_OnPrivacyValueUpdated, CallFunc_GetPartyPrivacy_ReturnValue) == 0x00000B, "Member 'SocialMenu_PartyWidget_C_OnPrivacyValueUpdated::CallFunc_GetPartyPrivacy_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_OnPrivacyValueUpdated, K2Node_Select_Default) == 0x00000C, "Member 'SocialMenu_PartyWidget_C_OnPrivacyValueUpdated::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_OnPrivacyValueUpdated, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00000D, "Member 'SocialMenu_PartyWidget_C_OnPrivacyValueUpdated::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function SocialMenu_PartyWidget.SocialMenu_PartyWidget_C.OnPartyMembersCanInviteValueUpdated
// 0x0008 (0x0008 - 0x0000)
struct SocialMenu_PartyWidget_C_OnPartyMembersCanInviteValueUpdated final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AllowPartyMemberInvites_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_PartyWidget_C_OnPartyMembersCanInviteValueUpdated) == 0x000004, "Wrong alignment on SocialMenu_PartyWidget_C_OnPartyMembersCanInviteValueUpdated");
static_assert(sizeof(SocialMenu_PartyWidget_C_OnPartyMembersCanInviteValueUpdated) == 0x000008, "Wrong size on SocialMenu_PartyWidget_C_OnPartyMembersCanInviteValueUpdated");
static_assert(offsetof(SocialMenu_PartyWidget_C_OnPartyMembersCanInviteValueUpdated, NewValue) == 0x000000, "Member 'SocialMenu_PartyWidget_C_OnPartyMembersCanInviteValueUpdated::NewValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyWidget_C_OnPartyMembersCanInviteValueUpdated, CallFunc_AllowPartyMemberInvites_ReturnValue) == 0x000004, "Member 'SocialMenu_PartyWidget_C_OnPartyMembersCanInviteValueUpdated::CallFunc_AllowPartyMemberInvites_ReturnValue' has a wrong offset!");
