#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_Slider

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SocialMenu_Slider.SocialMenu_Slider_C.OnValueUpdated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SocialMenu_Slider_C_OnValueUpdated__DelegateSignature final
{
public:
	float                                         Value_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_Slider_C_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong alignment on SocialMenu_Slider_C_OnValueUpdated__DelegateSignature");
static_assert(sizeof(SocialMenu_Slider_C_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong size on SocialMenu_Slider_C_OnValueUpdated__DelegateSignature");
static_assert(offsetof(SocialMenu_Slider_C_OnValueUpdated__DelegateSignature, Value_0) == 0x000000, "Member 'SocialMenu_Slider_C_OnValueUpdated__DelegateSignature::Value_0' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.ExecuteUbergraph_SocialMenu_Slider
// 0x0040 (0x0040 - 0x0000)
struct SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_value;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0010(0x0008)(NoDestructor)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsGamepad;                           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider) == 0x000008, "Wrong alignment on SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider");
static_assert(sizeof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider) == 0x000040, "Wrong size on SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, EntryPoint) == 0x000000, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, Temp_bool_Variable) == 0x000004, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, Temp_byte_Variable) == 0x000005, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, Temp_byte_Variable_1) == 0x000006, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, K2Node_ComponentBoundEvent_value) == 0x000008, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::K2Node_ComponentBoundEvent_value' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, K2Node_Event_InFocusEvent) == 0x000010, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, CallFunc_GetValue_ReturnValue) == 0x000018, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, CallFunc_Add_FloatFloat_ReturnValue) == 0x00001C, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, CallFunc_FMin_ReturnValue) == 0x000020, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, CallFunc_FMax_ReturnValue) == 0x000028, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, K2Node_Event_bIsGamepad) == 0x00002C, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::K2Node_Event_bIsGamepad' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, CallFunc_GetMenuManager_ReturnValue) == 0x000030, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000038, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider, K2Node_Select_Default) == 0x000039, "Member 'SocialMenu_Slider_C_ExecuteUbergraph_SocialMenu_Slider::K2Node_Select_Default' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.Event_InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_Slider_C_Event_InputSourceChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Slider_C_Event_InputSourceChanged) == 0x000001, "Wrong alignment on SocialMenu_Slider_C_Event_InputSourceChanged");
static_assert(sizeof(SocialMenu_Slider_C_Event_InputSourceChanged) == 0x000001, "Wrong size on SocialMenu_Slider_C_Event_InputSourceChanged");
static_assert(offsetof(SocialMenu_Slider_C_Event_InputSourceChanged, bIsGamepad) == 0x000000, "Member 'SocialMenu_Slider_C_Event_InputSourceChanged::bIsGamepad' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct SocialMenu_Slider_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(SocialMenu_Slider_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on SocialMenu_Slider_C_OnRemovedFromFocusPath");
static_assert(sizeof(SocialMenu_Slider_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on SocialMenu_Slider_C_OnRemovedFromFocusPath");
static_assert(offsetof(SocialMenu_Slider_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'SocialMenu_Slider_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_Slider_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Slider_C_PreConstruct) == 0x000001, "Wrong alignment on SocialMenu_Slider_C_PreConstruct");
static_assert(sizeof(SocialMenu_Slider_C_PreConstruct) == 0x000001, "Wrong size on SocialMenu_Slider_C_PreConstruct");
static_assert(offsetof(SocialMenu_Slider_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SocialMenu_Slider_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.BndEvt__SliderValue_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SocialMenu_Slider_C_BndEvt__SliderValue_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_Slider_C_BndEvt__SliderValue_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on SocialMenu_Slider_C_BndEvt__SliderValue_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(SocialMenu_Slider_C_BndEvt__SliderValue_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on SocialMenu_Slider_C_BndEvt__SliderValue_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(SocialMenu_Slider_C_BndEvt__SliderValue_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature, Value_0) == 0x000000, "Member 'SocialMenu_Slider_C_BndEvt__SliderValue_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature::Value_0' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.Setup
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_Slider_C_Setup final
{
public:
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Slider_C_Setup) == 0x000001, "Wrong alignment on SocialMenu_Slider_C_Setup");
static_assert(sizeof(SocialMenu_Slider_C_Setup) == 0x000001, "Wrong size on SocialMenu_Slider_C_Setup");
static_assert(offsetof(SocialMenu_Slider_C_Setup, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000000, "Member 'SocialMenu_Slider_C_Setup::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_Slider_C_SetEnabled final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Slider_C_SetEnabled) == 0x000001, "Wrong alignment on SocialMenu_Slider_C_SetEnabled");
static_assert(sizeof(SocialMenu_Slider_C_SetEnabled) == 0x000001, "Wrong size on SocialMenu_Slider_C_SetEnabled");
static_assert(offsetof(SocialMenu_Slider_C_SetEnabled, bInEnabled) == 0x000000, "Member 'SocialMenu_Slider_C_SetEnabled::bInEnabled' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.SetValue
// 0x0004 (0x0004 - 0x0000)
struct SocialMenu_Slider_C_SetValue final
{
public:
	float                                         Value_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_Slider_C_SetValue) == 0x000004, "Wrong alignment on SocialMenu_Slider_C_SetValue");
static_assert(sizeof(SocialMenu_Slider_C_SetValue) == 0x000004, "Wrong size on SocialMenu_Slider_C_SetValue");
static_assert(offsetof(SocialMenu_Slider_C_SetValue, Value_0) == 0x000000, "Member 'SocialMenu_Slider_C_SetValue::Value_0' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.SetValueText
// 0x0020 (0x0020 - 0x0000)
struct SocialMenu_Slider_C_SetValueText final
{
public:
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(SocialMenu_Slider_C_SetValueText) == 0x000008, "Wrong alignment on SocialMenu_Slider_C_SetValueText");
static_assert(sizeof(SocialMenu_Slider_C_SetValueText) == 0x000020, "Wrong size on SocialMenu_Slider_C_SetValueText");
static_assert(offsetof(SocialMenu_Slider_C_SetValueText, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000000, "Member 'SocialMenu_Slider_C_SetValueText::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_SetValueText, CallFunc_Round_ReturnValue) == 0x000004, "Member 'SocialMenu_Slider_C_SetValueText::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_SetValueText, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'SocialMenu_Slider_C_SetValueText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.OnValueChanged
// 0x0004 (0x0004 - 0x0000)
struct SocialMenu_Slider_C_OnValueChanged final
{
public:
	float                                         CurrentValue_0;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_Slider_C_OnValueChanged) == 0x000004, "Wrong alignment on SocialMenu_Slider_C_OnValueChanged");
static_assert(sizeof(SocialMenu_Slider_C_OnValueChanged) == 0x000004, "Wrong size on SocialMenu_Slider_C_OnValueChanged");
static_assert(offsetof(SocialMenu_Slider_C_OnValueChanged, CurrentValue_0) == 0x000000, "Member 'SocialMenu_Slider_C_OnValueChanged::CurrentValue_0' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct SocialMenu_Slider_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(SocialMenu_Slider_C_OnFocusReceived) == 0x000008, "Wrong alignment on SocialMenu_Slider_C_OnFocusReceived");
static_assert(sizeof(SocialMenu_Slider_C_OnFocusReceived) == 0x0001B0, "Wrong size on SocialMenu_Slider_C_OnFocusReceived");
static_assert(offsetof(SocialMenu_Slider_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'SocialMenu_Slider_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'SocialMenu_Slider_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'SocialMenu_Slider_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'SocialMenu_Slider_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.SetHovered
// 0x0030 (0x0030 - 0x0000)
struct SocialMenu_Slider_C_SetHovered final
{
public:
	bool                                          bInHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWasConsideredHovered;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Slider_C_SetHovered) == 0x000008, "Wrong alignment on SocialMenu_Slider_C_SetHovered");
static_assert(sizeof(SocialMenu_Slider_C_SetHovered) == 0x000030, "Wrong size on SocialMenu_Slider_C_SetHovered");
static_assert(offsetof(SocialMenu_Slider_C_SetHovered, bInHovered) == 0x000000, "Member 'SocialMenu_Slider_C_SetHovered::bInHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_SetHovered, bWasConsideredHovered) == 0x000001, "Member 'SocialMenu_Slider_C_SetHovered::bWasConsideredHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_SetHovered, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'SocialMenu_Slider_C_SetHovered::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_SetHovered, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'SocialMenu_Slider_C_SetHovered::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_SetHovered, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000028, "Member 'SocialMenu_Slider_C_SetHovered::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.RefreshDisplay
// 0x00C8 (0x00C8 - 0x0000)
struct SocialMenu_Slider_C_RefreshDisplay final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00A0(0x0028)()
};
static_assert(alignof(SocialMenu_Slider_C_RefreshDisplay) == 0x000008, "Wrong alignment on SocialMenu_Slider_C_RefreshDisplay");
static_assert(sizeof(SocialMenu_Slider_C_RefreshDisplay) == 0x0000C8, "Wrong size on SocialMenu_Slider_C_RefreshDisplay");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, Temp_bool_Variable) == 0x000000, "Member 'SocialMenu_Slider_C_RefreshDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, Temp_struct_Variable) == 0x000004, "Member 'SocialMenu_Slider_C_RefreshDisplay::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, Temp_struct_Variable_1) == 0x000014, "Member 'SocialMenu_Slider_C_RefreshDisplay::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, Temp_bool_Variable_1) == 0x000024, "Member 'SocialMenu_Slider_C_RefreshDisplay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, Temp_struct_Variable_2) == 0x000028, "Member 'SocialMenu_Slider_C_RefreshDisplay::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, Temp_struct_Variable_3) == 0x000038, "Member 'SocialMenu_Slider_C_RefreshDisplay::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, Temp_bool_Variable_2) == 0x000048, "Member 'SocialMenu_Slider_C_RefreshDisplay::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, Temp_byte_Variable) == 0x000049, "Member 'SocialMenu_Slider_C_RefreshDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, Temp_byte_Variable_1) == 0x00004A, "Member 'SocialMenu_Slider_C_RefreshDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, Temp_bool_Variable_3) == 0x00004B, "Member 'SocialMenu_Slider_C_RefreshDisplay::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, Temp_struct_Variable_4) == 0x00004C, "Member 'SocialMenu_Slider_C_RefreshDisplay::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, Temp_struct_Variable_5) == 0x00005C, "Member 'SocialMenu_Slider_C_RefreshDisplay::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, K2Node_Select_Default) == 0x00006C, "Member 'SocialMenu_Slider_C_RefreshDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, K2Node_Select_Default_1) == 0x00007C, "Member 'SocialMenu_Slider_C_RefreshDisplay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, K2Node_Select_Default_2) == 0x00008C, "Member 'SocialMenu_Slider_C_RefreshDisplay::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, K2Node_Select_Default_3) == 0x000090, "Member 'SocialMenu_Slider_C_RefreshDisplay::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_RefreshDisplay, K2Node_MakeStruct_SlateColor) == 0x0000A0, "Member 'SocialMenu_Slider_C_RefreshDisplay::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.OnAnalogValueChanged
// 0x04D8 (0x04D8 - 0x0000)
struct SocialMenu_Slider_C_OnAnalogValueChanged final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FAnalogInputEvent                      InAnalogInputEvent;                                // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          bCanRepeatInput;                                   // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsRepeatInput;                                    // 0x0131(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLeftPressed;                                      // 0x0132(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue; // 0x0138(0x0038)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0178(0x0018)(HasGetValueTypeHash)
	class UArrowButton_C*                         CallFunc_GetArrowButton_NewParam;                  // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowButton_C*                         CallFunc_GetArrowButton_NewParam_1;                // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnalogValue_ReturnValue;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnalogValue_ReturnValue_1;             // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetElapsedTime_ReturnValue;               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTime_ReturnValue;                  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTime_ReturnValue_1;                // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetElapsedTime_ReturnValue_1;             // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetElapsedTime_ReturnValue_2;             // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_2;                        // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EF[0x1];                                      // 0x01EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x01F0(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue_1;                  // 0x02A8(0x00B8)()
	float                                         CallFunc_Abs_ReturnValue_3;                        // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue_2;                  // 0x0368(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0420(0x00B8)()
};
static_assert(alignof(SocialMenu_Slider_C_OnAnalogValueChanged) == 0x000008, "Wrong alignment on SocialMenu_Slider_C_OnAnalogValueChanged");
static_assert(sizeof(SocialMenu_Slider_C_OnAnalogValueChanged) == 0x0004D8, "Wrong size on SocialMenu_Slider_C_OnAnalogValueChanged");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, MyGeometry) == 0x000000, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::MyGeometry' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, InAnalogInputEvent) == 0x000038, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::InAnalogInputEvent' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, ReturnValue) == 0x000078, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, bCanRepeatInput) == 0x000130, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::bCanRepeatInput' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, bIsRepeatInput) == 0x000131, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::bIsRepeatInput' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, bLeftPressed) == 0x000132, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::bLeftPressed' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue) == 0x000138, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Not_PreBool_ReturnValue) == 0x000170, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_GetKey_ReturnValue) == 0x000178, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_GetArrowButton_NewParam) == 0x000190, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_GetArrowButton_NewParam' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000198, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_GetArrowButton_NewParam_1) == 0x0001A0, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_GetArrowButton_NewParam_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_GetAnalogValue_ReturnValue) == 0x0001A8, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_GetAnalogValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001AC, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_BooleanAND_ReturnValue) == 0x0001AD, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Abs_ReturnValue) == 0x0001B0, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001B4, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_GetAnalogValue_ReturnValue_1) == 0x0001B8, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_GetAnalogValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_GetElapsedTime_ReturnValue) == 0x0001BC, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_GetElapsedTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001C0, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_FFloor_ReturnValue) == 0x0001C4, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Abs_ReturnValue_1) == 0x0001C8, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Max_ReturnValue) == 0x0001CC, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x0001D0, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_GetGameTime_ReturnValue) == 0x0001D4, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_GetGameTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_GetGameTime_ReturnValue_1) == 0x0001D8, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_GetGameTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_GetElapsedTime_ReturnValue_1) == 0x0001DC, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_GetElapsedTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0001E0, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_GetElapsedTime_ReturnValue_2) == 0x0001E4, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_GetElapsedTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Abs_ReturnValue_2) == 0x0001E8, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x0001EC, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x0001ED, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_BooleanOR_ReturnValue) == 0x0001EE, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Unhandled_ReturnValue) == 0x0001F0, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Unhandled_ReturnValue_1) == 0x0002A8, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Unhandled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Abs_ReturnValue_3) == 0x000360, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Abs_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x000364, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Unhandled_ReturnValue_2) == 0x000368, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Unhandled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnAnalogValueChanged, CallFunc_Handled_ReturnValue) == 0x000420, "Member 'SocialMenu_Slider_C_OnAnalogValueChanged::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.OnKeyDown
// 0x03B0 (0x03B0 - 0x0000)
struct SocialMenu_Slider_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          LeftPressed;                                       // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputEvent                            CallFunc_GetInputEventFromKeyEvent_ReturnValue;    // 0x0130(0x0018)()
	class UArrowButton_C*                         CallFunc_GetArrowButton_NewParam;                  // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InputEvent_IsRepeat_ReturnValue;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowButton_C*                         CallFunc_GetArrowButton_NewParam_1;                // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
	EUINavigation                                 CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue; // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputEvent                            CallFunc_GetInputEventFromKeyEvent_ReturnValue_1;  // 0x0220(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InputEvent_IsRepeat_ReturnValue_1;        // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x023B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0240(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x02F8(0x00B8)()
};
static_assert(alignof(SocialMenu_Slider_C_OnKeyDown) == 0x000008, "Wrong alignment on SocialMenu_Slider_C_OnKeyDown");
static_assert(sizeof(SocialMenu_Slider_C_OnKeyDown) == 0x0003B0, "Wrong size on SocialMenu_Slider_C_OnKeyDown");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'SocialMenu_Slider_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'SocialMenu_Slider_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, ReturnValue) == 0x000070, "Member 'SocialMenu_Slider_C_OnKeyDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, LeftPressed) == 0x000128, "Member 'SocialMenu_Slider_C_OnKeyDown::LeftPressed' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_GetInputEventFromKeyEvent_ReturnValue) == 0x000130, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_GetInputEventFromKeyEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_GetArrowButton_NewParam) == 0x000148, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_GetArrowButton_NewParam' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_InputEvent_IsRepeat_ReturnValue) == 0x000150, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_InputEvent_IsRepeat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_Not_PreBool_ReturnValue) == 0x000151, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_Not_PreBool_ReturnValue_1) == 0x000152, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_GetArrowButton_NewParam_1) == 0x000158, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_GetArrowButton_NewParam_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue) == 0x000218, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000219, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_GetInputEventFromKeyEvent_ReturnValue_1) == 0x000220, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_GetInputEventFromKeyEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000238, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_InputEvent_IsRepeat_ReturnValue_1) == 0x000239, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_InputEvent_IsRepeat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_BooleanOR_ReturnValue) == 0x00023A, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_BooleanAND_ReturnValue) == 0x00023B, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_Unhandled_ReturnValue) == 0x000240, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyDown, CallFunc_Handled_ReturnValue_1) == 0x0002F8, "Member 'SocialMenu_Slider_C_OnKeyDown::CallFunc_Handled_ReturnValue_1' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.OnKeyUp
// 0x02A8 (0x02A8 - 0x0000)
struct SocialMenu_Slider_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0128(0x00B8)()
	EUINavigation                                 CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue; // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E3[0x5];                                      // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01E8(0x00B8)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_Slider_C_OnKeyUp) == 0x000008, "Wrong alignment on SocialMenu_Slider_C_OnKeyUp");
static_assert(sizeof(SocialMenu_Slider_C_OnKeyUp) == 0x0002A8, "Wrong size on SocialMenu_Slider_C_OnKeyUp");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'SocialMenu_Slider_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyUp, InKeyEvent) == 0x000038, "Member 'SocialMenu_Slider_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyUp, ReturnValue) == 0x000070, "Member 'SocialMenu_Slider_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyUp, CallFunc_Unhandled_ReturnValue) == 0x000128, "Member 'SocialMenu_Slider_C_OnKeyUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyUp, CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue) == 0x0001E0, "Member 'SocialMenu_Slider_C_OnKeyUp::CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyUp, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001E1, "Member 'SocialMenu_Slider_C_OnKeyUp::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyUp, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001E2, "Member 'SocialMenu_Slider_C_OnKeyUp::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyUp, CallFunc_Handled_ReturnValue) == 0x0001E8, "Member 'SocialMenu_Slider_C_OnKeyUp::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyUp, CallFunc_BooleanOR_ReturnValue) == 0x0002A0, "Member 'SocialMenu_Slider_C_OnKeyUp::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Slider_C_OnKeyUp, CallFunc_BooleanAND_ReturnValue) == 0x0002A1, "Member 'SocialMenu_Slider_C_OnKeyUp::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function SocialMenu_Slider.SocialMenu_Slider_C.HandleSliderOnInput
// 0x0028 (0x0028 - 0x0000)
struct SocialMenu_Slider_C_HandleSliderOnInput final
{
public:
	bool                                          bLeftPressed;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TimeBasedMultiplier;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GridSnap_Float_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_Slider_C_HandleSliderOnInput) == 0x000004, "Wrong alignment on SocialMenu_Slider_C_HandleSliderOnInput");
