#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_ContextualMenu_Action

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialMenu_ContextualMenu_Action.SocialMenu_ContextualMenu_Action_C
// 0x0040 (0x02B0 - 0x0270)
class USocialMenu_ContextualMenu_Action_C final : public URBSocialMenuEntryContextualMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                btn;                                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             btn_text;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Line;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnActionTriggered;                                 // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	ERBSocialMenuEntryAction                      Action;                                            // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHovered;                                          // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnActionTriggered__DelegateSignature(ERBSocialMenuEntryAction Param_Action);
	void ExecuteUbergraph_SocialMenu_ContextualMenu_Action(int32 EntryPoint);
	void BndEvt__SocialMenu_ContextualMenu_Action_btn_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SocialMenu_ContextualMenu_Action_btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__btn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void SetEnabled(bool bEnabled);
	void SetButtonText(const class FText& Text);
	void RefreshDisplay();
	void SetHovered(bool bInHovered);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialMenu_ContextualMenu_Action_C">();
	}
	static class USocialMenu_ContextualMenu_Action_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialMenu_ContextualMenu_Action_C>();
	}
};
static_assert(alignof(USocialMenu_ContextualMenu_Action_C) == 0x000008, "Wrong alignment on USocialMenu_ContextualMenu_Action_C");
static_assert(sizeof(USocialMenu_ContextualMenu_Action_C) == 0x0002B0, "Wrong size on USocialMenu_ContextualMenu_Action_C");
static_assert(offsetof(USocialMenu_ContextualMenu_Action_C, UberGraphFrame) == 0x000270, "Member 'USocialMenu_ContextualMenu_Action_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_Action_C, Background) == 0x000278, "Member 'USocialMenu_ContextualMenu_Action_C::Background' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_Action_C, btn) == 0x000280, "Member 'USocialMenu_ContextualMenu_Action_C::btn' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_Action_C, btn_text) == 0x000288, "Member 'USocialMenu_ContextualMenu_Action_C::btn_text' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_Action_C, Line) == 0x000290, "Member 'USocialMenu_ContextualMenu_Action_C::Line' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_Action_C, OnActionTriggered) == 0x000298, "Member 'USocialMenu_ContextualMenu_Action_C::OnActionTriggered' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_Action_C, Action) == 0x0002A8, "Member 'USocialMenu_ContextualMenu_Action_C::Action' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_Action_C, bHovered) == 0x0002A9, "Member 'USocialMenu_ContextualMenu_Action_C::bHovered' has a wrong offset!");

}

