#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_ContextualMenu_Action

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function SocialMenu_ContextualMenu_Action.SocialMenu_ContextualMenu_Action_C.OnActionTriggered__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_ContextualMenu_Action_C_OnActionTriggered__DelegateSignature final
{
public:
	ERBSocialMenuEntryAction                      Param_Action;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_ContextualMenu_Action_C_OnActionTriggered__DelegateSignature) == 0x000001, "Wrong alignment on SocialMenu_ContextualMenu_Action_C_OnActionTriggered__DelegateSignature");
static_assert(sizeof(SocialMenu_ContextualMenu_Action_C_OnActionTriggered__DelegateSignature) == 0x000001, "Wrong size on SocialMenu_ContextualMenu_Action_C_OnActionTriggered__DelegateSignature");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_OnActionTriggered__DelegateSignature, Param_Action) == 0x000000, "Member 'SocialMenu_ContextualMenu_Action_C_OnActionTriggered__DelegateSignature::Param_Action' has a wrong offset!");

// Function SocialMenu_ContextualMenu_Action.SocialMenu_ContextualMenu_Action_C.ExecuteUbergraph_SocialMenu_ContextualMenu_Action
// 0x0008 (0x0008 - 0x0000)
struct SocialMenu_ContextualMenu_Action_C_ExecuteUbergraph_SocialMenu_ContextualMenu_Action final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_ContextualMenu_Action_C_ExecuteUbergraph_SocialMenu_ContextualMenu_Action) == 0x000004, "Wrong alignment on SocialMenu_ContextualMenu_Action_C_ExecuteUbergraph_SocialMenu_ContextualMenu_Action");
static_assert(sizeof(SocialMenu_ContextualMenu_Action_C_ExecuteUbergraph_SocialMenu_ContextualMenu_Action) == 0x000008, "Wrong size on SocialMenu_ContextualMenu_Action_C_ExecuteUbergraph_SocialMenu_ContextualMenu_Action");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_ExecuteUbergraph_SocialMenu_ContextualMenu_Action, EntryPoint) == 0x000000, "Member 'SocialMenu_ContextualMenu_Action_C_ExecuteUbergraph_SocialMenu_ContextualMenu_Action::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_ExecuteUbergraph_SocialMenu_ContextualMenu_Action, K2Node_Event_IsDesignTime) == 0x000004, "Member 'SocialMenu_ContextualMenu_Action_C_ExecuteUbergraph_SocialMenu_ContextualMenu_Action::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function SocialMenu_ContextualMenu_Action.SocialMenu_ContextualMenu_Action_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_ContextualMenu_Action_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_ContextualMenu_Action_C_PreConstruct) == 0x000001, "Wrong alignment on SocialMenu_ContextualMenu_Action_C_PreConstruct");
static_assert(sizeof(SocialMenu_ContextualMenu_Action_C_PreConstruct) == 0x000001, "Wrong size on SocialMenu_ContextualMenu_Action_C_PreConstruct");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SocialMenu_ContextualMenu_Action_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SocialMenu_ContextualMenu_Action.SocialMenu_ContextualMenu_Action_C.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_ContextualMenu_Action_C_SetEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_ContextualMenu_Action_C_SetEnabled) == 0x000001, "Wrong alignment on SocialMenu_ContextualMenu_Action_C_SetEnabled");
static_assert(sizeof(SocialMenu_ContextualMenu_Action_C_SetEnabled) == 0x000001, "Wrong size on SocialMenu_ContextualMenu_Action_C_SetEnabled");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_SetEnabled, bEnabled) == 0x000000, "Member 'SocialMenu_ContextualMenu_Action_C_SetEnabled::bEnabled' has a wrong offset!");

// Function SocialMenu_ContextualMenu_Action.SocialMenu_ContextualMenu_Action_C.SetButtonText
// 0x0018 (0x0018 - 0x0000)
struct SocialMenu_ContextualMenu_Action_C_SetButtonText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SocialMenu_ContextualMenu_Action_C_SetButtonText) == 0x000008, "Wrong alignment on SocialMenu_ContextualMenu_Action_C_SetButtonText");
static_assert(sizeof(SocialMenu_ContextualMenu_Action_C_SetButtonText) == 0x000018, "Wrong size on SocialMenu_ContextualMenu_Action_C_SetButtonText");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_SetButtonText, Text) == 0x000000, "Member 'SocialMenu_ContextualMenu_Action_C_SetButtonText::Text' has a wrong offset!");

// Function SocialMenu_ContextualMenu_Action.SocialMenu_ContextualMenu_Action_C.RefreshDisplay
// 0x0060 (0x0060 - 0x0000)
struct SocialMenu_ContextualMenu_Action_C_RefreshDisplay final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F00[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0028)()
};
static_assert(alignof(SocialMenu_ContextualMenu_Action_C_RefreshDisplay) == 0x000008, "Wrong alignment on SocialMenu_ContextualMenu_Action_C_RefreshDisplay");
static_assert(sizeof(SocialMenu_ContextualMenu_Action_C_RefreshDisplay) == 0x000060, "Wrong size on SocialMenu_ContextualMenu_Action_C_RefreshDisplay");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_RefreshDisplay, Temp_bool_Variable) == 0x000000, "Member 'SocialMenu_ContextualMenu_Action_C_RefreshDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_RefreshDisplay, Temp_byte_Variable) == 0x000001, "Member 'SocialMenu_ContextualMenu_Action_C_RefreshDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_RefreshDisplay, Temp_byte_Variable_1) == 0x000002, "Member 'SocialMenu_ContextualMenu_Action_C_RefreshDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_RefreshDisplay, Temp_bool_Variable_1) == 0x000003, "Member 'SocialMenu_ContextualMenu_Action_C_RefreshDisplay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_RefreshDisplay, Temp_struct_Variable) == 0x000004, "Member 'SocialMenu_ContextualMenu_Action_C_RefreshDisplay::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_RefreshDisplay, Temp_struct_Variable_1) == 0x000014, "Member 'SocialMenu_ContextualMenu_Action_C_RefreshDisplay::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_RefreshDisplay, K2Node_Select_Default) == 0x000024, "Member 'SocialMenu_ContextualMenu_Action_C_RefreshDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_RefreshDisplay, K2Node_Select_Default_1) == 0x000028, "Member 'SocialMenu_ContextualMenu_Action_C_RefreshDisplay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_RefreshDisplay, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'SocialMenu_ContextualMenu_Action_C_RefreshDisplay::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function SocialMenu_ContextualMenu_Action.SocialMenu_ContextualMenu_Action_C.SetHovered
// 0x0030 (0x0030 - 0x0000)
struct SocialMenu_ContextualMenu_Action_C_SetHovered final
{
public:
	bool                                          bInHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWasConsideredHovered;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F01[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_ContextualMenu_Action_C_SetHovered) == 0x000008, "Wrong alignment on SocialMenu_ContextualMenu_Action_C_SetHovered");
static_assert(sizeof(SocialMenu_ContextualMenu_Action_C_SetHovered) == 0x000030, "Wrong size on SocialMenu_ContextualMenu_Action_C_SetHovered");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_SetHovered, bInHovered) == 0x000000, "Member 'SocialMenu_ContextualMenu_Action_C_SetHovered::bInHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_SetHovered, bWasConsideredHovered) == 0x000001, "Member 'SocialMenu_ContextualMenu_Action_C_SetHovered::bWasConsideredHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_SetHovered, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'SocialMenu_ContextualMenu_Action_C_SetHovered::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_SetHovered, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'SocialMenu_ContextualMenu_Action_C_SetHovered::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_ContextualMenu_Action_C_SetHovered, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000028, "Member 'SocialMenu_ContextualMenu_Action_C_SetHovered::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

}

