#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundDetector_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SoundDetector_BP.SoundDetector_BP_C
// 0x0080 (0x02D0 - 0x0250)
class ASoundDetector_BP_C final : public ARBSoundDetector
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StairsSignMinus02;                                 // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ToasterDetectorBaseMinus02;                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SoundDeviceBack;                                   // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight1;                                      // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight;                                       // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StairsSignMinus01;                                 // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HangingMicrophoneMinus02;                          // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HangingMicrophoneMinus01;                          // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBPlayerSoundDetectionComponent*       RBPlayerSoundDetection;                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBDamageableComponent*                 RBDamageable;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultPositionRef;                                // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      RBSound;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ToasterDetectorBaseMinus01;                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldUpdateRTPC;                                 // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UpdateSignStatus();
	void Event_OnResetStage();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_0_OnSoundDetectionMeterChanged__DelegateSignature(float CurrentMeterRatio);
	void BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_1_OnSoundDetectionStateChanged__DelegateSignature(EPlayerSoundDetectionState OldState, EPlayerSoundDetectionState NewState);
	void SetVariatorEnabled(bool bEnabled);
	void ExecuteUbergraph_SoundDetector_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SoundDetector_BP_C">();
	}
	static class ASoundDetector_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASoundDetector_BP_C>();
	}
};
static_assert(alignof(ASoundDetector_BP_C) == 0x000008, "Wrong alignment on ASoundDetector_BP_C");
static_assert(sizeof(ASoundDetector_BP_C) == 0x0002D0, "Wrong size on ASoundDetector_BP_C");
static_assert(offsetof(ASoundDetector_BP_C, UberGraphFrame) == 0x000250, "Member 'ASoundDetector_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, StairsSignMinus02) == 0x000258, "Member 'ASoundDetector_BP_C::StairsSignMinus02' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, ToasterDetectorBaseMinus02) == 0x000260, "Member 'ASoundDetector_BP_C::ToasterDetectorBaseMinus02' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, SoundDeviceBack) == 0x000268, "Member 'ASoundDetector_BP_C::SoundDeviceBack' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, RBSpotLight1) == 0x000270, "Member 'ASoundDetector_BP_C::RBSpotLight1' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, RBSpotLight) == 0x000278, "Member 'ASoundDetector_BP_C::RBSpotLight' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, StairsSignMinus01) == 0x000280, "Member 'ASoundDetector_BP_C::StairsSignMinus01' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, HangingMicrophoneMinus02) == 0x000288, "Member 'ASoundDetector_BP_C::HangingMicrophoneMinus02' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, HangingMicrophoneMinus01) == 0x000290, "Member 'ASoundDetector_BP_C::HangingMicrophoneMinus01' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, RBPlayerSoundDetection) == 0x000298, "Member 'ASoundDetector_BP_C::RBPlayerSoundDetection' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, Box) == 0x0002A0, "Member 'ASoundDetector_BP_C::Box' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, RBDamageable) == 0x0002A8, "Member 'ASoundDetector_BP_C::RBDamageable' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, DefaultPositionRef) == 0x0002B0, "Member 'ASoundDetector_BP_C::DefaultPositionRef' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, RBSound) == 0x0002B8, "Member 'ASoundDetector_BP_C::RBSound' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, ToasterDetectorBaseMinus01) == 0x0002C0, "Member 'ASoundDetector_BP_C::ToasterDetectorBaseMinus01' has a wrong offset!");
static_assert(offsetof(ASoundDetector_BP_C, bShouldUpdateRTPC) == 0x0002C8, "Member 'ASoundDetector_BP_C::bShouldUpdateRTPC' has a wrong offset!");

}

