#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Spectra_ActiveSkill_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function Spectra_ActiveSkill_BP.Spectra_ActiveSkill_BP_C.ExecuteUbergraph_Spectra_ActiveSkill_BP
// 0x0050 (0x0050 - 0x0000)
struct Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsActive;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFullEffect;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A8[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBActiveSkillController*               CallFunc_GetControllerItem_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30A9[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventOnActor_ReturnValue_1;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHumanSpectral_SkillController_BP_C*    K2Node_DynamicCast_AsHuman_Spectral_Skill_Controller_BP; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30AA[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue;      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP) == 0x000008, "Wrong alignment on Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP");
static_assert(sizeof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP) == 0x000050, "Wrong size on Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP, EntryPoint) == 0x000000, "Member 'Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP, K2Node_Event_IsActive) == 0x000004, "Member 'Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP::K2Node_Event_IsActive' has a wrong offset!");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP, K2Node_Event_bFullEffect) == 0x000005, "Member 'Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP::K2Node_Event_bFullEffect' has a wrong offset!");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP, CallFunc_IsValid_ReturnValue) == 0x000006, "Member 'Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP, CallFunc_IsLocallyControlled_ReturnValue) == 0x000007, "Member 'Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP, Temp_delegate_Variable) == 0x000008, "Member 'Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP, CallFunc_PostEventOnActor_ReturnValue) == 0x000018, "Member 'Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP, CallFunc_GetControllerItem_ReturnValue) == 0x000020, "Member 'Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP::CallFunc_GetControllerItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP, Temp_delegate_Variable_1) == 0x000028, "Member 'Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP, CallFunc_PostEventOnActor_ReturnValue_1) == 0x00003C, "Member 'Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP::CallFunc_PostEventOnActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP, K2Node_DynamicCast_AsHuman_Spectral_Skill_Controller_BP) == 0x000040, "Member 'Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP::K2Node_DynamicCast_AsHuman_Spectral_Skill_Controller_BP' has a wrong offset!");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP, CallFunc_PlayLoopingSoundOnActor_ReturnValue) == 0x00004C, "Member 'Spectra_ActiveSkill_BP_C_ExecuteUbergraph_Spectra_ActiveSkill_BP::CallFunc_PlayLoopingSoundOnActor_ReturnValue' has a wrong offset!");

// Function Spectra_ActiveSkill_BP.Spectra_ActiveSkill_BP_C.Event_OnVisionActiveChanged
// 0x0002 (0x0002 - 0x0000)
struct Spectra_ActiveSkill_BP_C_Event_OnVisionActiveChanged final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFullEffect;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Spectra_ActiveSkill_BP_C_Event_OnVisionActiveChanged) == 0x000001, "Wrong alignment on Spectra_ActiveSkill_BP_C_Event_OnVisionActiveChanged");
static_assert(sizeof(Spectra_ActiveSkill_BP_C_Event_OnVisionActiveChanged) == 0x000002, "Wrong size on Spectra_ActiveSkill_BP_C_Event_OnVisionActiveChanged");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_Event_OnVisionActiveChanged, IsActive) == 0x000000, "Member 'Spectra_ActiveSkill_BP_C_Event_OnVisionActiveChanged::IsActive' has a wrong offset!");
static_assert(offsetof(Spectra_ActiveSkill_BP_C_Event_OnVisionActiveChanged, bFullEffect) == 0x000001, "Member 'Spectra_ActiveSkill_BP_C_Event_OnVisionActiveChanged::bFullEffect' has a wrong offset!");

}

