#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplashScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "MediaUtils_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SplashScreen.SplashScreen_C
// 0x00A8 (0x03B0 - 0x0308)
class USplashScreen_C final : public URBMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeInSkipButton;                                  // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SkipSplashScreen;                                  // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SplashScreenAnim;                                  // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URichTextBlock*                         PlayerName;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Prompt;                                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PromptBackground;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PromptOverlay;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpinner_C*                             Spinner_469;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SpinnerSizeBox;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TitleScreen;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TrialLogo;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsConnecting;                                     // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bConnected;                                        // 0x0369(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3157[0x6];                                     // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               LogoMat;                                           // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMediaPlayerOptions                    SplashScreenMediaPlayerOptions;                    // 0x0378(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FTimerHandle                           SkipButtonFadeOutTimer;                            // 0x03A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SplashScreen(int32 EntryPoint);
	void Event_OnPush();
	void Construct();
	void OnMainMenuStateChanged(EMainMenuState MainMenuState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SplashScreen_C">();
	}
	static class USplashScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USplashScreen_C>();
	}
};
static_assert(alignof(USplashScreen_C) == 0x000008, "Wrong alignment on USplashScreen_C");
static_assert(sizeof(USplashScreen_C) == 0x0003B0, "Wrong size on USplashScreen_C");
static_assert(offsetof(USplashScreen_C, UberGraphFrame) == 0x000308, "Member 'USplashScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, FadeInSkipButton) == 0x000310, "Member 'USplashScreen_C::FadeInSkipButton' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, SkipSplashScreen) == 0x000318, "Member 'USplashScreen_C::SkipSplashScreen' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, SplashScreenAnim) == 0x000320, "Member 'USplashScreen_C::SplashScreenAnim' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, PlayerName) == 0x000328, "Member 'USplashScreen_C::PlayerName' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, Prompt) == 0x000330, "Member 'USplashScreen_C::Prompt' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, PromptBackground) == 0x000338, "Member 'USplashScreen_C::PromptBackground' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, PromptOverlay) == 0x000340, "Member 'USplashScreen_C::PromptOverlay' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, Spinner_469) == 0x000348, "Member 'USplashScreen_C::Spinner_469' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, SpinnerSizeBox) == 0x000350, "Member 'USplashScreen_C::SpinnerSizeBox' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, TitleScreen) == 0x000358, "Member 'USplashScreen_C::TitleScreen' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, TrialLogo) == 0x000360, "Member 'USplashScreen_C::TrialLogo' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, bIsConnecting) == 0x000368, "Member 'USplashScreen_C::bIsConnecting' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, bConnected) == 0x000369, "Member 'USplashScreen_C::bConnected' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, LogoMat) == 0x000370, "Member 'USplashScreen_C::LogoMat' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, SplashScreenMediaPlayerOptions) == 0x000378, "Member 'USplashScreen_C::SplashScreenMediaPlayerOptions' has a wrong offset!");
static_assert(offsetof(USplashScreen_C, SkipButtonFadeOutTimer) == 0x0003A8, "Member 'USplashScreen_C::SkipButtonFadeOutTimer' has a wrong offset!");

}

