#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplashScreen

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SplashScreen.SplashScreen_C.ExecuteUbergraph_SplashScreen
// 0x0168 (0x0168 - 0x0000)
struct SplashScreen_C_ExecuteUbergraph_SplashScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315B[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_315C[0x5];                                     // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameModeMainMenu*                    CallFunc_GetRBGameModeMainMenu_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EMainMenuState MainMenuState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0080(0x0018)()
	EMainMenuState                                K2Node_CustomEvent_mainMenuState;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315D[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315E[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerDisplayName_ReturnValue;         // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00C0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00F0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315F[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0148(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SplashScreen_C_ExecuteUbergraph_SplashScreen) == 0x000008, "Wrong alignment on SplashScreen_C_ExecuteUbergraph_SplashScreen");
static_assert(sizeof(SplashScreen_C_ExecuteUbergraph_SplashScreen) == 0x000168, "Wrong size on SplashScreen_C_ExecuteUbergraph_SplashScreen");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, EntryPoint) == 0x000000, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, Temp_delegate_Variable) == 0x000004, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, Temp_delegate_Variable_1) == 0x000014, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, CallFunc_PostEventGlobal_ReturnValue) == 0x000024, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, CallFunc_PostEventGlobal_ReturnValue_1) == 0x000028, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::CallFunc_PostEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, Temp_bool_Variable) == 0x00002C, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, Temp_text_Variable) == 0x000030, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, Temp_text_Variable_1) == 0x000048, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, Temp_bool_Variable_1) == 0x000060, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, Temp_byte_Variable) == 0x000061, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, Temp_byte_Variable_1) == 0x000062, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, CallFunc_GetRBGameModeMainMenu_ReturnValue) == 0x000068, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::CallFunc_GetRBGameModeMainMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000070, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, CallFunc_MakeLiteralText_ReturnValue) == 0x000080, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, K2Node_CustomEvent_mainMenuState) == 0x000098, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::K2Node_CustomEvent_mainMenuState' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, K2Node_SwitchEnum_CmpSuccess) == 0x000099, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000A0, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, CallFunc_IsConsole_ReturnValue) == 0x0000A8, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, CallFunc_GetPlayerDisplayName_ReturnValue) == 0x0000B0, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::CallFunc_GetPlayerDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, K2Node_Select_Default) == 0x0000C0, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D8, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, K2Node_MakeStruct_FormatArgumentData) == 0x0000F0, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, CallFunc_TextIsEmpty_ReturnValue) == 0x000130, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, K2Node_MakeArray_Array) == 0x000138, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, CallFunc_Format_ReturnValue) == 0x000148, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreen_C_ExecuteUbergraph_SplashScreen, K2Node_Select_Default_1) == 0x000160, "Member 'SplashScreen_C_ExecuteUbergraph_SplashScreen::K2Node_Select_Default_1' has a wrong offset!");

// Function SplashScreen.SplashScreen_C.OnMainMenuStateChanged
// 0x0001 (0x0001 - 0x0000)
struct SplashScreen_C_OnMainMenuStateChanged final
{
public:
	EMainMenuState                                MainMenuState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SplashScreen_C_OnMainMenuStateChanged) == 0x000001, "Wrong alignment on SplashScreen_C_OnMainMenuStateChanged");
static_assert(sizeof(SplashScreen_C_OnMainMenuStateChanged) == 0x000001, "Wrong size on SplashScreen_C_OnMainMenuStateChanged");
static_assert(offsetof(SplashScreen_C_OnMainMenuStateChanged, MainMenuState) == 0x000000, "Member 'SplashScreen_C_OnMainMenuStateChanged::MainMenuState' has a wrong offset!");

}

