#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplineMeshBase_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SplineMeshData_structs.hpp"
#include "MeshIndex_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SplineMeshBase_BP.SplineMeshBase_BP_C
// 0x0168 (0x0420 - 0x02B8)
class ASplineMeshBase_BP_C : public ARBSplineMeshActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSplineMeshData>                Meshes;                                            // 0x02C8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FMeshIndex>                     OverwriteMeshes;                                   // 0x02D8(0x0010)(Edit, BlueprintVisible)
	bool                                          UseDetailsMesh;                                    // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            DetailsStaticMesh;                                 // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCollision;                                      // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DetailsMeshesDistance;                             // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               FowardAxis;                                        // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             MaterialOvewrite;                                  // 0x0308(0x0010)(Edit, BlueprintVisible)
	bool                                          CloseLoop;                                         // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MeshesScale;                                       // 0x031C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastLocation;                                      // 0x0328(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SplinePointsPositions;                             // 0x0334(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        CurrentPointsPositions;                            // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                LastTangent;                                       // 0x0350(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndDistance;                                       // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipMesh;                                          // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CurrentStaticMesh;                                 // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FloorTangent;                                      // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SnapOnGrid;                                        // 0x0371(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_372[0x2];                                      // 0x0372(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GridSize;                                          // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineCoordinateSpace                        GridSizeSpace;                                     // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DetailsMeshOffset;                                 // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 SkipMeshAtPoint;                                   // 0x0380(0x0010)(Edit, BlueprintVisible)
	bool                                          SkipLastMesh;                                      // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastFirstPointPosition;                            // 0x0394(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewWorldPosition;                                  // 0x03A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Zero;                                              // 0x03AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      DetailsVoid;                                       // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SkipDetailMesh;                                    // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDrawDistance;                                   // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CastStaticShadow;                                  // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLightingChannels                      LightingChannels;                                  // 0x03D1(0x0001)(Edit, BlueprintVisible, NoDestructor)
	ELightmapType                                 LightmapType;                                      // 0x03D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseMaterialDynamicDataForUV;                       // 0x03D3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASplineMeshBase_BP_C*                   Target;                                            // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USplineMeshComponent*>           SpawnedSplineMeshes;                               // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           DetailStaticMeshes;                                // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         NumberOfPoint;                                     // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        AllPointsPositions;                                // 0x0408(0x0010)(Edit, BlueprintVisible)
	bool                                          UseReoderPointOnAdd;                               // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SplineMeshBase_BP(int32 EntryPoint);
	void PostToggled(bool bToggleEnabled);
	void UserConstructionScript();
	void AddDetailsMeshes(float Distance, const struct FVector& Location, const struct FRotator& Relative_Transform_Rotation);
	void AddStaticMesh(const struct FVector& StartPos, const struct FVector& StartTangent, const struct FVector& EndPos, const struct FVector& EndTangent, class UStaticMesh* NewMesh, int32 Index_0);
	void FindClosetMeshes(int32 A, class USplineComponent* Target_0, TArray<struct FSplineMeshData>& Meshes_0, int32* Index_0);
	void SnapPointOnGrid(class USplineComponent* Spline_0);
	void Construct_Spline_Meshes();
	void ClearGeneratedMeshes();
	void SetSplinePosition();
	void FlattenTangent(class USplineComponent* Spline_0);
	void Snap();
	void Reorder_Point();
	void GetAllPointsPositions();

	bool IsTogglingStaticShadowComponentAllowed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SplineMeshBase_BP_C">();
	}
	static class ASplineMeshBase_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASplineMeshBase_BP_C>();
	}
};
static_assert(alignof(ASplineMeshBase_BP_C) == 0x000008, "Wrong alignment on ASplineMeshBase_BP_C");
static_assert(sizeof(ASplineMeshBase_BP_C) == 0x000420, "Wrong size on ASplineMeshBase_BP_C");
static_assert(offsetof(ASplineMeshBase_BP_C, UberGraphFrame) == 0x0002B8, "Member 'ASplineMeshBase_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, Billboard) == 0x0002C0, "Member 'ASplineMeshBase_BP_C::Billboard' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, Meshes) == 0x0002C8, "Member 'ASplineMeshBase_BP_C::Meshes' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, OverwriteMeshes) == 0x0002D8, "Member 'ASplineMeshBase_BP_C::OverwriteMeshes' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, UseDetailsMesh) == 0x0002E8, "Member 'ASplineMeshBase_BP_C::UseDetailsMesh' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, DetailsStaticMesh) == 0x0002F0, "Member 'ASplineMeshBase_BP_C::DetailsStaticMesh' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, UseCollision) == 0x0002F8, "Member 'ASplineMeshBase_BP_C::UseCollision' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, DetailsMeshesDistance) == 0x0002FC, "Member 'ASplineMeshBase_BP_C::DetailsMeshesDistance' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, FowardAxis) == 0x000300, "Member 'ASplineMeshBase_BP_C::FowardAxis' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, MaterialOvewrite) == 0x000308, "Member 'ASplineMeshBase_BP_C::MaterialOvewrite' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, CloseLoop) == 0x000318, "Member 'ASplineMeshBase_BP_C::CloseLoop' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, MeshesScale) == 0x00031C, "Member 'ASplineMeshBase_BP_C::MeshesScale' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, LastLocation) == 0x000328, "Member 'ASplineMeshBase_BP_C::LastLocation' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, SplinePointsPositions) == 0x000334, "Member 'ASplineMeshBase_BP_C::SplinePointsPositions' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, CurrentPointsPositions) == 0x000340, "Member 'ASplineMeshBase_BP_C::CurrentPointsPositions' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, LastTangent) == 0x000350, "Member 'ASplineMeshBase_BP_C::LastTangent' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, EndDistance) == 0x00035C, "Member 'ASplineMeshBase_BP_C::EndDistance' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, SkipMesh) == 0x000360, "Member 'ASplineMeshBase_BP_C::SkipMesh' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, CurrentStaticMesh) == 0x000368, "Member 'ASplineMeshBase_BP_C::CurrentStaticMesh' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, FloorTangent) == 0x000370, "Member 'ASplineMeshBase_BP_C::FloorTangent' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, SnapOnGrid) == 0x000371, "Member 'ASplineMeshBase_BP_C::SnapOnGrid' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, GridSize) == 0x000374, "Member 'ASplineMeshBase_BP_C::GridSize' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, GridSizeSpace) == 0x000378, "Member 'ASplineMeshBase_BP_C::GridSizeSpace' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, DetailsMeshOffset) == 0x00037C, "Member 'ASplineMeshBase_BP_C::DetailsMeshOffset' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, SkipMeshAtPoint) == 0x000380, "Member 'ASplineMeshBase_BP_C::SkipMeshAtPoint' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, SkipLastMesh) == 0x000390, "Member 'ASplineMeshBase_BP_C::SkipLastMesh' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, LastFirstPointPosition) == 0x000394, "Member 'ASplineMeshBase_BP_C::LastFirstPointPosition' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, NewWorldPosition) == 0x0003A0, "Member 'ASplineMeshBase_BP_C::NewWorldPosition' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, Zero) == 0x0003AC, "Member 'ASplineMeshBase_BP_C::Zero' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, DetailsVoid) == 0x0003B8, "Member 'ASplineMeshBase_BP_C::DetailsVoid' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, SkipDetailMesh) == 0x0003C8, "Member 'ASplineMeshBase_BP_C::SkipDetailMesh' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, MaxDrawDistance) == 0x0003CC, "Member 'ASplineMeshBase_BP_C::MaxDrawDistance' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, CastStaticShadow) == 0x0003D0, "Member 'ASplineMeshBase_BP_C::CastStaticShadow' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, LightingChannels) == 0x0003D1, "Member 'ASplineMeshBase_BP_C::LightingChannels' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, LightmapType) == 0x0003D2, "Member 'ASplineMeshBase_BP_C::LightmapType' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, UseMaterialDynamicDataForUV) == 0x0003D3, "Member 'ASplineMeshBase_BP_C::UseMaterialDynamicDataForUV' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, Target) == 0x0003D8, "Member 'ASplineMeshBase_BP_C::Target' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, SpawnedSplineMeshes) == 0x0003E0, "Member 'ASplineMeshBase_BP_C::SpawnedSplineMeshes' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, DetailStaticMeshes) == 0x0003F0, "Member 'ASplineMeshBase_BP_C::DetailStaticMeshes' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, NumberOfPoint) == 0x000400, "Member 'ASplineMeshBase_BP_C::NumberOfPoint' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, AllPointsPositions) == 0x000408, "Member 'ASplineMeshBase_BP_C::AllPointsPositions' has a wrong offset!");
static_assert(offsetof(ASplineMeshBase_BP_C, UseReoderPointOnAdd) == 0x000418, "Member 'ASplineMeshBase_BP_C::UseReoderPointOnAdd' has a wrong offset!");

}

