#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SteamShowerMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SteamShower-01_BP.SteamShower-01_BP_C
// 0x0050 (0x0480 - 0x0430)
class ASteamShowerMinus01_BP_C final : public ARBTriggerable
{
public:
	uint8                                         Pad_3CDE[0x8];                                     // 0x0428(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Ngr_SteamMinus07;                                  // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_SteamMinus06;                                  // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      RBSound;                                           // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_SteamMinus04;                                  // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_SteamMinus03;                                  // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_SteamMinus02;                                  // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_SteamMinus01;                                  // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SteamShowerMinus01;                                // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void Event_OnTriggered();
	void Event_OnUntriggered();
	void ExecuteUbergraph_SteamShowerMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SteamShower-01_BP_C">();
	}
	static class ASteamShowerMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASteamShowerMinus01_BP_C>();
	}
};
static_assert(alignof(ASteamShowerMinus01_BP_C) == 0x000010, "Wrong alignment on ASteamShowerMinus01_BP_C");
static_assert(sizeof(ASteamShowerMinus01_BP_C) == 0x000480, "Wrong size on ASteamShowerMinus01_BP_C");
static_assert(offsetof(ASteamShowerMinus01_BP_C, UberGraphFrame) == 0x000430, "Member 'ASteamShowerMinus01_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASteamShowerMinus01_BP_C, Ngr_SteamMinus07) == 0x000438, "Member 'ASteamShowerMinus01_BP_C::Ngr_SteamMinus07' has a wrong offset!");
static_assert(offsetof(ASteamShowerMinus01_BP_C, Ngr_SteamMinus06) == 0x000440, "Member 'ASteamShowerMinus01_BP_C::Ngr_SteamMinus06' has a wrong offset!");
static_assert(offsetof(ASteamShowerMinus01_BP_C, RBSound) == 0x000448, "Member 'ASteamShowerMinus01_BP_C::RBSound' has a wrong offset!");
static_assert(offsetof(ASteamShowerMinus01_BP_C, Ngr_SteamMinus04) == 0x000450, "Member 'ASteamShowerMinus01_BP_C::Ngr_SteamMinus04' has a wrong offset!");
static_assert(offsetof(ASteamShowerMinus01_BP_C, Ngr_SteamMinus03) == 0x000458, "Member 'ASteamShowerMinus01_BP_C::Ngr_SteamMinus03' has a wrong offset!");
static_assert(offsetof(ASteamShowerMinus01_BP_C, Ngr_SteamMinus02) == 0x000460, "Member 'ASteamShowerMinus01_BP_C::Ngr_SteamMinus02' has a wrong offset!");
static_assert(offsetof(ASteamShowerMinus01_BP_C, Ngr_SteamMinus01) == 0x000468, "Member 'ASteamShowerMinus01_BP_C::Ngr_SteamMinus01' has a wrong offset!");
static_assert(offsetof(ASteamShowerMinus01_BP_C, SteamShowerMinus01) == 0x000470, "Member 'ASteamShowerMinus01_BP_C::SteamShowerMinus01' has a wrong offset!");
static_assert(offsetof(ASteamShowerMinus01_BP_C, DefaultSceneRoot) == 0x000478, "Member 'ASteamShowerMinus01_BP_C::DefaultSceneRoot' has a wrong offset!");

}

