#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskRewardWidget

#include "Basic.hpp"

#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function TaskRewardWidget.TaskRewardWidget_C.ExecuteUbergraph_TaskRewardWidget
// 0x0068 (0x0068 - 0x0000)
struct TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EDA[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EDB[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget) == 0x000008, "Wrong alignment on TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget");
static_assert(sizeof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget) == 0x000068, "Wrong size on TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget");
static_assert(offsetof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget, EntryPoint) == 0x000000, "Member 'TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget, CallFunc_Percent_IntInt_ReturnValue) == 0x00001C, "Member 'TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget, CallFunc_Array_Length_ReturnValue_1) == 0x000020, "Member 'TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000038, "Member 'TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000040, "Member 'TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000050, "Member 'TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000058, "Member 'TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'TaskRewardWidget_C_ExecuteUbergraph_TaskRewardWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function TaskRewardWidget.TaskRewardWidget_C.Init
// 0x0010 (0x0010 - 0x0000)
struct TaskRewardWidget_C_Init final
{
public:
	TArray<struct FRewardUIData>                  Param_Rewards;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TaskRewardWidget_C_Init) == 0x000008, "Wrong alignment on TaskRewardWidget_C_Init");
static_assert(sizeof(TaskRewardWidget_C_Init) == 0x000010, "Wrong size on TaskRewardWidget_C_Init");
static_assert(offsetof(TaskRewardWidget_C_Init, Param_Rewards) == 0x000000, "Member 'TaskRewardWidget_C_Init::Param_Rewards' has a wrong offset!");

// Function TaskRewardWidget.TaskRewardWidget_C.SetAnimated
// 0x0002 (0x0002 - 0x0000)
struct TaskRewardWidget_C_SetAnimated final
{
public:
	bool                                          Param_bAnimated;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TaskRewardWidget_C_SetAnimated) == 0x000001, "Wrong alignment on TaskRewardWidget_C_SetAnimated");
static_assert(sizeof(TaskRewardWidget_C_SetAnimated) == 0x000002, "Wrong size on TaskRewardWidget_C_SetAnimated");
static_assert(offsetof(TaskRewardWidget_C_SetAnimated, Param_bAnimated) == 0x000000, "Member 'TaskRewardWidget_C_SetAnimated::Param_bAnimated' has a wrong offset!");
static_assert(offsetof(TaskRewardWidget_C_SetAnimated, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'TaskRewardWidget_C_SetAnimated::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

}

