#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TasksWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function TasksWidget.TasksWidget_C.ShowTasks
// 0x02E8 (0x02E8 - 0x0000)
struct TasksWidget_C_ShowTasks final
{
public:
	class FName                                   GroupID;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentSectionId;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FD9[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRBTaskMenuEntry>               CallFunc_GetTasks_ReturnValue;                     // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FDA[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FDB[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTaskButton_C*                          CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBTaskMenuEntry                       CallFunc_Array_Get_Item;                           // 0x0048(0x01B0)()
	class UTaskListSection_C*                     CallFunc_Create_ReturnValue_1;                     // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FDC[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGroupName_ReturnValue;                 // 0x0210(0x0018)(ConstParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0228(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0268(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0278(0x0018)()
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0290(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FDD[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTaskCategoryButton_C*                  K2Node_DynamicCast_AsTask_Category_Button;         // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FDE[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FDF[0x2];                                     // 0x02CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FRBTaskMenuEntry& Entry)> K2Node_CreateDelegate_OutputDelegate;              // 0x02D4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CanConsumeRewards_ReturnValue;            // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TasksWidget_C_ShowTasks) == 0x000008, "Wrong alignment on TasksWidget_C_ShowTasks");
static_assert(sizeof(TasksWidget_C_ShowTasks) == 0x0002E8, "Wrong size on TasksWidget_C_ShowTasks");
static_assert(offsetof(TasksWidget_C_ShowTasks, GroupID) == 0x000000, "Member 'TasksWidget_C_ShowTasks::GroupID' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CurrentSectionId) == 0x000008, "Member 'TasksWidget_C_ShowTasks::CurrentSectionId' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, Temp_int_Array_Index_Variable) == 0x000010, "Member 'TasksWidget_C_ShowTasks::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_GetTasks_ReturnValue) == 0x000018, "Member 'TasksWidget_C_ShowTasks::CallFunc_GetTasks_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'TasksWidget_C_ShowTasks::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'TasksWidget_C_ShowTasks::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'TasksWidget_C_ShowTasks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'TasksWidget_C_ShowTasks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'TasksWidget_C_ShowTasks::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_Create_ReturnValue) == 0x000040, "Member 'TasksWidget_C_ShowTasks::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_Array_Get_Item) == 0x000048, "Member 'TasksWidget_C_ShowTasks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_Create_ReturnValue_1) == 0x0001F8, "Member 'TasksWidget_C_ShowTasks::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_AddChild_ReturnValue) == 0x000200, "Member 'TasksWidget_C_ShowTasks::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_NotEqual_NameName_ReturnValue) == 0x000208, "Member 'TasksWidget_C_ShowTasks::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_GetGroupName_ReturnValue) == 0x000210, "Member 'TasksWidget_C_ShowTasks::CallFunc_GetGroupName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, K2Node_MakeStruct_FormatArgumentData) == 0x000228, "Member 'TasksWidget_C_ShowTasks::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, K2Node_MakeArray_Array) == 0x000268, "Member 'TasksWidget_C_ShowTasks::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_Format_ReturnValue) == 0x000278, "Member 'TasksWidget_C_ShowTasks::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_GetAllChildren_ReturnValue) == 0x000290, "Member 'TasksWidget_C_ShowTasks::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_Array_Get_Item_1) == 0x0002A0, "Member 'TasksWidget_C_ShowTasks::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_Array_Length_ReturnValue_1) == 0x0002A8, "Member 'TasksWidget_C_ShowTasks::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, K2Node_DynamicCast_AsTask_Category_Button) == 0x0002B0, "Member 'TasksWidget_C_ShowTasks::K2Node_DynamicCast_AsTask_Category_Button' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, K2Node_DynamicCast_bSuccess) == 0x0002B8, "Member 'TasksWidget_C_ShowTasks::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_AddChild_ReturnValue_1) == 0x0002C0, "Member 'TasksWidget_C_ShowTasks::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, Temp_int_Loop_Counter_Variable_1) == 0x0002C8, "Member 'TasksWidget_C_ShowTasks::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0002CC, "Member 'TasksWidget_C_ShowTasks::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002CD, "Member 'TasksWidget_C_ShowTasks::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_Add_IntInt_ReturnValue_1) == 0x0002D0, "Member 'TasksWidget_C_ShowTasks::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, K2Node_CreateDelegate_OutputDelegate) == 0x0002D4, "Member 'TasksWidget_C_ShowTasks::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_ShowTasks, CallFunc_CanConsumeRewards_ReturnValue) == 0x0002E4, "Member 'TasksWidget_C_ShowTasks::CallFunc_CanConsumeRewards_ReturnValue' has a wrong offset!");

// Function TasksWidget.TasksWidget_C.OnTaskClicked
// 0x01B0 (0x01B0 - 0x0000)
struct TasksWidget_C_OnTaskClicked final
{
public:
	struct FRBTaskMenuEntry                       Entry;                                             // 0x0000(0x01B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(TasksWidget_C_OnTaskClicked) == 0x000008, "Wrong alignment on TasksWidget_C_OnTaskClicked");
static_assert(sizeof(TasksWidget_C_OnTaskClicked) == 0x0001B0, "Wrong size on TasksWidget_C_OnTaskClicked");
static_assert(offsetof(TasksWidget_C_OnTaskClicked, Entry) == 0x000000, "Member 'TasksWidget_C_OnTaskClicked::Entry' has a wrong offset!");

// Function TasksWidget.TasksWidget_C.UpdateRefreshTime
// 0x00E8 (0x00E8 - 0x0000)
struct TasksWidget_C_UpdateRefreshTime final
{
public:
	int32                                         CallFunc_GetDaysUntilRefresh_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GroupHasRefreshTimer_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FE0[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FE1[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0060(0x0018)()
	int32                                         CallFunc_GetHoursUntilRefresh_ReturnValue;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FE2[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00D0(0x0018)()
};
static_assert(alignof(TasksWidget_C_UpdateRefreshTime) == 0x000008, "Wrong alignment on TasksWidget_C_UpdateRefreshTime");
static_assert(sizeof(TasksWidget_C_UpdateRefreshTime) == 0x0000E8, "Wrong size on TasksWidget_C_UpdateRefreshTime");
static_assert(offsetof(TasksWidget_C_UpdateRefreshTime, CallFunc_GetDaysUntilRefresh_ReturnValue) == 0x000000, "Member 'TasksWidget_C_UpdateRefreshTime::CallFunc_GetDaysUntilRefresh_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_UpdateRefreshTime, CallFunc_GroupHasRefreshTimer_ReturnValue) == 0x000004, "Member 'TasksWidget_C_UpdateRefreshTime::CallFunc_GroupHasRefreshTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_UpdateRefreshTime, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'TasksWidget_C_UpdateRefreshTime::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_UpdateRefreshTime, K2Node_MakeArray_Array) == 0x000048, "Member 'TasksWidget_C_UpdateRefreshTime::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_UpdateRefreshTime, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'TasksWidget_C_UpdateRefreshTime::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_UpdateRefreshTime, CallFunc_Format_ReturnValue) == 0x000060, "Member 'TasksWidget_C_UpdateRefreshTime::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_UpdateRefreshTime, CallFunc_GetHoursUntilRefresh_ReturnValue) == 0x000078, "Member 'TasksWidget_C_UpdateRefreshTime::CallFunc_GetHoursUntilRefresh_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_UpdateRefreshTime, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00007C, "Member 'TasksWidget_C_UpdateRefreshTime::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_UpdateRefreshTime, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'TasksWidget_C_UpdateRefreshTime::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_UpdateRefreshTime, K2Node_MakeArray_Array_1) == 0x0000C0, "Member 'TasksWidget_C_UpdateRefreshTime::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_UpdateRefreshTime, CallFunc_Format_ReturnValue_1) == 0x0000D0, "Member 'TasksWidget_C_UpdateRefreshTime::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function TasksWidget.TasksWidget_C.Event_Refresh
// 0x0048 (0x0048 - 0x0000)
struct TasksWidget_C_Event_Refresh final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FE3[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FE4[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTaskCategoryButton_C*                  K2Node_DynamicCast_AsTask_Category_Button;         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FE5[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHoursUntilRefresh_ReturnValue;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDaysUntilRefresh_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GroupHasRefreshTimer_ReturnValue;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedTasksPendingConsume_ReturnValue; // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TasksWidget_C_Event_Refresh) == 0x000008, "Wrong alignment on TasksWidget_C_Event_Refresh");
static_assert(sizeof(TasksWidget_C_Event_Refresh) == 0x000048, "Wrong size on TasksWidget_C_Event_Refresh");
static_assert(offsetof(TasksWidget_C_Event_Refresh, Temp_int_Array_Index_Variable) == 0x000000, "Member 'TasksWidget_C_Event_Refresh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Refresh, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'TasksWidget_C_Event_Refresh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Refresh, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'TasksWidget_C_Event_Refresh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Refresh, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'TasksWidget_C_Event_Refresh::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Refresh, CallFunc_Array_Get_Item) == 0x000020, "Member 'TasksWidget_C_Event_Refresh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Refresh, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'TasksWidget_C_Event_Refresh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Refresh, K2Node_DynamicCast_AsTask_Category_Button) == 0x000030, "Member 'TasksWidget_C_Event_Refresh::K2Node_DynamicCast_AsTask_Category_Button' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Refresh, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'TasksWidget_C_Event_Refresh::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Refresh, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'TasksWidget_C_Event_Refresh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Refresh, CallFunc_GetHoursUntilRefresh_ReturnValue) == 0x00003C, "Member 'TasksWidget_C_Event_Refresh::CallFunc_GetHoursUntilRefresh_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Refresh, CallFunc_GetDaysUntilRefresh_ReturnValue) == 0x000040, "Member 'TasksWidget_C_Event_Refresh::CallFunc_GetDaysUntilRefresh_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Refresh, CallFunc_GroupHasRefreshTimer_ReturnValue) == 0x000044, "Member 'TasksWidget_C_Event_Refresh::CallFunc_GroupHasRefreshTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Refresh, CallFunc_HasCompletedTasksPendingConsume_ReturnValue) == 0x000045, "Member 'TasksWidget_C_Event_Refresh::CallFunc_HasCompletedTasksPendingConsume_ReturnValue' has a wrong offset!");

// Function TasksWidget.TasksWidget_C.Event_Build
// 0x00B0 (0x00B0 - 0x0000)
struct TasksWidget_C_Event_Build final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FE6[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTaskCategoryButton_C*                  CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetActiveGroupIds_ReturnValue;            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHoursUntilRefresh_ReturnValue;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FE7[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDaysUntilRefresh_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GroupHasRefreshTimer_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FE8[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetGroupIcon_ReturnValue;                 // 0x0048(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedTasksPendingConsume_ReturnValue; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FE9[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGroupName_ReturnValue;                 // 0x0078(0x0018)(ConstParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ID)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TasksWidget_C_Event_Build) == 0x000008, "Wrong alignment on TasksWidget_C_Event_Build");
static_assert(sizeof(TasksWidget_C_Event_Build) == 0x0000B0, "Wrong size on TasksWidget_C_Event_Build");
static_assert(offsetof(TasksWidget_C_Event_Build, Temp_int_Array_Index_Variable) == 0x000000, "Member 'TasksWidget_C_Event_Build::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'TasksWidget_C_Event_Build::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'TasksWidget_C_Event_Build::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x00000C, "Member 'TasksWidget_C_Event_Build::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_Create_ReturnValue) == 0x000010, "Member 'TasksWidget_C_Event_Build::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_GetActiveGroupIds_ReturnValue) == 0x000018, "Member 'TasksWidget_C_Event_Build::CallFunc_GetActiveGroupIds_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_Array_Get_Item) == 0x000028, "Member 'TasksWidget_C_Event_Build::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'TasksWidget_C_Event_Build::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_GetHoursUntilRefresh_ReturnValue) == 0x000034, "Member 'TasksWidget_C_Event_Build::CallFunc_GetHoursUntilRefresh_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'TasksWidget_C_Event_Build::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_GetDaysUntilRefresh_ReturnValue) == 0x00003C, "Member 'TasksWidget_C_Event_Build::CallFunc_GetDaysUntilRefresh_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_GroupHasRefreshTimer_ReturnValue) == 0x000040, "Member 'TasksWidget_C_Event_Build::CallFunc_GroupHasRefreshTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_GetGroupIcon_ReturnValue) == 0x000048, "Member 'TasksWidget_C_Event_Build::CallFunc_GetGroupIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_HasCompletedTasksPendingConsume_ReturnValue) == 0x000070, "Member 'TasksWidget_C_Event_Build::CallFunc_HasCompletedTasksPendingConsume_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_GetGroupName_ReturnValue) == 0x000078, "Member 'TasksWidget_C_Event_Build::CallFunc_GetGroupName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_AddChild_ReturnValue) == 0x000090, "Member 'TasksWidget_C_Event_Build::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, K2Node_CreateDelegate_OutputDelegate) == 0x000098, "Member 'TasksWidget_C_Event_Build::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_Event_Build, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000A8, "Member 'TasksWidget_C_Event_Build::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function TasksWidget.TasksWidget_C.OnFocusReceived
// 0x0280 (0x0280 - 0x0000)
struct TasksWidget_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FEA[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0100(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01B8(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TasksWidget_C_OnFocusReceived) == 0x000008, "Wrong alignment on TasksWidget_C_OnFocusReceived");
static_assert(sizeof(TasksWidget_C_OnFocusReceived) == 0x000280, "Wrong size on TasksWidget_C_OnFocusReceived");
static_assert(offsetof(TasksWidget_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'TasksWidget_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'TasksWidget_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'TasksWidget_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_OnFocusReceived, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x0000F8, "Member 'TasksWidget_C_OnFocusReceived::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_OnFocusReceived, CallFunc_Unhandled_ReturnValue) == 0x000100, "Member 'TasksWidget_C_OnFocusReceived::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0001B8, "Member 'TasksWidget_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x000270, "Member 'TasksWidget_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_OnFocusReceived, CallFunc_IsValid_ReturnValue) == 0x000278, "Member 'TasksWidget_C_OnFocusReceived::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TasksWidget.TasksWidget_C.NavToSelectedGroup
// 0x0018 (0x0018 - 0x0000)
struct TasksWidget_C_NavToSelectedGroup final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FEB[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTaskCategoryButton_C*                  CallFunc_GetSelectedGroupWidget_selectedCategoryWidget; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TasksWidget_C_NavToSelectedGroup) == 0x000008, "Wrong alignment on TasksWidget_C_NavToSelectedGroup");
static_assert(sizeof(TasksWidget_C_NavToSelectedGroup) == 0x000018, "Wrong size on TasksWidget_C_NavToSelectedGroup");
static_assert(offsetof(TasksWidget_C_NavToSelectedGroup, Param_Navigation) == 0x000000, "Member 'TasksWidget_C_NavToSelectedGroup::Param_Navigation' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_NavToSelectedGroup, ReturnValue) == 0x000008, "Member 'TasksWidget_C_NavToSelectedGroup::ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_NavToSelectedGroup, CallFunc_GetSelectedGroupWidget_selectedCategoryWidget) == 0x000010, "Member 'TasksWidget_C_NavToSelectedGroup::CallFunc_GetSelectedGroupWidget_selectedCategoryWidget' has a wrong offset!");

// Function TasksWidget.TasksWidget_C.NavToTasks
// 0x0018 (0x0018 - 0x0000)
struct TasksWidget_C_NavToTasks final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FEC[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TasksWidget_C_NavToTasks) == 0x000008, "Wrong alignment on TasksWidget_C_NavToTasks");
static_assert(sizeof(TasksWidget_C_NavToTasks) == 0x000018, "Wrong size on TasksWidget_C_NavToTasks");
static_assert(offsetof(TasksWidget_C_NavToTasks, Param_Navigation) == 0x000000, "Member 'TasksWidget_C_NavToTasks::Param_Navigation' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_NavToTasks, ReturnValue) == 0x000008, "Member 'TasksWidget_C_NavToTasks::ReturnValue' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_NavToTasks, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'TasksWidget_C_NavToTasks::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function TasksWidget.TasksWidget_C.GetSelectedGroupWidget
// 0x0060 (0x0060 - 0x0000)
struct TasksWidget_C_GetSelectedGroupWidget final
{
public:
	class UTaskCategoryButton_C*                  SelectedCategoryWidget;                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTaskCategoryButton_C*                  SelectedWidget;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FED[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FEE[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FEF[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FF0[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FF1[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTaskCategoryButton_C*                  K2Node_DynamicCast_AsTask_Category_Button;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelected_bSelected;                     // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TasksWidget_C_GetSelectedGroupWidget) == 0x000008, "Wrong alignment on TasksWidget_C_GetSelectedGroupWidget");
static_assert(sizeof(TasksWidget_C_GetSelectedGroupWidget) == 0x000060, "Wrong size on TasksWidget_C_GetSelectedGroupWidget");
static_assert(offsetof(TasksWidget_C_GetSelectedGroupWidget, SelectedCategoryWidget) == 0x000000, "Member 'TasksWidget_C_GetSelectedGroupWidget::SelectedCategoryWidget' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_GetSelectedGroupWidget, SelectedWidget) == 0x000008, "Member 'TasksWidget_C_GetSelectedGroupWidget::SelectedWidget' has a wrong offset!");
static_assert(offsetof(TasksWidget_C_GetSelectedGroupWidget, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'TasksWidget_C_GetSelectedGroupWidget::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
