#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskProgressionHudWidget

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TaskProgressionHudWidget.TaskProgressionHudWidget_C.ExecuteUbergraph_TaskProgressionHudWidget
// 0x0258 (0x0258 - 0x0000)
struct TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CE1[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBTaskHudProgressDisplayDetails       K2Node_CustomEvent_details;                        // 0x0044(0x0008)(NoDestructor)
	uint8                                         Pad_2CE2[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBTasksConfig*                         CallFunc_GetTasksConfig_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBTaskDataRow                         CallFunc_GetTaskData_ReturnValue;                  // 0x0068(0x0188)(ConstParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01F0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0230(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0240(0x0018)()
};
static_assert(alignof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget) == 0x000008, "Wrong alignment on TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget");
static_assert(sizeof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget) == 0x000258, "Wrong size on TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, EntryPoint) == 0x000000, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, Temp_delegate_Variable) == 0x000004, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, CallFunc_PostEventGlobal_ReturnValue) == 0x000024, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, K2Node_CustomEvent_Loaded) == 0x000028, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, Temp_object_Variable) == 0x000030, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, K2Node_DynamicCast_AsTexture_2D) == 0x000038, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, K2Node_CustomEvent_details) == 0x000044, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::K2Node_CustomEvent_details' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000050, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000058, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, CallFunc_GetTasksConfig_ReturnValue) == 0x000060, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::CallFunc_GetTasksConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, CallFunc_GetTaskData_ReturnValue) == 0x000068, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::CallFunc_GetTaskData_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, K2Node_MakeStruct_FormatArgumentData) == 0x0001F0, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, K2Node_MakeArray_Array) == 0x000230, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget, CallFunc_Format_ReturnValue) == 0x000240, "Member 'TaskProgressionHudWidget_C_ExecuteUbergraph_TaskProgressionHudWidget::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function TaskProgressionHudWidget.TaskProgressionHudWidget_C.Show
// 0x0008 (0x0008 - 0x0000)
struct TaskProgressionHudWidget_C_Show final
{
public:
	struct FRBTaskHudProgressDisplayDetails       Details;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(TaskProgressionHudWidget_C_Show) == 0x000004, "Wrong alignment on TaskProgressionHudWidget_C_Show");
static_assert(sizeof(TaskProgressionHudWidget_C_Show) == 0x000008, "Wrong size on TaskProgressionHudWidget_C_Show");
static_assert(offsetof(TaskProgressionHudWidget_C_Show, Details) == 0x000000, "Member 'TaskProgressionHudWidget_C_Show::Details' has a wrong offset!");

// Function TaskProgressionHudWidget.TaskProgressionHudWidget_C.OnLoaded_225EBAA349307E17F6FD5792DBFB9AEE
// 0x0008 (0x0008 - 0x0000)
struct TaskProgressionHudWidget_C_OnLoaded_225EBAA349307E17F6FD5792DBFB9AEE final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskProgressionHudWidget_C_OnLoaded_225EBAA349307E17F6FD5792DBFB9AEE) == 0x000008, "Wrong alignment on TaskProgressionHudWidget_C_OnLoaded_225EBAA349307E17F6FD5792DBFB9AEE");
static_assert(sizeof(TaskProgressionHudWidget_C_OnLoaded_225EBAA349307E17F6FD5792DBFB9AEE) == 0x000008, "Wrong size on TaskProgressionHudWidget_C_OnLoaded_225EBAA349307E17F6FD5792DBFB9AEE");
static_assert(offsetof(TaskProgressionHudWidget_C_OnLoaded_225EBAA349307E17F6FD5792DBFB9AEE, Loaded) == 0x000000, "Member 'TaskProgressionHudWidget_C_OnLoaded_225EBAA349307E17F6FD5792DBFB9AEE::Loaded' has a wrong offset!");

}

