#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskRewardWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TaskRewardWidget.TaskRewardWidget_C
// 0x0038 (0x0298 - 0x0260)
class UTaskRewardWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hide;                                              // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USingleRewardWidget_C*                  SingleRewardWidget;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FRewardUIData>                  Rewards;                                           // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bAnimated;                                         // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentRewardIndex;                                // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TaskRewardWidget(int32 EntryPoint);
	void Animate();
	void Finished_FE3476BC4677FFD9574C21B61B4C3100();
	void Finished_06C8D1BA4A83DEE7EEB540A7F6355A36();
	void Init(TArray<struct FRewardUIData>& Rewards_0);
	void SetAnimated(bool bAnimated_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TaskRewardWidget_C">();
	}
	static class UTaskRewardWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTaskRewardWidget_C>();
	}
};
static_assert(alignof(UTaskRewardWidget_C) == 0x000008, "Wrong alignment on UTaskRewardWidget_C");
static_assert(sizeof(UTaskRewardWidget_C) == 0x000298, "Wrong size on UTaskRewardWidget_C");
static_assert(offsetof(UTaskRewardWidget_C, UberGraphFrame) == 0x000260, "Member 'UTaskRewardWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTaskRewardWidget_C, Show) == 0x000268, "Member 'UTaskRewardWidget_C::Show' has a wrong offset!");
static_assert(offsetof(UTaskRewardWidget_C, Hide) == 0x000270, "Member 'UTaskRewardWidget_C::Hide' has a wrong offset!");
static_assert(offsetof(UTaskRewardWidget_C, SingleRewardWidget) == 0x000278, "Member 'UTaskRewardWidget_C::SingleRewardWidget' has a wrong offset!");
static_assert(offsetof(UTaskRewardWidget_C, Rewards) == 0x000280, "Member 'UTaskRewardWidget_C::Rewards' has a wrong offset!");
static_assert(offsetof(UTaskRewardWidget_C, bAnimated) == 0x000290, "Member 'UTaskRewardWidget_C::bAnimated' has a wrong offset!");
static_assert(offsetof(UTaskRewardWidget_C, CurrentRewardIndex) == 0x000294, "Member 'UTaskRewardWidget_C::CurrentRewardIndex' has a wrong offset!");

}

