#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TasksWidget

#include "Basic.hpp"

#include "OPP_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TasksWidget.TasksWidget_C
// 0x00A0 (0x0330 - 0x0290)
class UTasksWidget_C final : public URBTasksWidget
{
public:
	class UTextBlock*                             CategoryTitle;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             GroupList;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LineImage;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RefreshTimeBox;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RefreshTimeText;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTaskButton_C*                          TaskButton;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTaskButton_C*                          TaskButton_1;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTaskButton_C*                          TaskButton_2;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTaskButton_C*                          TaskButton_3;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTaskButton_C*                          TaskButton_4;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTaskButton_C*                          TaskButton_130;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTaskButton_C*                          TaskButton_272;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTaskCategoryButton_C*                  TaskCategoryButton;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTaskCategoryButton_C*                  TaskCategoryButton_1;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTaskCategoryButton_C*                  TaskCategoryButton_2;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTaskCategoryButton_C*                  TaskCategoryButton_3;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTaskCategoryButton_C*                  TaskCategoryButton_4;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             TaskList;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TimerImage;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   Group_Id;                                          // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ShowTasks(class FName GroupID);
	void OnTaskClicked(const struct FRBTaskMenuEntry& Entry);
	void UpdateRefreshTime();
	void Event_Refresh();
	void Event_Build();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	class UWidget* NavToSelectedGroup(EUINavigation Param_Navigation);
	class UWidget* NavToTasks(EUINavigation Param_Navigation);
	void GetSelectedGroupWidget(class UTaskCategoryButton_C** SelectedCategoryWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TasksWidget_C">();
	}
	static class UTasksWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTasksWidget_C>();
	}
};
static_assert(alignof(UTasksWidget_C) == 0x000008, "Wrong alignment on UTasksWidget_C");
static_assert(sizeof(UTasksWidget_C) == 0x000330, "Wrong size on UTasksWidget_C");
static_assert(offsetof(UTasksWidget_C, CategoryTitle) == 0x000290, "Member 'UTasksWidget_C::CategoryTitle' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, GroupList) == 0x000298, "Member 'UTasksWidget_C::GroupList' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, LineImage) == 0x0002A0, "Member 'UTasksWidget_C::LineImage' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, RefreshTimeBox) == 0x0002A8, "Member 'UTasksWidget_C::RefreshTimeBox' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, RefreshTimeText) == 0x0002B0, "Member 'UTasksWidget_C::RefreshTimeText' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, TaskButton) == 0x0002B8, "Member 'UTasksWidget_C::TaskButton' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, TaskButton_1) == 0x0002C0, "Member 'UTasksWidget_C::TaskButton_1' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, TaskButton_2) == 0x0002C8, "Member 'UTasksWidget_C::TaskButton_2' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, TaskButton_3) == 0x0002D0, "Member 'UTasksWidget_C::TaskButton_3' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, TaskButton_4) == 0x0002D8, "Member 'UTasksWidget_C::TaskButton_4' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, TaskButton_130) == 0x0002E0, "Member 'UTasksWidget_C::TaskButton_130' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, TaskButton_272) == 0x0002E8, "Member 'UTasksWidget_C::TaskButton_272' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, TaskCategoryButton) == 0x0002F0, "Member 'UTasksWidget_C::TaskCategoryButton' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, TaskCategoryButton_1) == 0x0002F8, "Member 'UTasksWidget_C::TaskCategoryButton_1' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, TaskCategoryButton_2) == 0x000300, "Member 'UTasksWidget_C::TaskCategoryButton_2' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, TaskCategoryButton_3) == 0x000308, "Member 'UTasksWidget_C::TaskCategoryButton_3' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, TaskCategoryButton_4) == 0x000310, "Member 'UTasksWidget_C::TaskCategoryButton_4' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, TaskList) == 0x000318, "Member 'UTasksWidget_C::TaskList' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, TimerImage) == 0x000320, "Member 'UTasksWidget_C::TimerImage' has a wrong offset!");
static_assert(offsetof(UTasksWidget_C, Group_Id) == 0x000328, "Member 'UTasksWidget_C::Group_Id' has a wrong offset!");

}

