#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextChatEntry

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TextChatEntry.TextChatEntry_C.OnHidden__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TextChatEntry_C_OnHidden__DelegateSignature final
{
public:
	class UTextChatEntry_C*                       Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TextChatEntry_C_OnHidden__DelegateSignature) == 0x000008, "Wrong alignment on TextChatEntry_C_OnHidden__DelegateSignature");
static_assert(sizeof(TextChatEntry_C_OnHidden__DelegateSignature) == 0x000008, "Wrong size on TextChatEntry_C_OnHidden__DelegateSignature");
static_assert(offsetof(TextChatEntry_C_OnHidden__DelegateSignature, Entry) == 0x000000, "Member 'TextChatEntry_C_OnHidden__DelegateSignature::Entry' has a wrong offset!");

// Function TextChatEntry.TextChatEntry_C.ExecuteUbergraph_TextChatEntry
// 0x0004 (0x0004 - 0x0000)
struct TextChatEntry_C_ExecuteUbergraph_TextChatEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TextChatEntry_C_ExecuteUbergraph_TextChatEntry) == 0x000004, "Wrong alignment on TextChatEntry_C_ExecuteUbergraph_TextChatEntry");
static_assert(sizeof(TextChatEntry_C_ExecuteUbergraph_TextChatEntry) == 0x000004, "Wrong size on TextChatEntry_C_ExecuteUbergraph_TextChatEntry");
static_assert(offsetof(TextChatEntry_C_ExecuteUbergraph_TextChatEntry, EntryPoint) == 0x000000, "Member 'TextChatEntry_C_ExecuteUbergraph_TextChatEntry::EntryPoint' has a wrong offset!");

// Function TextChatEntry.TextChatEntry_C.Setup
// 0x0170 (0x0170 - 0x0000)
struct TextChatEntry_C_Setup final
{
public:
	struct FRBTextChatMessage                     Message_0;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTextChatWidget_BP_C*                   Parent_0;                                          // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TalkWheelColor;                                    // 0x0048(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            NotificationColor;                                 // 0x0070(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            GlobalColor;                                       // 0x0098(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            PartyColor;                                        // 0x00C0(0x0028)(Edit, BlueprintVisible)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0108(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0158(0x0018)()
};
static_assert(alignof(TextChatEntry_C_Setup) == 0x000008, "Wrong alignment on TextChatEntry_C_Setup");
static_assert(sizeof(TextChatEntry_C_Setup) == 0x000170, "Wrong size on TextChatEntry_C_Setup");
static_assert(offsetof(TextChatEntry_C_Setup, Message_0) == 0x000000, "Member 'TextChatEntry_C_Setup::Message_0' has a wrong offset!");
static_assert(offsetof(TextChatEntry_C_Setup, Parent_0) == 0x000040, "Member 'TextChatEntry_C_Setup::Parent_0' has a wrong offset!");
static_assert(offsetof(TextChatEntry_C_Setup, TalkWheelColor) == 0x000048, "Member 'TextChatEntry_C_Setup::TalkWheelColor' has a wrong offset!");
static_assert(offsetof(TextChatEntry_C_Setup, NotificationColor) == 0x000070, "Member 'TextChatEntry_C_Setup::NotificationColor' has a wrong offset!");
static_assert(offsetof(TextChatEntry_C_Setup, GlobalColor) == 0x000098, "Member 'TextChatEntry_C_Setup::GlobalColor' has a wrong offset!");
static_assert(offsetof(TextChatEntry_C_Setup, PartyColor) == 0x0000C0, "Member 'TextChatEntry_C_Setup::PartyColor' has a wrong offset!");
static_assert(offsetof(TextChatEntry_C_Setup, CallFunc_PlayAnimation_ReturnValue) == 0x0000E8, "Member 'TextChatEntry_C_Setup::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TextChatEntry_C_Setup, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F0, "Member 'TextChatEntry_C_Setup::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TextChatEntry_C_Setup, K2Node_MakeStruct_FormatArgumentData) == 0x000108, "Member 'TextChatEntry_C_Setup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(TextChatEntry_C_Setup, K2Node_MakeArray_Array) == 0x000148, "Member 'TextChatEntry_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TextChatEntry_C_Setup, CallFunc_Format_ReturnValue) == 0x000158, "Member 'TextChatEntry_C_Setup::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function TextChatEntry.TextChatEntry_C.Hide
// 0x0008 (0x0008 - 0x0000)
struct TextChatEntry_C_Hide final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TextChatEntry_C_Hide) == 0x000008, "Wrong alignment on TextChatEntry_C_Hide");
static_assert(sizeof(TextChatEntry_C_Hide) == 0x000008, "Wrong size on TextChatEntry_C_Hide");
static_assert(offsetof(TextChatEntry_C_Hide, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'TextChatEntry_C_Hide::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

