#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrialBoardTab

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TrialBoardTab.TrialBoardTab_C.CanFocusEntry
// 0x0010 (0x0010 - 0x0000)
struct TrialBoardTab_C_CanFocusEntry final
{
public:
	class URBSocialMenuEntry*                     Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanSendPartyInvite_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasFlag_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrialBoardTab_C_CanFocusEntry) == 0x000008, "Wrong alignment on TrialBoardTab_C_CanFocusEntry");
static_assert(sizeof(TrialBoardTab_C_CanFocusEntry) == 0x000010, "Wrong size on TrialBoardTab_C_CanFocusEntry");
static_assert(offsetof(TrialBoardTab_C_CanFocusEntry, Entry) == 0x000000, "Member 'TrialBoardTab_C_CanFocusEntry::Entry' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_CanFocusEntry, ReturnValue) == 0x000008, "Member 'TrialBoardTab_C_CanFocusEntry::ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_CanFocusEntry, CallFunc_CanSendPartyInvite_ReturnValue) == 0x000009, "Member 'TrialBoardTab_C_CanFocusEntry::CallFunc_CanSendPartyInvite_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_CanFocusEntry, CallFunc_HasFlag_ReturnValue) == 0x00000A, "Member 'TrialBoardTab_C_CanFocusEntry::CallFunc_HasFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_CanFocusEntry, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'TrialBoardTab_C_CanFocusEntry::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function TrialBoardTab.TrialBoardTab_C.GetPosterTextureForTrial
// 0x02E8 (0x02E8 - 0x0000)
struct TrialBoardTab_C_GetPosterTextureForTrial final
{
public:
	class FName                                   TrialId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGameStructureConfig*                 CallFunc_GetGameStructureConfig_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBTrialInfoRow                        CallFunc_GetTrialInfo_ReturnValue;                 // 0x0018(0x0158)(ConstParm)
	struct FRBProgramInfoRow                      CallFunc_GetProgramInfo_ReturnValue;               // 0x0170(0x0148)(ConstParm)
	class UObject*                                CallFunc_TryLoadSyncSoftRef_NewParam;              // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3577[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_TryLoadSyncSoftRef_NewParam_1;            // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrialBoardTab_C_GetPosterTextureForTrial) == 0x000008, "Wrong alignment on TrialBoardTab_C_GetPosterTextureForTrial");
static_assert(sizeof(TrialBoardTab_C_GetPosterTextureForTrial) == 0x0002E8, "Wrong size on TrialBoardTab_C_GetPosterTextureForTrial");
static_assert(offsetof(TrialBoardTab_C_GetPosterTextureForTrial, TrialId) == 0x000000, "Member 'TrialBoardTab_C_GetPosterTextureForTrial::TrialId' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetPosterTextureForTrial, Texture) == 0x000008, "Member 'TrialBoardTab_C_GetPosterTextureForTrial::Texture' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetPosterTextureForTrial, CallFunc_GetGameStructureConfig_ReturnValue) == 0x000010, "Member 'TrialBoardTab_C_GetPosterTextureForTrial::CallFunc_GetGameStructureConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetPosterTextureForTrial, CallFunc_GetTrialInfo_ReturnValue) == 0x000018, "Member 'TrialBoardTab_C_GetPosterTextureForTrial::CallFunc_GetTrialInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetPosterTextureForTrial, CallFunc_GetProgramInfo_ReturnValue) == 0x000170, "Member 'TrialBoardTab_C_GetPosterTextureForTrial::CallFunc_GetProgramInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetPosterTextureForTrial, CallFunc_TryLoadSyncSoftRef_NewParam) == 0x0002B8, "Member 'TrialBoardTab_C_GetPosterTextureForTrial::CallFunc_TryLoadSyncSoftRef_NewParam' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetPosterTextureForTrial, K2Node_DynamicCast_AsTexture_2D) == 0x0002C0, "Member 'TrialBoardTab_C_GetPosterTextureForTrial::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetPosterTextureForTrial, K2Node_DynamicCast_bSuccess) == 0x0002C8, "Member 'TrialBoardTab_C_GetPosterTextureForTrial::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetPosterTextureForTrial, CallFunc_TryLoadSyncSoftRef_NewParam_1) == 0x0002D0, "Member 'TrialBoardTab_C_GetPosterTextureForTrial::CallFunc_TryLoadSyncSoftRef_NewParam_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetPosterTextureForTrial, K2Node_DynamicCast_AsTexture_2D_1) == 0x0002D8, "Member 'TrialBoardTab_C_GetPosterTextureForTrial::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetPosterTextureForTrial, K2Node_DynamicCast_bSuccess_1) == 0x0002E0, "Member 'TrialBoardTab_C_GetPosterTextureForTrial::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetPosterTextureForTrial, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0002E1, "Member 'TrialBoardTab_C_GetPosterTextureForTrial::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

// Function TrialBoardTab.TrialBoardTab_C.SetupCanvasEntryNavigationRules
// 0x0018 (0x0018 - 0x0000)
struct TrialBoardTab_C_SetupCanvasEntryNavigationRules final
{
public:
	class UWidget*                                Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EUINavigation Navigation)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(TrialBoardTab_C_SetupCanvasEntryNavigationRules) == 0x000008, "Wrong alignment on TrialBoardTab_C_SetupCanvasEntryNavigationRules");
static_assert(sizeof(TrialBoardTab_C_SetupCanvasEntryNavigationRules) == 0x000018, "Wrong size on TrialBoardTab_C_SetupCanvasEntryNavigationRules");
static_assert(offsetof(TrialBoardTab_C_SetupCanvasEntryNavigationRules, Entry) == 0x000000, "Member 'TrialBoardTab_C_SetupCanvasEntryNavigationRules::Entry' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_SetupCanvasEntryNavigationRules, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'TrialBoardTab_C_SetupCanvasEntryNavigationRules::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function TrialBoardTab.TrialBoardTab_C.StartGroupFinder
// 0x0198 (0x0198 - 0x0000)
struct TrialBoardTab_C_StartGroupFinder final
{
public:
	class URBGameStructureConfig*                 CallFunc_GetGameStructureConfig_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMatchSettings                         CallFunc_GetMatchSettings_ReturnValue;             // 0x0010(0x0024)(ConstParm, NoDestructor)
	uint8                                         Pad_3578[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBTrialInfoRow                        CallFunc_GetTrialInfo_ReturnValue;                 // 0x0038(0x0158)(ConstParm)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrialBoardTab_C_StartGroupFinder) == 0x000008, "Wrong alignment on TrialBoardTab_C_StartGroupFinder");
static_assert(sizeof(TrialBoardTab_C_StartGroupFinder) == 0x000198, "Wrong size on TrialBoardTab_C_StartGroupFinder");
static_assert(offsetof(TrialBoardTab_C_StartGroupFinder, CallFunc_GetGameStructureConfig_ReturnValue) == 0x000000, "Member 'TrialBoardTab_C_StartGroupFinder::CallFunc_GetGameStructureConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_StartGroupFinder, CallFunc_MakeLiteralName_ReturnValue) == 0x000008, "Member 'TrialBoardTab_C_StartGroupFinder::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_StartGroupFinder, CallFunc_GetMatchSettings_ReturnValue) == 0x000010, "Member 'TrialBoardTab_C_StartGroupFinder::CallFunc_GetMatchSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_StartGroupFinder, CallFunc_GetTrialInfo_ReturnValue) == 0x000038, "Member 'TrialBoardTab_C_StartGroupFinder::CallFunc_GetTrialInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_StartGroupFinder, K2Node_SwitchInteger_CmpSuccess) == 0x000190, "Member 'TrialBoardTab_C_StartGroupFinder::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function TrialBoardTab.TrialBoardTab_C.GetFindAGroupButtonNavigation
// 0x0018 (0x0018 - 0x0000)
struct TrialBoardTab_C_GetFindAGroupButtonNavigation final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3579[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrialBoardTab_C_GetFindAGroupButtonNavigation) == 0x000008, "Wrong alignment on TrialBoardTab_C_GetFindAGroupButtonNavigation");
static_assert(sizeof(TrialBoardTab_C_GetFindAGroupButtonNavigation) == 0x000018, "Wrong size on TrialBoardTab_C_GetFindAGroupButtonNavigation");
static_assert(offsetof(TrialBoardTab_C_GetFindAGroupButtonNavigation, Param_Navigation) == 0x000000, "Member 'TrialBoardTab_C_GetFindAGroupButtonNavigation::Param_Navigation' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetFindAGroupButtonNavigation, ReturnValue) == 0x000008, "Member 'TrialBoardTab_C_GetFindAGroupButtonNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetFindAGroupButtonNavigation, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'TrialBoardTab_C_GetFindAGroupButtonNavigation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function TrialBoardTab.TrialBoardTab_C.GetSelectedTrialNavigation
// 0x0018 (0x0018 - 0x0000)
struct TrialBoardTab_C_GetSelectedTrialNavigation final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_357A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrialBoardTab_C_GetSelectedTrialNavigation) == 0x000008, "Wrong alignment on TrialBoardTab_C_GetSelectedTrialNavigation");
static_assert(sizeof(TrialBoardTab_C_GetSelectedTrialNavigation) == 0x000018, "Wrong size on TrialBoardTab_C_GetSelectedTrialNavigation");
static_assert(offsetof(TrialBoardTab_C_GetSelectedTrialNavigation, Param_Navigation) == 0x000000, "Member 'TrialBoardTab_C_GetSelectedTrialNavigation::Param_Navigation' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetSelectedTrialNavigation, ReturnValue) == 0x000008, "Member 'TrialBoardTab_C_GetSelectedTrialNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetSelectedTrialNavigation, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'TrialBoardTab_C_GetSelectedTrialNavigation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function TrialBoardTab.TrialBoardTab_C.GetSelectedProgramNavigation
// 0x0018 (0x0018 - 0x0000)
struct TrialBoardTab_C_GetSelectedProgramNavigation final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_357B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrialBoardTab_C_GetSelectedProgramNavigation) == 0x000008, "Wrong alignment on TrialBoardTab_C_GetSelectedProgramNavigation");
static_assert(sizeof(TrialBoardTab_C_GetSelectedProgramNavigation) == 0x000018, "Wrong size on TrialBoardTab_C_GetSelectedProgramNavigation");
static_assert(offsetof(TrialBoardTab_C_GetSelectedProgramNavigation, Param_Navigation) == 0x000000, "Member 'TrialBoardTab_C_GetSelectedProgramNavigation::Param_Navigation' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetSelectedProgramNavigation, ReturnValue) == 0x000008, "Member 'TrialBoardTab_C_GetSelectedProgramNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetSelectedProgramNavigation, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'TrialBoardTab_C_GetSelectedProgramNavigation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function TrialBoardTab.TrialBoardTab_C.GetAnyTrialNavigation
// 0x0018 (0x0018 - 0x0000)
struct TrialBoardTab_C_GetAnyTrialNavigation final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_357C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrialBoardTab_C_GetAnyTrialNavigation) == 0x000008, "Wrong alignment on TrialBoardTab_C_GetAnyTrialNavigation");
static_assert(sizeof(TrialBoardTab_C_GetAnyTrialNavigation) == 0x000018, "Wrong size on TrialBoardTab_C_GetAnyTrialNavigation");
static_assert(offsetof(TrialBoardTab_C_GetAnyTrialNavigation, Param_Navigation) == 0x000000, "Member 'TrialBoardTab_C_GetAnyTrialNavigation::Param_Navigation' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetAnyTrialNavigation, ReturnValue) == 0x000008, "Member 'TrialBoardTab_C_GetAnyTrialNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_GetAnyTrialNavigation, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'TrialBoardTab_C_GetAnyTrialNavigation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function TrialBoardTab.TrialBoardTab_C.ChangeFilter
// 0x0040 (0x0040 - 0x0000)
struct TrialBoardTab_C_ChangeFilter final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	ERBSocialMenuEntryFilter                      Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERBSocialMenuEntryFilter                      Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERBSocialMenuEntryFilter                      Temp_byte_Variable_2;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_357D[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuWithTabsWidget*                  CallFunc_GetMenuWithTabsParent_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMenuFocused_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_357E[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_357F[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERBSocialMenuEntryFilter                      CallFunc_GetFilter_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERBSocialMenuEntryFilter                      K2Node_Select_Default;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialBoardTab_C_ChangeFilter) == 0x000008, "Wrong alignment on TrialBoardTab_C_ChangeFilter");
static_assert(sizeof(TrialBoardTab_C_ChangeFilter) == 0x000040, "Wrong size on TrialBoardTab_C_ChangeFilter");
static_assert(offsetof(TrialBoardTab_C_ChangeFilter, Temp_delegate_Variable) == 0x000000, "Member 'TrialBoardTab_C_ChangeFilter::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ChangeFilter, Temp_byte_Variable) == 0x000010, "Member 'TrialBoardTab_C_ChangeFilter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ChangeFilter, Temp_byte_Variable_1) == 0x000011, "Member 'TrialBoardTab_C_ChangeFilter::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ChangeFilter, Temp_byte_Variable_2) == 0x000012, "Member 'TrialBoardTab_C_ChangeFilter::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ChangeFilter, CallFunc_GetMenuWithTabsParent_ReturnValue) == 0x000018, "Member 'TrialBoardTab_C_ChangeFilter::CallFunc_GetMenuWithTabsParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ChangeFilter, CallFunc_IsMenuFocused_ReturnValue) == 0x000020, "Member 'TrialBoardTab_C_ChangeFilter::CallFunc_IsMenuFocused_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ChangeFilter, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000028, "Member 'TrialBoardTab_C_ChangeFilter::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ChangeFilter, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'TrialBoardTab_C_ChangeFilter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ChangeFilter, CallFunc_PostEventGlobal_ReturnValue) == 0x000034, "Member 'TrialBoardTab_C_ChangeFilter::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ChangeFilter, CallFunc_GetFilter_ReturnValue) == 0x000038, "Member 'TrialBoardTab_C_ChangeFilter::CallFunc_GetFilter_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ChangeFilter, K2Node_Select_Default) == 0x000039, "Member 'TrialBoardTab_C_ChangeFilter::K2Node_Select_Default' has a wrong offset!");

// Function TrialBoardTab.TrialBoardTab_C.OnFilterButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct TrialBoardTab_C_OnFilterButtonClicked final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialBoardTab_C_OnFilterButtonClicked) == 0x000008, "Wrong alignment on TrialBoardTab_C_OnFilterButtonClicked");
static_assert(sizeof(TrialBoardTab_C_OnFilterButtonClicked) == 0x000008, "Wrong size on TrialBoardTab_C_OnFilterButtonClicked");
static_assert(offsetof(TrialBoardTab_C_OnFilterButtonClicked, Button) == 0x000000, "Member 'TrialBoardTab_C_OnFilterButtonClicked::Button' has a wrong offset!");

// Function TrialBoardTab.TrialBoardTab_C.UpdateDisplayedTrialOptions
// 0x01D8 (0x01D8 - 0x0000)
struct TrialBoardTab_C_UpdateDisplayedTrialOptions final
{
public:
	class UProgramTrialBlockWidget_C*             CurrentProgramBlockWidget;                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3580[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0030(0x0018)()
	bool                                          Temp_bool_Variable_4;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatchOwner_ReturnValue;                 // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMatchOwner_ReturnValue_1;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3581[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGameStructureConfig*                 CallFunc_GetGameStructureConfig_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBTrialInfoRow                        CallFunc_GetTrialInfo_ReturnValue;                 // 0x0058(0x0158)(ConstParm)
	bool                                          CallFunc_IsTrialUnlocked_ReturnValue;              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3582[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x01B8(0x0018)()
	bool                                          CallFunc_CanSelectTrial_ReturnValue;               // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialBoardTab_C_UpdateDisplayedTrialOptions) == 0x000008, "Wrong alignment on TrialBoardTab_C_UpdateDisplayedTrialOptions");
static_assert(sizeof(TrialBoardTab_C_UpdateDisplayedTrialOptions) == 0x0001D8, "Wrong size on TrialBoardTab_C_UpdateDisplayedTrialOptions");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, CurrentProgramBlockWidget) == 0x000000, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::CurrentProgramBlockWidget' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_bool_Variable) == 0x000008, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_byte_Variable) == 0x000009, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_byte_Variable_1) == 0x00000A, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_bool_Variable_1) == 0x00000B, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_byte_Variable_2) == 0x00000C, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_byte_Variable_3) == 0x00000D, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_bool_Variable_2) == 0x00000E, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_byte_Variable_4) == 0x00000F, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_byte_Variable_5) == 0x000010, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_bool_Variable_3) == 0x000011, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_text_Variable) == 0x000018, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_text_Variable_1) == 0x000030, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_bool_Variable_4) == 0x000048, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_byte_Variable_6) == 0x000049, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, Temp_byte_Variable_7) == 0x00004A, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, CallFunc_IsMatchOwner_ReturnValue) == 0x00004B, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::CallFunc_IsMatchOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, CallFunc_IsMatchOwner_ReturnValue_1) == 0x00004C, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::CallFunc_IsMatchOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, K2Node_Select_Default) == 0x00004D, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, CallFunc_GetGameStructureConfig_ReturnValue) == 0x000050, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::CallFunc_GetGameStructureConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, CallFunc_GetTrialInfo_ReturnValue) == 0x000058, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::CallFunc_GetTrialInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, CallFunc_IsTrialUnlocked_ReturnValue) == 0x0001B0, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::CallFunc_IsTrialUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, CallFunc_Greater_IntInt_ReturnValue) == 0x0001B1, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, K2Node_Select_Default_1) == 0x0001B2, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, K2Node_Select_Default_2) == 0x0001B3, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, K2Node_Select_Default_3) == 0x0001B8, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, CallFunc_CanSelectTrial_ReturnValue) == 0x0001D0, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::CallFunc_CanSelectTrial_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, CallFunc_BooleanAND_ReturnValue) == 0x0001D1, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_UpdateDisplayedTrialOptions, K2Node_Select_Default_4) == 0x0001D2, "Member 'TrialBoardTab_C_UpdateDisplayedTrialOptions::K2Node_Select_Default_4' has a wrong offset!");

// Function TrialBoardTab.TrialBoardTab_C.ToggleGroupFinder
// 0x0038 (0x0038 - 0x0000)
struct TrialBoardTab_C_ToggleGroupFinder final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class URBMenuWithTabsWidget*                  CallFunc_GetMenuWithTabsParent_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShowingMenuTutorial_isShowingTutorial;  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMenuFocused_ReturnValue;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3583[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3584[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanFindParty_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanCancelFindParty_ReturnValue;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrialBoardTab_C_ToggleGroupFinder) == 0x000008, "Wrong alignment on TrialBoardTab_C_ToggleGroupFinder");
static_assert(sizeof(TrialBoardTab_C_ToggleGroupFinder) == 0x000038, "Wrong size on TrialBoardTab_C_ToggleGroupFinder");
static_assert(offsetof(TrialBoardTab_C_ToggleGroupFinder, Temp_delegate_Variable) == 0x000000, "Member 'TrialBoardTab_C_ToggleGroupFinder::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ToggleGroupFinder, CallFunc_GetMenuWithTabsParent_ReturnValue) == 0x000010, "Member 'TrialBoardTab_C_ToggleGroupFinder::CallFunc_GetMenuWithTabsParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ToggleGroupFinder, CallFunc_IsShowingMenuTutorial_isShowingTutorial) == 0x000018, "Member 'TrialBoardTab_C_ToggleGroupFinder::CallFunc_IsShowingMenuTutorial_isShowingTutorial' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ToggleGroupFinder, CallFunc_IsMenuFocused_ReturnValue) == 0x000019, "Member 'TrialBoardTab_C_ToggleGroupFinder::CallFunc_IsMenuFocused_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ToggleGroupFinder, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'TrialBoardTab_C_ToggleGroupFinder::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ToggleGroupFinder, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000020, "Member 'TrialBoardTab_C_ToggleGroupFinder::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ToggleGroupFinder, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'TrialBoardTab_C_ToggleGroupFinder::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ToggleGroupFinder, CallFunc_PostEventGlobal_ReturnValue) == 0x00002C, "Member 'TrialBoardTab_C_ToggleGroupFinder::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ToggleGroupFinder, CallFunc_CanFindParty_ReturnValue) == 0x000030, "Member 'TrialBoardTab_C_ToggleGroupFinder::CallFunc_CanFindParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ToggleGroupFinder, CallFunc_CanCancelFindParty_ReturnValue) == 0x000031, "Member 'TrialBoardTab_C_ToggleGroupFinder::CallFunc_CanCancelFindParty_ReturnValue' has a wrong offset!");

// Function TrialBoardTab.TrialBoardTab_C.OnAddAFriendButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct TrialBoardTab_C_OnAddAFriendButtonClicked final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialBoardTab_C_OnAddAFriendButtonClicked) == 0x000008, "Wrong alignment on TrialBoardTab_C_OnAddAFriendButtonClicked");
static_assert(sizeof(TrialBoardTab_C_OnAddAFriendButtonClicked) == 0x000008, "Wrong size on TrialBoardTab_C_OnAddAFriendButtonClicked");
static_assert(offsetof(TrialBoardTab_C_OnAddAFriendButtonClicked, Button) == 0x000000, "Member 'TrialBoardTab_C_OnAddAFriendButtonClicked::Button' has a wrong offset!");

// Function TrialBoardTab.TrialBoardTab_C.ShowAddAFriend
// 0x0050 (0x0050 - 0x0000)
struct TrialBoardTab_C_ShowAddAFriend final
{
public:
	class URBMenuWithTabsWidget*                  CallFunc_GetMenuWithTabsParent_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMenuFocused_ReturnValue;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3585[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CanAddFriend_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3586[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3587[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuWithTabsWidget*                  CallFunc_GetMenuWithTabsParent_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterSheet_C*                      K2Node_DynamicCast_AsCharacter_Sheet;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrialBoardTab_C_ShowAddAFriend) == 0x000008, "Wrong alignment on TrialBoardTab_C_ShowAddAFriend");
static_assert(sizeof(TrialBoardTab_C_ShowAddAFriend) == 0x000050, "Wrong size on TrialBoardTab_C_ShowAddAFriend");
static_assert(offsetof(TrialBoardTab_C_ShowAddAFriend, CallFunc_GetMenuWithTabsParent_ReturnValue) == 0x000000, "Member 'TrialBoardTab_C_ShowAddAFriend::CallFunc_GetMenuWithTabsParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ShowAddAFriend, CallFunc_IsMenuFocused_ReturnValue) == 0x000008, "Member 'TrialBoardTab_C_ShowAddAFriend::CallFunc_IsMenuFocused_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ShowAddAFriend, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000010, "Member 'TrialBoardTab_C_ShowAddAFriend::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ShowAddAFriend, Temp_delegate_Variable) == 0x000018, "Member 'TrialBoardTab_C_ShowAddAFriend::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ShowAddAFriend, CallFunc_CanAddFriend_ReturnValue) == 0x000028, "Member 'TrialBoardTab_C_ShowAddAFriend::CallFunc_CanAddFriend_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ShowAddAFriend, CallFunc_PostEventGlobal_ReturnValue) == 0x00002C, "Member 'TrialBoardTab_C_ShowAddAFriend::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ShowAddAFriend, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'TrialBoardTab_C_ShowAddAFriend::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ShowAddAFriend, CallFunc_BooleanAND_ReturnValue_1) == 0x000031, "Member 'TrialBoardTab_C_ShowAddAFriend::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ShowAddAFriend, CallFunc_GetMenuWithTabsParent_ReturnValue_1) == 0x000038, "Member 'TrialBoardTab_C_ShowAddAFriend::CallFunc_GetMenuWithTabsParent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ShowAddAFriend, K2Node_DynamicCast_AsCharacter_Sheet) == 0x000040, "Member 'TrialBoardTab_C_ShowAddAFriend::K2Node_DynamicCast_AsCharacter_Sheet' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_ShowAddAFriend, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'TrialBoardTab_C_ShowAddAFriend::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function TrialBoardTab.TrialBoardTab_C.OnInputSourceChanged
// 0x00C0 (0x00C0 - 0x0000)
struct TrialBoardTab_C_OnInputSourceChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3588[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3589[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_358A[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgramTrialVariatorWidget_C*          K2Node_DynamicCast_AsProgram_Trial_Variator_Widget; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_358B[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_358C[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_358D[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgramTrialBlockWidget_C*             K2Node_DynamicCast_AsProgram_Trial_Block_Widget;   // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_358E[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_358F[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_2;             // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3590[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgramTrialEntryContentWidget_C*      K2Node_DynamicCast_AsProgram_Trial_Entry_Content_Widget; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3591[0x1];                                     // 0x00BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialBoardTab_C_OnInputSourceChanged) == 0x000008, "Wrong alignment on TrialBoardTab_C_OnInputSourceChanged");
static_assert(sizeof(TrialBoardTab_C_OnInputSourceChanged) == 0x0000C0, "Wrong size on TrialBoardTab_C_OnInputSourceChanged");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, bIsGamepad) == 0x000000, "Member 'TrialBoardTab_C_OnInputSourceChanged::bIsGamepad' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, Temp_int_Array_Index_Variable) == 0x000004, "Member 'TrialBoardTab_C_OnInputSourceChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, Temp_int_Array_Index_Variable_1) == 0x000008, "Member 'TrialBoardTab_C_OnInputSourceChanged::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'TrialBoardTab_C_OnInputSourceChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'TrialBoardTab_C_OnInputSourceChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, Temp_int_Array_Index_Variable_2) == 0x000014, "Member 'TrialBoardTab_C_OnInputSourceChanged::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'TrialBoardTab_C_OnInputSourceChanged::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'TrialBoardTab_C_OnInputSourceChanged::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'TrialBoardTab_C_OnInputSourceChanged::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, CallFunc_Array_Get_Item) == 0x000038, "Member 'TrialBoardTab_C_OnInputSourceChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, K2Node_DynamicCast_AsProgram_Trial_Variator_Widget) == 0x000040, "Member 'TrialBoardTab_C_OnInputSourceChanged::K2Node_DynamicCast_AsProgram_Trial_Variator_Widget' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'TrialBoardTab_C_OnInputSourceChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'TrialBoardTab_C_OnInputSourceChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, Temp_int_Loop_Counter_Variable_2) == 0x000050, "Member 'TrialBoardTab_C_OnInputSourceChanged::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, CallFunc_GetAllChildren_ReturnValue_1) == 0x000058, "Member 'TrialBoardTab_C_OnInputSourceChanged::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'TrialBoardTab_C_OnInputSourceChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'TrialBoardTab_C_OnInputSourceChanged::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, K2Node_DynamicCast_AsProgram_Trial_Block_Widget) == 0x000078, "Member 'TrialBoardTab_C_OnInputSourceChanged::K2Node_DynamicCast_AsProgram_Trial_Block_Widget' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'TrialBoardTab_C_OnInputSourceChanged::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, CallFunc_Array_Length_ReturnValue_1) == 0x000084, "Member 'TrialBoardTab_C_OnInputSourceChanged::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, CallFunc_Less_IntInt_ReturnValue_1) == 0x000088, "Member 'TrialBoardTab_C_OnInputSourceChanged::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, CallFunc_GetAllChildren_ReturnValue_2) == 0x000090, "Member 'TrialBoardTab_C_OnInputSourceChanged::CallFunc_GetAllChildren_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, CallFunc_Array_Get_Item_2) == 0x0000A0, "Member 'TrialBoardTab_C_OnInputSourceChanged::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, CallFunc_Array_Length_ReturnValue_2) == 0x0000A8, "Member 'TrialBoardTab_C_OnInputSourceChanged::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, K2Node_DynamicCast_AsProgram_Trial_Entry_Content_Widget) == 0x0000B0, "Member 'TrialBoardTab_C_OnInputSourceChanged::K2Node_DynamicCast_AsProgram_Trial_Entry_Content_Widget' has a wrong offset!");
static_assert(offsetof(TrialBoardTab_C_OnInputSourceChanged, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'TrialBoardTab_C_OnInputSourceChanged::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
