#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrialDetailsNotificationHudWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function TrialDetailsNotificationHudWidget.TrialDetailsNotificationHudWidget_C.ExecuteUbergraph_TrialDetailsNotificationHudWidget
// 0x04D8 (0x04D8 - 0x0000)
struct TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	EProgramDifficulty                            Temp_byte_Variable;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x00B0(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_5;                              // 0x00D0(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00E8(0x0018)()
	EProgramType                                  Temp_byte_Variable_1;                              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProgramType                                  Temp_byte_Variable_2;                              // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Temp_struct_Variable;                              // 0x0104(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                Temp_struct_Variable_1;                            // 0x0114(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0124(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EProgramType                                  Temp_byte_Variable_3;                              // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProgramType                                  Temp_byte_Variable_4;                              // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0137(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBTrialHudNotificationDetails         K2Node_CustomEvent_details;                        // 0x013C(0x0014)(NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0158(0x0018)()
	class URBGameStructureConfig*                 CallFunc_GetGameStructureConfig_ReturnValue;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBTrialInfoRow                        CallFunc_GetTrialInfo_ReturnValue;                 // 0x0178(0x00E8)(ConstParm)
	struct FRBProgramInfoRow                      CallFunc_GetProgramInfo_ReturnValue;               // 0x0260(0x01D8)(ConstParm)
	class FText                                   K2Node_Select_Default_1;                           // 0x0438(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0450(0x0028)()
	TSoftObjectPtr<class UObject>                 K2Node_Select_Default_2;                           // 0x0478(0x0028)(HasGetValueTypeHash)
	struct FMargin                                K2Node_Select_Default_3;                           // 0x04A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_Select_Default_4;                           // 0x04B0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget) == 0x000008, "Wrong alignment on TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget");
static_assert(sizeof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget) == 0x0004D8, "Wrong size on TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, EntryPoint) == 0x000000, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_object_Variable) == 0x000020, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, K2Node_DynamicCast_AsTexture_2D) == 0x000028, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_delegate_Variable) == 0x000034, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_byte_Variable) == 0x000044, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, CallFunc_PostEventGlobal_ReturnValue) == 0x000048, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_text_Variable) == 0x000050, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_text_Variable_1) == 0x000068, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_text_Variable_2) == 0x000080, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_text_Variable_3) == 0x000098, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_text_Variable_4) == 0x0000B0, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_bool_Variable) == 0x0000C8, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_text_Variable_5) == 0x0000D0, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_text_Variable_6) == 0x0000E8, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_byte_Variable_1) == 0x000100, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_byte_Variable_2) == 0x000101, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_struct_Variable) == 0x000104, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_struct_Variable_1) == 0x000114, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, K2Node_MakeStruct_Margin) == 0x000124, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_byte_Variable_3) == 0x000134, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_byte_Variable_4) == 0x000135, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_byte_Variable_5) == 0x000136, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_byte_Variable_6) == 0x000137, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, Temp_byte_Variable_7) == 0x000138, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, K2Node_CustomEvent_details) == 0x00013C, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::K2Node_CustomEvent_details' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000150, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, K2Node_Select_Default) == 0x000158, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, CallFunc_GetGameStructureConfig_ReturnValue) == 0x000170, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::CallFunc_GetGameStructureConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, CallFunc_GetTrialInfo_ReturnValue) == 0x000178, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::CallFunc_GetTrialInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, CallFunc_GetProgramInfo_ReturnValue) == 0x000260, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::CallFunc_GetProgramInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, K2Node_Select_Default_1) == 0x000438, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, K2Node_MakeStruct_SlateColor) == 0x000450, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, K2Node_Select_Default_2) == 0x000478, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, K2Node_Select_Default_3) == 0x0004A0, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, K2Node_Select_Default_4) == 0x0004B0, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, K2Node_Select_Default_5) == 0x0004C8, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0004D0, "Member 'TrialDetailsNotificationHudWidget_C_ExecuteUbergraph_TrialDetailsNotificationHudWidget::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");

// Function TrialDetailsNotificationHudWidget.TrialDetailsNotificationHudWidget_C.Show
// 0x0014 (0x0014 - 0x0000)
struct TrialDetailsNotificationHudWidget_C_Show final
{
public:
	struct FRBTrialHudNotificationDetails         Details;                                           // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(TrialDetailsNotificationHudWidget_C_Show) == 0x000004, "Wrong alignment on TrialDetailsNotificationHudWidget_C_Show");
static_assert(sizeof(TrialDetailsNotificationHudWidget_C_Show) == 0x000014, "Wrong size on TrialDetailsNotificationHudWidget_C_Show");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_Show, Details) == 0x000000, "Member 'TrialDetailsNotificationHudWidget_C_Show::Details' has a wrong offset!");

// Function TrialDetailsNotificationHudWidget.TrialDetailsNotificationHudWidget_C.OnLoaded_76A8266E46F538C023072980EA257A98
// 0x0008 (0x0008 - 0x0000)
struct TrialDetailsNotificationHudWidget_C_OnLoaded_76A8266E46F538C023072980EA257A98 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialDetailsNotificationHudWidget_C_OnLoaded_76A8266E46F538C023072980EA257A98) == 0x000008, "Wrong alignment on TrialDetailsNotificationHudWidget_C_OnLoaded_76A8266E46F538C023072980EA257A98");
static_assert(sizeof(TrialDetailsNotificationHudWidget_C_OnLoaded_76A8266E46F538C023072980EA257A98) == 0x000008, "Wrong size on TrialDetailsNotificationHudWidget_C_OnLoaded_76A8266E46F538C023072980EA257A98");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_OnLoaded_76A8266E46F538C023072980EA257A98, Loaded) == 0x000000, "Member 'TrialDetailsNotificationHudWidget_C_OnLoaded_76A8266E46F538C023072980EA257A98::Loaded' has a wrong offset!");

// Function TrialDetailsNotificationHudWidget.TrialDetailsNotificationHudWidget_C.Hide
// 0x0010 (0x0010 - 0x0000)
struct TrialDetailsNotificationHudWidget_C_Hide final
{
public:
	bool                                          bPlayTransition;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialDetailsNotificationHudWidget_C_Hide) == 0x000008, "Wrong alignment on TrialDetailsNotificationHudWidget_C_Hide");
static_assert(sizeof(TrialDetailsNotificationHudWidget_C_Hide) == 0x000010, "Wrong size on TrialDetailsNotificationHudWidget_C_Hide");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_Hide, bPlayTransition) == 0x000000, "Member 'TrialDetailsNotificationHudWidget_C_Hide::bPlayTransition' has a wrong offset!");
static_assert(offsetof(TrialDetailsNotificationHudWidget_C_Hide, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'TrialDetailsNotificationHudWidget_C_Hide::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

