#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrialBoardOverheadWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TrialBoardOverheadWidget.TrialBoardOverheadWidget_C
// 0x0068 (0x04D8 - 0x0470)
class UTrialBoardOverheadWidget_C final : public URBSocialMenuEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UActiveSkillButton_C*                   ActiveSkillButton;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                GamepadButton;                                     // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              LoadoutBox;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_1;                                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyLeaderIcon;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerksDisplay_C*                        PerksDisplay;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerksDisplay_C*                        PerksDisplay_1;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerksDisplay_C*                        PerksDisplay_2;                                    // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PlayerLevelBorderBox;                              // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PlayerLevelSizeBox;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerLevelText;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVoiceChatOverheadWidget_C*             VoiceChatOverheadWidget;                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetupPerksList();
	void SetupPlayerLevel();
	void SetupPartyLeaderIcon();
	void SetupActiveSkill();
	void SetName();
	void Event_Refresh();
	void BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_0_OnClickedEvent__DelegateSignature(class UActiveSkillButton_C* Button);
	void BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_1_OnHoveredEvent__DelegateSignature(class UActiveSkillButton_C* Button);
	void BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_2_OnUnhoveredEvent__DelegateSignature(class UActiveSkillButton_C* Button);
	void BndEvt__TrialBoardOverheadWidget_GamepadButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void OnInputSourceChanged();
	void Destruct();
	void ExecuteUbergraph_TrialBoardOverheadWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TrialBoardOverheadWidget_C">();
	}
	static class UTrialBoardOverheadWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrialBoardOverheadWidget_C>();
	}
};
static_assert(alignof(UTrialBoardOverheadWidget_C) == 0x000008, "Wrong alignment on UTrialBoardOverheadWidget_C");
static_assert(sizeof(UTrialBoardOverheadWidget_C) == 0x0004D8, "Wrong size on UTrialBoardOverheadWidget_C");
static_assert(offsetof(UTrialBoardOverheadWidget_C, UberGraphFrame) == 0x000470, "Member 'UTrialBoardOverheadWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTrialBoardOverheadWidget_C, ActiveSkillButton) == 0x000478, "Member 'UTrialBoardOverheadWidget_C::ActiveSkillButton' has a wrong offset!");
static_assert(offsetof(UTrialBoardOverheadWidget_C, GamepadButton) == 0x000480, "Member 'UTrialBoardOverheadWidget_C::GamepadButton' has a wrong offset!");
static_assert(offsetof(UTrialBoardOverheadWidget_C, LoadoutBox) == 0x000488, "Member 'UTrialBoardOverheadWidget_C::LoadoutBox' has a wrong offset!");
static_assert(offsetof(UTrialBoardOverheadWidget_C, Name_1) == 0x000490, "Member 'UTrialBoardOverheadWidget_C::Name_1' has a wrong offset!");
static_assert(offsetof(UTrialBoardOverheadWidget_C, PartyLeaderIcon) == 0x000498, "Member 'UTrialBoardOverheadWidget_C::PartyLeaderIcon' has a wrong offset!");
static_assert(offsetof(UTrialBoardOverheadWidget_C, PerksDisplay) == 0x0004A0, "Member 'UTrialBoardOverheadWidget_C::PerksDisplay' has a wrong offset!");
static_assert(offsetof(UTrialBoardOverheadWidget_C, PerksDisplay_1) == 0x0004A8, "Member 'UTrialBoardOverheadWidget_C::PerksDisplay_1' has a wrong offset!");
static_assert(offsetof(UTrialBoardOverheadWidget_C, PerksDisplay_2) == 0x0004B0, "Member 'UTrialBoardOverheadWidget_C::PerksDisplay_2' has a wrong offset!");
static_assert(offsetof(UTrialBoardOverheadWidget_C, PlayerLevelBorderBox) == 0x0004B8, "Member 'UTrialBoardOverheadWidget_C::PlayerLevelBorderBox' has a wrong offset!");
static_assert(offsetof(UTrialBoardOverheadWidget_C, PlayerLevelSizeBox) == 0x0004C0, "Member 'UTrialBoardOverheadWidget_C::PlayerLevelSizeBox' has a wrong offset!");
static_assert(offsetof(UTrialBoardOverheadWidget_C, PlayerLevelText) == 0x0004C8, "Member 'UTrialBoardOverheadWidget_C::PlayerLevelText' has a wrong offset!");
static_assert(offsetof(UTrialBoardOverheadWidget_C, VoiceChatOverheadWidget) == 0x0004D0, "Member 'UTrialBoardOverheadWidget_C::VoiceChatOverheadWidget' has a wrong offset!");

}

