#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialZoneIcon

#include "Basic.hpp"


namespace SDK::Params
{

// Function TutorialZoneIcon.TutorialZoneIcon_C.ExecuteUbergraph_TutorialZoneIcon
// 0x0010 (0x0010 - 0x0000)
struct TutorialZoneIcon_C_ExecuteUbergraph_TutorialZoneIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Event_newTexture;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutorialZoneIcon_C_ExecuteUbergraph_TutorialZoneIcon) == 0x000008, "Wrong alignment on TutorialZoneIcon_C_ExecuteUbergraph_TutorialZoneIcon");
static_assert(sizeof(TutorialZoneIcon_C_ExecuteUbergraph_TutorialZoneIcon) == 0x000010, "Wrong size on TutorialZoneIcon_C_ExecuteUbergraph_TutorialZoneIcon");
static_assert(offsetof(TutorialZoneIcon_C_ExecuteUbergraph_TutorialZoneIcon, EntryPoint) == 0x000000, "Member 'TutorialZoneIcon_C_ExecuteUbergraph_TutorialZoneIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(TutorialZoneIcon_C_ExecuteUbergraph_TutorialZoneIcon, K2Node_Event_newTexture) == 0x000008, "Member 'TutorialZoneIcon_C_ExecuteUbergraph_TutorialZoneIcon::K2Node_Event_newTexture' has a wrong offset!");

// Function TutorialZoneIcon.TutorialZoneIcon_C.Event_UpdateIconTexture
// 0x0008 (0x0008 - 0x0000)
struct TutorialZoneIcon_C_Event_UpdateIconTexture final
{
public:
	class UTexture2D*                             NewTexture;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TutorialZoneIcon_C_Event_UpdateIconTexture) == 0x000008, "Wrong alignment on TutorialZoneIcon_C_Event_UpdateIconTexture");
static_assert(sizeof(TutorialZoneIcon_C_Event_UpdateIconTexture) == 0x000008, "Wrong size on TutorialZoneIcon_C_Event_UpdateIconTexture");
static_assert(offsetof(TutorialZoneIcon_C_Event_UpdateIconTexture, NewTexture) == 0x000000, "Member 'TutorialZoneIcon_C_Event_UpdateIconTexture::NewTexture' has a wrong offset!");

// Function TutorialZoneIcon.TutorialZoneIcon_C.ShouldShow
// 0x0004 (0x0004 - 0x0000)
struct TutorialZoneIcon_C_ShouldShow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldShow_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TutorialZoneIcon_C_ShouldShow) == 0x000001, "Wrong alignment on TutorialZoneIcon_C_ShouldShow");
static_assert(sizeof(TutorialZoneIcon_C_ShouldShow) == 0x000004, "Wrong size on TutorialZoneIcon_C_ShouldShow");
static_assert(offsetof(TutorialZoneIcon_C_ShouldShow, ReturnValue) == 0x000000, "Member 'TutorialZoneIcon_C_ShouldShow::ReturnValue' has a wrong offset!");
static_assert(offsetof(TutorialZoneIcon_C_ShouldShow, CallFunc_ShouldShow_ReturnValue) == 0x000001, "Member 'TutorialZoneIcon_C_ShouldShow::CallFunc_ShouldShow_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutorialZoneIcon_C_ShouldShow, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'TutorialZoneIcon_C_ShouldShow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TutorialZoneIcon_C_ShouldShow, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'TutorialZoneIcon_C_ShouldShow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

