#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UpgradeButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UpgradeButton.UpgradeButton_C
// 0x0240 (0x04A0 - 0x0260)
class UUpgradeButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PurchaseProgressAnimation;                         // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PurchaseAnimation;                                 // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AcquiredCheckmark;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BlockNumberText;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentBox;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CostAmountText;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CostHBox;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CurrencyTypeImage;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedBottomLeftBracket_1;                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedBottomRightBracket_1;                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedTopLeftBracket_1;                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedTopRightBracket_1;                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_116;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InteractionButton;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockedIcon;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PurchaseAnimationImage;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SelectionBorderPanel;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UpgradeName;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               UpgradeNumberOverlay;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsLoadout;                                        // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDisplayNumber;                                    // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_372F[0x6];                                     // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuUpgradeItemInfo                   UpgradeInfo;                                       // 0x0310(0x0128)(Edit, BlueprintVisible)
	bool                                          bIsGamepad;                                        // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHovered;                                          // 0x0439(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3730[0x6];                                     // 0x043A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnHovered;                                         // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnhovered;                                       // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPressed;                                         // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnReleased;                                        // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bFocused;                                          // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bEnableLoadoutHoveredEvents;                       // 0x0491(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3731[0x2];                                     // 0x0492(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeCounter;                                       // 0x0494(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELoadoutElementType                           OverrideLoadoutHoverType;                          // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPressed;                                          // 0x0499(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void IsConsideredHovered(bool* bConsideredHovered);
	void SetFocused(bool bInFocused);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetHovered(bool bInHovered);
	void Refresh();
	void Init(bool Param_bIsLoadout, class FName ItemId, int32 Param_Index, bool Param_bDisplayNumber, ELoadoutElementType Param_OverrideLoadoutHoverType);
	void Setup();
	void BndEvt__RigButton_InteractionButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__RigButton_InteractionButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__RigButton_InteractionButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UpgradeButton_InteractionButton_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__UpgradeButton_InteractionButton_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();
	void Construct();
	void OnMenuActionProgressChanged(const class FName& ActionName, float NewProgress);
	void Destruct();
	void OnMenuInputSourceChanged();
	void ExecuteUbergraph_UpgradeButton(int32 EntryPoint);
	void OnReleased__DelegateSignature(class FName ItemId);
	void OnPressed__DelegateSignature(class FName ItemId);
	void OnClicked__DelegateSignature(class FName ItemId);
	void OnUnhovered__DelegateSignature(class FName ItemId);
	void OnHovered__DelegateSignature(class FName ItemId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UpgradeButton_C">();
	}
	static class UUpgradeButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUpgradeButton_C>();
	}
};
static_assert(alignof(UUpgradeButton_C) == 0x000008, "Wrong alignment on UUpgradeButton_C");
static_assert(sizeof(UUpgradeButton_C) == 0x0004A0, "Wrong size on UUpgradeButton_C");
static_assert(offsetof(UUpgradeButton_C, UberGraphFrame) == 0x000260, "Member 'UUpgradeButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, PurchaseProgressAnimation) == 0x000268, "Member 'UUpgradeButton_C::PurchaseProgressAnimation' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, PurchaseAnimation) == 0x000270, "Member 'UUpgradeButton_C::PurchaseAnimation' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, AcquiredCheckmark) == 0x000278, "Member 'UUpgradeButton_C::AcquiredCheckmark' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, BackgroundImage) == 0x000280, "Member 'UUpgradeButton_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, BlockNumberText) == 0x000288, "Member 'UUpgradeButton_C::BlockNumberText' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, ContentBox) == 0x000290, "Member 'UUpgradeButton_C::ContentBox' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, CostAmountText) == 0x000298, "Member 'UUpgradeButton_C::CostAmountText' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, CostHBox) == 0x0002A0, "Member 'UUpgradeButton_C::CostHBox' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, CurrencyTypeImage) == 0x0002A8, "Member 'UUpgradeButton_C::CurrencyTypeImage' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, FocussedBottomLeftBracket_1) == 0x0002B0, "Member 'UUpgradeButton_C::FocussedBottomLeftBracket_1' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, FocussedBottomRightBracket_1) == 0x0002B8, "Member 'UUpgradeButton_C::FocussedBottomRightBracket_1' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, FocussedTopLeftBracket_1) == 0x0002C0, "Member 'UUpgradeButton_C::FocussedTopLeftBracket_1' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, FocussedTopRightBracket_1) == 0x0002C8, "Member 'UUpgradeButton_C::FocussedTopRightBracket_1' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, Image_116) == 0x0002D0, "Member 'UUpgradeButton_C::Image_116' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, InteractionButton) == 0x0002D8, "Member 'UUpgradeButton_C::InteractionButton' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, LockedIcon) == 0x0002E0, "Member 'UUpgradeButton_C::LockedIcon' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, PurchaseAnimationImage) == 0x0002E8, "Member 'UUpgradeButton_C::PurchaseAnimationImage' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, SelectionBorderPanel) == 0x0002F0, "Member 'UUpgradeButton_C::SelectionBorderPanel' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, UpgradeName) == 0x0002F8, "Member 'UUpgradeButton_C::UpgradeName' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, UpgradeNumberOverlay) == 0x000300, "Member 'UUpgradeButton_C::UpgradeNumberOverlay' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, bIsLoadout) == 0x000308, "Member 'UUpgradeButton_C::bIsLoadout' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, bDisplayNumber) == 0x000309, "Member 'UUpgradeButton_C::bDisplayNumber' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, UpgradeInfo) == 0x000310, "Member 'UUpgradeButton_C::UpgradeInfo' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, bIsGamepad) == 0x000438, "Member 'UUpgradeButton_C::bIsGamepad' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, bHovered) == 0x000439, "Member 'UUpgradeButton_C::bHovered' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, OnHovered) == 0x000440, "Member 'UUpgradeButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, OnUnhovered) == 0x000450, "Member 'UUpgradeButton_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, OnClicked) == 0x000460, "Member 'UUpgradeButton_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, OnPressed) == 0x000470, "Member 'UUpgradeButton_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, OnReleased) == 0x000480, "Member 'UUpgradeButton_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, bFocused) == 0x000490, "Member 'UUpgradeButton_C::bFocused' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, bEnableLoadoutHoveredEvents) == 0x000491, "Member 'UUpgradeButton_C::bEnableLoadoutHoveredEvents' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, TimeCounter) == 0x000494, "Member 'UUpgradeButton_C::TimeCounter' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, OverrideLoadoutHoverType) == 0x000498, "Member 'UUpgradeButton_C::OverrideLoadoutHoverType' has a wrong offset!");
static_assert(offsetof(UUpgradeButton_C, bPressed) == 0x000499, "Member 'UUpgradeButton_C::bPressed' has a wrong offset!");

}

