#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceChatOverheadWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VoiceChatOverheadWidget.VoiceChatOverheadWidget_C
// 0x0238 (0x04C8 - 0x0290)
class UVoiceChatOverheadWidget_C final : public URBOverheadVoiceChatWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_VoiceChatOverheadWidget;           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpeakerIcon;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            SpeakingBrush;                                     // 0x02A8(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            GloballyMutedBrush;                                // 0x0330(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            MutedBrush;                                        // 0x03B8(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            NotSpeakingBrush;                                  // 0x0440(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_VoiceChatOverheadWidget(int32 EntryPoint);
	void Event_Refresh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VoiceChatOverheadWidget_C">();
	}
	static class UVoiceChatOverheadWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceChatOverheadWidget_C>();
	}
};
static_assert(alignof(UVoiceChatOverheadWidget_C) == 0x000008, "Wrong alignment on UVoiceChatOverheadWidget_C");
static_assert(sizeof(UVoiceChatOverheadWidget_C) == 0x0004C8, "Wrong size on UVoiceChatOverheadWidget_C");
static_assert(offsetof(UVoiceChatOverheadWidget_C, UberGraphFrame) == 0x000290, "Member 'UVoiceChatOverheadWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVoiceChatOverheadWidget_C, InvalidationBox_VoiceChatOverheadWidget) == 0x000298, "Member 'UVoiceChatOverheadWidget_C::InvalidationBox_VoiceChatOverheadWidget' has a wrong offset!");
static_assert(offsetof(UVoiceChatOverheadWidget_C, SpeakerIcon) == 0x0002A0, "Member 'UVoiceChatOverheadWidget_C::SpeakerIcon' has a wrong offset!");
static_assert(offsetof(UVoiceChatOverheadWidget_C, SpeakingBrush) == 0x0002A8, "Member 'UVoiceChatOverheadWidget_C::SpeakingBrush' has a wrong offset!");
static_assert(offsetof(UVoiceChatOverheadWidget_C, GloballyMutedBrush) == 0x000330, "Member 'UVoiceChatOverheadWidget_C::GloballyMutedBrush' has a wrong offset!");
static_assert(offsetof(UVoiceChatOverheadWidget_C, MutedBrush) == 0x0003B8, "Member 'UVoiceChatOverheadWidget_C::MutedBrush' has a wrong offset!");
static_assert(offsetof(UVoiceChatOverheadWidget_C, NotSpeakingBrush) == 0x000440, "Member 'UVoiceChatOverheadWidget_C::NotSpeakingBrush' has a wrong offset!");

}

