#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WakeUpBed_GhostAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function WakeUpBed_GhostAnimBP.WakeUpBed_GhostAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct WakeUpBed_GhostAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(WakeUpBed_GhostAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on WakeUpBed_GhostAnimBP_C_AnimGraph");
static_assert(sizeof(WakeUpBed_GhostAnimBP_C_AnimGraph) == 0x000010, "Wrong size on WakeUpBed_GhostAnimBP_C_AnimGraph");
static_assert(offsetof(WakeUpBed_GhostAnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'WakeUpBed_GhostAnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function WakeUpBed_GhostAnimBP.WakeUpBed_GhostAnimBP_C.FinishGhost
// 0x000C (0x000C - 0x0000)
struct WakeUpBed_GhostAnimBP_C_FinishGhost final
{
public:
	EGhostFinishReason                            FinishReason;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A7[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GhostFinishCustomReason;                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WakeUpBed_GhostAnimBP_C_FinishGhost) == 0x000004, "Wrong alignment on WakeUpBed_GhostAnimBP_C_FinishGhost");
static_assert(sizeof(WakeUpBed_GhostAnimBP_C_FinishGhost) == 0x00000C, "Wrong size on WakeUpBed_GhostAnimBP_C_FinishGhost");
static_assert(offsetof(WakeUpBed_GhostAnimBP_C_FinishGhost, FinishReason) == 0x000000, "Member 'WakeUpBed_GhostAnimBP_C_FinishGhost::FinishReason' has a wrong offset!");
static_assert(offsetof(WakeUpBed_GhostAnimBP_C_FinishGhost, GhostFinishCustomReason) == 0x000004, "Member 'WakeUpBed_GhostAnimBP_C_FinishGhost::GhostFinishCustomReason' has a wrong offset!");
static_assert(offsetof(WakeUpBed_GhostAnimBP_C_FinishGhost, ReturnValue) == 0x000008, "Member 'WakeUpBed_GhostAnimBP_C_FinishGhost::ReturnValue' has a wrong offset!");
static_assert(offsetof(WakeUpBed_GhostAnimBP_C_FinishGhost, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'WakeUpBed_GhostAnimBP_C_FinishGhost::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WakeUpBed_GhostAnimBP.WakeUpBed_GhostAnimBP_C.ExecuteUbergraph_WakeUpBed_GhostAnimBP
// 0x0008 (0x0008 - 0x0000)
struct WakeUpBed_GhostAnimBP_C_ExecuteUbergraph_WakeUpBed_GhostAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GhostAnimTransition_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WakeUpBed_GhostAnimBP_C_ExecuteUbergraph_WakeUpBed_GhostAnimBP) == 0x000004, "Wrong alignment on WakeUpBed_GhostAnimBP_C_ExecuteUbergraph_WakeUpBed_GhostAnimBP");
static_assert(sizeof(WakeUpBed_GhostAnimBP_C_ExecuteUbergraph_WakeUpBed_GhostAnimBP) == 0x000008, "Wrong size on WakeUpBed_GhostAnimBP_C_ExecuteUbergraph_WakeUpBed_GhostAnimBP");
static_assert(offsetof(WakeUpBed_GhostAnimBP_C_ExecuteUbergraph_WakeUpBed_GhostAnimBP, EntryPoint) == 0x000000, "Member 'WakeUpBed_GhostAnimBP_C_ExecuteUbergraph_WakeUpBed_GhostAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(WakeUpBed_GhostAnimBP_C_ExecuteUbergraph_WakeUpBed_GhostAnimBP, CallFunc_GhostAnimTransition_ReturnValue) == 0x000004, "Member 'WakeUpBed_GhostAnimBP_C_ExecuteUbergraph_WakeUpBed_GhostAnimBP::CallFunc_GhostAnimTransition_ReturnValue' has a wrong offset!");

}

