#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wernicke_Lobby_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Wernicke_Lobby_BP.Wernicke_Lobby_BP_C
// 0x0040 (0x0288 - 0x0248)
class AWernicke_Lobby_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBPropOptimizerComponent*              RBPropOptimizer;                                   // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Wernicke_Outfit_01;                                // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Wernicke_Hands;                                    // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Wernicke_Head;                                     // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Wernicke_FullBody;                                 // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Wernicke_WheelChair_skm;                           // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ArriveWindow();
	void LeaveWindow();
	void ExecuteUbergraph_Wernicke_Lobby_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Wernicke_Lobby_BP_C">();
	}
	static class AWernicke_Lobby_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWernicke_Lobby_BP_C>();
	}
};
static_assert(alignof(AWernicke_Lobby_BP_C) == 0x000008, "Wrong alignment on AWernicke_Lobby_BP_C");
static_assert(sizeof(AWernicke_Lobby_BP_C) == 0x000288, "Wrong size on AWernicke_Lobby_BP_C");
static_assert(offsetof(AWernicke_Lobby_BP_C, UberGraphFrame) == 0x000248, "Member 'AWernicke_Lobby_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWernicke_Lobby_BP_C, RBPropOptimizer) == 0x000250, "Member 'AWernicke_Lobby_BP_C::RBPropOptimizer' has a wrong offset!");
static_assert(offsetof(AWernicke_Lobby_BP_C, Wernicke_Outfit_01) == 0x000258, "Member 'AWernicke_Lobby_BP_C::Wernicke_Outfit_01' has a wrong offset!");
static_assert(offsetof(AWernicke_Lobby_BP_C, Wernicke_Hands) == 0x000260, "Member 'AWernicke_Lobby_BP_C::Wernicke_Hands' has a wrong offset!");
static_assert(offsetof(AWernicke_Lobby_BP_C, Wernicke_Head) == 0x000268, "Member 'AWernicke_Lobby_BP_C::Wernicke_Head' has a wrong offset!");
static_assert(offsetof(AWernicke_Lobby_BP_C, Wernicke_FullBody) == 0x000270, "Member 'AWernicke_Lobby_BP_C::Wernicke_FullBody' has a wrong offset!");
static_assert(offsetof(AWernicke_Lobby_BP_C, Wernicke_WheelChair_skm) == 0x000278, "Member 'AWernicke_Lobby_BP_C::Wernicke_WheelChair_skm' has a wrong offset!");
static_assert(offsetof(AWernicke_Lobby_BP_C, DefaultSceneRoot) == 0x000280, "Member 'AWernicke_Lobby_BP_C::DefaultSceneRoot' has a wrong offset!");

}

