#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WireMinus01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Wire-01_BP.Wire-01_BP_C.ExecuteUbergraph_Wire-01_BP
// 0x0004 (0x0004 - 0x0000)
struct WireMinus01_BP_C_ExecuteUbergraph_WireMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WireMinus01_BP_C_ExecuteUbergraph_WireMinus01_BP) == 0x000004, "Wrong alignment on WireMinus01_BP_C_ExecuteUbergraph_WireMinus01_BP");
static_assert(sizeof(WireMinus01_BP_C_ExecuteUbergraph_WireMinus01_BP) == 0x000004, "Wrong size on WireMinus01_BP_C_ExecuteUbergraph_WireMinus01_BP");
static_assert(offsetof(WireMinus01_BP_C_ExecuteUbergraph_WireMinus01_BP, EntryPoint) == 0x000000, "Member 'WireMinus01_BP_C_ExecuteUbergraph_WireMinus01_BP::EntryPoint' has a wrong offset!");

// Function Wire-01_BP.Wire-01_BP_C.UserConstructionScript
// 0x00F0 (0x00F0 - 0x0000)
struct WireMinus01_BP_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB2[0xF];                                      // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0048(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WireMinus01_BP_C_UserConstructionScript) == 0x000010, "Wrong alignment on WireMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(WireMinus01_BP_C_UserConstructionScript) == 0x0000F0, "Wrong size on WireMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(WireMinus01_BP_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'WireMinus01_BP_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WireMinus01_BP_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'WireMinus01_BP_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WireMinus01_BP_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'WireMinus01_BP_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WireMinus01_BP_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000048, "Member 'WireMinus01_BP_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WireMinus01_BP_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000D0, "Member 'WireMinus01_BP_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WireMinus01_BP_C_UserConstructionScript, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x0000D4, "Member 'WireMinus01_BP_C_UserConstructionScript::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WireMinus01_BP_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x0000E0, "Member 'WireMinus01_BP_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(WireMinus01_BP_C_UserConstructionScript, K2Node_Select_Default) == 0x0000E4, "Member 'WireMinus01_BP_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");

}

