#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AddFriendWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function AddFriendWidget.AddFriendWidget_C.OnFocusReceived
// 0x01C8 (0x01C8 - 0x0000)
struct AddFriendWidget_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3625[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3626[0x6];                                     // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AddFriendWidget_C_OnFocusReceived) == 0x000008, "Wrong alignment on AddFriendWidget_C_OnFocusReceived");
static_assert(sizeof(AddFriendWidget_C_OnFocusReceived) == 0x0001C8, "Wrong size on AddFriendWidget_C_OnFocusReceived");
static_assert(offsetof(AddFriendWidget_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'AddFriendWidget_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'AddFriendWidget_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'AddFriendWidget_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_OnFocusReceived, Temp_bool_Variable) == 0x0000F8, "Member 'AddFriendWidget_C_OnFocusReceived::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'AddFriendWidget_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_OnFocusReceived, CallFunc_GetVisibility_ReturnValue) == 0x0001B8, "Member 'AddFriendWidget_C_OnFocusReceived::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_OnFocusReceived, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001B9, "Member 'AddFriendWidget_C_OnFocusReceived::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_OnFocusReceived, K2Node_Select_Default) == 0x0001C0, "Member 'AddFriendWidget_C_OnFocusReceived::K2Node_Select_Default' has a wrong offset!");

// Function AddFriendWidget.AddFriendWidget_C.Refresh
// 0x0180 (0x0180 - 0x0000)
struct AddFriendWidget_C_Refresh final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3627[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3628[0x1];                                     // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0058(0x0018)()
	bool                                          Temp_bool_Variable_4;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3629[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_4;                              // 0x0078(0x0018)()
	bool                                          Temp_bool_Variable_5;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_362A[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_5;                              // 0x0098(0x0018)()
	bool                                          Temp_bool_Variable_6;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSendPlatformFriendRequest_ReturnValue; // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_362B[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOperationPending_ReturnValue;           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasProfile_ReturnValue;                   // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_362C[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00C8(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x00E0(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x00F8(0x0018)()
	bool                                          CallFunc_CanShowProfile_ReturnValue;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSendFriendRequest_ReturnValue;         // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_362D[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_4;                           // 0x0118(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProfilePlatform                              CallFunc_GetProfilePlatform_ReturnValue;           // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362E[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetPlatformIconTexture_texture;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetName_ReturnValue;                      // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FormatPlayerName_ReturnValue;             // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0160(0x0018)()
	bool                                          CallFunc_HasProfile_ReturnValue_1;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInitialDataPending_ReturnValue;         // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AddFriendWidget_C_Refresh) == 0x000008, "Wrong alignment on AddFriendWidget_C_Refresh");
static_assert(sizeof(AddFriendWidget_C_Refresh) == 0x000180, "Wrong size on AddFriendWidget_C_Refresh");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_bool_Variable) == 0x000000, "Member 'AddFriendWidget_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_text_Variable) == 0x000008, "Member 'AddFriendWidget_C_Refresh::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_text_Variable_1) == 0x000020, "Member 'AddFriendWidget_C_Refresh::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_bool_Variable_1) == 0x000038, "Member 'AddFriendWidget_C_Refresh::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_byte_Variable) == 0x000039, "Member 'AddFriendWidget_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_byte_Variable_1) == 0x00003A, "Member 'AddFriendWidget_C_Refresh::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_bool_Variable_2) == 0x00003B, "Member 'AddFriendWidget_C_Refresh::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_byte_Variable_2) == 0x00003C, "Member 'AddFriendWidget_C_Refresh::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_byte_Variable_3) == 0x00003D, "Member 'AddFriendWidget_C_Refresh::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_bool_Variable_3) == 0x00003E, "Member 'AddFriendWidget_C_Refresh::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_text_Variable_2) == 0x000040, "Member 'AddFriendWidget_C_Refresh::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_text_Variable_3) == 0x000058, "Member 'AddFriendWidget_C_Refresh::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_bool_Variable_4) == 0x000070, "Member 'AddFriendWidget_C_Refresh::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_text_Variable_4) == 0x000078, "Member 'AddFriendWidget_C_Refresh::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_bool_Variable_5) == 0x000090, "Member 'AddFriendWidget_C_Refresh::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_text_Variable_5) == 0x000098, "Member 'AddFriendWidget_C_Refresh::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_bool_Variable_6) == 0x0000B0, "Member 'AddFriendWidget_C_Refresh::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_byte_Variable_4) == 0x0000B1, "Member 'AddFriendWidget_C_Refresh::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, Temp_byte_Variable_5) == 0x0000B2, "Member 'AddFriendWidget_C_Refresh::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, CallFunc_CanSendPlatformFriendRequest_ReturnValue) == 0x0000B3, "Member 'AddFriendWidget_C_Refresh::CallFunc_CanSendPlatformFriendRequest_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000B8, "Member 'AddFriendWidget_C_Refresh::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, CallFunc_IsOperationPending_ReturnValue) == 0x0000C0, "Member 'AddFriendWidget_C_Refresh::CallFunc_IsOperationPending_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, CallFunc_HasProfile_ReturnValue) == 0x0000C1, "Member 'AddFriendWidget_C_Refresh::CallFunc_HasProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, K2Node_Select_Default) == 0x0000C8, "Member 'AddFriendWidget_C_Refresh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, K2Node_Select_Default_1) == 0x0000E0, "Member 'AddFriendWidget_C_Refresh::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, K2Node_Select_Default_2) == 0x0000F8, "Member 'AddFriendWidget_C_Refresh::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, CallFunc_CanShowProfile_ReturnValue) == 0x000110, "Member 'AddFriendWidget_C_Refresh::CallFunc_CanShowProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, K2Node_Select_Default_3) == 0x000111, "Member 'AddFriendWidget_C_Refresh::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, CallFunc_CanSendFriendRequest_ReturnValue) == 0x000112, "Member 'AddFriendWidget_C_Refresh::CallFunc_CanSendFriendRequest_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, CallFunc_BooleanOR_ReturnValue) == 0x000113, "Member 'AddFriendWidget_C_Refresh::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, K2Node_Select_Default_4) == 0x000118, "Member 'AddFriendWidget_C_Refresh::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, K2Node_Select_Default_5) == 0x000130, "Member 'AddFriendWidget_C_Refresh::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, CallFunc_GetProfilePlatform_ReturnValue) == 0x000131, "Member 'AddFriendWidget_C_Refresh::CallFunc_GetProfilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, CallFunc_GetPlatformIconTexture_texture) == 0x000138, "Member 'AddFriendWidget_C_Refresh::CallFunc_GetPlatformIconTexture_texture' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, CallFunc_GetName_ReturnValue) == 0x000140, "Member 'AddFriendWidget_C_Refresh::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, CallFunc_FormatPlayerName_ReturnValue) == 0x000150, "Member 'AddFriendWidget_C_Refresh::CallFunc_FormatPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, CallFunc_Conv_StringToText_ReturnValue) == 0x000160, "Member 'AddFriendWidget_C_Refresh::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, CallFunc_HasProfile_ReturnValue_1) == 0x000178, "Member 'AddFriendWidget_C_Refresh::CallFunc_HasProfile_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, K2Node_Select_Default_6) == 0x000179, "Member 'AddFriendWidget_C_Refresh::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_Refresh, CallFunc_IsInitialDataPending_ReturnValue) == 0x00017A, "Member 'AddFriendWidget_C_Refresh::CallFunc_IsInitialDataPending_ReturnValue' has a wrong offset!");

// Function AddFriendWidget.AddFriendWidget_C.BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function AddFriendWidget.AddFriendWidget_C.BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'AddFriendWidget_C_BndEvt__FriendCodeInputBox_K2Node_ComponentBoundEvent_2_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function AddFriendWidget.AddFriendWidget_C.ExecuteUbergraph_AddFriendWidget
// 0x0130 (0x0130 - 0x0000)
struct AddFriendWidget_C_ExecuteUbergraph_AddFriendWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3630[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0038(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3631[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0068(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3632[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_FilterFriendCodeInputText_ReturnValue;    // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3633[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3634[0x6];                                     // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3635[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanSendFriendRequest_ReturnValue;         // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3636[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0110(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AddFriendWidget_C_ExecuteUbergraph_AddFriendWidget) == 0x000008, "Wrong alignment on AddFriendWidget_C_ExecuteUbergraph_AddFriendWidget");
static_assert(sizeof(AddFriendWidget_C_ExecuteUbergraph_AddFriendWidget) == 0x000130, "Wrong size on AddFriendWidget_C_ExecuteUbergraph_AddFriendWidget");
static_assert(offsetof(AddFriendWidget_C_ExecuteUbergraph_AddFriendWidget, EntryPoint) == 0x000000, "Member 'AddFriendWidget_C_ExecuteUbergraph_AddFriendWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AddFriendWidget_C_ExecuteUbergraph_AddFriendWidget, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'AddFriendWidget_C_ExecuteUbergraph_AddFriendWidget::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
