#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArrowButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ArrowButton.ArrowButton_C.ExecuteUbergraph_ArrowButton
// 0x0060 (0x0060 - 0x0000)
struct ArrowButton_C_ExecuteUbergraph_ArrowButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FFE[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHorizontalAlignment                          Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_Select_Default;                             // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FFF[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UButtonSlot*                            CallFunc_SlotAsButtonSlot_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default_3;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArrowButton_C_ExecuteUbergraph_ArrowButton) == 0x000008, "Wrong alignment on ArrowButton_C_ExecuteUbergraph_ArrowButton");
static_assert(sizeof(ArrowButton_C_ExecuteUbergraph_ArrowButton) == 0x000060, "Wrong size on ArrowButton_C_ExecuteUbergraph_ArrowButton");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, EntryPoint) == 0x000000, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, Temp_bool_Variable) == 0x000004, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, Temp_bool_Variable_1) == 0x000005, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, Temp_bool_Variable_2) == 0x000006, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, Temp_bool_Variable_3) == 0x000018, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, Temp_byte_Variable) == 0x000019, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, Temp_byte_Variable_1) == 0x00001A, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, K2Node_Event_IsDesignTime) == 0x00001B, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, CallFunc_BreakVector2D_X) == 0x00001C, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, K2Node_Select_Default) == 0x000024, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, K2Node_Select_Default_1) == 0x000038, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, K2Node_Select_Default_2) == 0x000040, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, CallFunc_SlotAsButtonSlot_ReturnValue) == 0x000050, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::CallFunc_SlotAsButtonSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, K2Node_Select_Default_3) == 0x000058, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::K2Node_Select_Default_3' has a wrong offset!");

// Function ArrowButton.ArrowButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ArrowButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ArrowButton_C_PreConstruct) == 0x000001, "Wrong alignment on ArrowButton_C_PreConstruct");
static_assert(sizeof(ArrowButton_C_PreConstruct) == 0x000001, "Wrong size on ArrowButton_C_PreConstruct");
static_assert(offsetof(ArrowButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ArrowButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ArrowButton.ArrowButton_C.SetPressedPadding
// 0x0288 (0x0288 - 0x0000)
struct ArrowButton_C_SetPressedPadding final
{
public:
	struct FMargin                                NewPressedPadding;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0010(0x0278)()
};
static_assert(alignof(ArrowButton_C_SetPressedPadding) == 0x000008, "Wrong alignment on ArrowButton_C_SetPressedPadding");
static_assert(sizeof(ArrowButton_C_SetPressedPadding) == 0x000288, "Wrong size on ArrowButton_C_SetPressedPadding");
static_assert(offsetof(ArrowButton_C_SetPressedPadding, NewPressedPadding) == 0x000000, "Member 'ArrowButton_C_SetPressedPadding::NewPressedPadding' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_SetPressedPadding, K2Node_MakeStruct_ButtonStyle) == 0x000010, "Member 'ArrowButton_C_SetPressedPadding::K2Node_MakeStruct_ButtonStyle' has a wrong offset!");

// Function ArrowButton.ArrowButton_C.Highlight
// 0x0030 (0x0030 - 0x0000)
struct ArrowButton_C_Highlight final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3000[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3001[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArrowButton_C_Highlight) == 0x000008, "Wrong alignment on ArrowButton_C_Highlight");
static_assert(sizeof(ArrowButton_C_Highlight) == 0x000030, "Wrong size on ArrowButton_C_Highlight");
static_assert(offsetof(ArrowButton_C_Highlight, Temp_bool_Variable) == 0x000000, "Member 'ArrowButton_C_Highlight::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_Highlight, Temp_bool_Variable_1) == 0x000001, "Member 'ArrowButton_C_Highlight::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_Highlight, Temp_bool_Variable_2) == 0x000002, "Member 'ArrowButton_C_Highlight::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_Highlight, K2Node_Select_Default) == 0x000008, "Member 'ArrowButton_C_Highlight::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_Highlight, K2Node_Select_Default_1) == 0x000010, "Member 'ArrowButton_C_Highlight::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_Highlight, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000018, "Member 'ArrowButton_C_Highlight::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_Highlight, K2Node_Select_Default_2) == 0x000020, "Member 'ArrowButton_C_Highlight::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_Highlight, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'ArrowButton_C_Highlight::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function ArrowButton.ArrowButton_C.Downplay
// 0x0028 (0x0028 - 0x0000)
struct ArrowButton_C_Downplay final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3002[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ArrowButton_C_Downplay) == 0x000008, "Wrong alignment on ArrowButton_C_Downplay");
static_assert(sizeof(ArrowButton_C_Downplay) == 0x000028, "Wrong size on ArrowButton_C_Downplay");
static_assert(offsetof(ArrowButton_C_Downplay, Temp_bool_Variable) == 0x000000, "Member 'ArrowButton_C_Downplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_Downplay, Temp_bool_Variable_1) == 0x000001, "Member 'ArrowButton_C_Downplay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_Downplay, K2Node_Select_Default) == 0x000008, "Member 'ArrowButton_C_Downplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_Downplay, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'ArrowButton_C_Downplay::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_Downplay, K2Node_Select_Default_1) == 0x000018, "Member 'ArrowButton_C_Downplay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_Downplay, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000020, "Member 'ArrowButton_C_Downplay::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

}

