#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseOptionsEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BaseOptionsEntry.BaseOptionsEntry_C
// 0x0068 (0x0378 - 0x0310)
class UBaseOptionsEntry_C : public URBMenuOptionsEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   EntryName;                                         // 0x0318(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   SubButtonTitle;                                    // 0x0330(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           ArrowHoveredTint;                                  // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ArrowUnhoveredTint;                                // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastAnalogValue;                                   // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastInitialLRInputTimestamp;                       // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastLRInputPressedTimestamp;                       // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BaseOptionsEntry(int32 EntryPoint);
	void RefreshValue(bool ForceUpdateSlider);
	void Event_UpdateSubButtonText(const class FText& NewValue);
	void Event_RefreshEntry();
	void Event_UpdateTitle(const class FText& NewTitle);
	void PreConstruct(bool IsDesignTime);
	void RefreshEntry();
	void ColorChangedEntries();
	void RefreshDisplay();
	void UpdateEnableStatus();
	void SetupCounter();
	void RefreshCounter();
	void TrySetupCounter();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);
	void GetArrowBtn(bool Left, class UArrowButton_C** ArrowButton);
	void HandleSliderOnInput(bool bLeftPressed, int32 TimeBasedMultiplier);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BaseOptionsEntry_C">();
	}
	static class UBaseOptionsEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseOptionsEntry_C>();
	}
};
static_assert(alignof(UBaseOptionsEntry_C) == 0x000008, "Wrong alignment on UBaseOptionsEntry_C");
static_assert(sizeof(UBaseOptionsEntry_C) == 0x000378, "Wrong size on UBaseOptionsEntry_C");
static_assert(offsetof(UBaseOptionsEntry_C, UberGraphFrame) == 0x000310, "Member 'UBaseOptionsEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBaseOptionsEntry_C, EntryName) == 0x000318, "Member 'UBaseOptionsEntry_C::EntryName' has a wrong offset!");
static_assert(offsetof(UBaseOptionsEntry_C, SubButtonTitle) == 0x000330, "Member 'UBaseOptionsEntry_C::SubButtonTitle' has a wrong offset!");
static_assert(offsetof(UBaseOptionsEntry_C, ArrowHoveredTint) == 0x000348, "Member 'UBaseOptionsEntry_C::ArrowHoveredTint' has a wrong offset!");
static_assert(offsetof(UBaseOptionsEntry_C, ArrowUnhoveredTint) == 0x000358, "Member 'UBaseOptionsEntry_C::ArrowUnhoveredTint' has a wrong offset!");
static_assert(offsetof(UBaseOptionsEntry_C, LastAnalogValue) == 0x000368, "Member 'UBaseOptionsEntry_C::LastAnalogValue' has a wrong offset!");
static_assert(offsetof(UBaseOptionsEntry_C, LastInitialLRInputTimestamp) == 0x00036C, "Member 'UBaseOptionsEntry_C::LastInitialLRInputTimestamp' has a wrong offset!");
static_assert(offsetof(UBaseOptionsEntry_C, LastLRInputPressedTimestamp) == 0x000370, "Member 'UBaseOptionsEntry_C::LastLRInputPressedTimestamp' has a wrong offset!");

}

