#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FX_ENV_SteamPressureHi

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FX_ENV_SteamPressureHi.BP_FX_ENV_SteamPressureHi_C
// 0x0040 (0x0288 - 0x0248)
class ABP_FX_ENV_SteamPressureHi_C final : public ARBClientOnlyActor
{
public:
	class UArrowComponent*                        Arrow;                                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      RBSound;                                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SteamPtc;                                          // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Rate_StmMain;                                      // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed_StmMain;                                     // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Deco_ConeLength;                                   // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SteamColor;                                        // 0x0274(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FX_ENV_SteamPressureHi_C">();
	}
	static class ABP_FX_ENV_SteamPressureHi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FX_ENV_SteamPressureHi_C>();
	}
};
static_assert(alignof(ABP_FX_ENV_SteamPressureHi_C) == 0x000008, "Wrong alignment on ABP_FX_ENV_SteamPressureHi_C");
static_assert(sizeof(ABP_FX_ENV_SteamPressureHi_C) == 0x000288, "Wrong size on ABP_FX_ENV_SteamPressureHi_C");
static_assert(offsetof(ABP_FX_ENV_SteamPressureHi_C, Arrow) == 0x000248, "Member 'ABP_FX_ENV_SteamPressureHi_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureHi_C, RBSound) == 0x000250, "Member 'ABP_FX_ENV_SteamPressureHi_C::RBSound' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureHi_C, SteamPtc) == 0x000258, "Member 'ABP_FX_ENV_SteamPressureHi_C::SteamPtc' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureHi_C, DefaultSceneRoot) == 0x000260, "Member 'ABP_FX_ENV_SteamPressureHi_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureHi_C, Rate_StmMain) == 0x000268, "Member 'ABP_FX_ENV_SteamPressureHi_C::Rate_StmMain' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureHi_C, Speed_StmMain) == 0x00026C, "Member 'ABP_FX_ENV_SteamPressureHi_C::Speed_StmMain' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureHi_C, Deco_ConeLength) == 0x000270, "Member 'ABP_FX_ENV_SteamPressureHi_C::Deco_ConeLength' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureHi_C, SteamColor) == 0x000274, "Member 'ABP_FX_ENV_SteamPressureHi_C::SteamColor' has a wrong offset!");

}

