#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSheetStatsTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CharacterSheetStatsTab.CharacterSheetStatsTab_C
// 0x01E8 (0x04A0 - 0x02B8)
class UCharacterSheetStatsTab_C final : public URBPlayerStatsTabWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BackgroundImage;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BadgePageCounterText;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomBorder;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                GamepadFocusHolder;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        GamepadLeftPageButton;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               GamepadPageNav;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        GamepadRightPageButton;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GradeBox;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULevelIndicatorWidget_C*                LevelIndicatorWidget;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MainBackground_1;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NextLevelRewardBox;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         NextLevelRewardList;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNextLevelRewardWidget_C*               NextLevelRewardWidget;                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNextLevelRewardWidget_C*               NextLevelRewardWidget_124;                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                NextPageButton_1;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageNavText;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PCPageNav;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerStatEntry_C*                     PlayerStatEntry;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerStatEntry_C*                     PlayerStatEntry_1;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerStatEntry_C*                     PlayerStatEntry_2;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerStatEntry_C*                     PlayerStatEntry_3;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PreviousPageButton_1;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialVariatorWidget_C*          ProgramTrialVariatorWidget;                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialVariatorWidget_C*          ProgramTrialVariatorWidget_1;                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialVariatorWidget_C*          ProgramTrialVariatorWidget_2;                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialVariatorWidget_C*          ProgramTrialVariatorWidget_3;                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialVariatorWidget_C*          ProgramTrialVariatorWidget_4;                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RecentTrialsContentBox;                            // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RefNumber;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RequiredXpText;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreDetailLineEntry_C*                ScoreDetailLineEntry;                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreDetailLineEntry_C*                ScoreDetailLineEntry_1;                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreDetailLineEntry_C*                ScoreDetailLineEntry_2;                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreDetailLineEntry_C*                ScoreDetailLineEntry_3;                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreDetailLineEntry_C*                ScoreDetailLineEntry_4;                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreDetailLineEntry_C*                ScoreDetailLineEntry_5;                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreDetailLineEntry_C*                ScoreDetailLineEntry_6;                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreDetailLineEntry_C*                ScoreDetailLineEntry_7;                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreDetailLineEntry_C*                ScoreDetailLineEntry_8;                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreDetailLineEntry_C*                ScoreDetailLineEntry_9;                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreDetailLineEntry_C*                ScoreDetailLineEntry_10;                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreDetailLineEntry_C*                ScoreDetailLineEntry_11;                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreDetailLineEntry_C*                ScoreDetailLineEntry_12;                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScoreDetailLineEntry_C*                ScoreDetailLineEntry_13;                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ScoreLines;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         StatList;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBorder;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrialCompletionTimeText;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrialCompletionTypeText;                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrialDeathCountText;                               // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrialNameText;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrialRankText;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrialTypeText;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         VariatorHBox;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UXPProgressBar_C*                       XPProgressBar;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentPageIndex;                                  // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumPages;                                          // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EPlayerStat>                           DisplayedStats;                                    // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FEndStageInfo>                  RecentTrials;                                      // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BuildRecentTrialArray();
	void Setup_Score_Lines(int32 TrialSeed, TArray<struct FRecordedScoringEvent>& ScoringEvents);
	void SetupVariators(class UHorizontalBox* TargetHBox, class FName TrialId);
	void SetupTrialResults();
	void SetPage(int32 NewPageIndex);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void NextPage();
	void PreviousPage();
	void UpdateGamepadPageNav();
	void Refresh();
	void RefreshLevel();
	void RefreshStats();
	void Event_Refresh();
	void BndEvt__PreviousPageButton_1_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__NextPageButton_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void OnMenuInputSourceChanged();
	void Destruct();
	void OnGamepadPageLeft();
	void OnGamepadPageRight();
	void Event_OnTabSelected();
	void Event_OnTabUnselected();
	void ExecuteUbergraph_CharacterSheetStatsTab(int32 EntryPoint);

	class FText GetPageTitle() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterSheetStatsTab_C">();
	}
	static class UCharacterSheetStatsTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterSheetStatsTab_C>();
	}
};
static_assert(alignof(UCharacterSheetStatsTab_C) == 0x000008, "Wrong alignment on UCharacterSheetStatsTab_C");
static_assert(sizeof(UCharacterSheetStatsTab_C) == 0x0004A0, "Wrong size on UCharacterSheetStatsTab_C");
static_assert(offsetof(UCharacterSheetStatsTab_C, UberGraphFrame) == 0x0002B8, "Member 'UCharacterSheetStatsTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, BackgroundImage) == 0x0002C0, "Member 'UCharacterSheetStatsTab_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, BadgePageCounterText) == 0x0002C8, "Member 'UCharacterSheetStatsTab_C::BadgePageCounterText' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, BottomBorder) == 0x0002D0, "Member 'UCharacterSheetStatsTab_C::BottomBorder' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, GamepadFocusHolder) == 0x0002D8, "Member 'UCharacterSheetStatsTab_C::GamepadFocusHolder' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, GamepadLeftPageButton) == 0x0002E0, "Member 'UCharacterSheetStatsTab_C::GamepadLeftPageButton' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, GamepadPageNav) == 0x0002E8, "Member 'UCharacterSheetStatsTab_C::GamepadPageNav' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, GamepadRightPageButton) == 0x0002F0, "Member 'UCharacterSheetStatsTab_C::GamepadRightPageButton' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, GradeBox) == 0x0002F8, "Member 'UCharacterSheetStatsTab_C::GradeBox' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, LevelIndicatorWidget) == 0x000300, "Member 'UCharacterSheetStatsTab_C::LevelIndicatorWidget' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, MainBackground_1) == 0x000308, "Member 'UCharacterSheetStatsTab_C::MainBackground_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, NextLevelRewardBox) == 0x000310, "Member 'UCharacterSheetStatsTab_C::NextLevelRewardBox' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, NextLevelRewardList) == 0x000318, "Member 'UCharacterSheetStatsTab_C::NextLevelRewardList' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, NextLevelRewardWidget) == 0x000320, "Member 'UCharacterSheetStatsTab_C::NextLevelRewardWidget' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, NextLevelRewardWidget_124) == 0x000328, "Member 'UCharacterSheetStatsTab_C::NextLevelRewardWidget_124' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, NextPageButton_1) == 0x000330, "Member 'UCharacterSheetStatsTab_C::NextPageButton_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, PageNavText) == 0x000338, "Member 'UCharacterSheetStatsTab_C::PageNavText' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, PCPageNav) == 0x000340, "Member 'UCharacterSheetStatsTab_C::PCPageNav' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, PlayerStatEntry) == 0x000348, "Member 'UCharacterSheetStatsTab_C::PlayerStatEntry' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, PlayerStatEntry_1) == 0x000350, "Member 'UCharacterSheetStatsTab_C::PlayerStatEntry_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, PlayerStatEntry_2) == 0x000358, "Member 'UCharacterSheetStatsTab_C::PlayerStatEntry_2' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, PlayerStatEntry_3) == 0x000360, "Member 'UCharacterSheetStatsTab_C::PlayerStatEntry_3' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, PreviousPageButton_1) == 0x000368, "Member 'UCharacterSheetStatsTab_C::PreviousPageButton_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ProgramTrialVariatorWidget) == 0x000370, "Member 'UCharacterSheetStatsTab_C::ProgramTrialVariatorWidget' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ProgramTrialVariatorWidget_1) == 0x000378, "Member 'UCharacterSheetStatsTab_C::ProgramTrialVariatorWidget_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ProgramTrialVariatorWidget_2) == 0x000380, "Member 'UCharacterSheetStatsTab_C::ProgramTrialVariatorWidget_2' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ProgramTrialVariatorWidget_3) == 0x000388, "Member 'UCharacterSheetStatsTab_C::ProgramTrialVariatorWidget_3' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ProgramTrialVariatorWidget_4) == 0x000390, "Member 'UCharacterSheetStatsTab_C::ProgramTrialVariatorWidget_4' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, RecentTrialsContentBox) == 0x000398, "Member 'UCharacterSheetStatsTab_C::RecentTrialsContentBox' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, RefNumber) == 0x0003A0, "Member 'UCharacterSheetStatsTab_C::RefNumber' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, RequiredXpText) == 0x0003A8, "Member 'UCharacterSheetStatsTab_C::RequiredXpText' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreDetailLineEntry) == 0x0003B0, "Member 'UCharacterSheetStatsTab_C::ScoreDetailLineEntry' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreDetailLineEntry_1) == 0x0003B8, "Member 'UCharacterSheetStatsTab_C::ScoreDetailLineEntry_1' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreDetailLineEntry_2) == 0x0003C0, "Member 'UCharacterSheetStatsTab_C::ScoreDetailLineEntry_2' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreDetailLineEntry_3) == 0x0003C8, "Member 'UCharacterSheetStatsTab_C::ScoreDetailLineEntry_3' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreDetailLineEntry_4) == 0x0003D0, "Member 'UCharacterSheetStatsTab_C::ScoreDetailLineEntry_4' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreDetailLineEntry_5) == 0x0003D8, "Member 'UCharacterSheetStatsTab_C::ScoreDetailLineEntry_5' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreDetailLineEntry_6) == 0x0003E0, "Member 'UCharacterSheetStatsTab_C::ScoreDetailLineEntry_6' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreDetailLineEntry_7) == 0x0003E8, "Member 'UCharacterSheetStatsTab_C::ScoreDetailLineEntry_7' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreDetailLineEntry_8) == 0x0003F0, "Member 'UCharacterSheetStatsTab_C::ScoreDetailLineEntry_8' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreDetailLineEntry_9) == 0x0003F8, "Member 'UCharacterSheetStatsTab_C::ScoreDetailLineEntry_9' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreDetailLineEntry_10) == 0x000400, "Member 'UCharacterSheetStatsTab_C::ScoreDetailLineEntry_10' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreDetailLineEntry_11) == 0x000408, "Member 'UCharacterSheetStatsTab_C::ScoreDetailLineEntry_11' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreDetailLineEntry_12) == 0x000410, "Member 'UCharacterSheetStatsTab_C::ScoreDetailLineEntry_12' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreDetailLineEntry_13) == 0x000418, "Member 'UCharacterSheetStatsTab_C::ScoreDetailLineEntry_13' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, ScoreLines) == 0x000420, "Member 'UCharacterSheetStatsTab_C::ScoreLines' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, StatList) == 0x000428, "Member 'UCharacterSheetStatsTab_C::StatList' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, TopBorder) == 0x000430, "Member 'UCharacterSheetStatsTab_C::TopBorder' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, TrialCompletionTimeText) == 0x000438, "Member 'UCharacterSheetStatsTab_C::TrialCompletionTimeText' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, TrialCompletionTypeText) == 0x000440, "Member 'UCharacterSheetStatsTab_C::TrialCompletionTypeText' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, TrialDeathCountText) == 0x000448, "Member 'UCharacterSheetStatsTab_C::TrialDeathCountText' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, TrialNameText) == 0x000450, "Member 'UCharacterSheetStatsTab_C::TrialNameText' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, TrialRankText) == 0x000458, "Member 'UCharacterSheetStatsTab_C::TrialRankText' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, TrialTypeText) == 0x000460, "Member 'UCharacterSheetStatsTab_C::TrialTypeText' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, VariatorHBox) == 0x000468, "Member 'UCharacterSheetStatsTab_C::VariatorHBox' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, XPProgressBar) == 0x000470, "Member 'UCharacterSheetStatsTab_C::XPProgressBar' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, CurrentPageIndex) == 0x000478, "Member 'UCharacterSheetStatsTab_C::CurrentPageIndex' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, NumPages) == 0x00047C, "Member 'UCharacterSheetStatsTab_C::NumPages' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, DisplayedStats) == 0x000480, "Member 'UCharacterSheetStatsTab_C::DisplayedStats' has a wrong offset!");
static_assert(offsetof(UCharacterSheetStatsTab_C, RecentTrials) == 0x000490, "Member 'UCharacterSheetStatsTab_C::RecentTrials' has a wrong offset!");

}

