#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonNotificationWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CommonNotificationWidget.CommonNotificationWidget_C.ExecuteUbergraph_CommonNotificationWidget
// 0x0038 (0x0038 - 0x0000)
struct CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C8D[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C8E[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Gamepad;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget) == 0x000008, "Wrong alignment on CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget");
static_assert(sizeof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget) == 0x000038, "Wrong size on CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, EntryPoint) == 0x000000, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, Temp_bool_Variable) == 0x000004, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, Temp_byte_Variable) == 0x000005, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, Temp_byte_Variable_1) == 0x000006, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, Temp_bool_Variable_1) == 0x000007, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, Temp_byte_Variable_2) == 0x000008, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, Temp_byte_Variable_3) == 0x000009, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, Temp_bool_Variable_2) == 0x00000A, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, Temp_byte_Variable_4) == 0x00000B, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, Temp_byte_Variable_5) == 0x00000C, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, K2Node_Event_IsDesignTime) == 0x00000D, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, K2Node_ComponentBoundEvent_Button_2) == 0x000010, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, K2Node_Select_Default) == 0x000020, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, K2Node_Select_Default_1) == 0x000021, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, K2Node_Select_Default_2) == 0x000022, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, K2Node_ComponentBoundEvent_Button) == 0x000028, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget, K2Node_CustomEvent_Gamepad) == 0x000030, "Member 'CommonNotificationWidget_C_ExecuteUbergraph_CommonNotificationWidget::K2Node_CustomEvent_Gamepad' has a wrong offset!");

// Function CommonNotificationWidget.CommonNotificationWidget_C.InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct CommonNotificationWidget_C_InputSourceChanged final
{
public:
	bool                                          Gamepad;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonNotificationWidget_C_InputSourceChanged) == 0x000001, "Wrong alignment on CommonNotificationWidget_C_InputSourceChanged");
static_assert(sizeof(CommonNotificationWidget_C_InputSourceChanged) == 0x000001, "Wrong size on CommonNotificationWidget_C_InputSourceChanged");
static_assert(offsetof(CommonNotificationWidget_C_InputSourceChanged, Gamepad) == 0x000000, "Member 'CommonNotificationWidget_C_InputSourceChanged::Gamepad' has a wrong offset!");

// Function CommonNotificationWidget.CommonNotificationWidget_C.BndEvt__CommonNotificationWidget_BlockButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_BlockButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_BlockButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_BlockButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_BlockButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_BlockButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_BlockButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_BlockButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function CommonNotificationWidget.CommonNotificationWidget_C.BndEvt__CommonNotificationWidget_DeclineButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_DeclineButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_DeclineButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_DeclineButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(sizeof(CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_DeclineButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong size on CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_DeclineButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(offsetof(CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_DeclineButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_DeclineButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function CommonNotificationWidget.CommonNotificationWidget_C.BndEvt__CommonNotificationWidget_AcceptButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_AcceptButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_AcceptButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_AcceptButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_AcceptButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong size on CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_AcceptButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_AcceptButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'CommonNotificationWidget_C_BndEvt__CommonNotificationWidget_AcceptButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function CommonNotificationWidget.CommonNotificationWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CommonNotificationWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonNotificationWidget_C_PreConstruct) == 0x000001, "Wrong alignment on CommonNotificationWidget_C_PreConstruct");
static_assert(sizeof(CommonNotificationWidget_C_PreConstruct) == 0x000001, "Wrong size on CommonNotificationWidget_C_PreConstruct");
static_assert(offsetof(CommonNotificationWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CommonNotificationWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CommonNotificationWidget.CommonNotificationWidget_C.UpdateProgress
// 0x002C (0x002C - 0x0000)
struct CommonNotificationWidget_C_UpdateProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0010(0x001C)(NoDestructor)
};
static_assert(alignof(CommonNotificationWidget_C_UpdateProgress) == 0x000004, "Wrong alignment on CommonNotificationWidget_C_UpdateProgress");
static_assert(sizeof(CommonNotificationWidget_C_UpdateProgress) == 0x00002C, "Wrong size on CommonNotificationWidget_C_UpdateProgress");
static_assert(offsetof(CommonNotificationWidget_C_UpdateProgress, Progress) == 0x000000, "Member 'CommonNotificationWidget_C_UpdateProgress::Progress' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_UpdateProgress, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'CommonNotificationWidget_C_UpdateProgress::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_UpdateProgress, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'CommonNotificationWidget_C_UpdateProgress::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_UpdateProgress, K2Node_MakeStruct_WidgetTransform) == 0x000010, "Member 'CommonNotificationWidget_C_UpdateProgress::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");

// Function CommonNotificationWidget.CommonNotificationWidget_C.SetMessage
// 0x0018 (0x0018 - 0x0000)
struct CommonNotificationWidget_C_SetMessage final
{
public:
	class FText                                   Param_Message;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CommonNotificationWidget_C_SetMessage) == 0x000008, "Wrong alignment on CommonNotificationWidget_C_SetMessage");
static_assert(sizeof(CommonNotificationWidget_C_SetMessage) == 0x000018, "Wrong size on CommonNotificationWidget_C_SetMessage");
static_assert(offsetof(CommonNotificationWidget_C_SetMessage, Param_Message) == 0x000000, "Member 'CommonNotificationWidget_C_SetMessage::Param_Message' has a wrong offset!");

// Function CommonNotificationWidget.CommonNotificationWidget_C.EnableBlockButton
// 0x0005 (0x0005 - 0x0000)
struct CommonNotificationWidget_C_EnableBlockButton final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonNotificationWidget_C_EnableBlockButton) == 0x000001, "Wrong alignment on CommonNotificationWidget_C_EnableBlockButton");
static_assert(sizeof(CommonNotificationWidget_C_EnableBlockButton) == 0x000005, "Wrong size on CommonNotificationWidget_C_EnableBlockButton");
static_assert(offsetof(CommonNotificationWidget_C_EnableBlockButton, bEnable) == 0x000000, "Member 'CommonNotificationWidget_C_EnableBlockButton::bEnable' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_EnableBlockButton, Temp_bool_Variable) == 0x000001, "Member 'CommonNotificationWidget_C_EnableBlockButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_EnableBlockButton, Temp_byte_Variable) == 0x000002, "Member 'CommonNotificationWidget_C_EnableBlockButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_EnableBlockButton, Temp_byte_Variable_1) == 0x000003, "Member 'CommonNotificationWidget_C_EnableBlockButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonNotificationWidget_C_EnableBlockButton, K2Node_Select_Default) == 0x000004, "Member 'CommonNotificationWidget_C_EnableBlockButton::K2Node_Select_Default' has a wrong offset!");

}

