#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CoreUpgradeTierList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CoreUpgradeTierList.CoreUpgradeTierList_C
// 0x0060 (0x02C0 - 0x0260)
class UCoreUpgradeTierList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCoreUpgradeTierButton_C*               CoreUpgradeTierButton;                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCoreUpgradeTierButton_C*               CoreUpgradeTierButton_1;                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCoreUpgradeTierButton_C*               CoreUpgradeTierButton_2;                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TiersBox;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsLoadout;                                        // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A0C[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnTierHovered;                                     // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnTierUnhovered;                                   // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnTierClicked;                                     // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnTierClickedEvent(int32 Tier);
	void OnTierUnhoveredEvent(int32 Tier);
	void OnTierHoveredEvent(int32 Tier);
	void Refresh();
	void Init(bool Param_bIsLoadout);
	void Setup();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_CoreUpgradeTierList(int32 EntryPoint);
	void OnTierClicked__DelegateSignature(int32 Tier);
	void OnTierUnhovered__DelegateSignature(int32 Tier);
	void OnTierHovered__DelegateSignature(int32 Tier);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CoreUpgradeTierList_C">();
	}
	static class UCoreUpgradeTierList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCoreUpgradeTierList_C>();
	}
};
static_assert(alignof(UCoreUpgradeTierList_C) == 0x000008, "Wrong alignment on UCoreUpgradeTierList_C");
static_assert(sizeof(UCoreUpgradeTierList_C) == 0x0002C0, "Wrong size on UCoreUpgradeTierList_C");
static_assert(offsetof(UCoreUpgradeTierList_C, UberGraphFrame) == 0x000260, "Member 'UCoreUpgradeTierList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeTierList_C, CoreUpgradeTierButton) == 0x000268, "Member 'UCoreUpgradeTierList_C::CoreUpgradeTierButton' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeTierList_C, CoreUpgradeTierButton_1) == 0x000270, "Member 'UCoreUpgradeTierList_C::CoreUpgradeTierButton_1' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeTierList_C, CoreUpgradeTierButton_2) == 0x000278, "Member 'UCoreUpgradeTierList_C::CoreUpgradeTierButton_2' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeTierList_C, TiersBox) == 0x000280, "Member 'UCoreUpgradeTierList_C::TiersBox' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeTierList_C, bIsLoadout) == 0x000288, "Member 'UCoreUpgradeTierList_C::bIsLoadout' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeTierList_C, OnTierHovered) == 0x000290, "Member 'UCoreUpgradeTierList_C::OnTierHovered' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeTierList_C, OnTierUnhovered) == 0x0002A0, "Member 'UCoreUpgradeTierList_C::OnTierUnhovered' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeTierList_C, OnTierClicked) == 0x0002B0, "Member 'UCoreUpgradeTierList_C::OnTierClicked' has a wrong offset!");

}

