#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CoreUpgradesButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CoreUpgradesButton.CoreUpgradesButton_C
// 0x0068 (0x02C8 - 0x0260)
class UCoreUpgradesButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BackgroundImage;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedBottomLeftBracket_1;                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedBottomRightBracket_1;                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedTopLeftBracket_1;                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedTopRightBracket_1;                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_182;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InteractionButton;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SelectionBorderPanel;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StateText;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bHovered;                                          // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3757[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetHovered(bool bInHovered);
	void Refresh();
	void Init();
	void Setup();
	void BndEvt__RigButton_InteractionButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__RigButton_InteractionButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__RigButton_InteractionButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_CoreUpgradesButton(int32 EntryPoint);
	void OnClicked__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CoreUpgradesButton_C">();
	}
	static class UCoreUpgradesButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCoreUpgradesButton_C>();
	}
};
static_assert(alignof(UCoreUpgradesButton_C) == 0x000008, "Wrong alignment on UCoreUpgradesButton_C");
static_assert(sizeof(UCoreUpgradesButton_C) == 0x0002C8, "Wrong size on UCoreUpgradesButton_C");
static_assert(offsetof(UCoreUpgradesButton_C, UberGraphFrame) == 0x000260, "Member 'UCoreUpgradesButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCoreUpgradesButton_C, BackgroundImage) == 0x000268, "Member 'UCoreUpgradesButton_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UCoreUpgradesButton_C, FocussedBottomLeftBracket_1) == 0x000270, "Member 'UCoreUpgradesButton_C::FocussedBottomLeftBracket_1' has a wrong offset!");
static_assert(offsetof(UCoreUpgradesButton_C, FocussedBottomRightBracket_1) == 0x000278, "Member 'UCoreUpgradesButton_C::FocussedBottomRightBracket_1' has a wrong offset!");
static_assert(offsetof(UCoreUpgradesButton_C, FocussedTopLeftBracket_1) == 0x000280, "Member 'UCoreUpgradesButton_C::FocussedTopLeftBracket_1' has a wrong offset!");
static_assert(offsetof(UCoreUpgradesButton_C, FocussedTopRightBracket_1) == 0x000288, "Member 'UCoreUpgradesButton_C::FocussedTopRightBracket_1' has a wrong offset!");
static_assert(offsetof(UCoreUpgradesButton_C, Image_182) == 0x000290, "Member 'UCoreUpgradesButton_C::Image_182' has a wrong offset!");
static_assert(offsetof(UCoreUpgradesButton_C, InteractionButton) == 0x000298, "Member 'UCoreUpgradesButton_C::InteractionButton' has a wrong offset!");
static_assert(offsetof(UCoreUpgradesButton_C, SelectionBorderPanel) == 0x0002A0, "Member 'UCoreUpgradesButton_C::SelectionBorderPanel' has a wrong offset!");
static_assert(offsetof(UCoreUpgradesButton_C, StateText) == 0x0002A8, "Member 'UCoreUpgradesButton_C::StateText' has a wrong offset!");
static_assert(offsetof(UCoreUpgradesButton_C, bHovered) == 0x0002B0, "Member 'UCoreUpgradesButton_C::bHovered' has a wrong offset!");
static_assert(offsetof(UCoreUpgradesButton_C, OnClicked) == 0x0002B8, "Member 'UCoreUpgradesButton_C::OnClicked' has a wrong offset!");

}

