#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CubeGrayBox_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GrayBoxShape_ENU_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CubeGrayBox_BP.CubeGrayBox_BP_C.UserConstructionScript
// 0x0140 (0x0140 - 0x0000)
struct CubeGrayBox_BP_C_UserConstructionScript final
{
public:
	EGrayBoxShape_ENU                             Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3928[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3929[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_2;      // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_392A[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392B[0x8];                                     // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x00B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CubeGrayBox_BP_C_UserConstructionScript) == 0x000010, "Wrong alignment on CubeGrayBox_BP_C_UserConstructionScript");
static_assert(sizeof(CubeGrayBox_BP_C_UserConstructionScript) == 0x000140, "Wrong size on CubeGrayBox_BP_C_UserConstructionScript");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, Temp_byte_Variable) == 0x000000, "Member 'CubeGrayBox_BP_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, Temp_bool_Variable) == 0x000001, "Member 'CubeGrayBox_BP_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, Temp_bool_Variable_1) == 0x000002, "Member 'CubeGrayBox_BP_C_UserConstructionScript::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, Temp_bool_Variable_2) == 0x000003, "Member 'CubeGrayBox_BP_C_UserConstructionScript::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, K2Node_Select_Default) == 0x000008, "Member 'CubeGrayBox_BP_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000010, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000014, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000018, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x00001C, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000020, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x000024, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000028, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_FMax_ReturnValue) == 0x00002C, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_FMax_ReturnValue_1) == 0x000030, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, K2Node_Select_Default_1) == 0x000034, "Member 'CubeGrayBox_BP_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_FMax_ReturnValue_2) == 0x000038, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_EqualEqual_FloatFloat_ReturnValue_2) == 0x00003D, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_EqualEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, K2Node_Select_Default_2) == 0x000040, "Member 'CubeGrayBox_BP_C_UserConstructionScript::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, K2Node_Select_Default_3) == 0x000044, "Member 'CubeGrayBox_BP_C_UserConstructionScript::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000054, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_BreakVector_X_2) == 0x000060, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_2) == 0x000064, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_2) == 0x000068, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x00006C, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CubeGrayBox_BP_C_UserConstructionScript, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0000B0, "Member 'CubeGrayBox_BP_C_UserConstructionScript::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");

}

