#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationOptionThumbnail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CustomizationOptionThumbnail.CustomizationOptionThumbnail_C
// 0x0160 (0x03C0 - 0x0260)
class UCustomizationOptionThumbnail_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       buyAnimation;                                      // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                CostBorder;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CostIcon;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CostOverlay;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CostValue;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DevText;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DlcIcon;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DollarIcon;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EmptyOverlay;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EquippedIcon;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationInteractionWidget_C*      GamepadTooltip;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lock;                                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockedGreyout;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LockedOverlay;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewNotification;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OptionOverlay;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityOverlay;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Scratches;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ThumbnailButton;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             Event_OnClicked;                                   // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Event_OnHovered;                                   // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Event_OnUnhovered;                                 // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsEquipped;                                        // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_380C[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUICustomizationItem                   Item;                                              // 0x0350(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	FMulticastInlineDelegateProperty_             Event_OnPressed;                                   // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Event_OnReleased;                                  // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCustomizationInteractionWidget_C*      ToolTip;                                           // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECustomizationInteractionType                 InteractionType;                                   // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_New_Item;                                       // 0x03A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_380D[0x2];                                     // 0x03AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ItemId;                                            // 0x03AC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Rotating;                                          // 0x03B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MaintainHoveredState;                              // 0x03B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEmpty;                                           // 0x03B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ECustomizationMenuCategory                    Category;                                          // 0x03B7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHovered;                                          // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void IsElementEmpty(bool* bIsEmpty);
	void RefreshInteractionType();
	void UpdateThumbnailType(bool Param_IsEmpty);
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);
	void HideTooltip();
	void GamepadNav_MenuConfirm_Release();
	void GamepadNav_MenuConfirm();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void CreateTooltip();
	void InitCost();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetIsNew(bool IsNew);
	void UpdateRarity(EPlayerCustomizationRarity Rarity);
	void ShowLockedOverlay();
	void HideLockedOverlay();
	void SetIsEquipped(bool Equipped);
	void SetHovered(bool Param_IsHovered);
	void Initialize(const struct FUICustomizationItem& Param_Item, int32 Param_Index, ECustomizationMenuCategory Param_Category);
	void Construct();
	void BndEvt__Button_28_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_28_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_28_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_28_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__Button_28_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();
	void ExecuteUbergraph_CustomizationOptionThumbnail(int32 EntryPoint);
	void Event_OnReleased__DelegateSignature(class UCustomizationOptionThumbnail_C* Button);
	void Event_OnPressed__DelegateSignature(class UCustomizationOptionThumbnail_C* Button);
	void Event_OnUnhovered__DelegateSignature(class UCustomizationOptionThumbnail_C* Widget);
	void Event_OnHovered__DelegateSignature(class UCustomizationOptionThumbnail_C* Widget);
	void Event_OnClicked__DelegateSignature(class UCustomizationOptionThumbnail_C* Widget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomizationOptionThumbnail_C">();
	}
	static class UCustomizationOptionThumbnail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizationOptionThumbnail_C>();
	}
};
static_assert(alignof(UCustomizationOptionThumbnail_C) == 0x000008, "Wrong alignment on UCustomizationOptionThumbnail_C");
static_assert(sizeof(UCustomizationOptionThumbnail_C) == 0x0003C0, "Wrong size on UCustomizationOptionThumbnail_C");
static_assert(offsetof(UCustomizationOptionThumbnail_C, UberGraphFrame) == 0x000260, "Member 'UCustomizationOptionThumbnail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, buyAnimation) == 0x000268, "Member 'UCustomizationOptionThumbnail_C::buyAnimation' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, Border) == 0x000270, "Member 'UCustomizationOptionThumbnail_C::Border' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, CostBorder) == 0x000278, "Member 'UCustomizationOptionThumbnail_C::CostBorder' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, CostIcon) == 0x000280, "Member 'UCustomizationOptionThumbnail_C::CostIcon' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, CostOverlay) == 0x000288, "Member 'UCustomizationOptionThumbnail_C::CostOverlay' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, CostValue) == 0x000290, "Member 'UCustomizationOptionThumbnail_C::CostValue' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, DevText) == 0x000298, "Member 'UCustomizationOptionThumbnail_C::DevText' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, DlcIcon) == 0x0002A0, "Member 'UCustomizationOptionThumbnail_C::DlcIcon' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, DollarIcon) == 0x0002A8, "Member 'UCustomizationOptionThumbnail_C::DollarIcon' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, EmptyOverlay) == 0x0002B0, "Member 'UCustomizationOptionThumbnail_C::EmptyOverlay' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, EquippedIcon) == 0x0002B8, "Member 'UCustomizationOptionThumbnail_C::EquippedIcon' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, GamepadTooltip) == 0x0002C0, "Member 'UCustomizationOptionThumbnail_C::GamepadTooltip' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, Image) == 0x0002C8, "Member 'UCustomizationOptionThumbnail_C::Image' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, Lock) == 0x0002D0, "Member 'UCustomizationOptionThumbnail_C::Lock' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, LockedGreyout) == 0x0002D8, "Member 'UCustomizationOptionThumbnail_C::LockedGreyout' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, LockedOverlay) == 0x0002E0, "Member 'UCustomizationOptionThumbnail_C::LockedOverlay' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, NewNotification) == 0x0002E8, "Member 'UCustomizationOptionThumbnail_C::NewNotification' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, OptionOverlay) == 0x0002F0, "Member 'UCustomizationOptionThumbnail_C::OptionOverlay' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, RarityOverlay) == 0x0002F8, "Member 'UCustomizationOptionThumbnail_C::RarityOverlay' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, Scratches) == 0x000300, "Member 'UCustomizationOptionThumbnail_C::Scratches' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, Thumbnail) == 0x000308, "Member 'UCustomizationOptionThumbnail_C::Thumbnail' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, ThumbnailButton) == 0x000310, "Member 'UCustomizationOptionThumbnail_C::ThumbnailButton' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, Event_OnClicked) == 0x000318, "Member 'UCustomizationOptionThumbnail_C::Event_OnClicked' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, Event_OnHovered) == 0x000328, "Member 'UCustomizationOptionThumbnail_C::Event_OnHovered' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, Event_OnUnhovered) == 0x000338, "Member 'UCustomizationOptionThumbnail_C::Event_OnUnhovered' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, IsEquipped) == 0x000348, "Member 'UCustomizationOptionThumbnail_C::IsEquipped' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, Item) == 0x000350, "Member 'UCustomizationOptionThumbnail_C::Item' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, Event_OnPressed) == 0x000380, "Member 'UCustomizationOptionThumbnail_C::Event_OnPressed' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, Event_OnReleased) == 0x000390, "Member 'UCustomizationOptionThumbnail_C::Event_OnReleased' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, ToolTip) == 0x0003A0, "Member 'UCustomizationOptionThumbnail_C::ToolTip' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, InteractionType) == 0x0003A8, "Member 'UCustomizationOptionThumbnail_C::InteractionType' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, Is_New_Item) == 0x0003A9, "Member 'UCustomizationOptionThumbnail_C::Is_New_Item' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, ItemId) == 0x0003AC, "Member 'UCustomizationOptionThumbnail_C::ItemId' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, Rotating) == 0x0003B4, "Member 'UCustomizationOptionThumbnail_C::Rotating' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, MaintainHoveredState) == 0x0003B5, "Member 'UCustomizationOptionThumbnail_C::MaintainHoveredState' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, IsEmpty) == 0x0003B6, "Member 'UCustomizationOptionThumbnail_C::IsEmpty' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, Category) == 0x0003B7, "Member 'UCustomizationOptionThumbnail_C::Category' has a wrong offset!");
static_assert(offsetof(UCustomizationOptionThumbnail_C, bHovered) == 0x0003B8, "Member 'UCustomizationOptionThumbnail_C::bHovered' has a wrong offset!");

}

