#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationInteractionWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CustomizationInteractionWidget.CustomizationInteractionWidget_C.UpdateDevText
// 0x02B0 (0x02B0 - 0x0000)
struct CustomizationInteractionWidget_C_UpdateDevText final
{
public:
	class URBCustomizationOption*                 Option;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3839[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0088(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0040)(HasGetValueTypeHash)
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBItemProgressionData                 CallFunc_GetItemProgressionData_ReturnValue;       // 0x00E8(0x00E8)(ConstParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01D0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x01E8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0200(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0240(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_CheckFeatureSwitch_ReturnValue;           // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383A[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0288(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0298(0x0018)()
};
static_assert(alignof(CustomizationInteractionWidget_C_UpdateDevText) == 0x000008, "Wrong alignment on CustomizationInteractionWidget_C_UpdateDevText");
static_assert(sizeof(CustomizationInteractionWidget_C_UpdateDevText) == 0x0002B0, "Wrong size on CustomizationInteractionWidget_C_UpdateDevText");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, Option) == 0x000000, "Member 'CustomizationInteractionWidget_C_UpdateDevText::Option' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_GetPathName_ReturnValue) == 0x000010, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'CustomizationInteractionWidget_C_UpdateDevText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000088, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'CustomizationInteractionWidget_C_UpdateDevText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x0000E0, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_GetItemProgressionData_ReturnValue) == 0x0000E8, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_GetItemProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0001D0, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0001E8, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, K2Node_MakeStruct_FormatArgumentData_2) == 0x000200, "Member 'CustomizationInteractionWidget_C_UpdateDevText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, K2Node_MakeStruct_FormatArgumentData_3) == 0x000240, "Member 'CustomizationInteractionWidget_C_UpdateDevText::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_CheckFeatureSwitch_ReturnValue) == 0x000280, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_CheckFeatureSwitch_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, K2Node_MakeArray_Array) == 0x000288, "Member 'CustomizationInteractionWidget_C_UpdateDevText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_Format_ReturnValue) == 0x000298, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function CustomizationInteractionWidget.CustomizationInteractionWidget_C.Initialize
// 0x0068 (0x0068 - 0x0000)
struct CustomizationInteractionWidget_C_Initialize final
{
public:
	struct FUICustomizationItem                   Item;                                              // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBCustomizationOption*                 CallFunc_GetValidCustomizationOption_ReturnValue;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemUnlockInfo                        CallFunc_GetUnlockInfo_ReturnValue;                // 0x0048(0x0020)(ConstParm)
};
static_assert(alignof(CustomizationInteractionWidget_C_Initialize) == 0x000008, "Wrong alignment on CustomizationInteractionWidget_C_Initialize");
static_assert(sizeof(CustomizationInteractionWidget_C_Initialize) == 0x000068, "Wrong size on CustomizationInteractionWidget_C_Initialize");
static_assert(offsetof(CustomizationInteractionWidget_C_Initialize, Item) == 0x000000, "Member 'CustomizationInteractionWidget_C_Initialize::Item' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_Initialize, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000030, "Member 'CustomizationInteractionWidget_C_Initialize::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_Initialize, CallFunc_GetValidCustomizationOption_ReturnValue) == 0x000038, "Member 'CustomizationInteractionWidget_C_Initialize::CallFunc_GetValidCustomizationOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_Initialize, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x000040, "Member 'CustomizationInteractionWidget_C_Initialize::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_Initialize, CallFunc_GetUnlockInfo_ReturnValue) == 0x000048, "Member 'CustomizationInteractionWidget_C_Initialize::CallFunc_GetUnlockInfo_ReturnValue' has a wrong offset!");

// Function CustomizationInteractionWidget.CustomizationInteractionWidget_C.UpdateInteractionType
// 0x00E8 (0x00E8 - 0x0000)
struct CustomizationInteractionWidget_C_UpdateInteractionType final
{
public:
	ECustomizationInteractionType                 InteractionType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemUnlockInfo                        UnlockInfo;                                        // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          HasHoldAction;                                     // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DisplayNegativeFeedback;                           // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383C[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RestrictionText;                                   // 0x0030(0x0018)(Edit, BlueprintVisible)
	bool                                          HasAction;                                         // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383D[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ActionText;                                        // 0x0050(0x0018)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383E[0x5];                                     // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0070(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0098(0x0028)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x00C0(0x0028)()
};
static_assert(alignof(CustomizationInteractionWidget_C_UpdateInteractionType) == 0x000008, "Wrong alignment on CustomizationInteractionWidget_C_UpdateInteractionType");
static_assert(sizeof(CustomizationInteractionWidget_C_UpdateInteractionType) == 0x0000E8, "Wrong size on CustomizationInteractionWidget_C_UpdateInteractionType");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, InteractionType) == 0x000000, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::InteractionType' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, UnlockInfo) == 0x000008, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::UnlockInfo' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, HasHoldAction) == 0x000028, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::HasHoldAction' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, DisplayNegativeFeedback) == 0x000029, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::DisplayNegativeFeedback' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, RestrictionText) == 0x000030, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::RestrictionText' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, HasAction) == 0x000048, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::HasAction' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, ActionText) == 0x000050, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::ActionText' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, Temp_bool_Variable) == 0x000068, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, K2Node_SwitchEnum_CmpSuccess) == 0x000069, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, CallFunc_TextIsEmpty_ReturnValue) == 0x00006A, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, K2Node_MakeStruct_SlateColor) == 0x000070, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, K2Node_MakeStruct_SlateColor_1) == 0x000098, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, K2Node_Select_Default) == 0x0000C0, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::K2Node_Select_Default' has a wrong offset!");

// Function CustomizationInteractionWidget.CustomizationInteractionWidget_C.InitWithOption
// 0x0038 (0x0038 - 0x0000)
struct CustomizationInteractionWidget_C_InitWithOption final
{
public:
	class URBPlayerCustomizationOption*           Option;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECustomizationInteractionType                 InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_383F[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemUnlockInfo                        CallFunc_GetUnlockInfo_ReturnValue;                // 0x0018(0x0020)(ConstParm)
};
static_assert(alignof(CustomizationInteractionWidget_C_InitWithOption) == 0x000008, "Wrong alignment on CustomizationInteractionWidget_C_InitWithOption");
static_assert(sizeof(CustomizationInteractionWidget_C_InitWithOption) == 0x000038, "Wrong size on CustomizationInteractionWidget_C_InitWithOption");
static_assert(offsetof(CustomizationInteractionWidget_C_InitWithOption, Option) == 0x000000, "Member 'CustomizationInteractionWidget_C_InitWithOption::Option' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_InitWithOption, InteractionType) == 0x000008, "Member 'CustomizationInteractionWidget_C_InitWithOption::InteractionType' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_InitWithOption, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x000010, "Member 'CustomizationInteractionWidget_C_InitWithOption::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_InitWithOption, CallFunc_GetUnlockInfo_ReturnValue) == 0x000018, "Member 'CustomizationInteractionWidget_C_InitWithOption::CallFunc_GetUnlockInfo_ReturnValue' has a wrong offset!");

// Function CustomizationInteractionWidget.CustomizationInteractionWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CustomizationInteractionWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationInteractionWidget_C_PreConstruct) == 0x000001, "Wrong alignment on CustomizationInteractionWidget_C_PreConstruct");
static_assert(sizeof(CustomizationInteractionWidget_C_PreConstruct) == 0x000001, "Wrong size on CustomizationInteractionWidget_C_PreConstruct");
static_assert(offsetof(CustomizationInteractionWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CustomizationInteractionWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CustomizationInteractionWidget.CustomizationInteractionWidget_C.ExecuteUbergraph_CustomizationInteractionWidget
// 0x0008 (0x0008 - 0x0000)
struct CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget) == 0x000004, "Wrong alignment on CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget");
static_assert(sizeof(CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget) == 0x000008, "Wrong size on CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget");
static_assert(offsetof(CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget, EntryPoint) == 0x000000, "Member 'CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

}

