#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Denizen_Face_State_Struct

#include "Basic.hpp"

#include "Denizen_Names_Enum_structs.hpp"


namespace SDK
{

// UserDefinedStruct Denizen_Face_State_Struct.Denizen_Face_State_Struct
// 0x00F0 (0x00F0 - 0x0000)
struct FDenizen_Face_State_Struct final
{
public:
	TMap<EDenizen_Names_Enum, class UAnimSequence*> Default_24_599E99054D8D9DA09BBFC2A0DD36563F;       // 0x0000(0x0050)(Edit, BlueprintVisible)
	TMap<EDenizen_Names_Enum, class UAnimSequence*> Unaware_25_D9927C234FBC8BF014BFF69B84493DFD;       // 0x0050(0x0050)(Edit, BlueprintVisible)
	TMap<EDenizen_Names_Enum, class UAnimSequence*> Notice_26_D214DFC94BD693ACA9C91AA0EEB5A690;        // 0x00A0(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FDenizen_Face_State_Struct) == 0x000008, "Wrong alignment on FDenizen_Face_State_Struct");
static_assert(sizeof(FDenizen_Face_State_Struct) == 0x0000F0, "Wrong size on FDenizen_Face_State_Struct");
static_assert(offsetof(FDenizen_Face_State_Struct, Default_24_599E99054D8D9DA09BBFC2A0DD36563F) == 0x000000, "Member 'FDenizen_Face_State_Struct::Default_24_599E99054D8D9DA09BBFC2A0DD36563F' has a wrong offset!");
static_assert(offsetof(FDenizen_Face_State_Struct, Unaware_25_D9927C234FBC8BF014BFF69B84493DFD) == 0x000050, "Member 'FDenizen_Face_State_Struct::Unaware_25_D9927C234FBC8BF014BFF69B84493DFD' has a wrong offset!");
static_assert(offsetof(FDenizen_Face_State_Struct, Notice_26_D214DFC94BD693ACA9C91AA0EEB5A690) == 0x0000A0, "Member 'FDenizen_Face_State_Struct::Notice_26_D214DFC94BD693ACA9C91AA0EEB5A690' has a wrong offset!");

}

