#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DestructibleFunctions

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function DestructibleFunctions.DestructibleFunctions_C.ShakeSurroundingPlayersCamera
// 0x0118 (0x0118 - 0x0000)
struct DestructibleFunctions_C_ShakeSurroundingPlayersCamera final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339E[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraShakeData                       ShakeData;                                         // 0x0010(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339F[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBWorld*                               CallFunc_GetRBWorld_ReturnValue;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ARBPawn*>                        CallFunc_GetRBPawns_ReturnValue;                   // 0x00C0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A0[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33A1[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_DynamicCast_AsRB_Player;                    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33A2[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera) == 0x000008, "Wrong alignment on DestructibleFunctions_C_ShakeSurroundingPlayersCamera");
static_assert(sizeof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera) == 0x000118, "Wrong size on DestructibleFunctions_C_ShakeSurroundingPlayersCamera");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, Location) == 0x000000, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::Location' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, ShakeData) == 0x000010, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::ShakeData' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, __WorldContext) == 0x0000A0, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::__WorldContext' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, Temp_int_Array_Index_Variable) == 0x0000A8, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, Temp_int_Loop_Counter_Variable) == 0x0000AC, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, CallFunc_Add_IntInt_ReturnValue) == 0x0000B0, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, CallFunc_GetRBWorld_ReturnValue) == 0x0000B8, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::CallFunc_GetRBWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, CallFunc_GetRBPawns_ReturnValue) == 0x0000C0, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::CallFunc_GetRBPawns_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, CallFunc_Less_IntInt_ReturnValue) == 0x0000E0, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, K2Node_DynamicCast_AsRB_Player) == 0x0000E8, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::K2Node_DynamicCast_AsRB_Player' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F4, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000100, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, CallFunc_VSize_ReturnValue) == 0x00010C, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(DestructibleFunctions_C_ShakeSurroundingPlayersCamera, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000110, "Member 'DestructibleFunctions_C_ShakeSurroundingPlayersCamera::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

