#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DocumentGroupButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DocumentGroupButton.DocumentGroupButton_C.IsElementEmpty
// 0x0002 (0x0002 - 0x0000)
struct DocumentGroupButton_C_IsElementEmpty final
{
public:
	bool                                          bIsEmpty;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DocumentGroupButton_C_IsElementEmpty) == 0x000001, "Wrong alignment on DocumentGroupButton_C_IsElementEmpty");
static_assert(sizeof(DocumentGroupButton_C_IsElementEmpty) == 0x000002, "Wrong size on DocumentGroupButton_C_IsElementEmpty");
static_assert(offsetof(DocumentGroupButton_C_IsElementEmpty, bIsEmpty) == 0x000000, "Member 'DocumentGroupButton_C_IsElementEmpty::bIsEmpty' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_IsElementEmpty, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000001, "Member 'DocumentGroupButton_C_IsElementEmpty::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function DocumentGroupButton.DocumentGroupButton_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct DocumentGroupButton_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(DocumentGroupButton_C_OnFocusLost) == 0x000004, "Wrong alignment on DocumentGroupButton_C_OnFocusLost");
static_assert(sizeof(DocumentGroupButton_C_OnFocusLost) == 0x000008, "Wrong size on DocumentGroupButton_C_OnFocusLost");
static_assert(offsetof(DocumentGroupButton_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'DocumentGroupButton_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function DocumentGroupButton.DocumentGroupButton_C.OnFocusReceived
// 0x01D0 (0x01D0 - 0x0000)
struct DocumentGroupButton_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00F8(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0118(0x00B8)()
};
static_assert(alignof(DocumentGroupButton_C_OnFocusReceived) == 0x000008, "Wrong alignment on DocumentGroupButton_C_OnFocusReceived");
static_assert(sizeof(DocumentGroupButton_C_OnFocusReceived) == 0x0001D0, "Wrong size on DocumentGroupButton_C_OnFocusReceived");
static_assert(offsetof(DocumentGroupButton_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'DocumentGroupButton_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'DocumentGroupButton_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'DocumentGroupButton_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_OnFocusReceived, CallFunc_MakeLiteralText_ReturnValue) == 0x0000F8, "Member 'DocumentGroupButton_C_OnFocusReceived::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_OnFocusReceived, CallFunc_MakeLiteralName_ReturnValue) == 0x000110, "Member 'DocumentGroupButton_C_OnFocusReceived::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000118, "Member 'DocumentGroupButton_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function DocumentGroupButton.DocumentGroupButton_C.IsConsideredHovered
// 0x0001 (0x0001 - 0x0000)
struct DocumentGroupButton_C_IsConsideredHovered final
{
public:
	bool                                          bConsideredHovered;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DocumentGroupButton_C_IsConsideredHovered) == 0x000001, "Wrong alignment on DocumentGroupButton_C_IsConsideredHovered");
static_assert(sizeof(DocumentGroupButton_C_IsConsideredHovered) == 0x000001, "Wrong size on DocumentGroupButton_C_IsConsideredHovered");
static_assert(offsetof(DocumentGroupButton_C_IsConsideredHovered, bConsideredHovered) == 0x000000, "Member 'DocumentGroupButton_C_IsConsideredHovered::bConsideredHovered' has a wrong offset!");

// Function DocumentGroupButton.DocumentGroupButton_C.SetFocused
// 0x0003 (0x0003 - 0x0000)
struct DocumentGroupButton_C_SetFocused final
{
public:
	bool                                          bInFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWasConsideredHovered;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DocumentGroupButton_C_SetFocused) == 0x000001, "Wrong alignment on DocumentGroupButton_C_SetFocused");
static_assert(sizeof(DocumentGroupButton_C_SetFocused) == 0x000003, "Wrong size on DocumentGroupButton_C_SetFocused");
static_assert(offsetof(DocumentGroupButton_C_SetFocused, bInFocused) == 0x000000, "Member 'DocumentGroupButton_C_SetFocused::bInFocused' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_SetFocused, bWasConsideredHovered) == 0x000001, "Member 'DocumentGroupButton_C_SetFocused::bWasConsideredHovered' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_SetFocused, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000002, "Member 'DocumentGroupButton_C_SetFocused::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");

// Function DocumentGroupButton.DocumentGroupButton_C.SetHovered
// 0x0005 (0x0005 - 0x0000)
struct DocumentGroupButton_C_SetHovered final
{
public:
	bool                                          bInHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWasConsideredHovered;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered_1; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DocumentGroupButton_C_SetHovered) == 0x000001, "Wrong alignment on DocumentGroupButton_C_SetHovered");
static_assert(sizeof(DocumentGroupButton_C_SetHovered) == 0x000005, "Wrong size on DocumentGroupButton_C_SetHovered");
static_assert(offsetof(DocumentGroupButton_C_SetHovered, bInHovered) == 0x000000, "Member 'DocumentGroupButton_C_SetHovered::bInHovered' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_SetHovered, bWasConsideredHovered) == 0x000001, "Member 'DocumentGroupButton_C_SetHovered::bWasConsideredHovered' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_SetHovered, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000002, "Member 'DocumentGroupButton_C_SetHovered::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_SetHovered, CallFunc_IsConsideredHovered_bConsideredHovered_1) == 0x000003, "Member 'DocumentGroupButton_C_SetHovered::CallFunc_IsConsideredHovered_bConsideredHovered_1' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_SetHovered, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000004, "Member 'DocumentGroupButton_C_SetHovered::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function DocumentGroupButton.DocumentGroupButton_C.Setup
// 0x03F0 (0x03F0 - 0x0000)
struct DocumentGroupButton_C_Setup final
{
public:
	struct FRBCollectibleDocumentGroupRow         DocumentGroupRow;                                  // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Param_Index;                                       // 0x0068(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AcquiredCount;                                     // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0078(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0040)(HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B2[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F8(0x0018)()
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B3[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B4[0x2];                                     // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBCollectibleDocumentsConfig*          CallFunc_GetCollectibleDocumentsConfig_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRBCollectibleDocumentDefinitionRow> CallFunc_GetDocumentGroupDocuments_ReturnValue;    // 0x0138(0x0010)(ReferenceParm)
	struct FRBCollectibleDocumentDefinitionRow    CallFunc_Array_Get_Item;                           // 0x0148(0x00E8)()
	struct FRBCollectibleDocumentDefinitionRow    CallFunc_Array_Get_Item_1;                         // 0x0230(0x00E8)()
	bool                                          CallFunc_HasSeenDocument_ReturnValue;              // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B5[0x3];                                     // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B6[0x2];                                     // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B7[0x2];                                     // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0330(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0370(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x03B0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37B8[0x4];                                     // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x03C8(0x0018)()
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemAcquired_ReturnValue;               // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsItemAcquired_ReturnValue_1;             // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DocumentGroupButton_C_Setup) == 0x000008, "Wrong alignment on DocumentGroupButton_C_Setup");
static_assert(sizeof(DocumentGroupButton_C_Setup) == 0x0003F0, "Wrong size on DocumentGroupButton_C_Setup");
static_assert(offsetof(DocumentGroupButton_C_Setup, DocumentGroupRow) == 0x000000, "Member 'DocumentGroupButton_C_Setup::DocumentGroupRow' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, Param_Index) == 0x000068, "Member 'DocumentGroupButton_C_Setup::Param_Index' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, AcquiredCount) == 0x00006C, "Member 'DocumentGroupButton_C_Setup::AcquiredCount' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, Temp_int_Array_Index_Variable) == 0x000070, "Member 'DocumentGroupButton_C_Setup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'DocumentGroupButton_C_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Conv_IntToText_ReturnValue) == 0x000078, "Member 'DocumentGroupButton_C_Setup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'DocumentGroupButton_C_Setup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0000D0, "Member 'DocumentGroupButton_C_Setup::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, K2Node_MakeArray_Array) == 0x0000D8, "Member 'DocumentGroupButton_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, K2Node_DynamicCast_AsTexture_2D) == 0x0000E8, "Member 'DocumentGroupButton_C_Setup::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'DocumentGroupButton_C_Setup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Format_ReturnValue) == 0x0000F8, "Member 'DocumentGroupButton_C_Setup::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000110, "Member 'DocumentGroupButton_C_Setup::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, Temp_int_Loop_Counter_Variable) == 0x000114, "Member 'DocumentGroupButton_C_Setup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, Temp_bool_True_if_break_was_hit_Variable) == 0x000118, "Member 'DocumentGroupButton_C_Setup::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Not_PreBool_ReturnValue) == 0x000119, "Member 'DocumentGroupButton_C_Setup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Add_IntInt_ReturnValue_1) == 0x00011C, "Member 'DocumentGroupButton_C_Setup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, Temp_int_Loop_Counter_Variable_1) == 0x000120, "Member 'DocumentGroupButton_C_Setup::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Add_IntInt_ReturnValue_2) == 0x000124, "Member 'DocumentGroupButton_C_Setup::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, Temp_int_Array_Index_Variable_1) == 0x000128, "Member 'DocumentGroupButton_C_Setup::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, Temp_int_Variable) == 0x00012C, "Member 'DocumentGroupButton_C_Setup::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_GetCollectibleDocumentsConfig_ReturnValue) == 0x000130, "Member 'DocumentGroupButton_C_Setup::CallFunc_GetCollectibleDocumentsConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_GetDocumentGroupDocuments_ReturnValue) == 0x000138, "Member 'DocumentGroupButton_C_Setup::CallFunc_GetDocumentGroupDocuments_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Array_Get_Item) == 0x000148, "Member 'DocumentGroupButton_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Array_Get_Item_1) == 0x000230, "Member 'DocumentGroupButton_C_Setup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_HasSeenDocument_ReturnValue) == 0x000318, "Member 'DocumentGroupButton_C_Setup::CallFunc_HasSeenDocument_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x00031C, "Member 'DocumentGroupButton_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Not_PreBool_ReturnValue_1) == 0x000320, "Member 'DocumentGroupButton_C_Setup::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x000321, "Member 'DocumentGroupButton_C_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Array_Length_ReturnValue_1) == 0x000324, "Member 'DocumentGroupButton_C_Setup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_BooleanAND_ReturnValue) == 0x000328, "Member 'DocumentGroupButton_C_Setup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Less_IntInt_ReturnValue_1) == 0x000329, "Member 'DocumentGroupButton_C_Setup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Array_Length_ReturnValue_2) == 0x00032C, "Member 'DocumentGroupButton_C_Setup::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, K2Node_MakeStruct_FormatArgumentData_1) == 0x000330, "Member 'DocumentGroupButton_C_Setup::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, K2Node_MakeStruct_FormatArgumentData_2) == 0x000370, "Member 'DocumentGroupButton_C_Setup::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, K2Node_MakeArray_Array_1) == 0x0003B0, "Member 'DocumentGroupButton_C_Setup::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Add_IntInt_ReturnValue_3) == 0x0003C0, "Member 'DocumentGroupButton_C_Setup::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_Format_ReturnValue_1) == 0x0003C8, "Member 'DocumentGroupButton_C_Setup::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_GetLocalPlayerState_ReturnValue) == 0x0003E0, "Member 'DocumentGroupButton_C_Setup::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_IsItemAcquired_ReturnValue) == 0x0003E8, "Member 'DocumentGroupButton_C_Setup::CallFunc_IsItemAcquired_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_IsItemAcquired_ReturnValue_1) == 0x0003E9, "Member 'DocumentGroupButton_C_Setup::CallFunc_IsItemAcquired_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_Setup, CallFunc_BooleanAND_ReturnValue_1) == 0x0003EA, "Member 'DocumentGroupButton_C_Setup::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function DocumentGroupButton.DocumentGroupButton_C.UpdateFocus
// 0x0118 (0x0118 - 0x0000)
struct DocumentGroupButton_C_UpdateFocus final
{
public:
	struct FSlateColor                            UnfocusedTextColor;                                // 0x0000(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            FocusedTextColor;                                  // 0x0028(0x0028)(Edit, BlueprintVisible)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B9[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0068(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0090(0x0088)()
};
static_assert(alignof(DocumentGroupButton_C_UpdateFocus) == 0x000008, "Wrong alignment on DocumentGroupButton_C_UpdateFocus");
static_assert(sizeof(DocumentGroupButton_C_UpdateFocus) == 0x000118, "Wrong size on DocumentGroupButton_C_UpdateFocus");
static_assert(offsetof(DocumentGroupButton_C_UpdateFocus, UnfocusedTextColor) == 0x000000, "Member 'DocumentGroupButton_C_UpdateFocus::UnfocusedTextColor' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_UpdateFocus, FocusedTextColor) == 0x000028, "Member 'DocumentGroupButton_C_UpdateFocus::FocusedTextColor' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_UpdateFocus, K2Node_MakeStruct_Margin) == 0x000050, "Member 'DocumentGroupButton_C_UpdateFocus::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_UpdateFocus, Temp_bool_Variable) == 0x000060, "Member 'DocumentGroupButton_C_UpdateFocus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_UpdateFocus, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000061, "Member 'DocumentGroupButton_C_UpdateFocus::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_UpdateFocus, K2Node_Select_Default) == 0x000068, "Member 'DocumentGroupButton_C_UpdateFocus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_UpdateFocus, K2Node_MakeStruct_SlateBrush) == 0x000090, "Member 'DocumentGroupButton_C_UpdateFocus::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function DocumentGroupButton.DocumentGroupButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct DocumentGroupButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DocumentGroupButton_C_PreConstruct) == 0x000001, "Wrong alignment on DocumentGroupButton_C_PreConstruct");
static_assert(sizeof(DocumentGroupButton_C_PreConstruct) == 0x000001, "Wrong size on DocumentGroupButton_C_PreConstruct");
static_assert(offsetof(DocumentGroupButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'DocumentGroupButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function DocumentGroupButton.DocumentGroupButton_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct DocumentGroupButton_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(DocumentGroupButton_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on DocumentGroupButton_C_OnRemovedFromFocusPath");
static_assert(sizeof(DocumentGroupButton_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on DocumentGroupButton_C_OnRemovedFromFocusPath");
static_assert(offsetof(DocumentGroupButton_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'DocumentGroupButton_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function DocumentGroupButton.DocumentGroupButton_C.ExecuteUbergraph_DocumentGroupButton
// 0x0030 (0x0030 - 0x0000)
struct DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37BA[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37BB[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0024(0x0008)(NoDestructor)
};
static_assert(alignof(DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton) == 0x000008, "Wrong alignment on DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton");
static_assert(sizeof(DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton) == 0x000030, "Wrong size on DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton");
static_assert(offsetof(DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton, EntryPoint) == 0x000000, "Member 'DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton, K2Node_Event_IsDesignTime) == 0x000014, "Member 'DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton, CallFunc_GetMenuManager_ReturnValue) == 0x000018, "Member 'DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000022, "Member 'DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton, K2Node_Event_InFocusEvent) == 0x000024, "Member 'DocumentGroupButton_C_ExecuteUbergraph_DocumentGroupButton::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function DocumentGroupButton.DocumentGroupButton_C.OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DocumentGroupButton_C_OnHovered__DelegateSignature final
{
public:
	class UWidget*                                NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DocumentGroupButton_C_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on DocumentGroupButton_C_OnHovered__DelegateSignature");
static_assert(sizeof(DocumentGroupButton_C_OnHovered__DelegateSignature) == 0x000008, "Wrong size on DocumentGroupButton_C_OnHovered__DelegateSignature");
static_assert(offsetof(DocumentGroupButton_C_OnHovered__DelegateSignature, NewParam) == 0x000000, "Member 'DocumentGroupButton_C_OnHovered__DelegateSignature::NewParam' has a wrong offset!");

// Function DocumentGroupButton.DocumentGroupButton_C.OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DocumentGroupButton_C_OnSelected__DelegateSignature final
{
public:
	class FName                                   Param_DocumentGroupId;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DocumentGroupButton_C_OnSelected__DelegateSignature) == 0x000004, "Wrong alignment on DocumentGroupButton_C_OnSelected__DelegateSignature");
static_assert(sizeof(DocumentGroupButton_C_OnSelected__DelegateSignature) == 0x000008, "Wrong size on DocumentGroupButton_C_OnSelected__DelegateSignature");
static_assert(offsetof(DocumentGroupButton_C_OnSelected__DelegateSignature, Param_DocumentGroupId) == 0x000000, "Member 'DocumentGroupButton_C_OnSelected__DelegateSignature::Param_DocumentGroupId' has a wrong offset!");

}

