#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DocumentButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function DocumentButton.DocumentButton_C.IsElementEmpty
// 0x0002 (0x0002 - 0x0000)
struct DocumentButton_C_IsElementEmpty final
{
public:
	bool                                          bIsEmpty;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DocumentButton_C_IsElementEmpty) == 0x000001, "Wrong alignment on DocumentButton_C_IsElementEmpty");
static_assert(sizeof(DocumentButton_C_IsElementEmpty) == 0x000002, "Wrong size on DocumentButton_C_IsElementEmpty");
static_assert(offsetof(DocumentButton_C_IsElementEmpty, bIsEmpty) == 0x000000, "Member 'DocumentButton_C_IsElementEmpty::bIsEmpty' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_IsElementEmpty, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000001, "Member 'DocumentButton_C_IsElementEmpty::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function DocumentButton.DocumentButton_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct DocumentButton_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(DocumentButton_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on DocumentButton_C_OnRemovedFromFocusPath");
static_assert(sizeof(DocumentButton_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on DocumentButton_C_OnRemovedFromFocusPath");
static_assert(offsetof(DocumentButton_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'DocumentButton_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function DocumentButton.DocumentButton_C.TryShowTooltip
// 0x00A0 (0x00A0 - 0x0000)
struct DocumentButton_C_TryShowTooltip final
{
public:
	class FName                                   CallFunc_StringTableIdAndKeyFromText_OutTableId;   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_StringTableIdAndKeyFromText_OutKey;       // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_StringTableIdAndKeyFromText_ReturnValue;  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37A9[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckFeatureSwitch_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37AA[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
};
static_assert(alignof(DocumentButton_C_TryShowTooltip) == 0x000008, "Wrong alignment on DocumentButton_C_TryShowTooltip");
static_assert(sizeof(DocumentButton_C_TryShowTooltip) == 0x0000A0, "Wrong size on DocumentButton_C_TryShowTooltip");
static_assert(offsetof(DocumentButton_C_TryShowTooltip, CallFunc_StringTableIdAndKeyFromText_OutTableId) == 0x000000, "Member 'DocumentButton_C_TryShowTooltip::CallFunc_StringTableIdAndKeyFromText_OutTableId' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_TryShowTooltip, CallFunc_StringTableIdAndKeyFromText_OutKey) == 0x000008, "Member 'DocumentButton_C_TryShowTooltip::CallFunc_StringTableIdAndKeyFromText_OutKey' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_TryShowTooltip, CallFunc_StringTableIdAndKeyFromText_ReturnValue) == 0x000018, "Member 'DocumentButton_C_TryShowTooltip::CallFunc_StringTableIdAndKeyFromText_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_TryShowTooltip, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'DocumentButton_C_TryShowTooltip::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_TryShowTooltip, CallFunc_Conv_NameToString_ReturnValue) == 0x000030, "Member 'DocumentButton_C_TryShowTooltip::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_TryShowTooltip, CallFunc_CheckFeatureSwitch_ReturnValue) == 0x000040, "Member 'DocumentButton_C_TryShowTooltip::CallFunc_CheckFeatureSwitch_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_TryShowTooltip, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'DocumentButton_C_TryShowTooltip::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_TryShowTooltip, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000058, "Member 'DocumentButton_C_TryShowTooltip::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_TryShowTooltip, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000068, "Member 'DocumentButton_C_TryShowTooltip::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_TryShowTooltip, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000078, "Member 'DocumentButton_C_TryShowTooltip::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_TryShowTooltip, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'DocumentButton_C_TryShowTooltip::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function DocumentButton.DocumentButton_C.OnFocusReceived
// 0x01D0 (0x01D0 - 0x0000)
struct DocumentButton_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00F8(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0118(0x00B8)()
};
static_assert(alignof(DocumentButton_C_OnFocusReceived) == 0x000008, "Wrong alignment on DocumentButton_C_OnFocusReceived");
static_assert(sizeof(DocumentButton_C_OnFocusReceived) == 0x0001D0, "Wrong size on DocumentButton_C_OnFocusReceived");
static_assert(offsetof(DocumentButton_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'DocumentButton_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'DocumentButton_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'DocumentButton_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_OnFocusReceived, CallFunc_MakeLiteralText_ReturnValue) == 0x0000F8, "Member 'DocumentButton_C_OnFocusReceived::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_OnFocusReceived, CallFunc_MakeLiteralName_ReturnValue) == 0x000110, "Member 'DocumentButton_C_OnFocusReceived::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000118, "Member 'DocumentButton_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function DocumentButton.DocumentButton_C.SetSeen
// 0x0010 (0x0010 - 0x0000)
struct DocumentButton_C_SetSeen final
{
public:
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemAcquired_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DocumentButton_C_SetSeen) == 0x000008, "Wrong alignment on DocumentButton_C_SetSeen");
static_assert(sizeof(DocumentButton_C_SetSeen) == 0x000010, "Wrong size on DocumentButton_C_SetSeen");
static_assert(offsetof(DocumentButton_C_SetSeen, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000000, "Member 'DocumentButton_C_SetSeen::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_SetSeen, CallFunc_IsItemAcquired_ReturnValue) == 0x000008, "Member 'DocumentButton_C_SetSeen::CallFunc_IsItemAcquired_ReturnValue' has a wrong offset!");

// Function DocumentButton.DocumentButton_C.IsConsideredHovered
// 0x0001 (0x0001 - 0x0000)
struct DocumentButton_C_IsConsideredHovered final
{
public:
	bool                                          bConsideredHovered;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DocumentButton_C_IsConsideredHovered) == 0x000001, "Wrong alignment on DocumentButton_C_IsConsideredHovered");
static_assert(sizeof(DocumentButton_C_IsConsideredHovered) == 0x000001, "Wrong size on DocumentButton_C_IsConsideredHovered");
static_assert(offsetof(DocumentButton_C_IsConsideredHovered, bConsideredHovered) == 0x000000, "Member 'DocumentButton_C_IsConsideredHovered::bConsideredHovered' has a wrong offset!");

// Function DocumentButton.DocumentButton_C.SetFocused
// 0x0005 (0x0005 - 0x0000)
struct DocumentButton_C_SetFocused final
{
public:
	bool                                          bInFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWasConsideredHovered;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered_1; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DocumentButton_C_SetFocused) == 0x000001, "Wrong alignment on DocumentButton_C_SetFocused");
static_assert(sizeof(DocumentButton_C_SetFocused) == 0x000005, "Wrong size on DocumentButton_C_SetFocused");
static_assert(offsetof(DocumentButton_C_SetFocused, bInFocused) == 0x000000, "Member 'DocumentButton_C_SetFocused::bInFocused' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_SetFocused, bWasConsideredHovered) == 0x000001, "Member 'DocumentButton_C_SetFocused::bWasConsideredHovered' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_SetFocused, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000002, "Member 'DocumentButton_C_SetFocused::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_SetFocused, CallFunc_IsConsideredHovered_bConsideredHovered_1) == 0x000003, "Member 'DocumentButton_C_SetFocused::CallFunc_IsConsideredHovered_bConsideredHovered_1' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_SetFocused, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000004, "Member 'DocumentButton_C_SetFocused::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function DocumentButton.DocumentButton_C.SetHovered
// 0x0005 (0x0005 - 0x0000)
struct DocumentButton_C_SetHovered final
{
public:
	bool                                          bInHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWasConsideredHovered;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered_1; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DocumentButton_C_SetHovered) == 0x000001, "Wrong alignment on DocumentButton_C_SetHovered");
static_assert(sizeof(DocumentButton_C_SetHovered) == 0x000005, "Wrong size on DocumentButton_C_SetHovered");
static_assert(offsetof(DocumentButton_C_SetHovered, bInHovered) == 0x000000, "Member 'DocumentButton_C_SetHovered::bInHovered' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_SetHovered, bWasConsideredHovered) == 0x000001, "Member 'DocumentButton_C_SetHovered::bWasConsideredHovered' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_SetHovered, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000002, "Member 'DocumentButton_C_SetHovered::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_SetHovered, CallFunc_IsConsideredHovered_bConsideredHovered_1) == 0x000003, "Member 'DocumentButton_C_SetHovered::CallFunc_IsConsideredHovered_bConsideredHovered_1' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_SetHovered, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000004, "Member 'DocumentButton_C_SetHovered::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function DocumentButton.DocumentButton_C.Refresh
// 0x000F (0x000F - 0x0000)
struct DocumentButton_C_Refresh final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSeenDocument_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DocumentButton_C_Refresh) == 0x000001, "Wrong alignment on DocumentButton_C_Refresh");
static_assert(sizeof(DocumentButton_C_Refresh) == 0x00000F, "Wrong size on DocumentButton_C_Refresh");
static_assert(offsetof(DocumentButton_C_Refresh, Temp_bool_Variable) == 0x000000, "Member 'DocumentButton_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_Refresh, Temp_byte_Variable) == 0x000001, "Member 'DocumentButton_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_Refresh, Temp_byte_Variable_1) == 0x000002, "Member 'DocumentButton_C_Refresh::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_Refresh, Temp_bool_Variable_1) == 0x000003, "Member 'DocumentButton_C_Refresh::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_Refresh, Temp_byte_Variable_2) == 0x000004, "Member 'DocumentButton_C_Refresh::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_Refresh, Temp_byte_Variable_3) == 0x000005, "Member 'DocumentButton_C_Refresh::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_Refresh, Temp_bool_Variable_2) == 0x000006, "Member 'DocumentButton_C_Refresh::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_Refresh, Temp_byte_Variable_4) == 0x000007, "Member 'DocumentButton_C_Refresh::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_Refresh, Temp_byte_Variable_5) == 0x000008, "Member 'DocumentButton_C_Refresh::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_Refresh, CallFunc_HasSeenDocument_ReturnValue) == 0x000009, "Member 'DocumentButton_C_Refresh::CallFunc_HasSeenDocument_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_Refresh, K2Node_Select_Default) == 0x00000A, "Member 'DocumentButton_C_Refresh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_Refresh, CallFunc_Not_PreBool_ReturnValue) == 0x00000B, "Member 'DocumentButton_C_Refresh::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_Refresh, CallFunc_BooleanOR_ReturnValue) == 0x00000C, "Member 'DocumentButton_C_Refresh::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_Refresh, K2Node_Select_Default_1) == 0x00000D, "Member 'DocumentButton_C_Refresh::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_Refresh, K2Node_Select_Default_2) == 0x00000E, "Member 'DocumentButton_C_Refresh::K2Node_Select_Default_2' has a wrong offset!");

// Function DocumentButton.DocumentButton_C.UpdateFocus
// 0x0118 (0x0118 - 0x0000)
struct DocumentButton_C_UpdateFocus final
{
public:
	struct FSlateColor                            UnfocusedTextColor;                                // 0x0000(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            FocusedTextColor;                                  // 0x0028(0x0028)(Edit, BlueprintVisible)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37AB[0x5];                                     // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0068(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0090(0x0088)()
};
static_assert(alignof(DocumentButton_C_UpdateFocus) == 0x000008, "Wrong alignment on DocumentButton_C_UpdateFocus");
static_assert(sizeof(DocumentButton_C_UpdateFocus) == 0x000118, "Wrong size on DocumentButton_C_UpdateFocus");
static_assert(offsetof(DocumentButton_C_UpdateFocus, UnfocusedTextColor) == 0x000000, "Member 'DocumentButton_C_UpdateFocus::UnfocusedTextColor' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_UpdateFocus, FocusedTextColor) == 0x000028, "Member 'DocumentButton_C_UpdateFocus::FocusedTextColor' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_UpdateFocus, K2Node_MakeStruct_Margin) == 0x000050, "Member 'DocumentButton_C_UpdateFocus::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_UpdateFocus, Temp_bool_Variable) == 0x000060, "Member 'DocumentButton_C_UpdateFocus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_UpdateFocus, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000061, "Member 'DocumentButton_C_UpdateFocus::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_UpdateFocus, CallFunc_IsValid_ReturnValue) == 0x000062, "Member 'DocumentButton_C_UpdateFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_UpdateFocus, K2Node_Select_Default) == 0x000068, "Member 'DocumentButton_C_UpdateFocus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_UpdateFocus, K2Node_MakeStruct_SlateBrush) == 0x000090, "Member 'DocumentButton_C_UpdateFocus::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function DocumentButton.DocumentButton_C.OnLoaded_400D3A6F46134D64437AC5B163287479
// 0x0008 (0x0008 - 0x0000)
struct DocumentButton_C_OnLoaded_400D3A6F46134D64437AC5B163287479 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DocumentButton_C_OnLoaded_400D3A6F46134D64437AC5B163287479) == 0x000008, "Wrong alignment on DocumentButton_C_OnLoaded_400D3A6F46134D64437AC5B163287479");
static_assert(sizeof(DocumentButton_C_OnLoaded_400D3A6F46134D64437AC5B163287479) == 0x000008, "Wrong size on DocumentButton_C_OnLoaded_400D3A6F46134D64437AC5B163287479");
static_assert(offsetof(DocumentButton_C_OnLoaded_400D3A6F46134D64437AC5B163287479, Loaded) == 0x000000, "Member 'DocumentButton_C_OnLoaded_400D3A6F46134D64437AC5B163287479::Loaded' has a wrong offset!");

// Function DocumentButton.DocumentButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct DocumentButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DocumentButton_C_PreConstruct) == 0x000001, "Wrong alignment on DocumentButton_C_PreConstruct");
static_assert(sizeof(DocumentButton_C_PreConstruct) == 0x000001, "Wrong size on DocumentButton_C_PreConstruct");
static_assert(offsetof(DocumentButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'DocumentButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function DocumentButton.DocumentButton_C.Setup
// 0x00E8 (0x00E8 - 0x0000)
struct DocumentButton_C_Setup final
{
public:
	struct FRBCollectibleDocumentDefinitionRow    Param_Document;                                    // 0x0000(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(DocumentButton_C_Setup) == 0x000008, "Wrong alignment on DocumentButton_C_Setup");
static_assert(sizeof(DocumentButton_C_Setup) == 0x0000E8, "Wrong size on DocumentButton_C_Setup");
static_assert(offsetof(DocumentButton_C_Setup, Param_Document) == 0x000000, "Member 'DocumentButton_C_Setup::Param_Document' has a wrong offset!");

// Function DocumentButton.DocumentButton_C.ExecuteUbergraph_DocumentButton
// 0x0158 (0x0158 - 0x0000)
struct DocumentButton_C_ExecuteUbergraph_DocumentButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37AC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37AD[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37AE[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBCollectibleDocumentDefinitionRow    K2Node_CustomEvent_document;                       // 0x0040(0x00E8)()
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37AF[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsItemAcquired_ReturnValue;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B0[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DocumentButton_C_ExecuteUbergraph_DocumentButton) == 0x000008, "Wrong alignment on DocumentButton_C_ExecuteUbergraph_DocumentButton");
static_assert(sizeof(DocumentButton_C_ExecuteUbergraph_DocumentButton) == 0x000158, "Wrong size on DocumentButton_C_ExecuteUbergraph_DocumentButton");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, EntryPoint) == 0x000000, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, Temp_object_Variable) == 0x000008, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, K2Node_DynamicCast_AsTexture_2D) == 0x000010, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, K2Node_CustomEvent_Loaded) == 0x000020, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, K2Node_Event_IsDesignTime) == 0x000038, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, K2Node_CustomEvent_document) == 0x000040, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::K2Node_CustomEvent_document' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000128, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, K2Node_CreateDelegate_OutputDelegate_1) == 0x000134, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, CallFunc_IsItemAcquired_ReturnValue) == 0x000144, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::CallFunc_IsItemAcquired_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, CallFunc_GetMenuManager_ReturnValue) == 0x000148, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, CallFunc_IsValid_ReturnValue_1) == 0x000150, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, CallFunc_IsValid_ReturnValue_2) == 0x000151, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DocumentButton_C_ExecuteUbergraph_DocumentButton, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000152, "Member 'DocumentButton_C_ExecuteUbergraph_DocumentButton::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");

// Function DocumentButton.DocumentButton_C.OnSelected__DelegateSignature
// 0x00E8 (0x00E8 - 0x0000)
struct DocumentButton_C_OnSelected__DelegateSignature final
{
public:
	struct FRBCollectibleDocumentDefinitionRow    Param_Document;                                    // 0x0000(0x00E8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(DocumentButton_C_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on DocumentButton_C_OnSelected__DelegateSignature");
static_assert(sizeof(DocumentButton_C_OnSelected__DelegateSignature) == 0x0000E8, "Wrong size on DocumentButton_C_OnSelected__DelegateSignature");
static_assert(offsetof(DocumentButton_C_OnSelected__DelegateSignature, Param_Document) == 0x000000, "Member 'DocumentButton_C_OnSelected__DelegateSignature::Param_Document' has a wrong offset!");

}

