#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EastermanRadio_Interact_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EastermanRadio_Interact_BP.EastermanRadio_Interact_BP_C
// 0x0020 (0x0308 - 0x02E8)
class AEastermanRadio_Interact_BP_C final : public ARBEastermanQuestGiver
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBObjectiveActorComponent*             RBObjectiveActor;                                  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	bool OnWorldPopulateFinishedTimeSliced();
	void UserConstructionScript();
	void OnWorldFullyLoaded();
	void OnWorldPopulateFinished();
	void Event_OnLocalPlayerInteracted();
	void VOEnded(int32 PlayingId);
	void ExecuteUbergraph_EastermanRadio_Interact_BP(int32 EntryPoint);

	bool GetInteractionPawnLocation(const class ARBPawn* Pawn, ESpecialMove SpecialMove, struct FVector* OutLocation, struct FVector* OutDirection) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EastermanRadio_Interact_BP_C">();
	}
	static class AEastermanRadio_Interact_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEastermanRadio_Interact_BP_C>();
	}
};
static_assert(alignof(AEastermanRadio_Interact_BP_C) == 0x000008, "Wrong alignment on AEastermanRadio_Interact_BP_C");
static_assert(sizeof(AEastermanRadio_Interact_BP_C) == 0x000308, "Wrong size on AEastermanRadio_Interact_BP_C");
static_assert(offsetof(AEastermanRadio_Interact_BP_C, UberGraphFrame) == 0x0002E8, "Member 'AEastermanRadio_Interact_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEastermanRadio_Interact_BP_C, RBObjectiveActor) == 0x0002F0, "Member 'AEastermanRadio_Interact_BP_C::RBObjectiveActor' has a wrong offset!");
static_assert(offsetof(AEastermanRadio_Interact_BP_C, Arrow) == 0x0002F8, "Member 'AEastermanRadio_Interact_BP_C::Arrow' has a wrong offset!");
static_assert(offsetof(AEastermanRadio_Interact_BP_C, Billboard) == 0x000300, "Member 'AEastermanRadio_Interact_BP_C::Billboard' has a wrong offset!");

}

