#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Engineer_AnimBP_Child

#include "Basic.hpp"


namespace SDK::Params
{

// Function Engineer_AnimBP_Child.Engineer_AnimBP_Child_C.ExecuteUbergraph_Engineer_AnimBP_Child
// 0x0008 (0x0008 - 0x0000)
struct Engineer_AnimBP_Child_C_ExecuteUbergraph_Engineer_AnimBP_Child final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Engineer_AnimBP_Child_C_ExecuteUbergraph_Engineer_AnimBP_Child) == 0x000004, "Wrong alignment on Engineer_AnimBP_Child_C_ExecuteUbergraph_Engineer_AnimBP_Child");
static_assert(sizeof(Engineer_AnimBP_Child_C_ExecuteUbergraph_Engineer_AnimBP_Child) == 0x000008, "Wrong size on Engineer_AnimBP_Child_C_ExecuteUbergraph_Engineer_AnimBP_Child");
static_assert(offsetof(Engineer_AnimBP_Child_C_ExecuteUbergraph_Engineer_AnimBP_Child, EntryPoint) == 0x000000, "Member 'Engineer_AnimBP_Child_C_ExecuteUbergraph_Engineer_AnimBP_Child::EntryPoint' has a wrong offset!");
static_assert(offsetof(Engineer_AnimBP_Child_C_ExecuteUbergraph_Engineer_AnimBP_Child, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'Engineer_AnimBP_Child_C_ExecuteUbergraph_Engineer_AnimBP_Child::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function Engineer_AnimBP_Child.Engineer_AnimBP_Child_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Engineer_AnimBP_Child_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Engineer_AnimBP_Child_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Engineer_AnimBP_Child_C_BlueprintUpdateAnimation");
static_assert(sizeof(Engineer_AnimBP_Child_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Engineer_AnimBP_Child_C_BlueprintUpdateAnimation");
static_assert(offsetof(Engineer_AnimBP_Child_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Engineer_AnimBP_Child_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

