#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Face_Lobby_StaticCharacter_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Face_Lobby_StaticCharacter_AnimBlueprint.Face_Lobby_StaticCharacter_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Face_Lobby_StaticCharacter_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Face_Lobby_StaticCharacter_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on Face_Lobby_StaticCharacter_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(Face_Lobby_StaticCharacter_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on Face_Lobby_StaticCharacter_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Face_Lobby_StaticCharacter_AnimBlueprint.Face_Lobby_StaticCharacter_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Face_Lobby_StaticCharacter_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Face_Lobby_StaticCharacter_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Face_Lobby_StaticCharacter_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(Face_Lobby_StaticCharacter_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Face_Lobby_StaticCharacter_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Face_Lobby_StaticCharacter_AnimBlueprint.Face_Lobby_StaticCharacter_AnimBlueprint_C.ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint
// 0x0068 (0x0068 - 0x0000)
struct Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3389[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_338A[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALobby_StationnaryCharacterBase_C*      K2Node_DynamicCast_AsLobby_Stationnary_Character_Base; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_338B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_1;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALobby_StationnaryCharacterBase_C*      K2Node_DynamicCast_AsLobby_Stationnary_Character_Base_1; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_338C[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPoseAsset*                             CallFunc_GetFacePoseAsset_PoseAsset;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_338D[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_338E[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint) == 0x000008, "Wrong alignment on Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint");
static_assert(sizeof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint) == 0x000068, "Wrong size on Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint, EntryPoint) == 0x000000, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000010, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint, K2Node_DynamicCast_AsLobby_Stationnary_Character_Base) == 0x000018, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint::K2Node_DynamicCast_AsLobby_Stationnary_Character_Base' has a wrong offset!");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint, CallFunc_GetOwningActor_ReturnValue_1) == 0x000028, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint::CallFunc_GetOwningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint, K2Node_DynamicCast_AsLobby_Stationnary_Character_Base_1) == 0x000030, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint::K2Node_DynamicCast_AsLobby_Stationnary_Character_Base_1' has a wrong offset!");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint, CallFunc_GetFacePoseAsset_PoseAsset) == 0x000040, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint::CallFunc_GetFacePoseAsset_PoseAsset' has a wrong offset!");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue) == 0x000050, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00005C, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint, CallFunc_FInterpTo_ReturnValue) == 0x000060, "Member 'Face_Lobby_StaticCharacter_AnimBlueprint_C_ExecuteUbergraph_Face_Lobby_StaticCharacter_AnimBlueprint::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

}

