#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlyingObject

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FlyingObject.FlyingObject_C.SetFinalActorDestination
// 0x0200 (0x0200 - 0x0000)
struct FlyingObject_C_SetFinalActorDestination final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0030(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3480[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x00F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult_1; // 0x0178(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(FlyingObject_C_SetFinalActorDestination) == 0x000010, "Wrong alignment on FlyingObject_C_SetFinalActorDestination");
static_assert(sizeof(FlyingObject_C_SetFinalActorDestination) == 0x000200, "Wrong size on FlyingObject_C_SetFinalActorDestination");
static_assert(offsetof(FlyingObject_C_SetFinalActorDestination, Transform) == 0x000000, "Member 'FlyingObject_C_SetFinalActorDestination::Transform' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_SetFinalActorDestination, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000030, "Member 'FlyingObject_C_SetFinalActorDestination::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_SetFinalActorDestination, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0000B8, "Member 'FlyingObject_C_SetFinalActorDestination::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_SetFinalActorDestination, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'FlyingObject_C_SetFinalActorDestination::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_SetFinalActorDestination, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0000F0, "Member 'FlyingObject_C_SetFinalActorDestination::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_SetFinalActorDestination, CallFunc_K2_SetRelativeTransform_SweepHitResult_1) == 0x000178, "Member 'FlyingObject_C_SetFinalActorDestination::CallFunc_K2_SetRelativeTransform_SweepHitResult_1' has a wrong offset!");

// Function FlyingObject.FlyingObject_C.GetOriginalMaterials
// 0x0028 (0x0028 - 0x0000)
struct FlyingObject_C_GetOriginalMaterials final
{
public:
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3481[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3482[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FlyingObject_C_GetOriginalMaterials) == 0x000008, "Wrong alignment on FlyingObject_C_GetOriginalMaterials");
static_assert(sizeof(FlyingObject_C_GetOriginalMaterials) == 0x000028, "Wrong size on FlyingObject_C_GetOriginalMaterials");
static_assert(offsetof(FlyingObject_C_GetOriginalMaterials, CallFunc_GetNumMaterials_ReturnValue) == 0x000000, "Member 'FlyingObject_C_GetOriginalMaterials::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_GetOriginalMaterials, Temp_int_Variable) == 0x000004, "Member 'FlyingObject_C_GetOriginalMaterials::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_GetOriginalMaterials, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'FlyingObject_C_GetOriginalMaterials::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_GetOriginalMaterials, CallFunc_GetMaterial_ReturnValue) == 0x000010, "Member 'FlyingObject_C_GetOriginalMaterials::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_GetOriginalMaterials, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'FlyingObject_C_GetOriginalMaterials::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_GetOriginalMaterials, CallFunc_Array_Add_ReturnValue) == 0x00001C, "Member 'FlyingObject_C_GetOriginalMaterials::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_GetOriginalMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'FlyingObject_C_GetOriginalMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function FlyingObject.FlyingObject_C.ResetMaterials
// 0x0020 (0x0020 - 0x0000)
struct FlyingObject_C_ResetMaterials final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3483[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FlyingObject_C_ResetMaterials) == 0x000008, "Wrong alignment on FlyingObject_C_ResetMaterials");
static_assert(sizeof(FlyingObject_C_ResetMaterials) == 0x000020, "Wrong size on FlyingObject_C_ResetMaterials");
static_assert(offsetof(FlyingObject_C_ResetMaterials, Temp_int_Variable) == 0x000000, "Member 'FlyingObject_C_ResetMaterials::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_ResetMaterials, CallFunc_Array_Get_Item) == 0x000008, "Member 'FlyingObject_C_ResetMaterials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_ResetMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'FlyingObject_C_ResetMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_ResetMaterials, CallFunc_GetNumMaterials_ReturnValue) == 0x000014, "Member 'FlyingObject_C_ResetMaterials::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_ResetMaterials, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'FlyingObject_C_ResetMaterials::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_ResetMaterials, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'FlyingObject_C_ResetMaterials::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function FlyingObject.FlyingObject_C.SetAllMaterialsRed
// 0x0014 (0x0014 - 0x0000)
struct FlyingObject_C_SetAllMaterialsRed final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FlyingObject_C_SetAllMaterialsRed) == 0x000004, "Wrong alignment on FlyingObject_C_SetAllMaterialsRed");
static_assert(sizeof(FlyingObject_C_SetAllMaterialsRed) == 0x000014, "Wrong size on FlyingObject_C_SetAllMaterialsRed");
static_assert(offsetof(FlyingObject_C_SetAllMaterialsRed, Temp_int_Variable) == 0x000000, "Member 'FlyingObject_C_SetAllMaterialsRed::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_SetAllMaterialsRed, CallFunc_GetNumMaterials_ReturnValue) == 0x000004, "Member 'FlyingObject_C_SetAllMaterialsRed::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_SetAllMaterialsRed, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'FlyingObject_C_SetAllMaterialsRed::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_SetAllMaterialsRed, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'FlyingObject_C_SetAllMaterialsRed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_SetAllMaterialsRed, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'FlyingObject_C_SetAllMaterialsRed::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function FlyingObject.FlyingObject_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct FlyingObject_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FlyingObject_C_UserConstructionScript) == 0x000010, "Wrong alignment on FlyingObject_C_UserConstructionScript");
static_assert(sizeof(FlyingObject_C_UserConstructionScript) == 0x000040, "Wrong size on FlyingObject_C_UserConstructionScript");
static_assert(offsetof(FlyingObject_C_UserConstructionScript, CallFunc_GetRelativeTransform_ReturnValue) == 0x000000, "Member 'FlyingObject_C_UserConstructionScript::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000030, "Member 'FlyingObject_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function FlyingObject.FlyingObject_C.CustomEvent_1
// 0x0008 (0x0008 - 0x0000)
struct FlyingObject_C_CustomEvent_1 final
{
public:
	float                                         Axis;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Shift;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Alt;                                               // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FlyingObject_C_CustomEvent_1) == 0x000004, "Wrong alignment on FlyingObject_C_CustomEvent_1");
static_assert(sizeof(FlyingObject_C_CustomEvent_1) == 0x000008, "Wrong size on FlyingObject_C_CustomEvent_1");
static_assert(offsetof(FlyingObject_C_CustomEvent_1, Axis) == 0x000000, "Member 'FlyingObject_C_CustomEvent_1::Axis' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_CustomEvent_1, Shift) == 0x000004, "Member 'FlyingObject_C_CustomEvent_1::Shift' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_CustomEvent_1, Alt) == 0x000005, "Member 'FlyingObject_C_CustomEvent_1::Alt' has a wrong offset!");

// Function FlyingObject.FlyingObject_C.MoveObject
// 0x0008 (0x0008 - 0x0000)
struct FlyingObject_C_MoveObject final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FlyingObject_C_MoveObject) == 0x000008, "Wrong alignment on FlyingObject_C_MoveObject");
static_assert(sizeof(FlyingObject_C_MoveObject) == 0x000008, "Wrong size on FlyingObject_C_MoveObject");
static_assert(offsetof(FlyingObject_C_MoveObject, Pawn) == 0x000000, "Member 'FlyingObject_C_MoveObject::Pawn' has a wrong offset!");

// Function FlyingObject.FlyingObject_C.Event_OnStartOperating
// 0x0008 (0x0008 - 0x0000)
struct FlyingObject_C_Event_OnStartOperating final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FlyingObject_C_Event_OnStartOperating) == 0x000008, "Wrong alignment on FlyingObject_C_Event_OnStartOperating");
static_assert(sizeof(FlyingObject_C_Event_OnStartOperating) == 0x000008, "Wrong size on FlyingObject_C_Event_OnStartOperating");
static_assert(offsetof(FlyingObject_C_Event_OnStartOperating, Pawn) == 0x000000, "Member 'FlyingObject_C_Event_OnStartOperating::Pawn' has a wrong offset!");

// Function FlyingObject.FlyingObject_C.Event_OnStopOperating
// 0x0008 (0x0008 - 0x0000)
struct FlyingObject_C_Event_OnStopOperating final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FlyingObject_C_Event_OnStopOperating) == 0x000008, "Wrong alignment on FlyingObject_C_Event_OnStopOperating");
static_assert(sizeof(FlyingObject_C_Event_OnStopOperating) == 0x000008, "Wrong size on FlyingObject_C_Event_OnStopOperating");
static_assert(offsetof(FlyingObject_C_Event_OnStopOperating, Pawn) == 0x000000, "Member 'FlyingObject_C_Event_OnStopOperating::Pawn' has a wrong offset!");

// Function FlyingObject.FlyingObject_C.MulticastSetFinalDestination
// 0x0030 (0x0030 - 0x0000)
struct FlyingObject_C_MulticastSetFinalDestination final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FlyingObject_C_MulticastSetFinalDestination) == 0x000010, "Wrong alignment on FlyingObject_C_MulticastSetFinalDestination");
static_assert(sizeof(FlyingObject_C_MulticastSetFinalDestination) == 0x000030, "Wrong size on FlyingObject_C_MulticastSetFinalDestination");
static_assert(offsetof(FlyingObject_C_MulticastSetFinalDestination, Transform) == 0x000000, "Member 'FlyingObject_C_MulticastSetFinalDestination::Transform' has a wrong offset!");

// Function FlyingObject.FlyingObject_C.ExecuteUbergraph_FlyingObject
// 0x0370 (0x0370 - 0x0000)
struct FlyingObject_C_ExecuteUbergraph_FlyingObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3484[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3485[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float Axis, bool Shift, bool Alt)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3486[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x007C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3487[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBController*                          CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Axis;                           // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SHIFT;                          // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_ALT;                            // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3488[0x2];                                     // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBController_BP_C*                     K2Node_DynamicCast_AsRB_Controller_BP;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3489[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_CustomEvent_pawn;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_Event_pawn_1;                               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_Event_pawn;                                 // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0190(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348A[0x4];                                     // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0250(0x0030)(IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0290(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348B[0x8];                                     // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Transform;                      // 0x02A0(0x0030)(IsPlainOldData, NoDestructor)
	class ARBLobbyPlayerController*               CallFunc_GetLocalLobbyPlayerController_ReturnValue; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x02D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ARBLobbyPlayerController_BP_C*          K2Node_DynamicCast_AsRB_Lobby_Player_Controller_BP; // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FlyingObject_C_ExecuteUbergraph_FlyingObject) == 0x000010, "Wrong alignment on FlyingObject_C_ExecuteUbergraph_FlyingObject");
static_assert(sizeof(FlyingObject_C_ExecuteUbergraph_FlyingObject) == 0x000370, "Wrong size on FlyingObject_C_ExecuteUbergraph_FlyingObject");
static_assert(offsetof(FlyingObject_C_ExecuteUbergraph_FlyingObject, EntryPoint) == 0x000000, "Member 'FlyingObject_C_ExecuteUbergraph_FlyingObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_ExecuteUbergraph_FlyingObject, Temp_object_Variable) == 0x000008, "Member 'FlyingObject_C_ExecuteUbergraph_FlyingObject::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(FlyingObject_C_ExecuteUbergraph_FlyingObject, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'FlyingObject_C_ExecuteUbergraph_FlyingObject::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
