#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GroupStatusSelfEntryWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GroupStatusSelfEntryWidget.GroupStatusSelfEntryWidget_C
// 0x0288 (0x0540 - 0x02B8)
class UGroupStatusSelfEntryWidget_C final : public URBGroupStatusEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              BackgroundScale;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ClassIcon;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         LoadoutRecap;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UActionIconWidget_C*                    LoadoutShortcut;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyLeaderIcon;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerksDisplay_C*                        PerksDisplay;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerksDisplay_C*                        PerksDisplay_1;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerksDisplay_C*                        PerksDisplay_2;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpeakerIcon;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SpeakerSizeBox;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            SpeakingBrush;                                     // 0x0318(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            GloballyMutedBrush;                                // 0x03A0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            MutedBrush;                                        // 0x0428(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            NotSpeakingBrush;                                  // 0x04B0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MaxNameLength;                                     // 0x0538(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GroupStatusSelfEntryWidget(int32 EntryPoint);
	void Event_Refresh_Audio();
	void PreConstruct(bool IsDesignTime);
	void Event_Refresh();
	void SetupCharacterClass();
	void SetupStatus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GroupStatusSelfEntryWidget_C">();
	}
	static class UGroupStatusSelfEntryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroupStatusSelfEntryWidget_C>();
	}
};
static_assert(alignof(UGroupStatusSelfEntryWidget_C) == 0x000008, "Wrong alignment on UGroupStatusSelfEntryWidget_C");
static_assert(sizeof(UGroupStatusSelfEntryWidget_C) == 0x000540, "Wrong size on UGroupStatusSelfEntryWidget_C");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UGroupStatusSelfEntryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, BackgroundScale) == 0x0002C0, "Member 'UGroupStatusSelfEntryWidget_C::BackgroundScale' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, ClassIcon) == 0x0002C8, "Member 'UGroupStatusSelfEntryWidget_C::ClassIcon' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, LoadoutRecap) == 0x0002D0, "Member 'UGroupStatusSelfEntryWidget_C::LoadoutRecap' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, LoadoutShortcut) == 0x0002D8, "Member 'UGroupStatusSelfEntryWidget_C::LoadoutShortcut' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, PartyLeaderIcon) == 0x0002E0, "Member 'UGroupStatusSelfEntryWidget_C::PartyLeaderIcon' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, PerksDisplay) == 0x0002E8, "Member 'UGroupStatusSelfEntryWidget_C::PerksDisplay' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, PerksDisplay_1) == 0x0002F0, "Member 'UGroupStatusSelfEntryWidget_C::PerksDisplay_1' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, PerksDisplay_2) == 0x0002F8, "Member 'UGroupStatusSelfEntryWidget_C::PerksDisplay_2' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, PlayerName) == 0x000300, "Member 'UGroupStatusSelfEntryWidget_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, SpeakerIcon) == 0x000308, "Member 'UGroupStatusSelfEntryWidget_C::SpeakerIcon' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, SpeakerSizeBox) == 0x000310, "Member 'UGroupStatusSelfEntryWidget_C::SpeakerSizeBox' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, SpeakingBrush) == 0x000318, "Member 'UGroupStatusSelfEntryWidget_C::SpeakingBrush' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, GloballyMutedBrush) == 0x0003A0, "Member 'UGroupStatusSelfEntryWidget_C::GloballyMutedBrush' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, MutedBrush) == 0x000428, "Member 'UGroupStatusSelfEntryWidget_C::MutedBrush' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, NotSpeakingBrush) == 0x0004B0, "Member 'UGroupStatusSelfEntryWidget_C::NotSpeakingBrush' has a wrong offset!");
static_assert(offsetof(UGroupStatusSelfEntryWidget_C, MaxNameLength) == 0x000538, "Member 'UGroupStatusSelfEntryWidget_C::MaxNameLength' has a wrong offset!");

}

