#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lobby_Idle_Ghost_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Lobby_Idle_Ghost_AnimBP.Lobby_Idle_Ghost_AnimBP_C
// 0x03A0 (0x0690 - 0x02F0)
class ULobby_Idle_Ghost_AnimBP_C final : public URBGhostAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0328(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0350(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x03D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0400(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0480(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x04B0(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0560(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0608(0x0080)()
	bool                                          IsShopping;                                        // 0x0688(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_Lobby_Idle_Ghost_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Lobby_Idle_Ghost_AnimBP_C">();
	}
	static class ULobby_Idle_Ghost_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULobby_Idle_Ghost_AnimBP_C>();
	}
};
static_assert(alignof(ULobby_Idle_Ghost_AnimBP_C) == 0x000010, "Wrong alignment on ULobby_Idle_Ghost_AnimBP_C");
static_assert(sizeof(ULobby_Idle_Ghost_AnimBP_C) == 0x000690, "Wrong size on ULobby_Idle_Ghost_AnimBP_C");
static_assert(offsetof(ULobby_Idle_Ghost_AnimBP_C, UberGraphFrame) == 0x0002F0, "Member 'ULobby_Idle_Ghost_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULobby_Idle_Ghost_AnimBP_C, AnimGraphNode_Root) == 0x0002F8, "Member 'ULobby_Idle_Ghost_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ULobby_Idle_Ghost_AnimBP_C, AnimGraphNode_TransitionResult) == 0x000328, "Member 'ULobby_Idle_Ghost_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ULobby_Idle_Ghost_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000350, "Member 'ULobby_Idle_Ghost_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(ULobby_Idle_Ghost_AnimBP_C, AnimGraphNode_StateResult_1) == 0x0003D0, "Member 'ULobby_Idle_Ghost_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ULobby_Idle_Ghost_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000400, "Member 'ULobby_Idle_Ghost_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ULobby_Idle_Ghost_AnimBP_C, AnimGraphNode_StateResult) == 0x000480, "Member 'ULobby_Idle_Ghost_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ULobby_Idle_Ghost_AnimBP_C, AnimGraphNode_StateMachine) == 0x0004B0, "Member 'ULobby_Idle_Ghost_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ULobby_Idle_Ghost_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x000560, "Member 'ULobby_Idle_Ghost_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ULobby_Idle_Ghost_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x000608, "Member 'ULobby_Idle_Ghost_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ULobby_Idle_Ghost_AnimBP_C, IsShopping) == 0x000688, "Member 'ULobby_Idle_Ghost_AnimBP_C::IsShopping' has a wrong offset!");

}

