#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lobby_ActiveSkillTuto_Interactible_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Lobby_ActiveSkillTuto_Interactible_BP.Lobby_ActiveSkillTuto_Interactible_BP_C
// 0x0088 (0x0348 - 0x02C0)
class ALobby_ActiveSkillTuto_Interactible_BP_C final : public ARBCustomSpecialMoveInteractableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       Camera;                                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ActiveSkillMeshComponent;                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBCinematicZoneComponent*              RBCinematicZone;                                   // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ATvChannel_BP_C>         LinkedTvChannel;                                   // 0x02F0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   WithSoundMovie;                                    // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NoSoundMovie;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             Data_Table;                                        // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          ActiveSkillMesh;                                   // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuWidget*                          MenuPage;                                          // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInInteraction;                                   // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool OnWorldPopulateFinishedTimeSliced();
	void UserConstructionScript();
	void OnWorldFullyLoaded();
	void Event_OnLocalPlayerInteracted();
	void Finished();
	void OnPawnPlaySpecialMoveAnimation(const class ARBPawn* Pawn, ESpecialMove SpecialMove);
	void OnExitTuto();
	void StartIdleLoop();
	void OnWorldPopulateFinished();
	void OnTutoAnimationFinished();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Lobby_ActiveSkillTuto_Interactible_BP(int32 EntryPoint);

	bool GetInteractionPawnLocation(const class ARBPawn* Pawn, ESpecialMove SpecialMove, struct FVector* OutLocation, struct FVector* OutDirection) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Lobby_ActiveSkillTuto_Interactible_BP_C">();
	}
	static class ALobby_ActiveSkillTuto_Interactible_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobby_ActiveSkillTuto_Interactible_BP_C>();
	}
};
static_assert(alignof(ALobby_ActiveSkillTuto_Interactible_BP_C) == 0x000008, "Wrong alignment on ALobby_ActiveSkillTuto_Interactible_BP_C");
static_assert(sizeof(ALobby_ActiveSkillTuto_Interactible_BP_C) == 0x000348, "Wrong size on ALobby_ActiveSkillTuto_Interactible_BP_C");
static_assert(offsetof(ALobby_ActiveSkillTuto_Interactible_BP_C, UberGraphFrame) == 0x0002C0, "Member 'ALobby_ActiveSkillTuto_Interactible_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALobby_ActiveSkillTuto_Interactible_BP_C, Camera) == 0x0002C8, "Member 'ALobby_ActiveSkillTuto_Interactible_BP_C::Camera' has a wrong offset!");
static_assert(offsetof(ALobby_ActiveSkillTuto_Interactible_BP_C, ActiveSkillMeshComponent) == 0x0002D0, "Member 'ALobby_ActiveSkillTuto_Interactible_BP_C::ActiveSkillMeshComponent' has a wrong offset!");
static_assert(offsetof(ALobby_ActiveSkillTuto_Interactible_BP_C, RBCinematicZone) == 0x0002D8, "Member 'ALobby_ActiveSkillTuto_Interactible_BP_C::RBCinematicZone' has a wrong offset!");
static_assert(offsetof(ALobby_ActiveSkillTuto_Interactible_BP_C, Arrow) == 0x0002E0, "Member 'ALobby_ActiveSkillTuto_Interactible_BP_C::Arrow' has a wrong offset!");
static_assert(offsetof(ALobby_ActiveSkillTuto_Interactible_BP_C, StaticMesh) == 0x0002E8, "Member 'ALobby_ActiveSkillTuto_Interactible_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ALobby_ActiveSkillTuto_Interactible_BP_C, LinkedTvChannel) == 0x0002F0, "Member 'ALobby_ActiveSkillTuto_Interactible_BP_C::LinkedTvChannel' has a wrong offset!");
static_assert(offsetof(ALobby_ActiveSkillTuto_Interactible_BP_C, WithSoundMovie) == 0x000318, "Member 'ALobby_ActiveSkillTuto_Interactible_BP_C::WithSoundMovie' has a wrong offset!");
static_assert(offsetof(ALobby_ActiveSkillTuto_Interactible_BP_C, NoSoundMovie) == 0x000320, "Member 'ALobby_ActiveSkillTuto_Interactible_BP_C::NoSoundMovie' has a wrong offset!");
static_assert(offsetof(ALobby_ActiveSkillTuto_Interactible_BP_C, Data_Table) == 0x000328, "Member 'ALobby_ActiveSkillTuto_Interactible_BP_C::Data_Table' has a wrong offset!");
static_assert(offsetof(ALobby_ActiveSkillTuto_Interactible_BP_C, ActiveSkillMesh) == 0x000330, "Member 'ALobby_ActiveSkillTuto_Interactible_BP_C::ActiveSkillMesh' has a wrong offset!");
static_assert(offsetof(ALobby_ActiveSkillTuto_Interactible_BP_C, MenuPage) == 0x000338, "Member 'ALobby_ActiveSkillTuto_Interactible_BP_C::MenuPage' has a wrong offset!");
static_assert(offsetof(ALobby_ActiveSkillTuto_Interactible_BP_C, IsInInteraction) == 0x000340, "Member 'ALobby_ActiveSkillTuto_Interactible_BP_C::IsInInteraction' has a wrong offset!");

}

