#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lobby_FakeReagent_BP

#include "Basic.hpp"

#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.TryPlayFacialAnim
// 0x0018 (0x0018 - 0x0000)
struct Lobby_FakeReagent_BP_C_TryPlayFacialAnim final
{
public:
	class FString                                 LineId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryPlayFacialAnim_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_TryPlayFacialAnim) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_TryPlayFacialAnim");
static_assert(sizeof(Lobby_FakeReagent_BP_C_TryPlayFacialAnim) == 0x000018, "Wrong size on Lobby_FakeReagent_BP_C_TryPlayFacialAnim");
static_assert(offsetof(Lobby_FakeReagent_BP_C_TryPlayFacialAnim, LineId) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_TryPlayFacialAnim::LineId' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_TryPlayFacialAnim, ReturnValue) == 0x000010, "Member 'Lobby_FakeReagent_BP_C_TryPlayFacialAnim::ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_TryPlayFacialAnim, CallFunc_TryPlayFacialAnim_ReturnValue) == 0x000011, "Member 'Lobby_FakeReagent_BP_C_TryPlayFacialAnim::CallFunc_TryPlayFacialAnim_ReturnValue' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct Lobby_FakeReagent_BP_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on Lobby_FakeReagent_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(Lobby_FakeReagent_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on Lobby_FakeReagent_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(Lobby_FakeReagent_BP_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.GetStateName
// 0x0028 (0x0028 - 0x0000)
struct Lobby_FakeReagent_BP_C_GetStateName final
{
public:
	class FString                                 StateA;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StateB;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_GetStateName) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_GetStateName");
static_assert(sizeof(Lobby_FakeReagent_BP_C_GetStateName) == 0x000028, "Wrong size on Lobby_FakeReagent_BP_C_GetStateName");
static_assert(offsetof(Lobby_FakeReagent_BP_C_GetStateName, StateA) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_GetStateName::StateA' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_GetStateName, StateB) == 0x000010, "Member 'Lobby_FakeReagent_BP_C_GetStateName::StateB' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_GetStateName, ReturnValue) == 0x000020, "Member 'Lobby_FakeReagent_BP_C_GetStateName::ReturnValue' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.GetFacePoseAsset
// 0x0008 (0x0008 - 0x0000)
struct Lobby_FakeReagent_BP_C_GetFacePoseAsset final
{
public:
	class UPoseAsset*                             Param_FacePoseAsset;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_GetFacePoseAsset) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_GetFacePoseAsset");
static_assert(sizeof(Lobby_FakeReagent_BP_C_GetFacePoseAsset) == 0x000008, "Wrong size on Lobby_FakeReagent_BP_C_GetFacePoseAsset");
static_assert(offsetof(Lobby_FakeReagent_BP_C_GetFacePoseAsset, Param_FacePoseAsset) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_GetFacePoseAsset::Param_FacePoseAsset' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.InitializeMasterComponent
// 0x0028 (0x0028 - 0x0000)
struct Lobby_FakeReagent_BP_C_InitializeMasterComponent final
{
public:
	TArray<class USkeletalMeshComponent*>         Skelmeshes;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C00[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_InitializeMasterComponent) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_InitializeMasterComponent");
static_assert(sizeof(Lobby_FakeReagent_BP_C_InitializeMasterComponent) == 0x000028, "Wrong size on Lobby_FakeReagent_BP_C_InitializeMasterComponent");
static_assert(offsetof(Lobby_FakeReagent_BP_C_InitializeMasterComponent, Skelmeshes) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_InitializeMasterComponent::Skelmeshes' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_InitializeMasterComponent, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Lobby_FakeReagent_BP_C_InitializeMasterComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_InitializeMasterComponent, K2Node_MakeArray_Array) == 0x000018, "Member 'Lobby_FakeReagent_BP_C_InitializeMasterComponent::K2Node_MakeArray_Array' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.SetState
// 0x0001 (0x0001 - 0x0000)
struct Lobby_FakeReagent_BP_C_SetState final
{
public:
	bool                                          bStateA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_SetState) == 0x000001, "Wrong alignment on Lobby_FakeReagent_BP_C_SetState");
static_assert(sizeof(Lobby_FakeReagent_BP_C_SetState) == 0x000001, "Wrong size on Lobby_FakeReagent_BP_C_SetState");
static_assert(offsetof(Lobby_FakeReagent_BP_C_SetState, bStateA) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_SetState::bStateA' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.PrepareState
// 0x0010 (0x0010 - 0x0000)
struct Lobby_FakeReagent_BP_C_PrepareState final
{
public:
	bool                                          bStateA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C01[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RandomOwner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_PrepareState) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_PrepareState");
static_assert(sizeof(Lobby_FakeReagent_BP_C_PrepareState) == 0x000010, "Wrong size on Lobby_FakeReagent_BP_C_PrepareState");
static_assert(offsetof(Lobby_FakeReagent_BP_C_PrepareState, bStateA) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_PrepareState::bStateA' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_PrepareState, RandomOwner) == 0x000008, "Member 'Lobby_FakeReagent_BP_C_PrepareState::RandomOwner' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.SetShouldBeIgnoredForLots
// 0x0001 (0x0001 - 0x0000)
struct Lobby_FakeReagent_BP_C_SetShouldBeIgnoredForLots final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_SetShouldBeIgnoredForLots) == 0x000001, "Wrong alignment on Lobby_FakeReagent_BP_C_SetShouldBeIgnoredForLots");
static_assert(sizeof(Lobby_FakeReagent_BP_C_SetShouldBeIgnoredForLots) == 0x000001, "Wrong size on Lobby_FakeReagent_BP_C_SetShouldBeIgnoredForLots");
static_assert(offsetof(Lobby_FakeReagent_BP_C_SetShouldBeIgnoredForLots, bValue) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_SetShouldBeIgnoredForLots::bValue' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.OnExtraCustomizationMeshesAddedForSlot
// 0x0018 (0x0018 - 0x0000)
struct Lobby_FakeReagent_BP_C_OnExtraCustomizationMeshesAddedForSlot final
{
public:
	TArray<class USkeletalMeshComponent*>         AddedExtraMeshes;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EPlayerCustomizationSlot                      Slot;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_OnExtraCustomizationMeshesAddedForSlot) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_OnExtraCustomizationMeshesAddedForSlot");
static_assert(sizeof(Lobby_FakeReagent_BP_C_OnExtraCustomizationMeshesAddedForSlot) == 0x000018, "Wrong size on Lobby_FakeReagent_BP_C_OnExtraCustomizationMeshesAddedForSlot");
static_assert(offsetof(Lobby_FakeReagent_BP_C_OnExtraCustomizationMeshesAddedForSlot, AddedExtraMeshes) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_OnExtraCustomizationMeshesAddedForSlot::AddedExtraMeshes' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_OnExtraCustomizationMeshesAddedForSlot, Slot) == 0x000010, "Member 'Lobby_FakeReagent_BP_C_OnExtraCustomizationMeshesAddedForSlot::Slot' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.CustomEvent_0
// 0x0010 (0x0010 - 0x0000)
struct Lobby_FakeReagent_BP_C_CustomEvent_0 final
{
public:
	class AActor*                                 CustomizationOwner;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequestID;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPawnCustomizationRequestType                 RequestType;                                       // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_CustomEvent_0) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_CustomEvent_0");
static_assert(sizeof(Lobby_FakeReagent_BP_C_CustomEvent_0) == 0x000010, "Wrong size on Lobby_FakeReagent_BP_C_CustomEvent_0");
static_assert(offsetof(Lobby_FakeReagent_BP_C_CustomEvent_0, CustomizationOwner) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_CustomEvent_0::CustomizationOwner' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_CustomEvent_0, RequestID) == 0x000008, "Member 'Lobby_FakeReagent_BP_C_CustomEvent_0::RequestID' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_CustomEvent_0, RequestType) == 0x00000C, "Member 'Lobby_FakeReagent_BP_C_CustomEvent_0::RequestType' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.PostToggled
// 0x0001 (0x0001 - 0x0000)
struct Lobby_FakeReagent_BP_C_PostToggled final
{
public:
	bool                                          bToggleEnabled;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_PostToggled) == 0x000001, "Wrong alignment on Lobby_FakeReagent_BP_C_PostToggled");
static_assert(sizeof(Lobby_FakeReagent_BP_C_PostToggled) == 0x000001, "Wrong size on Lobby_FakeReagent_BP_C_PostToggled");
static_assert(offsetof(Lobby_FakeReagent_BP_C_PostToggled, bToggleEnabled) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_PostToggled::bToggleEnabled' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.ExecuteUbergraph_Lobby_FakeReagent_BP
// 0x01B8 (0x01B8 - 0x0000)
struct Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* CustomizationOwner, int32 RequestID, EPawnCustomizationRequestType RequestType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C02[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStateA_1;                            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStateA;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C03[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_randomOwner;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bValue;                               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C04[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_Event_addedExtraMeshes;                     // 0x0058(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	EPlayerCustomizationSlot                      K2Node_Event_slot;                                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C05[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C06[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerCustomizationConfig*           CallFunc_GetPlayerCustomizationConfig_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GenerateRandomSeedNonDeterministic_ReturnValue; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C07[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C08[0x2];                                     // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPawnCustomizationManager*            CallFunc_GetPawnCustomizationManager_ReturnValue;  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBPawnCustomizationManager*            CallFunc_GetPawnCustomizationManager_ReturnValue_1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LoadPlayerCustomizationResources_ReturnValue; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C09[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_customizationOwner;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_requestID;                      // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPawnCustomizationRequestType                 K2Node_CustomEvent_requestType;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C0A[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPawnCustomizationManager*            CallFunc_GetPawnCustomizationManager_ReturnValue_2; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C0B[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsStateA_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C0C[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBPlayerCustomizationInfo             CallFunc_GetRandomDeadBodyCustomizationInfo_ReturnValue; // 0x00E0(0x0038)()
	class URBPlayerCustomizationOption*           CallFunc_GetPlayerCustomizationOptionForSlot_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Temp_object_Variable_1;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C0D[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPoseAsset*                             K2Node_DynamicCast_AsPose_Asset;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C0E[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFace_LobbyReagent_AnimBP_C*            K2Node_DynamicCast_AsFace_Lobby_Reagent_Anim_BP;   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C0F[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFace_LobbyReagent_AnimBP_C*            K2Node_DynamicCast_AsFace_Lobby_Reagent_Anim_BP_1; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C10[0x6];                                     // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_Select_Default;                             // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFace_LobbyReagent_AnimBP_C*            K2Node_DynamicCast_AsFace_Lobby_Reagent_Anim_BP_2; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bToggleEnabled;                       // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C11[0x6];                                     // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0198(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_2;                         // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP");
static_assert(sizeof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP) == 0x0001B8, "Wrong size on Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, EntryPoint) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, Temp_int_Array_Index_Variable) == 0x000004, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_HasAuthority_ReturnValue) == 0x000028, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, Temp_int_Loop_Counter_Variable_2) == 0x00002C, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_Add_IntInt_ReturnValue_2) == 0x000030, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, Temp_object_Variable) == 0x000038, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_Event_bStateA_1) == 0x000040, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_Event_bStateA_1' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_Event_bStateA) == 0x000041, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_Event_bStateA' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_Event_randomOwner) == 0x000048, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_Event_randomOwner' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_Event_bValue) == 0x000050, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_Event_bValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_Event_addedExtraMeshes) == 0x000058, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_Event_addedExtraMeshes' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_Event_slot) == 0x000068, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_Event_slot' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_GetPlayerCustomizationConfig_ReturnValue) == 0x000078, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_GetPlayerCustomizationConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_GenerateRandomSeedNonDeterministic_ReturnValue) == 0x000080, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_GenerateRandomSeedNonDeterministic_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_Array_Get_Item) == 0x000088, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_IsValid_ReturnValue) == 0x000094, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000095, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_GetPawnCustomizationManager_ReturnValue) == 0x000098, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_GetPawnCustomizationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_GetPawnCustomizationManager_ReturnValue_1) == 0x0000A0, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_GetPawnCustomizationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_LoadPlayerCustomizationResources_ReturnValue) == 0x0000A8, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_LoadPlayerCustomizationResources_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_CustomEvent_customizationOwner) == 0x0000B0, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_CustomEvent_customizationOwner' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_CustomEvent_requestID) == 0x0000B8, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_CustomEvent_requestID' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_CustomEvent_requestType) == 0x0000BC, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_CustomEvent_requestType' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_GetPawnCustomizationManager_ReturnValue_2) == 0x0000C0, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_GetPawnCustomizationManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000C8, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, Temp_int_Array_Index_Variable_2) == 0x0000CC, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_Array_Add_ReturnValue) == 0x0000D8, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_BP_IsStateA_ReturnValue) == 0x0000DC, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_BP_IsStateA_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_GetRandomDeadBodyCustomizationInfo_ReturnValue) == 0x0000E0, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_GetRandomDeadBodyCustomizationInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_GetPlayerCustomizationOptionForSlot_ReturnValue) == 0x000118, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_GetPlayerCustomizationOptionForSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, Temp_object_Variable_1) == 0x000120, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_IsValid_ReturnValue_1) == 0x000128, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000130, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_DynamicCast_AsPose_Asset) == 0x000138, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_DynamicCast_AsPose_Asset' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_GetAnimInstance_ReturnValue) == 0x000148, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_DynamicCast_AsFace_Lobby_Reagent_Anim_BP) == 0x000150, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_DynamicCast_AsFace_Lobby_Reagent_Anim_BP' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000160, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_DynamicCast_AsFace_Lobby_Reagent_Anim_BP_1) == 0x000168, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_DynamicCast_AsFace_Lobby_Reagent_Anim_BP_1' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_DynamicCast_bSuccess_2) == 0x000170, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, Temp_bool_Variable) == 0x000171, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000178, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_Select_Default) == 0x000180, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_DynamicCast_AsFace_Lobby_Reagent_Anim_BP_2) == 0x000188, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_DynamicCast_AsFace_Lobby_Reagent_Anim_BP_2' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_DynamicCast_bSuccess_3) == 0x000190, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, K2Node_Event_bToggleEnabled) == 0x000191, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::K2Node_Event_bToggleEnabled' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000198, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_Array_Get_Item_2) == 0x0001A8, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_Array_Length_ReturnValue_2) == 0x0001B0, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001B4, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0001B5, "Member 'Lobby_FakeReagent_BP_C_ExecuteUbergraph_Lobby_FakeReagent_BP::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.FindFaceAnimSequence
// 0x0020 (0x0020 - 0x0000)
struct Lobby_FakeReagent_BP_C_FindFaceAnimSequence final
{
public:
	class FString                                 LineId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UAnimSequence*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_FindFaceAnimSequenceFromLobbyData_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_FindFaceAnimSequence) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_FindFaceAnimSequence");
static_assert(sizeof(Lobby_FakeReagent_BP_C_FindFaceAnimSequence) == 0x000020, "Wrong size on Lobby_FakeReagent_BP_C_FindFaceAnimSequence");
static_assert(offsetof(Lobby_FakeReagent_BP_C_FindFaceAnimSequence, LineId) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_FindFaceAnimSequence::LineId' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_FindFaceAnimSequence, ReturnValue) == 0x000010, "Member 'Lobby_FakeReagent_BP_C_FindFaceAnimSequence::ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_FindFaceAnimSequence, CallFunc_FindFaceAnimSequenceFromLobbyData_ReturnValue) == 0x000018, "Member 'Lobby_FakeReagent_BP_C_FindFaceAnimSequence::CallFunc_FindFaceAnimSequenceFromLobbyData_ReturnValue' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.GetFaceFXSkeletalMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct Lobby_FakeReagent_BP_C_GetFaceFXSkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_GetFaceFXSkeletalMeshComponent) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_GetFaceFXSkeletalMeshComponent");
static_assert(sizeof(Lobby_FakeReagent_BP_C_GetFaceFXSkeletalMeshComponent) == 0x000008, "Wrong size on Lobby_FakeReagent_BP_C_GetFaceFXSkeletalMeshComponent");
static_assert(offsetof(Lobby_FakeReagent_BP_C_GetFaceFXSkeletalMeshComponent, ReturnValue) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_GetFaceFXSkeletalMeshComponent::ReturnValue' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.GetVoiceComponent
// 0x0008 (0x0008 - 0x0000)
struct Lobby_FakeReagent_BP_C_GetVoiceComponent final
{
public:
	class URBSoundComponent*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_GetVoiceComponent) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_GetVoiceComponent");
static_assert(sizeof(Lobby_FakeReagent_BP_C_GetVoiceComponent) == 0x000008, "Wrong size on Lobby_FakeReagent_BP_C_GetVoiceComponent");
static_assert(offsetof(Lobby_FakeReagent_BP_C_GetVoiceComponent, ReturnValue) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_GetVoiceComponent::ReturnValue' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.GetMainParentSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct Lobby_FakeReagent_BP_C_GetMainParentSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_GetMainParentSkeletalMesh) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_GetMainParentSkeletalMesh");
static_assert(sizeof(Lobby_FakeReagent_BP_C_GetMainParentSkeletalMesh) == 0x000008, "Wrong size on Lobby_FakeReagent_BP_C_GetMainParentSkeletalMesh");
static_assert(offsetof(Lobby_FakeReagent_BP_C_GetMainParentSkeletalMesh, ReturnValue) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_GetMainParentSkeletalMesh::ReturnValue' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.GetPlayerCustomizationInfo
// 0x0038 (0x0038 - 0x0000)
struct Lobby_FakeReagent_BP_C_GetPlayerCustomizationInfo final
{
public:
	struct FRBPlayerCustomizationInfo             ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_GetPlayerCustomizationInfo) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_GetPlayerCustomizationInfo");
static_assert(sizeof(Lobby_FakeReagent_BP_C_GetPlayerCustomizationInfo) == 0x000038, "Wrong size on Lobby_FakeReagent_BP_C_GetPlayerCustomizationInfo");
static_assert(offsetof(Lobby_FakeReagent_BP_C_GetPlayerCustomizationInfo, ReturnValue) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_GetPlayerCustomizationInfo::ReturnValue' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.GetSkeletalMeshComponentForSlot
// 0x0018 (0x0018 - 0x0000)
struct Lobby_FakeReagent_BP_C_GetSkeletalMeshComponentForSlot final
{
public:
	EPlayerCustomizationSlot                      Slot;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C12[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_GetSkeletalMeshComponentForSlot) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_GetSkeletalMeshComponentForSlot");
static_assert(sizeof(Lobby_FakeReagent_BP_C_GetSkeletalMeshComponentForSlot) == 0x000018, "Wrong size on Lobby_FakeReagent_BP_C_GetSkeletalMeshComponentForSlot");
static_assert(offsetof(Lobby_FakeReagent_BP_C_GetSkeletalMeshComponentForSlot, Slot) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_GetSkeletalMeshComponentForSlot::Slot' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_GetSkeletalMeshComponentForSlot, ReturnValue) == 0x000008, "Member 'Lobby_FakeReagent_BP_C_GetSkeletalMeshComponentForSlot::ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_GetSkeletalMeshComponentForSlot, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'Lobby_FakeReagent_BP_C_GetSkeletalMeshComponentForSlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.GetWatchComponent
// 0x0008 (0x0008 - 0x0000)
struct Lobby_FakeReagent_BP_C_GetWatchComponent final
{
public:
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_GetWatchComponent) == 0x000008, "Wrong alignment on Lobby_FakeReagent_BP_C_GetWatchComponent");
static_assert(sizeof(Lobby_FakeReagent_BP_C_GetWatchComponent) == 0x000008, "Wrong size on Lobby_FakeReagent_BP_C_GetWatchComponent");
static_assert(offsetof(Lobby_FakeReagent_BP_C_GetWatchComponent, ReturnValue) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_GetWatchComponent::ReturnValue' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.IsStateA
// 0x0002 (0x0002 - 0x0000)
struct Lobby_FakeReagent_BP_C_IsStateA final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsStateA_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_IsStateA) == 0x000001, "Wrong alignment on Lobby_FakeReagent_BP_C_IsStateA");
static_assert(sizeof(Lobby_FakeReagent_BP_C_IsStateA) == 0x000002, "Wrong size on Lobby_FakeReagent_BP_C_IsStateA");
static_assert(offsetof(Lobby_FakeReagent_BP_C_IsStateA, ReturnValue) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_IsStateA::ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_IsStateA, CallFunc_BP_IsStateA_ReturnValue) == 0x000001, "Member 'Lobby_FakeReagent_BP_C_IsStateA::CallFunc_BP_IsStateA_ReturnValue' has a wrong offset!");

// Function Lobby_FakeReagent_BP.Lobby_FakeReagent_BP_C.ShouldBeIgnoredForLots
// 0x0002 (0x0002 - 0x0000)
struct Lobby_FakeReagent_BP_C_ShouldBeIgnoredForLots final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_ShouldBeIgnoredForLots_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_FakeReagent_BP_C_ShouldBeIgnoredForLots) == 0x000001, "Wrong alignment on Lobby_FakeReagent_BP_C_ShouldBeIgnoredForLots");
static_assert(sizeof(Lobby_FakeReagent_BP_C_ShouldBeIgnoredForLots) == 0x000002, "Wrong size on Lobby_FakeReagent_BP_C_ShouldBeIgnoredForLots");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ShouldBeIgnoredForLots, ReturnValue) == 0x000000, "Member 'Lobby_FakeReagent_BP_C_ShouldBeIgnoredForLots::ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_FakeReagent_BP_C_ShouldBeIgnoredForLots, CallFunc_BP_ShouldBeIgnoredForLots_ReturnValue) == 0x000001, "Member 'Lobby_FakeReagent_BP_C_ShouldBeIgnoredForLots::CallFunc_BP_ShouldBeIgnoredForLots_ReturnValue' has a wrong offset!");

}

