#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbySocialMenuScene_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function LobbySocialMenuScene_BP.LobbySocialMenuScene_BP_C.ExecuteUbergraph_LobbySocialMenuScene_BP
// 0x0038 (0x0038 - 0x0000)
struct LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UChildActorComponent*>           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB3[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP) == 0x000008, "Wrong alignment on LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP");
static_assert(sizeof(LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP) == 0x000038, "Wrong size on LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP");
static_assert(offsetof(LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP, EntryPoint) == 0x000000, "Member 'LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP, K2Node_MakeArray_Array) == 0x000010, "Member 'LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP, CallFunc_Array_Get_Item) == 0x000028, "Member 'LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'LobbySocialMenuScene_BP_C_ExecuteUbergraph_LobbySocialMenuScene_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

