#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyMinus01_LD_AI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Lobby-01_LD_AI.Lobby-01_LD_AI_C
// 0x00E0 (0x0338 - 0x0258)
class ALobbyMinus01_LD_AI_C final : public ARBLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ARBLobbyPlayerState*                    LocalPlayerState;                                  // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ATvChannel_BP_C>         PlayerCellMasterTV;                                // 0x0268(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Affects_Movement;                                  // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33EA[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBAIConditionSet                      IdleCondition;                                     // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FRBAIConditionSet                      PatrolCondition;                                   // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FRBAIConditionSet                      IsInStationCondition;                              // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class URBAIConfig*                            ScientistConfigAsset;                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBAIConfig*                            GuardConfigAsset;                                  // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLobbyScriptedAnimStationData          ExitAreaGuard;                                     // 0x02D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ALobbyStretcher_BP_C*                   LobbyStretcher_BP_2_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty; // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALobbyAutomaticDoor_BP_C*               LobbyAutomaticDoor_BP_2_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty; // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASasDoorMinus03_BP1_C*                  SasDoorMinus03_BP3_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty; // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBRandomManager*                       RBRandomManager_1_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty; // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALobbyExperimentReadyExitLightsMinus01_BP_C* LobbyExperimentReadyExitLightsMinus01_BP2_5_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty; // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALobbyExperimentReadyExitLightsMinus01_BP_C* LobbyExperimentReadyExitLightsMinus01_BP3_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty; // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALobby_Stationnary_Scientist_C*         Lobby_Stationnary_Scientist_4_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty; // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayerTriggerVolume*                 RBPlayerTriggerVolume4_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty; // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayerTriggerVolume*                 RBPlayerTriggerVolume5_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty; // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Medical_Start();
	void Multicast_Docks_PlayStretcherSequence();
	void Opendoor();
	void Closedoor();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void TryBindLocalPlayerState();
	void OnMatchStateUpdated(class ARBLobbyPlayerState* RBLobbyPlayerState, const struct FMatchState& MatchState);
	void SetupFirstTimeInCellTutorial();
	void DoFirstTimeInCellTutorial();
	void OnWorldFullyLoaded();
	void OnWorldPopulateFinished();
	void OnPlayerInOwnCellUpdated(bool bInOwnCell);
	void Debug_CallFakeExperiment();
	void BindReleaseReagentTrigger();
	void CustomEvent_0(class ARBPlayer* Player);
	void UnBindReleaseReagentTrigger();
	void CustomEvent_1(class ARBPlayer* Player);
	void CustomEvent_3();
	void BindExitSASDoorTubes();
	void SASTubeBeginOverlapEvent(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void UnBindExitSASDoorTubes();
	void ExecuteUbergraph_LobbyMinus01_LD_AI(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Lobby-01_LD_AI_C">();
	}
	static class ALobbyMinus01_LD_AI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobbyMinus01_LD_AI_C>();
	}
};
static_assert(alignof(ALobbyMinus01_LD_AI_C) == 0x000008, "Wrong alignment on ALobbyMinus01_LD_AI_C");
static_assert(sizeof(ALobbyMinus01_LD_AI_C) == 0x000338, "Wrong size on ALobbyMinus01_LD_AI_C");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, UberGraphFrame) == 0x000258, "Member 'ALobbyMinus01_LD_AI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, LocalPlayerState) == 0x000260, "Member 'ALobbyMinus01_LD_AI_C::LocalPlayerState' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, PlayerCellMasterTV) == 0x000268, "Member 'ALobbyMinus01_LD_AI_C::PlayerCellMasterTV' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, Affects_Movement) == 0x000290, "Member 'ALobbyMinus01_LD_AI_C::Affects_Movement' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, IdleCondition) == 0x000298, "Member 'ALobbyMinus01_LD_AI_C::IdleCondition' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, PatrolCondition) == 0x0002A8, "Member 'ALobbyMinus01_LD_AI_C::PatrolCondition' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, IsInStationCondition) == 0x0002B8, "Member 'ALobbyMinus01_LD_AI_C::IsInStationCondition' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, ScientistConfigAsset) == 0x0002C8, "Member 'ALobbyMinus01_LD_AI_C::ScientistConfigAsset' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, GuardConfigAsset) == 0x0002D0, "Member 'ALobbyMinus01_LD_AI_C::GuardConfigAsset' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, ExitAreaGuard) == 0x0002D8, "Member 'ALobbyMinus01_LD_AI_C::ExitAreaGuard' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, LobbyStretcher_BP_2_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty) == 0x0002F0, "Member 'ALobbyMinus01_LD_AI_C::LobbyStretcher_BP_2_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, LobbyAutomaticDoor_BP_2_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty) == 0x0002F8, "Member 'ALobbyMinus01_LD_AI_C::LobbyAutomaticDoor_BP_2_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, SasDoorMinus03_BP3_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty) == 0x000300, "Member 'ALobbyMinus01_LD_AI_C::SasDoorMinus03_BP3_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, RBRandomManager_1_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty) == 0x000308, "Member 'ALobbyMinus01_LD_AI_C::RBRandomManager_1_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, LobbyExperimentReadyExitLightsMinus01_BP2_5_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty) == 0x000310, "Member 'ALobbyMinus01_LD_AI_C::LobbyExperimentReadyExitLightsMinus01_BP2_5_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, LobbyExperimentReadyExitLightsMinus01_BP3_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty) == 0x000318, "Member 'ALobbyMinus01_LD_AI_C::LobbyExperimentReadyExitLightsMinus01_BP3_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, Lobby_Stationnary_Scientist_4_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty) == 0x000320, "Member 'ALobbyMinus01_LD_AI_C::Lobby_Stationnary_Scientist_4_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, RBPlayerTriggerVolume4_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty) == 0x000328, "Member 'ALobbyMinus01_LD_AI_C::RBPlayerTriggerVolume4_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty' has a wrong offset!");
static_assert(offsetof(ALobbyMinus01_LD_AI_C, RBPlayerTriggerVolume5_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty) == 0x000330, "Member 'ALobbyMinus01_LD_AI_C::RBPlayerTriggerVolume5_ExecuteUbergraph_LobbyMinus01_LD_AI_RefProperty' has a wrong offset!");

}

