#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lobby_ToxicGasTrapMinus01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Lobby_ToxicGasTrap-01_BP.Lobby_ToxicGasTrap-01_BP_C.UserConstructionScript
// 0x0040 (0x0040 - 0x0000)
struct Lobby_ToxicGasTrapMinus01_BP_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_ToxicGasTrapMinus01_BP_C_UserConstructionScript) == 0x000010, "Wrong alignment on Lobby_ToxicGasTrapMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(Lobby_ToxicGasTrapMinus01_BP_C_UserConstructionScript) == 0x000040, "Wrong size on Lobby_ToxicGasTrapMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(Lobby_ToxicGasTrapMinus01_BP_C_UserConstructionScript, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'Lobby_ToxicGasTrapMinus01_BP_C_UserConstructionScript::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_ToxicGasTrapMinus01_BP_C_UserConstructionScript, CallFunc_TransformLocation_ReturnValue) == 0x000030, "Member 'Lobby_ToxicGasTrapMinus01_BP_C_UserConstructionScript::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");

// Function Lobby_ToxicGasTrap-01_BP.Lobby_ToxicGasTrap-01_BP_C.UpdateRopeTransforms
// 0x00D8 (0x00D8 - 0x0000)
struct Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms final
{
public:
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZY_ReturnValue;                // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms) == 0x000004, "Wrong alignment on Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms");
static_assert(sizeof(Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms) == 0x0000D8, "Wrong size on Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms");
static_assert(offsetof(Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms, CallFunc_GetRightVector_ReturnValue) == 0x000000, "Member 'Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00000C, "Member 'Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000018, "Member 'Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000024, "Member 'Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms, CallFunc_MakeRotFromZY_ReturnValue) == 0x000030, "Member 'Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms::CallFunc_MakeRotFromZY_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms, CallFunc_Vector_Distance_ReturnValue) == 0x00003C, "Member 'Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000040, "Member 'Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms, CallFunc_MakeVector_ReturnValue) == 0x000044, "Member 'Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000050, "Member 'Lobby_ToxicGasTrapMinus01_BP_C_UpdateRopeTransforms::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function Lobby_ToxicGasTrap-01_BP.Lobby_ToxicGasTrap-01_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Lobby_ToxicGasTrapMinus01_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_ToxicGasTrapMinus01_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on Lobby_ToxicGasTrapMinus01_BP_C_ReceiveTick");
static_assert(sizeof(Lobby_ToxicGasTrapMinus01_BP_C_ReceiveTick) == 0x000004, "Wrong size on Lobby_ToxicGasTrapMinus01_BP_C_ReceiveTick");
static_assert(offsetof(Lobby_ToxicGasTrapMinus01_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Lobby_ToxicGasTrapMinus01_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function Lobby_ToxicGasTrap-01_BP.Lobby_ToxicGasTrap-01_BP_C.ExecuteUbergraph_Lobby_ToxicGasTrap-01_BP
// 0x0008 (0x0008 - 0x0000)
struct Lobby_ToxicGasTrapMinus01_BP_C_ExecuteUbergraph_Lobby_ToxicGasTrapMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_ToxicGasTrapMinus01_BP_C_ExecuteUbergraph_Lobby_ToxicGasTrapMinus01_BP) == 0x000004, "Wrong alignment on Lobby_ToxicGasTrapMinus01_BP_C_ExecuteUbergraph_Lobby_ToxicGasTrapMinus01_BP");
static_assert(sizeof(Lobby_ToxicGasTrapMinus01_BP_C_ExecuteUbergraph_Lobby_ToxicGasTrapMinus01_BP) == 0x000008, "Wrong size on Lobby_ToxicGasTrapMinus01_BP_C_ExecuteUbergraph_Lobby_ToxicGasTrapMinus01_BP");
static_assert(offsetof(Lobby_ToxicGasTrapMinus01_BP_C_ExecuteUbergraph_Lobby_ToxicGasTrapMinus01_BP, EntryPoint) == 0x000000, "Member 'Lobby_ToxicGasTrapMinus01_BP_C_ExecuteUbergraph_Lobby_ToxicGasTrapMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Lobby_ToxicGasTrapMinus01_BP_C_ExecuteUbergraph_Lobby_ToxicGasTrapMinus01_BP, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Lobby_ToxicGasTrapMinus01_BP_C_ExecuteUbergraph_Lobby_ToxicGasTrapMinus01_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

