#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyDecalActorMinus01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LobbyDecalActor-01_BP.LobbyDecalActor-01_BP_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct LobbyDecalActorMinus01_BP_C_UserConstructionScript final
{
public:
	class UMaterialInstanceConstant*              CallFunc_Array_Get_Item;                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyDecalActorMinus01_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on LobbyDecalActorMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(LobbyDecalActorMinus01_BP_C_UserConstructionScript) == 0x000008, "Wrong size on LobbyDecalActorMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(LobbyDecalActorMinus01_BP_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000000, "Member 'LobbyDecalActorMinus01_BP_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");

// Function LobbyDecalActor-01_BP.LobbyDecalActor-01_BP_C.MoveObject
// 0x0008 (0x0008 - 0x0000)
struct LobbyDecalActorMinus01_BP_C_MoveObject final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyDecalActorMinus01_BP_C_MoveObject) == 0x000008, "Wrong alignment on LobbyDecalActorMinus01_BP_C_MoveObject");
static_assert(sizeof(LobbyDecalActorMinus01_BP_C_MoveObject) == 0x000008, "Wrong size on LobbyDecalActorMinus01_BP_C_MoveObject");
static_assert(offsetof(LobbyDecalActorMinus01_BP_C_MoveObject, Pawn) == 0x000000, "Member 'LobbyDecalActorMinus01_BP_C_MoveObject::Pawn' has a wrong offset!");

// Function LobbyDecalActor-01_BP.LobbyDecalActor-01_BP_C.CustomEvent_1
// 0x0008 (0x0008 - 0x0000)
struct LobbyDecalActorMinus01_BP_C_CustomEvent_1 final
{
public:
	float                                         Axis;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Shift;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Alt;                                               // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyDecalActorMinus01_BP_C_CustomEvent_1) == 0x000004, "Wrong alignment on LobbyDecalActorMinus01_BP_C_CustomEvent_1");
static_assert(sizeof(LobbyDecalActorMinus01_BP_C_CustomEvent_1) == 0x000008, "Wrong size on LobbyDecalActorMinus01_BP_C_CustomEvent_1");
static_assert(offsetof(LobbyDecalActorMinus01_BP_C_CustomEvent_1, Axis) == 0x000000, "Member 'LobbyDecalActorMinus01_BP_C_CustomEvent_1::Axis' has a wrong offset!");
static_assert(offsetof(LobbyDecalActorMinus01_BP_C_CustomEvent_1, Shift) == 0x000004, "Member 'LobbyDecalActorMinus01_BP_C_CustomEvent_1::Shift' has a wrong offset!");
static_assert(offsetof(LobbyDecalActorMinus01_BP_C_CustomEvent_1, Alt) == 0x000005, "Member 'LobbyDecalActorMinus01_BP_C_CustomEvent_1::Alt' has a wrong offset!");

// Function LobbyDecalActor-01_BP.LobbyDecalActor-01_BP_C.Event_OnStopOperating
// 0x0008 (0x0008 - 0x0000)
struct LobbyDecalActorMinus01_BP_C_Event_OnStopOperating final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyDecalActorMinus01_BP_C_Event_OnStopOperating) == 0x000008, "Wrong alignment on LobbyDecalActorMinus01_BP_C_Event_OnStopOperating");
static_assert(sizeof(LobbyDecalActorMinus01_BP_C_Event_OnStopOperating) == 0x000008, "Wrong size on LobbyDecalActorMinus01_BP_C_Event_OnStopOperating");
static_assert(offsetof(LobbyDecalActorMinus01_BP_C_Event_OnStopOperating, Pawn) == 0x000000, "Member 'LobbyDecalActorMinus01_BP_C_Event_OnStopOperating::Pawn' has a wrong offset!");

// Function LobbyDecalActor-01_BP.LobbyDecalActor-01_BP_C.ChangeDecal
// 0x0001 (0x0001 - 0x0000)
struct LobbyDecalActorMinus01_BP_C_ChangeDecal final
{
public:
	bool                                          Next;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyDecalActorMinus01_BP_C_ChangeDecal) == 0x000001, "Wrong alignment on LobbyDecalActorMinus01_BP_C_ChangeDecal");
static_assert(sizeof(LobbyDecalActorMinus01_BP_C_ChangeDecal) == 0x000001, "Wrong size on LobbyDecalActorMinus01_BP_C_ChangeDecal");
static_assert(offsetof(LobbyDecalActorMinus01_BP_C_ChangeDecal, Next) == 0x000000, "Member 'LobbyDecalActorMinus01_BP_C_ChangeDecal::Next' has a wrong offset!");

// Function LobbyDecalActor-01_BP.LobbyDecalActor-01_BP_C.Event_OnStartOperating
// 0x0008 (0x0008 - 0x0000)
struct LobbyDecalActorMinus01_BP_C_Event_OnStartOperating final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyDecalActorMinus01_BP_C_Event_OnStartOperating) == 0x000008, "Wrong alignment on LobbyDecalActorMinus01_BP_C_Event_OnStartOperating");
static_assert(sizeof(LobbyDecalActorMinus01_BP_C_Event_OnStartOperating) == 0x000008, "Wrong size on LobbyDecalActorMinus01_BP_C_Event_OnStartOperating");
static_assert(offsetof(LobbyDecalActorMinus01_BP_C_Event_OnStartOperating, Pawn) == 0x000000, "Member 'LobbyDecalActorMinus01_BP_C_Event_OnStartOperating::Pawn' has a wrong offset!");

// Function LobbyDecalActor-01_BP.LobbyDecalActor-01_BP_C.MulticastSetInitialDecalMaterial
// 0x0010 (0x0010 - 0x0000)
struct LobbyDecalActorMinus01_BP_C_MulticastSetInitialDecalMaterial final
{
public:
	class UMaterialInterface*                     NewDecalMaterial;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyDecalActorMinus01_BP_C_MulticastSetInitialDecalMaterial) == 0x000008, "Wrong alignment on LobbyDecalActorMinus01_BP_C_MulticastSetInitialDecalMaterial");
static_assert(sizeof(LobbyDecalActorMinus01_BP_C_MulticastSetInitialDecalMaterial) == 0x000010, "Wrong size on LobbyDecalActorMinus01_BP_C_MulticastSetInitialDecalMaterial");
static_assert(offsetof(LobbyDecalActorMinus01_BP_C_MulticastSetInitialDecalMaterial, NewDecalMaterial) == 0x000000, "Member 'LobbyDecalActorMinus01_BP_C_MulticastSetInitialDecalMaterial::NewDecalMaterial' has a wrong offset!");
static_assert(offsetof(LobbyDecalActorMinus01_BP_C_MulticastSetInitialDecalMaterial, Target) == 0x000008, "Member 'LobbyDecalActorMinus01_BP_C_MulticastSetInitialDecalMaterial::Target' has a wrong offset!");

// Function LobbyDecalActor-01_BP.LobbyDecalActor-01_BP_C.ExecuteUbergraph_LobbyDecalActor-01_BP
// 0x0540 (0x0540 - 0x0000)
struct LobbyDecalActorMinus01_BP_C_ExecuteUbergraph_LobbyDecalActorMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLobbyPlayerController*               CallFunc_GetLocalLobbyPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLobbyPlayerController_BP_C*          K2Node_DynamicCast_AsRB_Lobby_Player_Controller_BP; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_348E[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_CustomEvent_pawn;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348F[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBController*                          CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBController_BP_C*                     K2Node_DynamicCast_AsRB_Controller_BP;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3490[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Axis;                           // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SHIFT;                          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_ALT;                            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3491[0x1];                                     // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3492[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_Event_pawn_1;                               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x011C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_Next;                           // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3493[0x2];                                     // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Axis, bool Shift, bool Alt)> K2Node_CreateDelegate_OutputDelegate;              // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	class UMaterialInstanceConstant*              CallFunc_Array_Get_Item;                           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3494[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3495[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceConstant*              CallFunc_Array_Get_Item_1;                         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3496[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x01F0(0x0010)(ConstParm, ReferenceParm)
	class UMaterialInstanceConstant*              CallFunc_Array_Get_Item_2;                         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0208(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3497[0x1];                                     // 0x0293(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3498[0x4];                                     // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3499[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_Event_pawn;                                 // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349A[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0330(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0360(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349B[0x2];                                     // 0x03EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x03EC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_349C[0x4];                                     // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0400(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_CustomEvent_NewDecalMaterial;               // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        K2Node_CustomEvent_Target;                         // 0x0410(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0418(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x04A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ARBLobbyPlayerController*               CallFunc_GetLocalLobbyPlayerController_ReturnValue_1; // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLobbyPlayerController_BP_C*          K2Node_DynamicCast_AsRB_Lobby_Player_Controller_BP_1; // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyDecalActorMinus01_BP_C_ExecuteUbergraph_LobbyDecalActorMinus01_BP) == 0x000010, "Wrong alignment on LobbyDecalActorMinus01_BP_C_ExecuteUbergraph_LobbyDecalActorMinus01_BP");
static_assert(sizeof(LobbyDecalActorMinus01_BP_C_ExecuteUbergraph_LobbyDecalActorMinus01_BP) == 0x000540, "Wrong size on LobbyDecalActorMinus01_BP_C_ExecuteUbergraph_LobbyDecalActorMinus01_BP");
static_assert(offsetof(LobbyDecalActorMinus01_BP_C_ExecuteUbergraph_LobbyDecalActorMinus01_BP, EntryPoint) == 0x000000, "Member 'LobbyDecalActorMinus01_BP_C_ExecuteUbergraph_LobbyDecalActorMinus01_BP::EntryPoint' has a wrong offset!");
