#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lobby_ToxicGasTrapMinus01_BP

#include "Basic.hpp"

#include "RBSwingingActor_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Lobby_ToxicGasTrap-01_BP.Lobby_ToxicGasTrap-01_BP_C
// 0x0038 (0x0300 - 0x02C8)
class ALobby_ToxicGasTrapMinus01_BP_C final : public ARBSwingingActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Lobby_ToxicGasTrapMinus01_BP_C;     // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Rope;                                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RopePosition;                                      // 0x02E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZOffset;                                           // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AnchorWorldLocation;                               // 0x02F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void UpdateRopeTransforms();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_Lobby_ToxicGasTrapMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Lobby_ToxicGasTrap-01_BP_C">();
	}
	static class ALobby_ToxicGasTrapMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobby_ToxicGasTrapMinus01_BP_C>();
	}
};
static_assert(alignof(ALobby_ToxicGasTrapMinus01_BP_C) == 0x000008, "Wrong alignment on ALobby_ToxicGasTrapMinus01_BP_C");
static_assert(sizeof(ALobby_ToxicGasTrapMinus01_BP_C) == 0x000300, "Wrong size on ALobby_ToxicGasTrapMinus01_BP_C");
static_assert(offsetof(ALobby_ToxicGasTrapMinus01_BP_C, UberGraphFrame_Lobby_ToxicGasTrapMinus01_BP_C) == 0x0002C8, "Member 'ALobby_ToxicGasTrapMinus01_BP_C::UberGraphFrame_Lobby_ToxicGasTrapMinus01_BP_C' has a wrong offset!");
static_assert(offsetof(ALobby_ToxicGasTrapMinus01_BP_C, Rope) == 0x0002D0, "Member 'ALobby_ToxicGasTrapMinus01_BP_C::Rope' has a wrong offset!");
static_assert(offsetof(ALobby_ToxicGasTrapMinus01_BP_C, StaticMesh) == 0x0002D8, "Member 'ALobby_ToxicGasTrapMinus01_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ALobby_ToxicGasTrapMinus01_BP_C, RopePosition) == 0x0002E0, "Member 'ALobby_ToxicGasTrapMinus01_BP_C::RopePosition' has a wrong offset!");
static_assert(offsetof(ALobby_ToxicGasTrapMinus01_BP_C, ZOffset) == 0x0002EC, "Member 'ALobby_ToxicGasTrapMinus01_BP_C::ZOffset' has a wrong offset!");
static_assert(offsetof(ALobby_ToxicGasTrapMinus01_BP_C, AnchorWorldLocation) == 0x0002F0, "Member 'ALobby_ToxicGasTrapMinus01_BP_C::AnchorWorldLocation' has a wrong offset!");

}

