#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lobby_StoolSeatMinus01_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Lobby_StoolSeat-01_BP.Lobby_StoolSeat-01_BP_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct Lobby_StoolSeatMinus01_BP_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_StoolSeatMinus01_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on Lobby_StoolSeatMinus01_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(Lobby_StoolSeatMinus01_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on Lobby_StoolSeatMinus01_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(Lobby_StoolSeatMinus01_BP_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'Lobby_StoolSeatMinus01_BP_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

// Function Lobby_StoolSeat-01_BP.Lobby_StoolSeat-01_BP_C.PostToggled
// 0x0001 (0x0001 - 0x0000)
struct Lobby_StoolSeatMinus01_BP_C_PostToggled final
{
public:
	bool                                          bToggleEnabled;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_StoolSeatMinus01_BP_C_PostToggled) == 0x000001, "Wrong alignment on Lobby_StoolSeatMinus01_BP_C_PostToggled");
static_assert(sizeof(Lobby_StoolSeatMinus01_BP_C_PostToggled) == 0x000001, "Wrong size on Lobby_StoolSeatMinus01_BP_C_PostToggled");
static_assert(offsetof(Lobby_StoolSeatMinus01_BP_C_PostToggled, bToggleEnabled) == 0x000000, "Member 'Lobby_StoolSeatMinus01_BP_C_PostToggled::bToggleEnabled' has a wrong offset!");

// Function Lobby_StoolSeat-01_BP.Lobby_StoolSeat-01_BP_C.ExecuteUbergraph_Lobby_StoolSeat-01_BP
// 0x0008 (0x0008 - 0x0000)
struct Lobby_StoolSeatMinus01_BP_C_ExecuteUbergraph_Lobby_StoolSeatMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bToggleEnabled;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_StoolSeatMinus01_BP_C_ExecuteUbergraph_Lobby_StoolSeatMinus01_BP) == 0x000004, "Wrong alignment on Lobby_StoolSeatMinus01_BP_C_ExecuteUbergraph_Lobby_StoolSeatMinus01_BP");
static_assert(sizeof(Lobby_StoolSeatMinus01_BP_C_ExecuteUbergraph_Lobby_StoolSeatMinus01_BP) == 0x000008, "Wrong size on Lobby_StoolSeatMinus01_BP_C_ExecuteUbergraph_Lobby_StoolSeatMinus01_BP");
static_assert(offsetof(Lobby_StoolSeatMinus01_BP_C_ExecuteUbergraph_Lobby_StoolSeatMinus01_BP, EntryPoint) == 0x000000, "Member 'Lobby_StoolSeatMinus01_BP_C_ExecuteUbergraph_Lobby_StoolSeatMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Lobby_StoolSeatMinus01_BP_C_ExecuteUbergraph_Lobby_StoolSeatMinus01_BP, K2Node_Event_bToggleEnabled) == 0x000004, "Member 'Lobby_StoolSeatMinus01_BP_C_ExecuteUbergraph_Lobby_StoolSeatMinus01_BP::K2Node_Event_bToggleEnabled' has a wrong offset!");

}

