#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyCorridorWallNeonLightMinus01

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LobbyCorridorWallNeonLight-01.LobbyCorridorWallNeonLight-01_C
// 0x0020 (0x07C0 - 0x07A0)
class ALobbyCorridorWallNeonLightMinus01_C final : public ARBLight_BP_C
{
public:
	class URBSpotLightComponent*                  RBSpotLight_Static;                                // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBVolumetricFogLightComponent*         RBVolumetricFogLight_Free;                         // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight_Movable;                               // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight_Dual;                                   // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyCorridorWallNeonLight-01_C">();
	}
	static class ALobbyCorridorWallNeonLightMinus01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobbyCorridorWallNeonLightMinus01_C>();
	}
};
static_assert(alignof(ALobbyCorridorWallNeonLightMinus01_C) == 0x000010, "Wrong alignment on ALobbyCorridorWallNeonLightMinus01_C");
static_assert(sizeof(ALobbyCorridorWallNeonLightMinus01_C) == 0x0007C0, "Wrong size on ALobbyCorridorWallNeonLightMinus01_C");
static_assert(offsetof(ALobbyCorridorWallNeonLightMinus01_C, RBSpotLight_Static) == 0x0007A0, "Member 'ALobbyCorridorWallNeonLightMinus01_C::RBSpotLight_Static' has a wrong offset!");
static_assert(offsetof(ALobbyCorridorWallNeonLightMinus01_C, RBVolumetricFogLight_Free) == 0x0007A8, "Member 'ALobbyCorridorWallNeonLightMinus01_C::RBVolumetricFogLight_Free' has a wrong offset!");
static_assert(offsetof(ALobbyCorridorWallNeonLightMinus01_C, RBSpotLight_Movable) == 0x0007B0, "Member 'ALobbyCorridorWallNeonLightMinus01_C::RBSpotLight_Movable' has a wrong offset!");
static_assert(offsetof(ALobbyCorridorWallNeonLightMinus01_C, PointLight_Dual) == 0x0007B8, "Member 'ALobbyCorridorWallNeonLightMinus01_C::PointLight_Dual' has a wrong offset!");

}

