#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lobby_Stationnary_Scientist

#include "Basic.hpp"


namespace SDK::Params
{

// Function Lobby_Stationnary_Scientist.Lobby_Stationnary_Scientist_C.GetFacePoseAsset
// 0x0008 (0x0008 - 0x0000)
struct Lobby_Stationnary_Scientist_C_GetFacePoseAsset final
{
public:
	class UPoseAsset*                             PoseAsset;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lobby_Stationnary_Scientist_C_GetFacePoseAsset) == 0x000008, "Wrong alignment on Lobby_Stationnary_Scientist_C_GetFacePoseAsset");
static_assert(sizeof(Lobby_Stationnary_Scientist_C_GetFacePoseAsset) == 0x000008, "Wrong size on Lobby_Stationnary_Scientist_C_GetFacePoseAsset");
static_assert(offsetof(Lobby_Stationnary_Scientist_C_GetFacePoseAsset, PoseAsset) == 0x000000, "Member 'Lobby_Stationnary_Scientist_C_GetFacePoseAsset::PoseAsset' has a wrong offset!");

// Function Lobby_Stationnary_Scientist.Lobby_Stationnary_Scientist_C.CallToAnExperiment
// 0x0018 (0x0018 - 0x0000)
struct Lobby_Stationnary_Scientist_C_CallToAnExperiment final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScientist_Lobby_AquariumAnnouncer_AnimBP_C* K2Node_DynamicCast_AsScientist_Lobby_Aquarium_Announcer_Anim_BP; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lobby_Stationnary_Scientist_C_CallToAnExperiment) == 0x000008, "Wrong alignment on Lobby_Stationnary_Scientist_C_CallToAnExperiment");
static_assert(sizeof(Lobby_Stationnary_Scientist_C_CallToAnExperiment) == 0x000018, "Wrong size on Lobby_Stationnary_Scientist_C_CallToAnExperiment");
static_assert(offsetof(Lobby_Stationnary_Scientist_C_CallToAnExperiment, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'Lobby_Stationnary_Scientist_C_CallToAnExperiment::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lobby_Stationnary_Scientist_C_CallToAnExperiment, K2Node_DynamicCast_AsScientist_Lobby_Aquarium_Announcer_Anim_BP) == 0x000008, "Member 'Lobby_Stationnary_Scientist_C_CallToAnExperiment::K2Node_DynamicCast_AsScientist_Lobby_Aquarium_Announcer_Anim_BP' has a wrong offset!");
static_assert(offsetof(Lobby_Stationnary_Scientist_C_CallToAnExperiment, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Lobby_Stationnary_Scientist_C_CallToAnExperiment::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

