#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyCellDoorMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DoorBase_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LobbyCellDoor-01_BP.LobbyCellDoor-01_BP_C
// 0x0020 (0x1030 - 0x1010)
class ALobbyCellDoorMinus01_BP_C final : public ADoorBase_BP_C
{
public:
	uint8                                         Pad_3C5E[0x3];                                     // 0x1005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_LobbyCellDoorMinus01_BP_C;          // 0x1008(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bWasOpen;                                          // 0x1010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C5F[0x7];                                     // 0x1011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             DoorInteracted;                                    // 0x1018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnDoorInteract(class ARBPawn* Interactor);
	void ExecuteUbergraph_LobbyCellDoorMinus01_BP(int32 EntryPoint);
	void DoorInteracted__DelegateSignature(bool Param_bOpen);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyCellDoor-01_BP_C">();
	}
	static class ALobbyCellDoorMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobbyCellDoorMinus01_BP_C>();
	}
};
static_assert(alignof(ALobbyCellDoorMinus01_BP_C) == 0x000010, "Wrong alignment on ALobbyCellDoorMinus01_BP_C");
static_assert(sizeof(ALobbyCellDoorMinus01_BP_C) == 0x001030, "Wrong size on ALobbyCellDoorMinus01_BP_C");
static_assert(offsetof(ALobbyCellDoorMinus01_BP_C, UberGraphFrame_LobbyCellDoorMinus01_BP_C) == 0x001008, "Member 'ALobbyCellDoorMinus01_BP_C::UberGraphFrame_LobbyCellDoorMinus01_BP_C' has a wrong offset!");
static_assert(offsetof(ALobbyCellDoorMinus01_BP_C, bWasOpen) == 0x001010, "Member 'ALobbyCellDoorMinus01_BP_C::bWasOpen' has a wrong offset!");
static_assert(offsetof(ALobbyCellDoorMinus01_BP_C, DoorInteracted) == 0x001018, "Member 'ALobbyCellDoorMinus01_BP_C::DoorInteracted' has a wrong offset!");

}

