#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyCellTVMinus01_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function LobbyCellTV-01_BP.LobbyCellTV-01_BP_C.UserConstructionScript
// 0x0058 (0x0058 - 0x0000)
struct LobbyCellTVMinus01_BP_C_UserConstructionScript final
{
public:
	TArray<class APatienRoom_TvChannel_BP_C*>     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0000(0x0010)(ReferenceParm)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B9[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APatienRoom_TvChannel_BP_C*             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33BA[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class APatienRoom_TvChannel_BP_C> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0028(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyCellTVMinus01_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on LobbyCellTVMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(LobbyCellTVMinus01_BP_C_UserConstructionScript) == 0x000058, "Wrong size on LobbyCellTVMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(LobbyCellTVMinus01_BP_C_UserConstructionScript, CallFunc_GetAllActorsOfClass_OutActors) == 0x000000, "Member 'LobbyCellTVMinus01_BP_C_UserConstructionScript::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(LobbyCellTVMinus01_BP_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000010, "Member 'LobbyCellTVMinus01_BP_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCellTVMinus01_BP_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000018, "Member 'LobbyCellTVMinus01_BP_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LobbyCellTVMinus01_BP_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'LobbyCellTVMinus01_BP_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCellTVMinus01_BP_C_UserConstructionScript, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000028, "Member 'LobbyCellTVMinus01_BP_C_UserConstructionScript::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCellTVMinus01_BP_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x000050, "Member 'LobbyCellTVMinus01_BP_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyCellTVMinus01_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'LobbyCellTVMinus01_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LobbyCellTV-01_BP.LobbyCellTV-01_BP_C.ExecuteUbergraph_LobbyCellTV-01_BP
// 0x0004 (0x0004 - 0x0000)
struct LobbyCellTVMinus01_BP_C_ExecuteUbergraph_LobbyCellTVMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyCellTVMinus01_BP_C_ExecuteUbergraph_LobbyCellTVMinus01_BP) == 0x000004, "Wrong alignment on LobbyCellTVMinus01_BP_C_ExecuteUbergraph_LobbyCellTVMinus01_BP");
static_assert(sizeof(LobbyCellTVMinus01_BP_C_ExecuteUbergraph_LobbyCellTVMinus01_BP) == 0x000004, "Wrong size on LobbyCellTVMinus01_BP_C_ExecuteUbergraph_LobbyCellTVMinus01_BP");
static_assert(offsetof(LobbyCellTVMinus01_BP_C_ExecuteUbergraph_LobbyCellTVMinus01_BP, EntryPoint) == 0x000000, "Member 'LobbyCellTVMinus01_BP_C_ExecuteUbergraph_LobbyCellTVMinus01_BP::EntryPoint' has a wrong offset!");

}

