#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyAutomaticDoor_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LobbyAutomaticDoor_BP.LobbyAutomaticDoor_BP_C
// 0x0070 (0x04A0 - 0x0430)
class ALobbyAutomaticDoor_BP_C final : public ARBTriggerable
{
public:
	uint8                                         Pad_33E7[0x8];                                     // 0x0428(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBBoxNavMeshBlockingComponent*         RBBoxNavMeshBlocking;                              // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LightCageMinus04;                                  // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LobbyGridDoorMinus01;                              // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LightCageMinus03;                                  // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DoorOpeningTimeline_NewTrack_0_8C0A2D3F4BE00DE7FA1569BA1F376389; // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DoorOpeningTimeline__Direction_8C0A2D3F4BE00DE7FA1569BA1F376389; // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E8[0x3];                                     // 0x047D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DoorOpeningTimeline;                               // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OpenedRotation;                                    // 0x0488(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               ClosedRotation;                                    // 0x0494(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void DoorOpeningTimeline__FinishedFunc();
	void DoorOpeningTimeline__UpdateFunc();
	void Event_OnTriggered();
	void Event_OnResetStage();
	void ReceiveBeginPlay();
	void Event_OnUntriggered();
	void UpdateDoorOpening();
	void Unlock();
	void ExecuteUbergraph_LobbyAutomaticDoor_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyAutomaticDoor_BP_C">();
	}
	static class ALobbyAutomaticDoor_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobbyAutomaticDoor_BP_C>();
	}
};
static_assert(alignof(ALobbyAutomaticDoor_BP_C) == 0x000010, "Wrong alignment on ALobbyAutomaticDoor_BP_C");
static_assert(sizeof(ALobbyAutomaticDoor_BP_C) == 0x0004A0, "Wrong size on ALobbyAutomaticDoor_BP_C");
static_assert(offsetof(ALobbyAutomaticDoor_BP_C, UberGraphFrame) == 0x000430, "Member 'ALobbyAutomaticDoor_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALobbyAutomaticDoor_BP_C, RBBoxNavMeshBlocking) == 0x000438, "Member 'ALobbyAutomaticDoor_BP_C::RBBoxNavMeshBlocking' has a wrong offset!");
static_assert(offsetof(ALobbyAutomaticDoor_BP_C, StaticMesh1) == 0x000440, "Member 'ALobbyAutomaticDoor_BP_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ALobbyAutomaticDoor_BP_C, StaticMesh) == 0x000448, "Member 'ALobbyAutomaticDoor_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ALobbyAutomaticDoor_BP_C, LightCageMinus04) == 0x000450, "Member 'ALobbyAutomaticDoor_BP_C::LightCageMinus04' has a wrong offset!");
static_assert(offsetof(ALobbyAutomaticDoor_BP_C, LobbyGridDoorMinus01) == 0x000458, "Member 'ALobbyAutomaticDoor_BP_C::LobbyGridDoorMinus01' has a wrong offset!");
static_assert(offsetof(ALobbyAutomaticDoor_BP_C, LightCageMinus03) == 0x000460, "Member 'ALobbyAutomaticDoor_BP_C::LightCageMinus03' has a wrong offset!");
static_assert(offsetof(ALobbyAutomaticDoor_BP_C, Scene) == 0x000468, "Member 'ALobbyAutomaticDoor_BP_C::Scene' has a wrong offset!");
static_assert(offsetof(ALobbyAutomaticDoor_BP_C, DefaultSceneRoot) == 0x000470, "Member 'ALobbyAutomaticDoor_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ALobbyAutomaticDoor_BP_C, DoorOpeningTimeline_NewTrack_0_8C0A2D3F4BE00DE7FA1569BA1F376389) == 0x000478, "Member 'ALobbyAutomaticDoor_BP_C::DoorOpeningTimeline_NewTrack_0_8C0A2D3F4BE00DE7FA1569BA1F376389' has a wrong offset!");
static_assert(offsetof(ALobbyAutomaticDoor_BP_C, DoorOpeningTimeline__Direction_8C0A2D3F4BE00DE7FA1569BA1F376389) == 0x00047C, "Member 'ALobbyAutomaticDoor_BP_C::DoorOpeningTimeline__Direction_8C0A2D3F4BE00DE7FA1569BA1F376389' has a wrong offset!");
static_assert(offsetof(ALobbyAutomaticDoor_BP_C, DoorOpeningTimeline) == 0x000480, "Member 'ALobbyAutomaticDoor_BP_C::DoorOpeningTimeline' has a wrong offset!");
static_assert(offsetof(ALobbyAutomaticDoor_BP_C, OpenedRotation) == 0x000488, "Member 'ALobbyAutomaticDoor_BP_C::OpenedRotation' has a wrong offset!");
static_assert(offsetof(ALobbyAutomaticDoor_BP_C, ClosedRotation) == 0x000494, "Member 'ALobbyAutomaticDoor_BP_C::ClosedRotation' has a wrong offset!");

}

