#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyArmWrestlingSpectatorStation

#include "Basic.hpp"


namespace SDK::Params
{

// Function LobbyArmWrestlingSpectatorStation.LobbyArmWrestlingSpectatorStation_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct LobbyArmWrestlingSpectatorStation_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyArmWrestlingSpectatorStation_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on LobbyArmWrestlingSpectatorStation_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(LobbyArmWrestlingSpectatorStation_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on LobbyArmWrestlingSpectatorStation_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(LobbyArmWrestlingSpectatorStation_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'LobbyArmWrestlingSpectatorStation_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

// Function LobbyArmWrestlingSpectatorStation.LobbyArmWrestlingSpectatorStation_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct LobbyArmWrestlingSpectatorStation_C_CustomEvent_0 final
{
public:
	class ARBPawn*                                PawnInteracting;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyArmWrestlingSpectatorStation_C_CustomEvent_0) == 0x000008, "Wrong alignment on LobbyArmWrestlingSpectatorStation_C_CustomEvent_0");
static_assert(sizeof(LobbyArmWrestlingSpectatorStation_C_CustomEvent_0) == 0x000008, "Wrong size on LobbyArmWrestlingSpectatorStation_C_CustomEvent_0");
static_assert(offsetof(LobbyArmWrestlingSpectatorStation_C_CustomEvent_0, PawnInteracting) == 0x000000, "Member 'LobbyArmWrestlingSpectatorStation_C_CustomEvent_0::PawnInteracting' has a wrong offset!");

// Function LobbyArmWrestlingSpectatorStation.LobbyArmWrestlingSpectatorStation_C.ExecuteUbergraph_LobbyArmWrestlingSpectatorStation
// 0x0040 (0x0040 - 0x0000)
struct LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C25[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_CustomEvent_pawnInteracting;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ARBPawn* PawnInteracting)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class ARBPawn*                                CallFunc_GetPawnInteracting_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGhostAnimInstance*                   CallFunc_GetGhostAnimBP_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArmWrestleSpectator_Ghost_AnimBP_C*    K2Node_DynamicCast_AsArm_Wrestle_Spectator_Ghost_Anim_BP; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation) == 0x000008, "Wrong alignment on LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation");
static_assert(sizeof(LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation) == 0x000040, "Wrong size on LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation");
static_assert(offsetof(LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation, EntryPoint) == 0x000000, "Member 'LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation, K2Node_CustomEvent_pawnInteracting) == 0x000008, "Member 'LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation::K2Node_CustomEvent_pawnInteracting' has a wrong offset!");
static_assert(offsetof(LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation, CallFunc_GetPawnInteracting_ReturnValue) == 0x000020, "Member 'LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation::CallFunc_GetPawnInteracting_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation, CallFunc_GetGhostAnimBP_ReturnValue) == 0x000028, "Member 'LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation::CallFunc_GetGhostAnimBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation, K2Node_DynamicCast_AsArm_Wrestle_Spectator_Ghost_Anim_BP) == 0x000030, "Member 'LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation::K2Node_DynamicCast_AsArm_Wrestle_Spectator_Ghost_Anim_BP' has a wrong offset!");
static_assert(offsetof(LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'LobbyArmWrestlingSpectatorStation_C_ExecuteUbergraph_LobbyArmWrestlingSpectatorStation::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

