#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyCellDoorMinus01_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function LobbyCellDoor-01_BP.LobbyCellDoor-01_BP_C.BP_OnDoorInteract
// 0x0008 (0x0008 - 0x0000)
struct LobbyCellDoorMinus01_BP_C_BP_OnDoorInteract final
{
public:
	class ARBPawn*                                Interactor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyCellDoorMinus01_BP_C_BP_OnDoorInteract) == 0x000008, "Wrong alignment on LobbyCellDoorMinus01_BP_C_BP_OnDoorInteract");
static_assert(sizeof(LobbyCellDoorMinus01_BP_C_BP_OnDoorInteract) == 0x000008, "Wrong size on LobbyCellDoorMinus01_BP_C_BP_OnDoorInteract");
static_assert(offsetof(LobbyCellDoorMinus01_BP_C_BP_OnDoorInteract, Interactor) == 0x000000, "Member 'LobbyCellDoorMinus01_BP_C_BP_OnDoorInteract::Interactor' has a wrong offset!");

// Function LobbyCellDoor-01_BP.LobbyCellDoor-01_BP_C.ExecuteUbergraph_LobbyCellDoor-01_BP
// 0x0010 (0x0010 - 0x0000)
struct LobbyCellDoorMinus01_BP_C_ExecuteUbergraph_LobbyCellDoorMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C60[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_Event_interactor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyCellDoorMinus01_BP_C_ExecuteUbergraph_LobbyCellDoorMinus01_BP) == 0x000008, "Wrong alignment on LobbyCellDoorMinus01_BP_C_ExecuteUbergraph_LobbyCellDoorMinus01_BP");
static_assert(sizeof(LobbyCellDoorMinus01_BP_C_ExecuteUbergraph_LobbyCellDoorMinus01_BP) == 0x000010, "Wrong size on LobbyCellDoorMinus01_BP_C_ExecuteUbergraph_LobbyCellDoorMinus01_BP");
static_assert(offsetof(LobbyCellDoorMinus01_BP_C_ExecuteUbergraph_LobbyCellDoorMinus01_BP, EntryPoint) == 0x000000, "Member 'LobbyCellDoorMinus01_BP_C_ExecuteUbergraph_LobbyCellDoorMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbyCellDoorMinus01_BP_C_ExecuteUbergraph_LobbyCellDoorMinus01_BP, K2Node_Event_interactor) == 0x000008, "Member 'LobbyCellDoorMinus01_BP_C_ExecuteUbergraph_LobbyCellDoorMinus01_BP::K2Node_Event_interactor' has a wrong offset!");

// Function LobbyCellDoor-01_BP.LobbyCellDoor-01_BP_C.DoorInteracted__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct LobbyCellDoorMinus01_BP_C_DoorInteracted__DelegateSignature final
{
public:
	bool                                          Param_bOpen;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyCellDoorMinus01_BP_C_DoorInteracted__DelegateSignature) == 0x000001, "Wrong alignment on LobbyCellDoorMinus01_BP_C_DoorInteracted__DelegateSignature");
static_assert(sizeof(LobbyCellDoorMinus01_BP_C_DoorInteracted__DelegateSignature) == 0x000001, "Wrong size on LobbyCellDoorMinus01_BP_C_DoorInteracted__DelegateSignature");
static_assert(offsetof(LobbyCellDoorMinus01_BP_C_DoorInteracted__DelegateSignature, Param_bOpen) == 0x000000, "Member 'LobbyCellDoorMinus01_BP_C_DoorInteracted__DelegateSignature::Param_bOpen' has a wrong offset!");

}

