#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyConcreteWallMinus01_BP

#include "Basic.hpp"

#include "GrayBoxMat_ENU_structs.hpp"
#include "ModuleMeshData_structs.hpp"
#include "WallMinus01_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LobbyConcreteWall-01_BP.LobbyConcreteWall-01_BP_C
// 0x0010 (0x05C0 - 0x05B0)
class ALobbyConcreteWallMinus01_BP_C final : public AWallMinus01_BP_C
{
public:
	EGrayBoxMat_ENU                               Materials;                                         // 0x05AB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOverwriteMaterials;                             // 0x05AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseAlternativeBottomMoldings;                      // 0x05AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_392C[0x2];                                     // 0x05AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModuleMeshData>                AlternativeMoldings;                               // 0x05B0(0x0010)(Edit, BlueprintVisible)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyConcreteWall-01_BP_C">();
	}
	static class ALobbyConcreteWallMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobbyConcreteWallMinus01_BP_C>();
	}
};
static_assert(alignof(ALobbyConcreteWallMinus01_BP_C) == 0x000008, "Wrong alignment on ALobbyConcreteWallMinus01_BP_C");
static_assert(sizeof(ALobbyConcreteWallMinus01_BP_C) == 0x0005C0, "Wrong size on ALobbyConcreteWallMinus01_BP_C");
static_assert(offsetof(ALobbyConcreteWallMinus01_BP_C, Materials) == 0x0005AB, "Member 'ALobbyConcreteWallMinus01_BP_C::Materials' has a wrong offset!");
static_assert(offsetof(ALobbyConcreteWallMinus01_BP_C, UseOverwriteMaterials) == 0x0005AC, "Member 'ALobbyConcreteWallMinus01_BP_C::UseOverwriteMaterials' has a wrong offset!");
static_assert(offsetof(ALobbyConcreteWallMinus01_BP_C, UseAlternativeBottomMoldings) == 0x0005AD, "Member 'ALobbyConcreteWallMinus01_BP_C::UseAlternativeBottomMoldings' has a wrong offset!");
static_assert(offsetof(ALobbyConcreteWallMinus01_BP_C, AlternativeMoldings) == 0x0005B0, "Member 'ALobbyConcreteWallMinus01_BP_C::AlternativeMoldings' has a wrong offset!");

}

