#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenuTransition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenuTransition.MainMenuTransition_C
// 0x0038 (0x02D0 - 0x0298)
class UMainMenuTransition_C final : public URBMenuTransition
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 VideoTransition;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsTransitionOut;                                   // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F4E[0x7];                                     // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Material;                                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BeginTime;                                         // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeSpeed;                                         // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTransitioning;                                   // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F4F[0x3];                                     // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TransitionInSpeed;                                 // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionOutSpeed;                                // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenuTransition(int32 EntryPoint);
	void Construct();
	void Play(float Fade, float Param_FadeSpeed);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Event_TransitionOut();
	void Event_TransitionIn();
	void UpdateFade(float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenuTransition_C">();
	}
	static class UMainMenuTransition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenuTransition_C>();
	}
};
static_assert(alignof(UMainMenuTransition_C) == 0x000008, "Wrong alignment on UMainMenuTransition_C");
static_assert(sizeof(UMainMenuTransition_C) == 0x0002D0, "Wrong size on UMainMenuTransition_C");
static_assert(offsetof(UMainMenuTransition_C, UberGraphFrame) == 0x000298, "Member 'UMainMenuTransition_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenuTransition_C, VideoTransition) == 0x0002A0, "Member 'UMainMenuTransition_C::VideoTransition' has a wrong offset!");
static_assert(offsetof(UMainMenuTransition_C, IsTransitionOut) == 0x0002A8, "Member 'UMainMenuTransition_C::IsTransitionOut' has a wrong offset!");
static_assert(offsetof(UMainMenuTransition_C, Material) == 0x0002B0, "Member 'UMainMenuTransition_C::Material' has a wrong offset!");
static_assert(offsetof(UMainMenuTransition_C, BeginTime) == 0x0002B8, "Member 'UMainMenuTransition_C::BeginTime' has a wrong offset!");
static_assert(offsetof(UMainMenuTransition_C, FadeSpeed) == 0x0002BC, "Member 'UMainMenuTransition_C::FadeSpeed' has a wrong offset!");
static_assert(offsetof(UMainMenuTransition_C, IsTransitioning) == 0x0002C0, "Member 'UMainMenuTransition_C::IsTransitioning' has a wrong offset!");
static_assert(offsetof(UMainMenuTransition_C, TransitionInSpeed) == 0x0002C4, "Member 'UMainMenuTransition_C::TransitionInSpeed' has a wrong offset!");
static_assert(offsetof(UMainMenuTransition_C, TransitionOutSpeed) == 0x0002C8, "Member 'UMainMenuTransition_C::TransitionOutSpeed' has a wrong offset!");

}

