#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshPopulate_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "StaticmeshArray_Stuc_structs.hpp"


namespace SDK::Params
{

// Function MeshPopulate_BP.MeshPopulate_BP_C.UserConstructionScript
// 0x0050 (0x0050 - 0x0000)
struct MeshPopulate_BP_C_UserConstructionScript final
{
public:
	struct FVector                                _NewSize;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _NewYSizeLeft;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _ySizeLeft;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _MeshSize;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _SizeLeft;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateSurface_LastLocation;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes;          // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MeshPopulate_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on MeshPopulate_BP_C_UserConstructionScript");
static_assert(sizeof(MeshPopulate_BP_C_UserConstructionScript) == 0x000050, "Wrong size on MeshPopulate_BP_C_UserConstructionScript");
static_assert(offsetof(MeshPopulate_BP_C_UserConstructionScript, _NewSize) == 0x000000, "Member 'MeshPopulate_BP_C_UserConstructionScript::_NewSize' has a wrong offset!");
static_assert(offsetof(MeshPopulate_BP_C_UserConstructionScript, _NewYSizeLeft) == 0x00000C, "Member 'MeshPopulate_BP_C_UserConstructionScript::_NewYSizeLeft' has a wrong offset!");
static_assert(offsetof(MeshPopulate_BP_C_UserConstructionScript, _ySizeLeft) == 0x000010, "Member 'MeshPopulate_BP_C_UserConstructionScript::_ySizeLeft' has a wrong offset!");
static_assert(offsetof(MeshPopulate_BP_C_UserConstructionScript, _MeshSize) == 0x000014, "Member 'MeshPopulate_BP_C_UserConstructionScript::_MeshSize' has a wrong offset!");
static_assert(offsetof(MeshPopulate_BP_C_UserConstructionScript, _SizeLeft) == 0x000018, "Member 'MeshPopulate_BP_C_UserConstructionScript::_SizeLeft' has a wrong offset!");
static_assert(offsetof(MeshPopulate_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation) == 0x00001C, "Member 'MeshPopulate_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation' has a wrong offset!");
static_assert(offsetof(MeshPopulate_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize) == 0x000028, "Member 'MeshPopulate_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize' has a wrong offset!");
static_assert(offsetof(MeshPopulate_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale) == 0x00002C, "Member 'MeshPopulate_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale' has a wrong offset!");
static_assert(offsetof(MeshPopulate_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes) == 0x000030, "Member 'MeshPopulate_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes' has a wrong offset!");
static_assert(offsetof(MeshPopulate_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount) == 0x000040, "Member 'MeshPopulate_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount' has a wrong offset!");
static_assert(offsetof(MeshPopulate_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize) == 0x000044, "Member 'MeshPopulate_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize' has a wrong offset!");
static_assert(offsetof(MeshPopulate_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale) == 0x000048, "Member 'MeshPopulate_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale' has a wrong offset!");

}

