#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NarrativeScreenBase_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.ResetScreenBreakEffects
// 0x0001 (0x0001 - 0x0000)
struct NarrativeScreenBase_BP_C_ResetScreenBreakEffects final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NarrativeScreenBase_BP_C_ResetScreenBreakEffects) == 0x000001, "Wrong alignment on NarrativeScreenBase_BP_C_ResetScreenBreakEffects");
static_assert(sizeof(NarrativeScreenBase_BP_C_ResetScreenBreakEffects) == 0x000001, "Wrong size on NarrativeScreenBase_BP_C_ResetScreenBreakEffects");
static_assert(offsetof(NarrativeScreenBase_BP_C_ResetScreenBreakEffects, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'NarrativeScreenBase_BP_C_ResetScreenBreakEffects::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.Update Screens MDD
// 0x0060 (0x0060 - 0x0000)
struct NarrativeScreenBase_BP_C_Update_Screens_MDD final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31E1[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorLinearColor_ReturnValue; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31E2[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NarrativeScreenBase_BP_C_Update_Screens_MDD) == 0x000010, "Wrong alignment on NarrativeScreenBase_BP_C_Update_Screens_MDD");
static_assert(sizeof(NarrativeScreenBase_BP_C_Update_Screens_MDD) == 0x000060, "Wrong size on NarrativeScreenBase_BP_C_Update_Screens_MDD");
static_assert(offsetof(NarrativeScreenBase_BP_C_Update_Screens_MDD, Temp_int_Array_Index_Variable) == 0x000000, "Member 'NarrativeScreenBase_BP_C_Update_Screens_MDD::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_Update_Screens_MDD, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'NarrativeScreenBase_BP_C_Update_Screens_MDD::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_Update_Screens_MDD, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'NarrativeScreenBase_BP_C_Update_Screens_MDD::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_Update_Screens_MDD, K2Node_MakeStruct_LinearColor) == 0x00000C, "Member 'NarrativeScreenBase_BP_C_Update_Screens_MDD::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_Update_Screens_MDD, CallFunc_MakeVector4_ReturnValue) == 0x000020, "Member 'NarrativeScreenBase_BP_C_Update_Screens_MDD::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_Update_Screens_MDD, CallFunc_Multiply_LinearColorLinearColor_ReturnValue) == 0x000030, "Member 'NarrativeScreenBase_BP_C_Update_Screens_MDD::CallFunc_Multiply_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_Update_Screens_MDD, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'NarrativeScreenBase_BP_C_Update_Screens_MDD::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_Update_Screens_MDD, CallFunc_Array_Get_Item) == 0x000048, "Member 'NarrativeScreenBase_BP_C_Update_Screens_MDD::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_Update_Screens_MDD, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'NarrativeScreenBase_BP_C_Update_Screens_MDD::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.TurnOnLight
// 0x0028 (0x0028 - 0x0000)
struct NarrativeScreenBase_BP_C_TurnOnLight final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31E3[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31E4[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALight*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NarrativeScreenBase_BP_C_TurnOnLight) == 0x000008, "Wrong alignment on NarrativeScreenBase_BP_C_TurnOnLight");
static_assert(sizeof(NarrativeScreenBase_BP_C_TurnOnLight) == 0x000028, "Wrong size on NarrativeScreenBase_BP_C_TurnOnLight");
static_assert(offsetof(NarrativeScreenBase_BP_C_TurnOnLight, Condition) == 0x000000, "Member 'NarrativeScreenBase_BP_C_TurnOnLight::Condition' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_TurnOnLight, Temp_int_Array_Index_Variable) == 0x000004, "Member 'NarrativeScreenBase_BP_C_TurnOnLight::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_TurnOnLight, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'NarrativeScreenBase_BP_C_TurnOnLight::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_TurnOnLight, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'NarrativeScreenBase_BP_C_TurnOnLight::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_TurnOnLight, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'NarrativeScreenBase_BP_C_TurnOnLight::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_TurnOnLight, CallFunc_Array_Get_Item) == 0x000018, "Member 'NarrativeScreenBase_BP_C_TurnOnLight::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_TurnOnLight, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'NarrativeScreenBase_BP_C_TurnOnLight::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_TurnOnLight, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'NarrativeScreenBase_BP_C_TurnOnLight::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.SpawnLight
// 0x01D0 (0x01D0 - 0x0000)
struct NarrativeScreenBase_BP_C_SpawnLight final
{
public:
	class ASpotLight*                             NewSpotLight;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31E5[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31E6[0xC];                                     // 0x0064(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASpotLight*                             CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorLocalRotation_SweepHitResult;  // 0x00B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorLocalOffset_SweepHitResult;    // 0x013C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(NarrativeScreenBase_BP_C_SpawnLight) == 0x000010, "Wrong alignment on NarrativeScreenBase_BP_C_SpawnLight");
static_assert(sizeof(NarrativeScreenBase_BP_C_SpawnLight) == 0x0001D0, "Wrong size on NarrativeScreenBase_BP_C_SpawnLight");
static_assert(offsetof(NarrativeScreenBase_BP_C_SpawnLight, NewSpotLight) == 0x000000, "Member 'NarrativeScreenBase_BP_C_SpawnLight::NewSpotLight' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SpawnLight, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'NarrativeScreenBase_BP_C_SpawnLight::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SpawnLight, CallFunc_BreakTransform_Location) == 0x000040, "Member 'NarrativeScreenBase_BP_C_SpawnLight::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SpawnLight, CallFunc_BreakTransform_Rotation) == 0x00004C, "Member 'NarrativeScreenBase_BP_C_SpawnLight::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SpawnLight, CallFunc_BreakTransform_Scale) == 0x000058, "Member 'NarrativeScreenBase_BP_C_SpawnLight::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SpawnLight, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'NarrativeScreenBase_BP_C_SpawnLight::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SpawnLight, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'NarrativeScreenBase_BP_C_SpawnLight::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SpawnLight, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A8, "Member 'NarrativeScreenBase_BP_C_SpawnLight::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SpawnLight, CallFunc_K2_AddActorLocalRotation_SweepHitResult) == 0x0000B0, "Member 'NarrativeScreenBase_BP_C_SpawnLight::CallFunc_K2_AddActorLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SpawnLight, CallFunc_Array_Add_ReturnValue) == 0x000138, "Member 'NarrativeScreenBase_BP_C_SpawnLight::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SpawnLight, CallFunc_K2_AddActorLocalOffset_SweepHitResult) == 0x00013C, "Member 'NarrativeScreenBase_BP_C_SpawnLight::CallFunc_K2_AddActorLocalOffset_SweepHitResult' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.LinkTextureToChannel
// 0x0010 (0x0010 - 0x0000)
struct NarrativeScreenBase_BP_C_LinkTextureToChannel final
{
public:
	class ATvChannel_BP_C*                        K2Node_DynamicCast_AsTv_Channel_BP;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NarrativeScreenBase_BP_C_LinkTextureToChannel) == 0x000008, "Wrong alignment on NarrativeScreenBase_BP_C_LinkTextureToChannel");
static_assert(sizeof(NarrativeScreenBase_BP_C_LinkTextureToChannel) == 0x000010, "Wrong size on NarrativeScreenBase_BP_C_LinkTextureToChannel");
static_assert(offsetof(NarrativeScreenBase_BP_C_LinkTextureToChannel, K2Node_DynamicCast_AsTv_Channel_BP) == 0x000000, "Member 'NarrativeScreenBase_BP_C_LinkTextureToChannel::K2Node_DynamicCast_AsTv_Channel_BP' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_LinkTextureToChannel, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'NarrativeScreenBase_BP_C_LinkTextureToChannel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_LinkTextureToChannel, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'NarrativeScreenBase_BP_C_LinkTextureToChannel::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.UpdateTVOn
// 0x0058 (0x0058 - 0x0000)
struct NarrativeScreenBase_BP_C_UpdateTVOn final
{
public:
	bool                                          Force;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31E7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue;      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NarrativeScreenBase_BP_C_UpdateTVOn) == 0x000008, "Wrong alignment on NarrativeScreenBase_BP_C_UpdateTVOn");
static_assert(sizeof(NarrativeScreenBase_BP_C_UpdateTVOn) == 0x000058, "Wrong size on NarrativeScreenBase_BP_C_UpdateTVOn");
static_assert(offsetof(NarrativeScreenBase_BP_C_UpdateTVOn, Force) == 0x000000, "Member 'NarrativeScreenBase_BP_C_UpdateTVOn::Force' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UpdateTVOn, Temp_struct_Variable) == 0x000008, "Member 'NarrativeScreenBase_BP_C_UpdateTVOn::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UpdateTVOn, Temp_delegate_Variable) == 0x000018, "Member 'NarrativeScreenBase_BP_C_UpdateTVOn::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UpdateTVOn, Temp_struct_Variable_1) == 0x000028, "Member 'NarrativeScreenBase_BP_C_UpdateTVOn::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UpdateTVOn, Temp_delegate_Variable_1) == 0x000038, "Member 'NarrativeScreenBase_BP_C_UpdateTVOn::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UpdateTVOn, CallFunc_PostAkEvent_ReturnValue) == 0x000048, "Member 'NarrativeScreenBase_BP_C_UpdateTVOn::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UpdateTVOn, CallFunc_PostAkEvent_ReturnValue_1) == 0x00004C, "Member 'NarrativeScreenBase_BP_C_UpdateTVOn::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UpdateTVOn, CallFunc_PlayLoopingSoundOnActor_ReturnValue) == 0x000050, "Member 'NarrativeScreenBase_BP_C_UpdateTVOn::CallFunc_PlayLoopingSoundOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UpdateTVOn, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000054, "Member 'NarrativeScreenBase_BP_C_UpdateTVOn::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UpdateTVOn, CallFunc_BooleanOR_ReturnValue) == 0x000055, "Member 'NarrativeScreenBase_BP_C_UpdateTVOn::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.SetScreenMaterial
// 0x0028 (0x0028 - 0x0000)
struct NarrativeScreenBase_BP_C_SetScreenMaterial final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NarrativeScreenBase_BP_C_SetScreenMaterial) == 0x000008, "Wrong alignment on NarrativeScreenBase_BP_C_SetScreenMaterial");
static_assert(sizeof(NarrativeScreenBase_BP_C_SetScreenMaterial) == 0x000028, "Wrong size on NarrativeScreenBase_BP_C_SetScreenMaterial");
static_assert(offsetof(NarrativeScreenBase_BP_C_SetScreenMaterial, Material) == 0x000000, "Member 'NarrativeScreenBase_BP_C_SetScreenMaterial::Material' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SetScreenMaterial, Temp_int_Array_Index_Variable) == 0x000008, "Member 'NarrativeScreenBase_BP_C_SetScreenMaterial::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SetScreenMaterial, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'NarrativeScreenBase_BP_C_SetScreenMaterial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SetScreenMaterial, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'NarrativeScreenBase_BP_C_SetScreenMaterial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SetScreenMaterial, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'NarrativeScreenBase_BP_C_SetScreenMaterial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SetScreenMaterial, CallFunc_Array_Get_Item) == 0x000018, "Member 'NarrativeScreenBase_BP_C_SetScreenMaterial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_SetScreenMaterial, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'NarrativeScreenBase_BP_C_SetScreenMaterial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.UserConstructionScript
// 0x0070 (0x0070 - 0x0000)
struct NarrativeScreenBase_BP_C_UserConstructionScript final
{
public:
	class ALight*                                 NewLocalVar_0;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31E8[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTimelineComponent*>             K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31E9[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31EA[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31EB[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NarrativeScreenBase_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on NarrativeScreenBase_BP_C_UserConstructionScript");
static_assert(sizeof(NarrativeScreenBase_BP_C_UserConstructionScript) == 0x000070, "Wrong size on NarrativeScreenBase_BP_C_UserConstructionScript");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, NewLocalVar_0) == 0x000000, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000008, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000010, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, CallFunc_SelectFloat_ReturnValue) == 0x000024, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000030, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000040, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000048, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, CallFunc_GetObjectName_ReturnValue) == 0x000050, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, CallFunc_FindSubstring_ReturnValue) == 0x000064, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000069, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'NarrativeScreenBase_BP_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.UpdateTVOnVisuals_Internal
// 0x0001 (0x0001 - 0x0000)
struct NarrativeScreenBase_BP_C_UpdateTVOnVisuals_Internal final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NarrativeScreenBase_BP_C_UpdateTVOnVisuals_Internal) == 0x000001, "Wrong alignment on NarrativeScreenBase_BP_C_UpdateTVOnVisuals_Internal");
static_assert(sizeof(NarrativeScreenBase_BP_C_UpdateTVOnVisuals_Internal) == 0x000001, "Wrong size on NarrativeScreenBase_BP_C_UpdateTVOnVisuals_Internal");
static_assert(offsetof(NarrativeScreenBase_BP_C_UpdateTVOnVisuals_Internal, IsOn) == 0x000000, "Member 'NarrativeScreenBase_BP_C_UpdateTVOnVisuals_Internal::IsOn' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.Event_OnDamageCountChanged
// 0x0004 (0x0004 - 0x0000)
struct NarrativeScreenBase_BP_C_Event_OnDamageCountChanged final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NarrativeScreenBase_BP_C_Event_OnDamageCountChanged) == 0x000004, "Wrong alignment on NarrativeScreenBase_BP_C_Event_OnDamageCountChanged");
static_assert(sizeof(NarrativeScreenBase_BP_C_Event_OnDamageCountChanged) == 0x000004, "Wrong size on NarrativeScreenBase_BP_C_Event_OnDamageCountChanged");
static_assert(offsetof(NarrativeScreenBase_BP_C_Event_OnDamageCountChanged, Count) == 0x000000, "Member 'NarrativeScreenBase_BP_C_Event_OnDamageCountChanged::Count' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.BndEvt__NarrativeScreenBase_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct NarrativeScreenBase_BP_C_BndEvt__NarrativeScreenBase_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature final
{
public:
	class URBDamageableComponent*                 Param_DamageableComponent;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NarrativeScreenBase_BP_C_BndEvt__NarrativeScreenBase_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature) == 0x000008, "Wrong alignment on NarrativeScreenBase_BP_C_BndEvt__NarrativeScreenBase_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature");
static_assert(sizeof(NarrativeScreenBase_BP_C_BndEvt__NarrativeScreenBase_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature) == 0x000008, "Wrong size on NarrativeScreenBase_BP_C_BndEvt__NarrativeScreenBase_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature");
static_assert(offsetof(NarrativeScreenBase_BP_C_BndEvt__NarrativeScreenBase_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature, Param_DamageableComponent) == 0x000000, "Member 'NarrativeScreenBase_BP_C_BndEvt__NarrativeScreenBase_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature::Param_DamageableComponent' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.PostToggled
// 0x0001 (0x0001 - 0x0000)
struct NarrativeScreenBase_BP_C_PostToggled final
{
public:
	bool                                          bToggleEnabled;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NarrativeScreenBase_BP_C_PostToggled) == 0x000001, "Wrong alignment on NarrativeScreenBase_BP_C_PostToggled");
static_assert(sizeof(NarrativeScreenBase_BP_C_PostToggled) == 0x000001, "Wrong size on NarrativeScreenBase_BP_C_PostToggled");
static_assert(offsetof(NarrativeScreenBase_BP_C_PostToggled, bToggleEnabled) == 0x000000, "Member 'NarrativeScreenBase_BP_C_PostToggled::bToggleEnabled' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.ExecuteUbergraph_NarrativeScreenBase_BP
// 0x0050 (0x0050 - 0x0000)
struct NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsOn;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31EC[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31ED[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31EE[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31EF[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_count;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31F0[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URBDamageableComponent*                 K2Node_ComponentBoundEvent_DamageableComponent;    // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AllowScreenExplosion_bAllowScreenExplosion; // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDestroyed_ReturnValue;                  // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bToggleEnabled;                       // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP) == 0x000008, "Wrong alignment on NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP");
static_assert(sizeof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP) == 0x000050, "Wrong size on NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, EntryPoint) == 0x000000, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, K2Node_CustomEvent_IsOn) == 0x000005, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::K2Node_CustomEvent_IsOn' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_PlayLoopingSoundOnActor_ReturnValue) == 0x00000C, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_PlayLoopingSoundOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_HasAuthority_ReturnValue_1) == 0x000010, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_Lerp_ReturnValue_1) == 0x000014, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_RandomFloatInRange_ReturnValue) == 0x00001C, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000020, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_RandomBool_ReturnValue) == 0x000024, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00002C, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_SelectFloat_ReturnValue) == 0x000030, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000034, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, K2Node_Event_count) == 0x000038, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::K2Node_Event_count' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003C, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00003D, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, K2Node_ComponentBoundEvent_DamageableComponent) == 0x000040, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::K2Node_ComponentBoundEvent_DamageableComponent' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000048, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000049, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_AllowScreenExplosion_bAllowScreenExplosion) == 0x00004A, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_AllowScreenExplosion_bAllowScreenExplosion' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, CallFunc_IsDestroyed_ReturnValue) == 0x00004B, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::CallFunc_IsDestroyed_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP, K2Node_Event_bToggleEnabled) == 0x00004C, "Member 'NarrativeScreenBase_BP_C_ExecuteUbergraph_NarrativeScreenBase_BP::K2Node_Event_bToggleEnabled' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.RefreshMultiPositionGroup
// 0x0020 (0x0020 - 0x0000)
struct NarrativeScreenBase_BP_C_RefreshMultiPositionGroup final
{
public:
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31F1[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NarrativeScreenBase_BP_C_RefreshMultiPositionGroup) == 0x000008, "Wrong alignment on NarrativeScreenBase_BP_C_RefreshMultiPositionGroup");
static_assert(sizeof(NarrativeScreenBase_BP_C_RefreshMultiPositionGroup) == 0x000020, "Wrong size on NarrativeScreenBase_BP_C_RefreshMultiPositionGroup");
static_assert(offsetof(NarrativeScreenBase_BP_C_RefreshMultiPositionGroup, CallFunc_GetObjectName_ReturnValue) == 0x000000, "Member 'NarrativeScreenBase_BP_C_RefreshMultiPositionGroup::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_RefreshMultiPositionGroup, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'NarrativeScreenBase_BP_C_RefreshMultiPositionGroup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_RefreshMultiPositionGroup, CallFunc_Conv_StringToName_ReturnValue) == 0x000014, "Member 'NarrativeScreenBase_BP_C_RefreshMultiPositionGroup::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.SnapScreenMeshesVisibility
// 0x0001 (0x0001 - 0x0000)
struct NarrativeScreenBase_BP_C_SnapScreenMeshesVisibility final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NarrativeScreenBase_BP_C_SnapScreenMeshesVisibility) == 0x000001, "Wrong alignment on NarrativeScreenBase_BP_C_SnapScreenMeshesVisibility");
static_assert(sizeof(NarrativeScreenBase_BP_C_SnapScreenMeshesVisibility) == 0x000001, "Wrong size on NarrativeScreenBase_BP_C_SnapScreenMeshesVisibility");
static_assert(offsetof(NarrativeScreenBase_BP_C_SnapScreenMeshesVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'NarrativeScreenBase_BP_C_SnapScreenMeshesVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.BreakOnServer
// 0x0001 (0x0001 - 0x0000)
struct NarrativeScreenBase_BP_C_BreakOnServer final
{
public:
	bool                                          CallFunc_AllowScreenExplosion_bAllowScreenExplosion; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NarrativeScreenBase_BP_C_BreakOnServer) == 0x000001, "Wrong alignment on NarrativeScreenBase_BP_C_BreakOnServer");
static_assert(sizeof(NarrativeScreenBase_BP_C_BreakOnServer) == 0x000001, "Wrong size on NarrativeScreenBase_BP_C_BreakOnServer");
static_assert(offsetof(NarrativeScreenBase_BP_C_BreakOnServer, CallFunc_AllowScreenExplosion_bAllowScreenExplosion) == 0x000000, "Member 'NarrativeScreenBase_BP_C_BreakOnServer::CallFunc_AllowScreenExplosion_bAllowScreenExplosion' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.OnRep_bScreenCracked
// 0x0038 (0x0038 - 0x0000)
struct NarrativeScreenBase_BP_C_OnRep_bScreenCracked final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31F2[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NarrativeScreenBase_BP_C_OnRep_bScreenCracked) == 0x000008, "Wrong alignment on NarrativeScreenBase_BP_C_OnRep_bScreenCracked");
static_assert(sizeof(NarrativeScreenBase_BP_C_OnRep_bScreenCracked) == 0x000038, "Wrong size on NarrativeScreenBase_BP_C_OnRep_bScreenCracked");
static_assert(offsetof(NarrativeScreenBase_BP_C_OnRep_bScreenCracked, Temp_delegate_Variable) == 0x000000, "Member 'NarrativeScreenBase_BP_C_OnRep_bScreenCracked::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_OnRep_bScreenCracked, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'NarrativeScreenBase_BP_C_OnRep_bScreenCracked::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_OnRep_bScreenCracked, Temp_struct_Variable) == 0x000018, "Member 'NarrativeScreenBase_BP_C_OnRep_bScreenCracked::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_OnRep_bScreenCracked, CallFunc_PostAkEvent_ReturnValue) == 0x000028, "Member 'NarrativeScreenBase_BP_C_OnRep_bScreenCracked::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_OnRep_bScreenCracked, CallFunc_SelectFloat_ReturnValue) == 0x00002C, "Member 'NarrativeScreenBase_BP_C_OnRep_bScreenCracked::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_OnRep_bScreenCracked, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'NarrativeScreenBase_BP_C_OnRep_bScreenCracked::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.OnRep_bScreenExploded
// 0x0030 (0x0030 - 0x0000)
struct NarrativeScreenBase_BP_C_OnRep_bScreenExploded final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31F3[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NarrativeScreenBase_BP_C_OnRep_bScreenExploded) == 0x000008, "Wrong alignment on NarrativeScreenBase_BP_C_OnRep_bScreenExploded");
static_assert(sizeof(NarrativeScreenBase_BP_C_OnRep_bScreenExploded) == 0x000030, "Wrong size on NarrativeScreenBase_BP_C_OnRep_bScreenExploded");
static_assert(offsetof(NarrativeScreenBase_BP_C_OnRep_bScreenExploded, Temp_delegate_Variable) == 0x000000, "Member 'NarrativeScreenBase_BP_C_OnRep_bScreenExploded::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_OnRep_bScreenExploded, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'NarrativeScreenBase_BP_C_OnRep_bScreenExploded::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_OnRep_bScreenExploded, Temp_struct_Variable) == 0x000018, "Member 'NarrativeScreenBase_BP_C_OnRep_bScreenExploded::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_OnRep_bScreenExploded, CallFunc_PostAkEvent_ReturnValue) == 0x000028, "Member 'NarrativeScreenBase_BP_C_OnRep_bScreenExploded::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function NarrativeScreenBase_BP.NarrativeScreenBase_BP_C.AllowScreenExplosion
// 0x0038 (0x0038 - 0x0000)
struct NarrativeScreenBase_BP_C_AllowScreenExplosion final
{
public:
	bool                                          bAllowScreenExplosion;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31F4[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ANarrativeScreenBase_BP_C*>      CallFunc_GetSimilarTVInRadius_TVs;                 // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31F5[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ANarrativeScreenBase_BP_C*              CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDestroyed_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NarrativeScreenBase_BP_C_AllowScreenExplosion) == 0x000008, "Wrong alignment on NarrativeScreenBase_BP_C_AllowScreenExplosion");
static_assert(sizeof(NarrativeScreenBase_BP_C_AllowScreenExplosion) == 0x000038, "Wrong size on NarrativeScreenBase_BP_C_AllowScreenExplosion");
static_assert(offsetof(NarrativeScreenBase_BP_C_AllowScreenExplosion, bAllowScreenExplosion) == 0x000000, "Member 'NarrativeScreenBase_BP_C_AllowScreenExplosion::bAllowScreenExplosion' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_AllowScreenExplosion, Temp_int_Array_Index_Variable) == 0x000004, "Member 'NarrativeScreenBase_BP_C_AllowScreenExplosion::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_AllowScreenExplosion, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'NarrativeScreenBase_BP_C_AllowScreenExplosion::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NarrativeScreenBase_BP_C_AllowScreenExplosion, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'NarrativeScreenBase_BP_C_AllowScreenExplosion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
