#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Noakes_padrepair_animbp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function noakes_padrepair_animbp.noakes_padrepair_animbp_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Noakes_padrepair_animbp_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Noakes_padrepair_animbp_C_AnimGraph) == 0x000008, "Wrong alignment on Noakes_padrepair_animbp_C_AnimGraph");
static_assert(sizeof(Noakes_padrepair_animbp_C_AnimGraph) == 0x000010, "Wrong size on Noakes_padrepair_animbp_C_AnimGraph");
static_assert(offsetof(Noakes_padrepair_animbp_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Noakes_padrepair_animbp_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function noakes_padrepair_animbp.noakes_padrepair_animbp_C.ExecuteUbergraph_noakes_padrepair_animbp
// 0x0004 (0x0004 - 0x0000)
struct Noakes_padrepair_animbp_C_ExecuteUbergraph_noakes_padrepair_animbp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Noakes_padrepair_animbp_C_ExecuteUbergraph_noakes_padrepair_animbp) == 0x000004, "Wrong alignment on Noakes_padrepair_animbp_C_ExecuteUbergraph_noakes_padrepair_animbp");
static_assert(sizeof(Noakes_padrepair_animbp_C_ExecuteUbergraph_noakes_padrepair_animbp) == 0x000004, "Wrong size on Noakes_padrepair_animbp_C_ExecuteUbergraph_noakes_padrepair_animbp");
static_assert(offsetof(Noakes_padrepair_animbp_C_ExecuteUbergraph_noakes_padrepair_animbp, EntryPoint) == 0x000000, "Member 'Noakes_padrepair_animbp_C_ExecuteUbergraph_noakes_padrepair_animbp::EntryPoint' has a wrong offset!");

}

