#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Noakes_flipbook_animbp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function noakes_flipbook_animbp.noakes_flipbook_animbp_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Noakes_flipbook_animbp_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Noakes_flipbook_animbp_C_AnimGraph) == 0x000008, "Wrong alignment on Noakes_flipbook_animbp_C_AnimGraph");
static_assert(sizeof(Noakes_flipbook_animbp_C_AnimGraph) == 0x000010, "Wrong size on Noakes_flipbook_animbp_C_AnimGraph");
static_assert(offsetof(Noakes_flipbook_animbp_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Noakes_flipbook_animbp_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function noakes_flipbook_animbp.noakes_flipbook_animbp_C.ExecuteUbergraph_noakes_flipbook_animbp
// 0x000C (0x000C - 0x0000)
struct Noakes_flipbook_animbp_C_ExecuteUbergraph_noakes_flipbook_animbp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Noakes_flipbook_animbp_C_ExecuteUbergraph_noakes_flipbook_animbp) == 0x000004, "Wrong alignment on Noakes_flipbook_animbp_C_ExecuteUbergraph_noakes_flipbook_animbp");
static_assert(sizeof(Noakes_flipbook_animbp_C_ExecuteUbergraph_noakes_flipbook_animbp) == 0x00000C, "Wrong size on Noakes_flipbook_animbp_C_ExecuteUbergraph_noakes_flipbook_animbp");
static_assert(offsetof(Noakes_flipbook_animbp_C_ExecuteUbergraph_noakes_flipbook_animbp, EntryPoint) == 0x000000, "Member 'Noakes_flipbook_animbp_C_ExecuteUbergraph_noakes_flipbook_animbp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Noakes_flipbook_animbp_C_ExecuteUbergraph_noakes_flipbook_animbp, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'Noakes_flipbook_animbp_C_ExecuteUbergraph_noakes_flipbook_animbp::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(Noakes_flipbook_animbp_C_ExecuteUbergraph_noakes_flipbook_animbp, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'Noakes_flipbook_animbp_C_ExecuteUbergraph_noakes_flipbook_animbp::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

