#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCDebugIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NPCDebugIcon.NPCDebugIcon_C
// 0x0040 (0x0378 - 0x0338)
class UNPCDebugIcon_C final : public URBNPCDebugIconWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           AlertedProgress;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChaseIcon;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_ObjectiveInWorld;                  // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           SuspiciousProgress;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           UnawareProgress;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EAIAwarenessStateType                         CurrentState;                                      // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9D[0x3];                                     // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentMeterValue;                                 // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ApprochainCoeff;                                   // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NPCDebugIcon(int32 EntryPoint);
	void UpdateDisplay();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Event_Hide();
	void Event_Show();

	bool ShouldShow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPCDebugIcon_C">();
	}
	static class UNPCDebugIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPCDebugIcon_C>();
	}
};
static_assert(alignof(UNPCDebugIcon_C) == 0x000008, "Wrong alignment on UNPCDebugIcon_C");
static_assert(sizeof(UNPCDebugIcon_C) == 0x000378, "Wrong size on UNPCDebugIcon_C");
static_assert(offsetof(UNPCDebugIcon_C, UberGraphFrame) == 0x000338, "Member 'UNPCDebugIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPCDebugIcon_C, AlertedProgress) == 0x000340, "Member 'UNPCDebugIcon_C::AlertedProgress' has a wrong offset!");
static_assert(offsetof(UNPCDebugIcon_C, ChaseIcon) == 0x000348, "Member 'UNPCDebugIcon_C::ChaseIcon' has a wrong offset!");
static_assert(offsetof(UNPCDebugIcon_C, InvalidationBox_ObjectiveInWorld) == 0x000350, "Member 'UNPCDebugIcon_C::InvalidationBox_ObjectiveInWorld' has a wrong offset!");
static_assert(offsetof(UNPCDebugIcon_C, SuspiciousProgress) == 0x000358, "Member 'UNPCDebugIcon_C::SuspiciousProgress' has a wrong offset!");
static_assert(offsetof(UNPCDebugIcon_C, UnawareProgress) == 0x000360, "Member 'UNPCDebugIcon_C::UnawareProgress' has a wrong offset!");
static_assert(offsetof(UNPCDebugIcon_C, CurrentState) == 0x000368, "Member 'UNPCDebugIcon_C::CurrentState' has a wrong offset!");
static_assert(offsetof(UNPCDebugIcon_C, CurrentMeterValue) == 0x00036C, "Member 'UNPCDebugIcon_C::CurrentMeterValue' has a wrong offset!");
static_assert(offsetof(UNPCDebugIcon_C, ApprochainCoeff) == 0x000370, "Member 'UNPCDebugIcon_C::ApprochainCoeff' has a wrong offset!");

}

