#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Parent_DestructibleDoor_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Parent_DestructibleDoor_BP.Parent_DestructibleDoor_BP_C
// 0x00A0 (0x0510 - 0x0470)
class AParent_DestructibleDoor_BP_C final : public ARBDestructibleActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               WoodSplintersMinusShoulder_PS1;                    // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ShadowBox;                                         // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               WoodSplintersMinusKick_PS;                         // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             OriginTransforms;                                  // 0x0490(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             DestinationTransforms;                             // 0x04C0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         TranslationDelta;                                  // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CastShadowForDarkness;                             // 0x04F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32F9[0x3];                                     // 0x04F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          WindowBreakAkEvent;                                // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 NoShadowSections;                                  // 0x0500(0x0010)(Edit, BlueprintVisible)

public:
	void EnableDamageSectionsShadow(bool CastShadow);
	void PostWindowBreakAkEvent();
	void SetParticleRotation(class ARBPawn* Front, class UParticleSystemComponent* ParticleSystem);
	void SetMovementTransforms();
	void UserConstructionScript();
	void Event_On_Bash(class ARBPawn* Pawn, bool bSuccess, bool bApplyDamageVisual, EBashDoorType bashType);
	void Event_OnResetStage();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Parent_DestructibleDoor_BP(int32 EntryPoint);

	bool GetPingItemName(class FText* OutName) const;
	bool GetPingEnabled(class ARBPlayer* PingOwner, const struct FHitResult& HitResult, bool* OutIsEnabled) const;
	bool GetPlayerPingData(class ARBPlayer* PingOwner, const struct FHitResult& HitResult, struct FPlayerPingData* OutData) const;
	bool GetPlayerPingWorldLocation(class ARBPlayer* PingOwner, const struct FHitResult& HitResult, struct FVector* OutLocation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Parent_DestructibleDoor_BP_C">();
	}
	static class AParent_DestructibleDoor_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParent_DestructibleDoor_BP_C>();
	}
};
static_assert(alignof(AParent_DestructibleDoor_BP_C) == 0x000010, "Wrong alignment on AParent_DestructibleDoor_BP_C");
static_assert(sizeof(AParent_DestructibleDoor_BP_C) == 0x000510, "Wrong size on AParent_DestructibleDoor_BP_C");
static_assert(offsetof(AParent_DestructibleDoor_BP_C, UberGraphFrame) == 0x000470, "Member 'AParent_DestructibleDoor_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AParent_DestructibleDoor_BP_C, WoodSplintersMinusShoulder_PS1) == 0x000478, "Member 'AParent_DestructibleDoor_BP_C::WoodSplintersMinusShoulder_PS1' has a wrong offset!");
static_assert(offsetof(AParent_DestructibleDoor_BP_C, ShadowBox) == 0x000480, "Member 'AParent_DestructibleDoor_BP_C::ShadowBox' has a wrong offset!");
static_assert(offsetof(AParent_DestructibleDoor_BP_C, WoodSplintersMinusKick_PS) == 0x000488, "Member 'AParent_DestructibleDoor_BP_C::WoodSplintersMinusKick_PS' has a wrong offset!");
static_assert(offsetof(AParent_DestructibleDoor_BP_C, OriginTransforms) == 0x000490, "Member 'AParent_DestructibleDoor_BP_C::OriginTransforms' has a wrong offset!");
static_assert(offsetof(AParent_DestructibleDoor_BP_C, DestinationTransforms) == 0x0004C0, "Member 'AParent_DestructibleDoor_BP_C::DestinationTransforms' has a wrong offset!");
static_assert(offsetof(AParent_DestructibleDoor_BP_C, TranslationDelta) == 0x0004F0, "Member 'AParent_DestructibleDoor_BP_C::TranslationDelta' has a wrong offset!");
static_assert(offsetof(AParent_DestructibleDoor_BP_C, CastShadowForDarkness) == 0x0004F4, "Member 'AParent_DestructibleDoor_BP_C::CastShadowForDarkness' has a wrong offset!");
static_assert(offsetof(AParent_DestructibleDoor_BP_C, WindowBreakAkEvent) == 0x0004F8, "Member 'AParent_DestructibleDoor_BP_C::WindowBreakAkEvent' has a wrong offset!");
static_assert(offsetof(AParent_DestructibleDoor_BP_C, NoShadowSections) == 0x000500, "Member 'AParent_DestructibleDoor_BP_C::NoShadowSections' has a wrong offset!");

}

