#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerksDisplay

#include "Basic.hpp"


namespace SDK::Params
{

// Function PerksDisplay.PerksDisplay_C.Setup
// 0x0020 (0x0020 - 0x0000)
struct PerksDisplay_C_Setup final
{
public:
	class ARBPlayerState*                         RBPlayerState;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisplayPlus;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DisplayTitle;                                      // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3071[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPerkSlotButton_C*                      CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerksDisplay_C_Setup) == 0x000008, "Wrong alignment on PerksDisplay_C_Setup");
static_assert(sizeof(PerksDisplay_C_Setup) == 0x000020, "Wrong size on PerksDisplay_C_Setup");
static_assert(offsetof(PerksDisplay_C_Setup, RBPlayerState) == 0x000000, "Member 'PerksDisplay_C_Setup::RBPlayerState' has a wrong offset!");
static_assert(offsetof(PerksDisplay_C_Setup, DisplayPlus) == 0x000008, "Member 'PerksDisplay_C_Setup::DisplayPlus' has a wrong offset!");
static_assert(offsetof(PerksDisplay_C_Setup, DisplayTitle) == 0x000009, "Member 'PerksDisplay_C_Setup::DisplayTitle' has a wrong offset!");
static_assert(offsetof(PerksDisplay_C_Setup, CallFunc_Create_ReturnValue) == 0x000010, "Member 'PerksDisplay_C_Setup::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerksDisplay_C_Setup, CallFunc_AddChildToOverlay_ReturnValue) == 0x000018, "Member 'PerksDisplay_C_Setup::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");

}

