#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkList

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PerkList.PerkList_C
// 0x00A8 (0x0320 - 0x0278)
class UPerkList_C final : public URBUpgradeMenuTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           PerkCategories;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkCategoryButton_C*                  PerkCategoryButton;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkCategoryButton_C*                  PerkCategoryButton_112;                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkCategoryButton_C*                  PerkCategoryButton_226;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      PerkGrid;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PerkListBox;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsLoadout;                                        // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_354F[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnUpgradeHovered;                                  // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUpgradeUnhovered;                                // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUpgradeClicked;                                  // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bHasNewItemBeingDisplayed;                         // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EPerkCategory                                 CurrentCategory;                                   // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3550[0x6];                                     // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnPerkCategoryChanged;                             // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPageChanged;                                     // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         LastFocusedChildren;                               // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void RefreshDisplay(bool ShowGrid);
	void HandleGamepadFocus();
	void HandleNavigationBack(bool* CanExitMenu);
	void CycleCategory(bool Left);
	class UWidget* GamepadNav_HandleGridNavigation(EUINavigation Param_Navigation);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnPerkReleasedEvent(const struct FMenuUpgradeItemInfo& ItemInfo);
	void OnPerkPressedEvent(const struct FMenuUpgradeItemInfo& ItemInfo);
	void OnPerkClickedEvent(class UPerkUpgradeButton_C* Button);
	void OnPerkUnhoveredEvent(class UPerkUpgradeButton_C* Button);
	void OnPerkHoveredEvent(class UPerkUpgradeButton_C* Button);
	void RefreshGrid();
	void Init(bool Param_bIsLoadout, EPerkCategory InitialCategory);
	void Setup(EPerkCategory WantedCategory);
	void PreConstruct(bool IsDesignTime);
	void Event_InputSourceChanged(bool bIsGamepad);
	void Construct();
	void OnInitDone();
	void OnPerkCategoryClicked(EPerkCategory Category);
	void OnUpgradeBuyAnimationEnded(class UPerkUpgradeButton_C* PerkUpgradeButton);
	void ExecuteUbergraph_PerkList(int32 EntryPoint);
	void OnPageChanged__DelegateSignature(bool CategoryEntered);
	void OnPerkCategoryChanged__DelegateSignature(EPerkCategory NewCategory);
	void OnUpgradeClicked__DelegateSignature(class FName ItemId);
	void OnUpgradeUnhovered__DelegateSignature(class FName ItemId);
	void OnUpgradeHovered__DelegateSignature(class FName ItemId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PerkList_C">();
	}
	static class UPerkList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerkList_C>();
	}
};
static_assert(alignof(UPerkList_C) == 0x000008, "Wrong alignment on UPerkList_C");
static_assert(sizeof(UPerkList_C) == 0x000320, "Wrong size on UPerkList_C");
static_assert(offsetof(UPerkList_C, UberGraphFrame) == 0x000278, "Member 'UPerkList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPerkList_C, PerkCategories) == 0x000280, "Member 'UPerkList_C::PerkCategories' has a wrong offset!");
static_assert(offsetof(UPerkList_C, PerkCategoryButton) == 0x000288, "Member 'UPerkList_C::PerkCategoryButton' has a wrong offset!");
static_assert(offsetof(UPerkList_C, PerkCategoryButton_112) == 0x000290, "Member 'UPerkList_C::PerkCategoryButton_112' has a wrong offset!");
static_assert(offsetof(UPerkList_C, PerkCategoryButton_226) == 0x000298, "Member 'UPerkList_C::PerkCategoryButton_226' has a wrong offset!");
static_assert(offsetof(UPerkList_C, PerkGrid) == 0x0002A0, "Member 'UPerkList_C::PerkGrid' has a wrong offset!");
static_assert(offsetof(UPerkList_C, PerkListBox) == 0x0002A8, "Member 'UPerkList_C::PerkListBox' has a wrong offset!");
static_assert(offsetof(UPerkList_C, ScrollBox) == 0x0002B0, "Member 'UPerkList_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UPerkList_C, bIsLoadout) == 0x0002B8, "Member 'UPerkList_C::bIsLoadout' has a wrong offset!");
static_assert(offsetof(UPerkList_C, OnUpgradeHovered) == 0x0002C0, "Member 'UPerkList_C::OnUpgradeHovered' has a wrong offset!");
static_assert(offsetof(UPerkList_C, OnUpgradeUnhovered) == 0x0002D0, "Member 'UPerkList_C::OnUpgradeUnhovered' has a wrong offset!");
static_assert(offsetof(UPerkList_C, OnUpgradeClicked) == 0x0002E0, "Member 'UPerkList_C::OnUpgradeClicked' has a wrong offset!");
static_assert(offsetof(UPerkList_C, bHasNewItemBeingDisplayed) == 0x0002F0, "Member 'UPerkList_C::bHasNewItemBeingDisplayed' has a wrong offset!");
static_assert(offsetof(UPerkList_C, CurrentCategory) == 0x0002F1, "Member 'UPerkList_C::CurrentCategory' has a wrong offset!");
static_assert(offsetof(UPerkList_C, OnPerkCategoryChanged) == 0x0002F8, "Member 'UPerkList_C::OnPerkCategoryChanged' has a wrong offset!");
static_assert(offsetof(UPerkList_C, OnPageChanged) == 0x000308, "Member 'UPerkList_C::OnPageChanged' has a wrong offset!");
static_assert(offsetof(UPerkList_C, LastFocusedChildren) == 0x000318, "Member 'UPerkList_C::LastFocusedChildren' has a wrong offset!");

}

