#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pharmacist_QuestGiver_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseAnimatedQuestGiver_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Pharmacist_QuestGiver_BP.Pharmacist_QuestGiver_BP_C
// 0x0028 (0x04E0 - 0x04B8)
class APharmacist_QuestGiver_BP_C final : public ABaseAnimatedQuestGiver_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Pharmacist_QuestGiver_BP_C;         // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Catalogue;                                         // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Novel;                                             // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBObjectiveActorComponent*             RBObjectiveActor;                                  // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Skirt;                                             // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Pharmacist_QuestGiver_BP(int32 EntryPoint);
	void UserConstructionScript();
	void NoticeStart();
	void NoticeStop();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pharmacist_QuestGiver_BP_C">();
	}
	static class APharmacist_QuestGiver_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APharmacist_QuestGiver_BP_C>();
	}
};
static_assert(alignof(APharmacist_QuestGiver_BP_C) == 0x000008, "Wrong alignment on APharmacist_QuestGiver_BP_C");
static_assert(sizeof(APharmacist_QuestGiver_BP_C) == 0x0004E0, "Wrong size on APharmacist_QuestGiver_BP_C");
static_assert(offsetof(APharmacist_QuestGiver_BP_C, UberGraphFrame_Pharmacist_QuestGiver_BP_C) == 0x0004B8, "Member 'APharmacist_QuestGiver_BP_C::UberGraphFrame_Pharmacist_QuestGiver_BP_C' has a wrong offset!");
static_assert(offsetof(APharmacist_QuestGiver_BP_C, Catalogue) == 0x0004C0, "Member 'APharmacist_QuestGiver_BP_C::Catalogue' has a wrong offset!");
static_assert(offsetof(APharmacist_QuestGiver_BP_C, Novel) == 0x0004C8, "Member 'APharmacist_QuestGiver_BP_C::Novel' has a wrong offset!");
static_assert(offsetof(APharmacist_QuestGiver_BP_C, RBObjectiveActor) == 0x0004D0, "Member 'APharmacist_QuestGiver_BP_C::RBObjectiveActor' has a wrong offset!");
static_assert(offsetof(APharmacist_QuestGiver_BP_C, Skirt) == 0x0004D8, "Member 'APharmacist_QuestGiver_BP_C::Skirt' has a wrong offset!");

}

