#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PipeModuleDetailParameters

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct PipeModuleDetailParameters.PipeModuleDetailParameters
// 0x0018 (0x0018 - 0x0000)
struct FPipeModuleDetailParameters final
{
public:
	class UStaticMesh*                            Staticmesh_2_E3641C7843830E61841D0599B46F13DF;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinTilingDistance_6_A5B8D7994CF25D5EDCF0098D319DE275; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PositionOffset_9_409952B6452100431B7F4CAD7A02FEBE; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationOffset_11_DBA5FE9D4DA243E9654754BB353193ED; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_14_BCAA5A17401C00DBE6E786BD24CE5C69;           // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FPipeModuleDetailParameters) == 0x000008, "Wrong alignment on FPipeModuleDetailParameters");
static_assert(sizeof(FPipeModuleDetailParameters) == 0x000018, "Wrong size on FPipeModuleDetailParameters");
static_assert(offsetof(FPipeModuleDetailParameters, Staticmesh_2_E3641C7843830E61841D0599B46F13DF) == 0x000000, "Member 'FPipeModuleDetailParameters::Staticmesh_2_E3641C7843830E61841D0599B46F13DF' has a wrong offset!");
static_assert(offsetof(FPipeModuleDetailParameters, MinTilingDistance_6_A5B8D7994CF25D5EDCF0098D319DE275) == 0x000008, "Member 'FPipeModuleDetailParameters::MinTilingDistance_6_A5B8D7994CF25D5EDCF0098D319DE275' has a wrong offset!");
static_assert(offsetof(FPipeModuleDetailParameters, PositionOffset_9_409952B6452100431B7F4CAD7A02FEBE) == 0x00000C, "Member 'FPipeModuleDetailParameters::PositionOffset_9_409952B6452100431B7F4CAD7A02FEBE' has a wrong offset!");
static_assert(offsetof(FPipeModuleDetailParameters, RotationOffset_11_DBA5FE9D4DA243E9654754BB353193ED) == 0x000010, "Member 'FPipeModuleDetailParameters::RotationOffset_11_DBA5FE9D4DA243E9654754BB353193ED' has a wrong offset!");
static_assert(offsetof(FPipeModuleDetailParameters, Use_14_BCAA5A17401C00DBE6E786BD24CE5C69) == 0x000014, "Member 'FPipeModuleDetailParameters::Use_14_BCAA5A17401C00DBE6E786BD24CE5C69' has a wrong offset!");

}

