#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerStatEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerStatEntry.PlayerStatEntry_C
// 0x0058 (0x02B8 - 0x0260)
class UPlayerStatEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             DisplayNameWidget;                                 // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ValueTextWidget;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DisplayName;                                       // 0x0280(0x0018)(Edit, BlueprintVisible)
	class FText                                   ValueText;                                         // 0x0298(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             IconTexture;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Setup(const class FText& Param_DisplayName, const class FText& Param_ValueText, class UTexture2D* Param_IconTexture);
	void Refresh();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_PlayerStatEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerStatEntry_C">();
	}
	static class UPlayerStatEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerStatEntry_C>();
	}
};
static_assert(alignof(UPlayerStatEntry_C) == 0x000008, "Wrong alignment on UPlayerStatEntry_C");
static_assert(sizeof(UPlayerStatEntry_C) == 0x0002B8, "Wrong size on UPlayerStatEntry_C");
static_assert(offsetof(UPlayerStatEntry_C, UberGraphFrame) == 0x000260, "Member 'UPlayerStatEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerStatEntry_C, DisplayNameWidget) == 0x000268, "Member 'UPlayerStatEntry_C::DisplayNameWidget' has a wrong offset!");
static_assert(offsetof(UPlayerStatEntry_C, Icon) == 0x000270, "Member 'UPlayerStatEntry_C::Icon' has a wrong offset!");
static_assert(offsetof(UPlayerStatEntry_C, ValueTextWidget) == 0x000278, "Member 'UPlayerStatEntry_C::ValueTextWidget' has a wrong offset!");
static_assert(offsetof(UPlayerStatEntry_C, DisplayName) == 0x000280, "Member 'UPlayerStatEntry_C::DisplayName' has a wrong offset!");
static_assert(offsetof(UPlayerStatEntry_C, ValueText) == 0x000298, "Member 'UPlayerStatEntry_C::ValueText' has a wrong offset!");
static_assert(offsetof(UPlayerStatEntry_C, IconTexture) == 0x0002B0, "Member 'UPlayerStatEntry_C::IconTexture' has a wrong offset!");

}

