#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerHud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerHud.PlayerHud_C
// 0x00E8 (0x0380 - 0x0298)
class UPlayerHud_C final : public URBHUDWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InviteFadeIn;                                      // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransitionFadeAnimation;                           // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HealAnimation;                                     // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UActiveEffectsHudWidget_C*              ActiveEffectsHudWidget_C_108;                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBadgeProgressionHudWidget_C*           BadgeProgressionHudWidget;                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ColorFadeImage;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConsumingProgressWidget_C*             ConsumingProgressWidget;                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDetectionCrosshair_C*                  DetectionCrosshair;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           FadeOutCanvas;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGroupStatusWidget_C*                   GroupStatusWidget;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHealthBar6_Animated_C*                 HealthBar;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HealthGainImage;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDNightVision_C*                      HUD_NV_W;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDGameMessages_C*                     HUDGameMessages;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDStageIntro_C*                       HUDStageIntro;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDTutorial_C*                         HUDTutorial;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDTutorialMessages_C*                 HUDTutorialMessages;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULinearInventory_C*                     LinearInventory;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchStartCountdownWidget_C*           MatchStartCountdownWidget;                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMessageWidget_C*                       MessageWidget;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUDObjectives_C*                       ObjectivesWidget;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPsychosisBar2_C*                       PsychosisBar2;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpectatorInfoHudWidget_C*              SpectatorInfoHudWidget;                            // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTalkWheel_V2_C*                        TalkWheel_V2;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWaitingForPlayersCountdownWidget_C*    WaitingForPlayersCountdownWidget;                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             FadeInCompleted;                                   // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         blackoutDuration;                                  // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void FadeInCompleted__DelegateSignature();
	void ExecuteUbergraph_PlayerHud(int32 EntryPoint);
	void OnObjectiveStartedMessageSent();
	void OnObjectiveCompletedMessageSent();
	void Construct();
	void ChangeCrosshairVisibility(bool Show);
	void Event_OnHUDOpacityChanged();
	void Event_ForceUpdateSwapIcons();
	void Destruct();
	void Event_HideInteractionMessage();
	void Event_ShowInteractionMessage(const class FText& Message, const EGameMessageCategory GameMessageCategory);
	void TransitionFeedbackFinished();
	void Event_StartTransitionFeedback(float Param_blackoutDuration);
	void Event_OnResetHud();
	void BlackoutCompleted();
	void PlayTransitionFeedback();
	void Event_ShowBadgeProgress(const struct FRBBadgeHudProgressDisplayDetails& Progress);
	void Event_HideBadgeProgress();
	void SequenceEvent__ENTRYPOINTPlayerHud_0();
	void SequenceEvent__ENTRYPOINTPlayerHud_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerHud_C">();
	}
	static class UPlayerHud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerHud_C>();
	}
};
static_assert(alignof(UPlayerHud_C) == 0x000008, "Wrong alignment on UPlayerHud_C");
static_assert(sizeof(UPlayerHud_C) == 0x000380, "Wrong size on UPlayerHud_C");
static_assert(offsetof(UPlayerHud_C, UberGraphFrame) == 0x000298, "Member 'UPlayerHud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, InviteFadeIn) == 0x0002A0, "Member 'UPlayerHud_C::InviteFadeIn' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, TransitionFadeAnimation) == 0x0002A8, "Member 'UPlayerHud_C::TransitionFadeAnimation' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, HealAnimation) == 0x0002B0, "Member 'UPlayerHud_C::HealAnimation' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, ActiveEffectsHudWidget_C_108) == 0x0002B8, "Member 'UPlayerHud_C::ActiveEffectsHudWidget_C_108' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, BadgeProgressionHudWidget) == 0x0002C0, "Member 'UPlayerHud_C::BadgeProgressionHudWidget' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, ColorFadeImage) == 0x0002C8, "Member 'UPlayerHud_C::ColorFadeImage' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, ConsumingProgressWidget) == 0x0002D0, "Member 'UPlayerHud_C::ConsumingProgressWidget' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, DetectionCrosshair) == 0x0002D8, "Member 'UPlayerHud_C::DetectionCrosshair' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, FadeOutCanvas) == 0x0002E0, "Member 'UPlayerHud_C::FadeOutCanvas' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, GroupStatusWidget) == 0x0002E8, "Member 'UPlayerHud_C::GroupStatusWidget' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, HealthBar) == 0x0002F0, "Member 'UPlayerHud_C::HealthBar' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, HealthGainImage) == 0x0002F8, "Member 'UPlayerHud_C::HealthGainImage' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, HUD_NV_W) == 0x000300, "Member 'UPlayerHud_C::HUD_NV_W' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, HUDGameMessages) == 0x000308, "Member 'UPlayerHud_C::HUDGameMessages' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, HUDStageIntro) == 0x000310, "Member 'UPlayerHud_C::HUDStageIntro' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, HUDTutorial) == 0x000318, "Member 'UPlayerHud_C::HUDTutorial' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, HUDTutorialMessages) == 0x000320, "Member 'UPlayerHud_C::HUDTutorialMessages' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, LinearInventory) == 0x000328, "Member 'UPlayerHud_C::LinearInventory' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, MatchStartCountdownWidget) == 0x000330, "Member 'UPlayerHud_C::MatchStartCountdownWidget' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, MessageWidget) == 0x000338, "Member 'UPlayerHud_C::MessageWidget' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, ObjectivesWidget) == 0x000340, "Member 'UPlayerHud_C::ObjectivesWidget' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, PsychosisBar2) == 0x000348, "Member 'UPlayerHud_C::PsychosisBar2' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, SpectatorInfoHudWidget) == 0x000350, "Member 'UPlayerHud_C::SpectatorInfoHudWidget' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, TalkWheel_V2) == 0x000358, "Member 'UPlayerHud_C::TalkWheel_V2' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, WaitingForPlayersCountdownWidget) == 0x000360, "Member 'UPlayerHud_C::WaitingForPlayersCountdownWidget' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, FadeInCompleted) == 0x000368, "Member 'UPlayerHud_C::FadeInCompleted' has a wrong offset!");
static_assert(offsetof(UPlayerHud_C, blackoutDuration) == 0x000378, "Member 'UPlayerHud_C::blackoutDuration' has a wrong offset!");

}

