#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgramPosterCarrousel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgramPosterCarrousel.ProgramPosterCarrousel_C
// 0x0098 (0x0300 - 0x0268)
class UProgramPosterCarrousel_C final : public URBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           ContainerPanel;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_76;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_142;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LeftCycle;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PosterBox;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RightCycle;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_0;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         StartingIndex;                                     // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3673[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UProgramPosterCarrouselEntry_C*> Entries;                                           // 0x02B8(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             OnPosterClicked;                                   // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPosterHovered;                                   // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPosterUnhovered;                                 // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   LastHoveredProgramId;                              // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateScrollboxBehavior(bool IsUsingGamePad);
	ESlateVisibility GetRightCycleVisibility();
	ESlateVisibility GetLeftCycleVisibility();
	void GetLastHoveredPoster(class UProgramPosterCarrouselEntry_C** OutLastHoveredPoster);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void GetCurrentlySelectedPoster(class UProgramPosterCarrouselEntry_C** SelectedPoster);
	void HandleLeftCycle();
	void HandleRightCycle();
	void GetFirstAvailablePoster(class UProgramPosterCarrouselEntry_C** Poster);
	void GetPosterForId(class FName ProgramId, class UProgramPosterCarrouselEntry_C** Poster);
	void ClearDelegates();
	void HandlePosterUnhover(class FName ProgramId);
	void HandlePosterHover(class FName ProgramId);
	void HandlePosterClick(class FName ProgramId);
	void Refresh(bool IsMatchOwner);
	void Setup();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BndEvt__TrialPosterCarrousel_V2_LeftCycle_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__TrialPosterCarrousel_V2_RightCycle_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Event_InputSourceChanged(bool bIsGamepad);
	void ExecuteUbergraph_ProgramPosterCarrousel(int32 EntryPoint);
	void OnPosterUnhovered__DelegateSignature(class FName ProgramId);
	void OnPosterHovered__DelegateSignature(class FName ProgramId);
	void OnPosterClicked__DelegateSignature(class FName ProgramId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgramPosterCarrousel_C">();
	}
	static class UProgramPosterCarrousel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgramPosterCarrousel_C>();
	}
};
static_assert(alignof(UProgramPosterCarrousel_C) == 0x000008, "Wrong alignment on UProgramPosterCarrousel_C");
static_assert(sizeof(UProgramPosterCarrousel_C) == 0x000300, "Wrong size on UProgramPosterCarrousel_C");
static_assert(offsetof(UProgramPosterCarrousel_C, UberGraphFrame) == 0x000268, "Member 'UProgramPosterCarrousel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProgramPosterCarrousel_C, FadeOut) == 0x000270, "Member 'UProgramPosterCarrousel_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UProgramPosterCarrousel_C, ContainerPanel) == 0x000278, "Member 'UProgramPosterCarrousel_C::ContainerPanel' has a wrong offset!");
static_assert(offsetof(UProgramPosterCarrousel_C, Image_76) == 0x000280, "Member 'UProgramPosterCarrousel_C::Image_76' has a wrong offset!");
static_assert(offsetof(UProgramPosterCarrousel_C, Image_142) == 0x000288, "Member 'UProgramPosterCarrousel_C::Image_142' has a wrong offset!");
static_assert(offsetof(UProgramPosterCarrousel_C, LeftCycle) == 0x000290, "Member 'UProgramPosterCarrousel_C::LeftCycle' has a wrong offset!");
static_assert(offsetof(UProgramPosterCarrousel_C, PosterBox) == 0x000298, "Member 'UProgramPosterCarrousel_C::PosterBox' has a wrong offset!");
static_assert(offsetof(UProgramPosterCarrousel_C, RightCycle) == 0x0002A0, "Member 'UProgramPosterCarrousel_C::RightCycle' has a wrong offset!");
static_assert(offsetof(UProgramPosterCarrousel_C, ScrollBox_0) == 0x0002A8, "Member 'UProgramPosterCarrousel_C::ScrollBox_0' has a wrong offset!");
static_assert(offsetof(UProgramPosterCarrousel_C, StartingIndex) == 0x0002B0, "Member 'UProgramPosterCarrousel_C::StartingIndex' has a wrong offset!");
static_assert(offsetof(UProgramPosterCarrousel_C, Entries) == 0x0002B8, "Member 'UProgramPosterCarrousel_C::Entries' has a wrong offset!");
static_assert(offsetof(UProgramPosterCarrousel_C, OnPosterClicked) == 0x0002C8, "Member 'UProgramPosterCarrousel_C::OnPosterClicked' has a wrong offset!");
static_assert(offsetof(UProgramPosterCarrousel_C, OnPosterHovered) == 0x0002D8, "Member 'UProgramPosterCarrousel_C::OnPosterHovered' has a wrong offset!");
static_assert(offsetof(UProgramPosterCarrousel_C, OnPosterUnhovered) == 0x0002E8, "Member 'UProgramPosterCarrousel_C::OnPosterUnhovered' has a wrong offset!");
static_assert(offsetof(UProgramPosterCarrousel_C, LastHoveredProgramId) == 0x0002F8, "Member 'UProgramPosterCarrousel_C::LastHoveredProgramId' has a wrong offset!");

}

