#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgramTrialBlockWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgramTrialBlockWidget.ProgramTrialBlockWidget_C
// 0x00C0 (0x0320 - 0x0260)
class UProgramTrialBlockWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BackgroundImage;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BlockNumberText;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           EntriesVBox_1;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedBottomLeftBracket_1;                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedBottomRightBracket_1;                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedTopLeftBracket_1;                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedTopRightBracket_1;                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_116;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                InnerBorder;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               NumberSizeBox;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ProgramPointerArrowContainer;                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialEntryContentWidget_C*      ProgramTrialEntryContentWidget;                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialEntryContentWidget_C*      ProgramTrialEntryContentWidget_1;                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialEntryContentWidget_C*      ProgramTrialEntryContentWidget_2;                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialEntryContentWidget_C*      ProgramTrialEntryContentWidget_3;                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bHovered;                                          // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3637[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             BackgroundImageTexture;                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumEditorEntries;                                  // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMajor;                                            // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3638[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnTrialSelected;                                   // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         BlockNumber;                                       // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFocused;                                          // 0x031C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsMatchOwner;                                     // 0x031D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHasSelectedTrial;                                 // 0x031E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetFocused(bool Param_bFocused);
	void SetHovered(bool Param_bHovered);
	void UpdateSelectedTrialArrow();
	void SetSelectedTrial(class FName TrialId);
	void OnTrialSelectedInternal(class FName TrialId);
	void AddTrial(const struct FRBTrialInfoRow& TrialInfo, int32 Param_BlockNumber, bool bLocked, bool bCompleted, float BestScore, bool bSelected);
	void SetIsMatchOwner(bool Param_bIsMatchOwner);
	void Setup();
	void Init(bool Param_bIsMatchOwner);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__ProgramTrialBlockWidget_Button_0_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ProgramTrialBlockWidget_Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_ProgramTrialBlockWidget(int32 EntryPoint);
	void OnTrialSelected__DelegateSignature(class FName TrialId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgramTrialBlockWidget_C">();
	}
	static class UProgramTrialBlockWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgramTrialBlockWidget_C>();
	}
};
static_assert(alignof(UProgramTrialBlockWidget_C) == 0x000008, "Wrong alignment on UProgramTrialBlockWidget_C");
static_assert(sizeof(UProgramTrialBlockWidget_C) == 0x000320, "Wrong size on UProgramTrialBlockWidget_C");
static_assert(offsetof(UProgramTrialBlockWidget_C, UberGraphFrame) == 0x000260, "Member 'UProgramTrialBlockWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, BackgroundImage) == 0x000268, "Member 'UProgramTrialBlockWidget_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, BlockNumberText) == 0x000270, "Member 'UProgramTrialBlockWidget_C::BlockNumberText' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, Button_0) == 0x000278, "Member 'UProgramTrialBlockWidget_C::Button_0' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, CanvasPanel_0) == 0x000280, "Member 'UProgramTrialBlockWidget_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, EntriesVBox_1) == 0x000288, "Member 'UProgramTrialBlockWidget_C::EntriesVBox_1' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, FocussedBottomLeftBracket_1) == 0x000290, "Member 'UProgramTrialBlockWidget_C::FocussedBottomLeftBracket_1' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, FocussedBottomRightBracket_1) == 0x000298, "Member 'UProgramTrialBlockWidget_C::FocussedBottomRightBracket_1' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, FocussedTopLeftBracket_1) == 0x0002A0, "Member 'UProgramTrialBlockWidget_C::FocussedTopLeftBracket_1' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, FocussedTopRightBracket_1) == 0x0002A8, "Member 'UProgramTrialBlockWidget_C::FocussedTopRightBracket_1' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, Image_116) == 0x0002B0, "Member 'UProgramTrialBlockWidget_C::Image_116' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, InnerBorder) == 0x0002B8, "Member 'UProgramTrialBlockWidget_C::InnerBorder' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, NumberSizeBox) == 0x0002C0, "Member 'UProgramTrialBlockWidget_C::NumberSizeBox' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, ProgramPointerArrowContainer) == 0x0002C8, "Member 'UProgramTrialBlockWidget_C::ProgramPointerArrowContainer' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, ProgramTrialEntryContentWidget) == 0x0002D0, "Member 'UProgramTrialBlockWidget_C::ProgramTrialEntryContentWidget' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, ProgramTrialEntryContentWidget_1) == 0x0002D8, "Member 'UProgramTrialBlockWidget_C::ProgramTrialEntryContentWidget_1' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, ProgramTrialEntryContentWidget_2) == 0x0002E0, "Member 'UProgramTrialBlockWidget_C::ProgramTrialEntryContentWidget_2' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, ProgramTrialEntryContentWidget_3) == 0x0002E8, "Member 'UProgramTrialBlockWidget_C::ProgramTrialEntryContentWidget_3' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, bHovered) == 0x0002F0, "Member 'UProgramTrialBlockWidget_C::bHovered' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, BackgroundImageTexture) == 0x0002F8, "Member 'UProgramTrialBlockWidget_C::BackgroundImageTexture' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, NumEditorEntries) == 0x000300, "Member 'UProgramTrialBlockWidget_C::NumEditorEntries' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, bMajor) == 0x000304, "Member 'UProgramTrialBlockWidget_C::bMajor' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, OnTrialSelected) == 0x000308, "Member 'UProgramTrialBlockWidget_C::OnTrialSelected' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, BlockNumber) == 0x000318, "Member 'UProgramTrialBlockWidget_C::BlockNumber' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, bFocused) == 0x00031C, "Member 'UProgramTrialBlockWidget_C::bFocused' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, bIsMatchOwner) == 0x00031D, "Member 'UProgramTrialBlockWidget_C::bIsMatchOwner' has a wrong offset!");
static_assert(offsetof(UProgramTrialBlockWidget_C, bHasSelectedTrial) == 0x00031E, "Member 'UProgramTrialBlockWidget_C::bHasSelectedTrial' has a wrong offset!");

}

