#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Proxy_Character_CopyPose

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Proxy_Character_CopyPose.Proxy_Character_CopyPose_C.ExecuteUbergraph_Proxy_Character_CopyPose
// 0x0004 (0x0004 - 0x0000)
struct Proxy_Character_CopyPose_C_ExecuteUbergraph_Proxy_Character_CopyPose final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Proxy_Character_CopyPose_C_ExecuteUbergraph_Proxy_Character_CopyPose) == 0x000004, "Wrong alignment on Proxy_Character_CopyPose_C_ExecuteUbergraph_Proxy_Character_CopyPose");
static_assert(sizeof(Proxy_Character_CopyPose_C_ExecuteUbergraph_Proxy_Character_CopyPose) == 0x000004, "Wrong size on Proxy_Character_CopyPose_C_ExecuteUbergraph_Proxy_Character_CopyPose");
static_assert(offsetof(Proxy_Character_CopyPose_C_ExecuteUbergraph_Proxy_Character_CopyPose, EntryPoint) == 0x000000, "Member 'Proxy_Character_CopyPose_C_ExecuteUbergraph_Proxy_Character_CopyPose::EntryPoint' has a wrong offset!");

// Function Proxy_Character_CopyPose.Proxy_Character_CopyPose_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Proxy_Character_CopyPose_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Proxy_Character_CopyPose_C_AnimGraph) == 0x000008, "Wrong alignment on Proxy_Character_CopyPose_C_AnimGraph");
static_assert(sizeof(Proxy_Character_CopyPose_C_AnimGraph) == 0x000010, "Wrong size on Proxy_Character_CopyPose_C_AnimGraph");
static_assert(offsetof(Proxy_Character_CopyPose_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Proxy_Character_CopyPose_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

}

