#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PsychosisBar2

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function PsychosisBar2.PsychosisBar2_C.ExecuteUbergraph_PsychosisBar2
// 0x00A8 (0x00A8 - 0x0000)
struct PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D3E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewValue, int32 OldValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D3F[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHudBarElement_Animated_C*>      K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_FadeIfNecessary_PlayAnim;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FadeIfNecessary_PlayAnim_1;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D40[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_Event_oldPlayer;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_Event_newPlayer;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D41[0x2];                                     // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_newValue;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_oldValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerIndicatorType                          K2Node_CustomEvent_PlayerIndicatorType;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D42[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetWatchedPlayer_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FadeIfNecessary_PlayAnim_2;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredKnockedDown_ReturnValue;      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D43[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPlayerIndicatorType PlayerIndicatorType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2D44[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2) == 0x000008, "Wrong alignment on PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2");
static_assert(sizeof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2) == 0x0000A8, "Wrong size on PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, EntryPoint) == 0x000000, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::EntryPoint' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000020, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, K2Node_Event_IsDesignTime) == 0x000029, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, K2Node_MakeArray_Array) == 0x000030, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, CallFunc_FadeIfNecessary_PlayAnim) == 0x000040, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::CallFunc_FadeIfNecessary_PlayAnim' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, CallFunc_FadeIfNecessary_PlayAnim_1) == 0x000041, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::CallFunc_FadeIfNecessary_PlayAnim_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, K2Node_Event_oldPlayer) == 0x000048, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::K2Node_Event_oldPlayer' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, K2Node_Event_newPlayer) == 0x000050, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::K2Node_Event_newPlayer' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, CallFunc_IsValid_ReturnValue_2) == 0x000059, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, K2Node_CustomEvent_newValue) == 0x00005C, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::K2Node_CustomEvent_newValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, K2Node_CustomEvent_oldValue) == 0x000060, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::K2Node_CustomEvent_oldValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, K2Node_CustomEvent_PlayerIndicatorType) == 0x000064, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::K2Node_CustomEvent_PlayerIndicatorType' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, CallFunc_GetWatchedPlayer_ReturnValue) == 0x000068, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::CallFunc_GetWatchedPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, CallFunc_FadeIfNecessary_PlayAnim_2) == 0x000070, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::CallFunc_FadeIfNecessary_PlayAnim_2' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, CallFunc_IsConsideredKnockedDown_ReturnValue) == 0x000071, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::CallFunc_IsConsideredKnockedDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, K2Node_CreateDelegate_OutputDelegate_2) == 0x000084, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000098, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2, CallFunc_IsValid_ReturnValue_3) == 0x0000A0, "Member 'PsychosisBar2_C_ExecuteUbergraph_PsychosisBar2::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function PsychosisBar2.PsychosisBar2_C.OnPlayerStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct PsychosisBar2_C_OnPlayerStatusChanged final
{
public:
	EPlayerIndicatorType                          PlayerIndicatorType;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychosisBar2_C_OnPlayerStatusChanged) == 0x000001, "Wrong alignment on PsychosisBar2_C_OnPlayerStatusChanged");
static_assert(sizeof(PsychosisBar2_C_OnPlayerStatusChanged) == 0x000001, "Wrong size on PsychosisBar2_C_OnPlayerStatusChanged");
static_assert(offsetof(PsychosisBar2_C_OnPlayerStatusChanged, PlayerIndicatorType) == 0x000000, "Member 'PsychosisBar2_C_OnPlayerStatusChanged::PlayerIndicatorType' has a wrong offset!");

// Function PsychosisBar2.PsychosisBar2_C.OnPsychosisChanged
// 0x0008 (0x0008 - 0x0000)
struct PsychosisBar2_C_OnPsychosisChanged final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychosisBar2_C_OnPsychosisChanged) == 0x000004, "Wrong alignment on PsychosisBar2_C_OnPsychosisChanged");
static_assert(sizeof(PsychosisBar2_C_OnPsychosisChanged) == 0x000008, "Wrong size on PsychosisBar2_C_OnPsychosisChanged");
static_assert(offsetof(PsychosisBar2_C_OnPsychosisChanged, NewValue) == 0x000000, "Member 'PsychosisBar2_C_OnPsychosisChanged::NewValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_OnPsychosisChanged, OldValue) == 0x000004, "Member 'PsychosisBar2_C_OnPsychosisChanged::OldValue' has a wrong offset!");

// Function PsychosisBar2.PsychosisBar2_C.Event_OnWatchedPlayerChanged
// 0x0010 (0x0010 - 0x0000)
struct PsychosisBar2_C_Event_OnWatchedPlayerChanged final
{
public:
	class ARBPlayer*                              OldPlayer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              NewPlayer;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychosisBar2_C_Event_OnWatchedPlayerChanged) == 0x000008, "Wrong alignment on PsychosisBar2_C_Event_OnWatchedPlayerChanged");
static_assert(sizeof(PsychosisBar2_C_Event_OnWatchedPlayerChanged) == 0x000010, "Wrong size on PsychosisBar2_C_Event_OnWatchedPlayerChanged");
static_assert(offsetof(PsychosisBar2_C_Event_OnWatchedPlayerChanged, OldPlayer) == 0x000000, "Member 'PsychosisBar2_C_Event_OnWatchedPlayerChanged::OldPlayer' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_Event_OnWatchedPlayerChanged, NewPlayer) == 0x000008, "Member 'PsychosisBar2_C_Event_OnWatchedPlayerChanged::NewPlayer' has a wrong offset!");

// Function PsychosisBar2.PsychosisBar2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PsychosisBar2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychosisBar2_C_PreConstruct) == 0x000001, "Wrong alignment on PsychosisBar2_C_PreConstruct");
static_assert(sizeof(PsychosisBar2_C_PreConstruct) == 0x000001, "Wrong size on PsychosisBar2_C_PreConstruct");
static_assert(offsetof(PsychosisBar2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PsychosisBar2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PsychosisBar2.PsychosisBar2_C.ChainTweens
// 0x0040 (0x0040 - 0x0000)
struct PsychosisBar2_C_ChainTweens final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D45[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D46[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHudBarElement_Animated_C*              CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PsychosisBar2_C_ChainTweens) == 0x000008, "Wrong alignment on PsychosisBar2_C_ChainTweens");
static_assert(sizeof(PsychosisBar2_C_ChainTweens) == 0x000040, "Wrong size on PsychosisBar2_C_ChainTweens");
static_assert(offsetof(PsychosisBar2_C_ChainTweens, Temp_bool_Variable) == 0x000000, "Member 'PsychosisBar2_C_ChainTweens::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ChainTweens, Temp_int_Variable) == 0x000004, "Member 'PsychosisBar2_C_ChainTweens::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ChainTweens, Temp_int_Variable_1) == 0x000008, "Member 'PsychosisBar2_C_ChainTweens::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ChainTweens, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'PsychosisBar2_C_ChainTweens::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ChainTweens, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'PsychosisBar2_C_ChainTweens::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ChainTweens, K2Node_Select_Default) == 0x000020, "Member 'PsychosisBar2_C_ChainTweens::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ChainTweens, Temp_bool_Variable_1) == 0x000024, "Member 'PsychosisBar2_C_ChainTweens::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ChainTweens, K2Node_Select_Default_1) == 0x000028, "Member 'PsychosisBar2_C_ChainTweens::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ChainTweens, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'PsychosisBar2_C_ChainTweens::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ChainTweens, CallFunc_Array_Get_Item) == 0x000030, "Member 'PsychosisBar2_C_ChainTweens::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ChainTweens, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000038, "Member 'PsychosisBar2_C_ChainTweens::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ChainTweens, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000039, "Member 'PsychosisBar2_C_ChainTweens::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ChainTweens, CallFunc_IsValid_ReturnValue) == 0x00003A, "Member 'PsychosisBar2_C_ChainTweens::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function PsychosisBar2.PsychosisBar2_C.ProcessPsychosisEvent
// 0x01D0 (0x01D0 - 0x0000)
struct PsychosisBar2_C_ProcessPsychosisEvent final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipAnims;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D47[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FinishingBracket;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartingBracket;                                   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Percentage;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxState;                                          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinState;                                          // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D48[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D49[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D4A[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4B[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBHallucinationManager*                CallFunc_GetHallucinationManager_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D4C[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D4D[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D4E[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              CallFunc_GetWatchedPlayer_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredKnockedDown_ReturnValue;      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D4F[0x6];                                     // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBHallucinationManager*                CallFunc_GetHallucinationManager_ReturnValue_1;    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxBracketAmount_ReturnValue;          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D50[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetWatchedPlayer_ReturnValue_1;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsIndicatorOfIncapacitatedType_ReturnValue; // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D51[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D52[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHudBarElement_Animated_C*              CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D53[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBHallucinationManager*                CallFunc_GetHallucinationManager_ReturnValue_2;    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D54[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxBracketAmount_ReturnValue_1;        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHudBarElement_Animated_C*              CallFunc_Array_Get_Item_1;                         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D55[0x3];                                     // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x012C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D56[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_4;                           // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_5;                           // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D57[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_5;            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D58[0x5];                                     // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHudBarElement_Animated_C*              CallFunc_Array_Get_Item_2;                         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_6;                           // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D59[0x2];                                     // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_7;                           // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_8;                           // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_6;            // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5A[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_4;            // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5B[0x4];                                     // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBHallucinationManager*                CallFunc_GetHallucinationManager_ReturnValue_3;    // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxBracketAmount_ReturnValue_2;        // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5C[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBHallucinationManager*                CallFunc_GetHallucinationManager_ReturnValue_4;    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_5;            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxBracketAmount_ReturnValue_3;        // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_6;            // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_6;          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5D[0x3];                                     // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_7;          // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_8;          // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PsychosisBar2_C_ProcessPsychosisEvent) == 0x000008, "Wrong alignment on PsychosisBar2_C_ProcessPsychosisEvent");
static_assert(sizeof(PsychosisBar2_C_ProcessPsychosisEvent) == 0x0001D0, "Wrong size on PsychosisBar2_C_ProcessPsychosisEvent");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, NewValue) == 0x000000, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::NewValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, OldValue) == 0x000004, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::OldValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, SkipAnims) == 0x000008, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::SkipAnims' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, FinishingBracket) == 0x00000C, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::FinishingBracket' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, StartingBracket) == 0x000010, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::StartingBracket' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Percentage) == 0x000014, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Percentage' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, MaxState) == 0x000018, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::MaxState' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, MinState) == 0x00001C, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::MinState' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_bool_Variable) == 0x000020, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_bool_Variable_1) == 0x000021, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_float_Variable) == 0x000024, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_float_Variable_1) == 0x000028, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_bool_Variable_2) == 0x00002C, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_float_Variable_2) == 0x000030, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_float_Variable_3) == 0x000034, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_bool_Variable_3) == 0x000038, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_bool_Variable_4) == 0x000039, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_int_Variable) == 0x00003C, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_int_Array_Index_Variable) == 0x000048, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_GetHallucinationManager_ReturnValue) == 0x000050, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_GetHallucinationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_bool_Variable_5) == 0x000059, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00005A, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00005B, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00005C, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_bool_Variable_6) == 0x000064, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000068, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_bool_Variable_7) == 0x00006C, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_int_Array_Index_Variable_1) == 0x000070, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, K2Node_Select_Default) == 0x000074, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_GetWatchedPlayer_ReturnValue) == 0x000078, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_GetWatchedPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_bool_Variable_8) == 0x000080, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_IsConsideredKnockedDown_ReturnValue) == 0x000081, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_IsConsideredKnockedDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_GetHallucinationManager_ReturnValue_1) == 0x000088, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_GetHallucinationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, K2Node_Select_Default_1) == 0x000090, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_GetMaxBracketAmount_ReturnValue) == 0x000094, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_GetMaxBracketAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000098, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_GetWatchedPlayer_ReturnValue_1) == 0x0000A0, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_GetWatchedPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A8, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000AC, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_BP_IsIndicatorOfIncapacitatedType_ReturnValue) == 0x0000AD, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_BP_IsIndicatorOfIncapacitatedType_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Not_PreBool_ReturnValue) == 0x0000AE, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_BooleanAND_ReturnValue) == 0x0000AF, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000B0, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0000B4, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x0000B8, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Less_IntInt_ReturnValue) == 0x0000BC, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0000C0, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000C4, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000C8, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_BooleanOR_ReturnValue) == 0x0000DC, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_GetHallucinationManager_ReturnValue_2) == 0x0000E0, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_GetHallucinationManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_BooleanOR_ReturnValue_1) == 0x0000E8, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_GetMaxBracketAmount_ReturnValue_1) == 0x0000EC, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_GetMaxBracketAmount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x0000F0, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0000F4, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x0000F8, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x0000FC, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000100, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Subtract_IntInt_ReturnValue_4) == 0x000104, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Subtract_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, K2Node_Select_Default_2) == 0x000108, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_int_Variable_1) == 0x00010C, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Array_Get_Item_1) == 0x000110, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, K2Node_Select_Default_3) == 0x000118, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, Temp_int_Loop_Counter_Variable_1) == 0x00011C, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Add_IntInt_ReturnValue_1) == 0x000120, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Less_IntInt_ReturnValue_1) == 0x000124, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Add_IntInt_ReturnValue_2) == 0x000128, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, K2Node_CreateDelegate_OutputDelegate) == 0x00012C, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, CallFunc_Greater_IntInt_ReturnValue) == 0x00013C, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PsychosisBar2_C_ProcessPsychosisEvent, K2Node_Select_Default_4) == 0x000140, "Member 'PsychosisBar2_C_ProcessPsychosisEvent::K2Node_Select_Default_4' has a wrong offset!");
