#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBLobbyPlayerState_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RBLobbyPlayerState_BP.RBLobbyPlayerState_BP_C
// 0x0018 (0x0AD8 - 0x0AC0)
class ARBLobbyPlayerState_BP_C final : public ARBLobbyPlayerState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Points;                                            // 0x0AD0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseWatchRadar;                                     // 0x0AD4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseCompassWatchMode;                               // 0x0AD5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseFull360CompassWatchMode;                        // 0x0AD6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnteredExperimentTrigger;                          // 0x0AD7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_RBLobbyPlayerState_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBLobbyPlayerState_BP_C">();
	}
	static class ARBLobbyPlayerState_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARBLobbyPlayerState_BP_C>();
	}
};
static_assert(alignof(ARBLobbyPlayerState_BP_C) == 0x000008, "Wrong alignment on ARBLobbyPlayerState_BP_C");
static_assert(sizeof(ARBLobbyPlayerState_BP_C) == 0x000AD8, "Wrong size on ARBLobbyPlayerState_BP_C");
static_assert(offsetof(ARBLobbyPlayerState_BP_C, UberGraphFrame) == 0x000AC0, "Member 'ARBLobbyPlayerState_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARBLobbyPlayerState_BP_C, DefaultSceneRoot) == 0x000AC8, "Member 'ARBLobbyPlayerState_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ARBLobbyPlayerState_BP_C, Points) == 0x000AD0, "Member 'ARBLobbyPlayerState_BP_C::Points' has a wrong offset!");
static_assert(offsetof(ARBLobbyPlayerState_BP_C, UseWatchRadar) == 0x000AD4, "Member 'ARBLobbyPlayerState_BP_C::UseWatchRadar' has a wrong offset!");
static_assert(offsetof(ARBLobbyPlayerState_BP_C, UseCompassWatchMode) == 0x000AD5, "Member 'ARBLobbyPlayerState_BP_C::UseCompassWatchMode' has a wrong offset!");
static_assert(offsetof(ARBLobbyPlayerState_BP_C, UseFull360CompassWatchMode) == 0x000AD6, "Member 'ARBLobbyPlayerState_BP_C::UseFull360CompassWatchMode' has a wrong offset!");
static_assert(offsetof(ARBLobbyPlayerState_BP_C, EnteredExperimentTrigger) == 0x000AD7, "Member 'ARBLobbyPlayerState_BP_C::EnteredExperimentTrigger' has a wrong offset!");

}

