#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBLobbyStatBoardBase

#include "Basic.hpp"

#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function RBLobbyStatBoardBase.RBLobbyStatBoardBase_C.UpdateAllEntries
// 0x0190 (0x0190 - 0x0000)
struct RBLobbyStatBoardBase_C_UpdateAllEntries final
{
public:
	class FText                                   NewName;                                           // 0x0000(0x0018)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CB4[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0028(0x0018)()
	class URBPlayerStatsConfig*                   CallFunc_GetPlayerStatsConfig_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBPlayerStatConfig                    CallFunc_GetPlayerStatConfigById_ReturnValue;      // 0x0048(0x0060)(ConstParm)
	class ALobbyExitReagentBoardNameItem_C*       CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CB5[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBLobbyStatBoardEntry                 CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CB6[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB7[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x00E8(0x0018)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CB8[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0108(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0120(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB9[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CBA[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0178(0x0018)()
};
static_assert(alignof(RBLobbyStatBoardBase_C_UpdateAllEntries) == 0x000008, "Wrong alignment on RBLobbyStatBoardBase_C_UpdateAllEntries");
static_assert(sizeof(RBLobbyStatBoardBase_C_UpdateAllEntries) == 0x000190, "Wrong size on RBLobbyStatBoardBase_C_UpdateAllEntries");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, NewName) == 0x000000, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::NewName' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, Temp_int_Array_Index_Variable) == 0x000020, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, Temp_bool_Variable) == 0x000024, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_MakeLiteralText_ReturnValue) == 0x000028, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_GetPlayerStatsConfig_ReturnValue) == 0x000040, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_GetPlayerStatsConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_GetPlayerStatConfigById_ReturnValue) == 0x000048, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_GetPlayerStatConfigById_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_Less_IntInt_ReturnValue) == 0x0000DC, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000E0, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_Conv_FloatToText_ReturnValue) == 0x0000E8, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_IsEmpty_ReturnValue) == 0x000100, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_Conv_StringToText_ReturnValue) == 0x000108, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, K2Node_Select_Default) == 0x000120, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_Conv_TextToString_ReturnValue) == 0x000138, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_Len_ReturnValue) == 0x000148, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_GetSubstring_ReturnValue) == 0x000150, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000160, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_Concat_StrStr_ReturnValue) == 0x000168, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_UpdateAllEntries, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000178, "Member 'RBLobbyStatBoardBase_C_UpdateAllEntries::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function RBLobbyStatBoardBase.RBLobbyStatBoardBase_C.ExecuteUbergraph_RBLobbyStatBoardBase
// 0x0090 (0x0090 - 0x0000)
struct RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StopLoopingSound_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBPlayerStatsConfig*                   CallFunc_GetPlayerStatsConfig_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBPlayerStatConfig                    CallFunc_GetPlayerStatConfigById_ReturnValue;      // 0x0010(0x0060)(ConstParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	int32                                         CallFunc_PlayLoopingSound_ReturnValue;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase) == 0x000008, "Wrong alignment on RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase");
static_assert(sizeof(RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase) == 0x000090, "Wrong size on RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase");
static_assert(offsetof(RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase, EntryPoint) == 0x000000, "Member 'RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase, CallFunc_StopLoopingSound_ReturnValue) == 0x000004, "Member 'RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase::CallFunc_StopLoopingSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase, CallFunc_GetPlayerStatsConfig_ReturnValue) == 0x000008, "Member 'RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase::CallFunc_GetPlayerStatsConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase, CallFunc_GetPlayerStatConfigById_ReturnValue) == 0x000010, "Member 'RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase::CallFunc_GetPlayerStatConfigById_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase, CallFunc_PlayLoopingSound_ReturnValue) == 0x000088, "Member 'RBLobbyStatBoardBase_C_ExecuteUbergraph_RBLobbyStatBoardBase::CallFunc_PlayLoopingSound_ReturnValue' has a wrong offset!");

}

