#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBNPC_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RBNPC_BP.RBNPC_BP_C
// 0x0050 (0x5890 - 0x5840)
class ARBNPC_BP_C : public ARBNPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x5840(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBActiveSkillVisionComponent*          RBActiveSkillVision;                               // 0x5848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AS_WaveSphere;                                     // 0x5850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBAimAssistComponent*                  Head_Aim_Assist;                                   // 0x5858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             BroadcastWeaponAnimation;                          // 0x5860(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UNiagaraComponent*                      RageEyeFX_R;                                       // 0x5870(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      RageEyeFX_L;                                       // 0x5878(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BloodDripsParticles;                               // 0x5880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SubtitleDistanceOverride;                          // 0x5888(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         SubtitleDistanceOccludedOverride;                  // 0x588C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void OnRep_SubtitleDistanceOccludedOverride();
	void OnRep_SubtitleDistanceOverride();
	void EnableLODs();
	void GetFaceAnimBP(class UEnemyFace_AnimBlueprint_C** EnemyFaceAnimBP);
	void SpawnVariatorEffects();
	void SetNormalMeshVisibility(bool bVisible);
	void UserConstructionScript();
	void Event_PlayHitReactionEffects(const struct FVector& AttackLoc, const struct FRotator& EffectRotation);
	void Event_OnFootstep(const struct FFootstepData& FootstepData);
	void Event_OnDealtWeaponDamage(class ARBPawn* OtherPawn, const struct FVector& DamageLocation);
	void Event_OnDealtUnarmedDamage(class ARBPawn* OtherPawn, class FName DamageSourceBone);
	void ReceiveBeginPlay();
	void TestFakeBlurHead();
	void TestFakeBlurComplete();
	void ExecuteUbergraph_RBNPC_BP(int32 EntryPoint);
	void BroadcastWeaponAnimation__DelegateSignature(class UAnimSequence* Sequence);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBNPC_BP_C">();
	}
	static class ARBNPC_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARBNPC_BP_C>();
	}
};
static_assert(alignof(ARBNPC_BP_C) == 0x000010, "Wrong alignment on ARBNPC_BP_C");
static_assert(sizeof(ARBNPC_BP_C) == 0x005890, "Wrong size on ARBNPC_BP_C");
static_assert(offsetof(ARBNPC_BP_C, UberGraphFrame) == 0x005840, "Member 'ARBNPC_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, RBActiveSkillVision) == 0x005848, "Member 'ARBNPC_BP_C::RBActiveSkillVision' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, AS_WaveSphere) == 0x005850, "Member 'ARBNPC_BP_C::AS_WaveSphere' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, Head_Aim_Assist) == 0x005858, "Member 'ARBNPC_BP_C::Head_Aim_Assist' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, BroadcastWeaponAnimation) == 0x005860, "Member 'ARBNPC_BP_C::BroadcastWeaponAnimation' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, RageEyeFX_R) == 0x005870, "Member 'ARBNPC_BP_C::RageEyeFX_R' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, RageEyeFX_L) == 0x005878, "Member 'ARBNPC_BP_C::RageEyeFX_L' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, BloodDripsParticles) == 0x005880, "Member 'ARBNPC_BP_C::BloodDripsParticles' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, SubtitleDistanceOverride) == 0x005888, "Member 'ARBNPC_BP_C::SubtitleDistanceOverride' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, SubtitleDistanceOccludedOverride) == 0x00588C, "Member 'ARBNPC_BP_C::SubtitleDistanceOccludedOverride' has a wrong offset!");

}

