#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReagentReleasePhotoBoothMinus02_BP

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.ToggleSkeletalMeshTicksForPicture
// 0x0001 (0x0001 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_ToggleSkeletalMeshTicksForPicture final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_ToggleSkeletalMeshTicksForPicture) == 0x000001, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_ToggleSkeletalMeshTicksForPicture");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_ToggleSkeletalMeshTicksForPicture) == 0x000001, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_ToggleSkeletalMeshTicksForPicture");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_ToggleSkeletalMeshTicksForPicture, bEnable) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_ToggleSkeletalMeshTicksForPicture::bEnable' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.SetupTrialSucessSettings
// 0x0001 (0x0001 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_SetupTrialSucessSettings final
{
public:
	bool                                          bTrialFailed;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_SetupTrialSucessSettings) == 0x000001, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_SetupTrialSucessSettings");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_SetupTrialSucessSettings) == 0x000001, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_SetupTrialSucessSettings");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_SetupTrialSucessSettings, bTrialFailed) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_SetupTrialSucessSettings::bTrialFailed' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.SetAnimBlueprintSelectionActive
// 0x0020 (0x0020 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_SetAnimBlueprintSelectionActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CC0[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEndScreen_Player_AnimBP_C*             K2Node_DynamicCast_AsEnd_Screen_Player_Anim_BP;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_SetAnimBlueprintSelectionActive) == 0x000008, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_SetAnimBlueprintSelectionActive");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_SetAnimBlueprintSelectionActive) == 0x000020, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_SetAnimBlueprintSelectionActive");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_SetAnimBlueprintSelectionActive, bActive) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_SetAnimBlueprintSelectionActive::bActive' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_SetAnimBlueprintSelectionActive, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_SetAnimBlueprintSelectionActive::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_SetAnimBlueprintSelectionActive, K2Node_DynamicCast_AsEnd_Screen_Player_Anim_BP) == 0x000010, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_SetAnimBlueprintSelectionActive::K2Node_DynamicCast_AsEnd_Screen_Player_Anim_BP' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_SetAnimBlueprintSelectionActive, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_SetAnimBlueprintSelectionActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.SetCharacterTQ
// 0x0020 (0x0020 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ final
{
public:
	float                                         In_TQ;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CC1[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEndScreen_Player_AnimBP_C*             K2Node_DynamicCast_AsEnd_Screen_Player_Anim_BP;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ) == 0x000008, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ) == 0x000020, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ, In_TQ) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ::In_TQ' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ, CallFunc_Less_FloatFloat_ReturnValue) == 0x000004, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ, K2Node_DynamicCast_AsEnd_Screen_Player_Anim_BP) == 0x000010, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ::K2Node_DynamicCast_AsEnd_Screen_Player_Anim_BP' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000019, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_SetCharacterTQ::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.TryShow
// 0x0001 (0x0001 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_TryShow final
{
public:
	bool                                          CallFunc_IsWaitingForRessources_ReturnValue;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_TryShow) == 0x000001, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_TryShow");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_TryShow) == 0x000001, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_TryShow");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_TryShow, CallFunc_IsWaitingForRessources_ReturnValue) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_TryShow::CallFunc_IsWaitingForRessources_ReturnValue' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.RefreshRigs
// 0x0060 (0x0060 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	EActiveSkillType                              CallFunc_GetActiveSkillType_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CC2[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ARBActiveSkill>             CallFunc_GetActiveSkillClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CC3[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs) == 0x000010, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs) == 0x000060, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs, CallFunc_GetActiveSkillType_ReturnValue) == 0x000030, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs::CallFunc_GetActiveSkillType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs, CallFunc_GetActiveSkillClass_ReturnValue) == 0x000038, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs::CallFunc_GetActiveSkillClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs, K2Node_ClassDynamicCast_AsActor) == 0x000040, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs, K2Node_ClassDynamicCast_bSuccess) == 0x000048, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_RefreshRigs::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.OverrideActorMaterials
// 0x0090 (0x0090 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CC4[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CC5[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC6[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CC7[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CC8[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials) == 0x000008, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials) == 0x000090, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, Actor) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::Actor' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, Temp_int_Array_Index_Variable) == 0x000024, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, Temp_int_Variable) == 0x000028, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_Add_IntInt_ReturnValue_2) == 0x000040, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, Temp_int_Array_Index_Variable_1) == 0x000044, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_Array_Get_Item) == 0x000048, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_GetChildrenComponents_Children) == 0x000050, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_Less_IntInt_ReturnValue_1) == 0x000070, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, K2Node_DynamicCast_AsPrimitive_Component) == 0x000078, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_GetNumMaterials_ReturnValue) == 0x000084, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_Subtract_IntInt_ReturnValue) == 0x000088, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00008C, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OverrideActorMaterials::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.SetupMaterialOverride
// 0x0001 (0x0001 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_SetupMaterialOverride final
{
public:
	bool                                          CallFunc_IsUnknown_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_SetupMaterialOverride) == 0x000001, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_SetupMaterialOverride");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_SetupMaterialOverride) == 0x000001, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_SetupMaterialOverride");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_SetupMaterialOverride, CallFunc_IsUnknown_ReturnValue) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_SetupMaterialOverride::CallFunc_IsUnknown_ReturnValue' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.CleanSpawnedRigs
// 0x0002 (0x0002 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_CleanSpawnedRigs final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_CleanSpawnedRigs) == 0x000001, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_CleanSpawnedRigs");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_CleanSpawnedRigs) == 0x000002, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_CleanSpawnedRigs");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_CleanSpawnedRigs, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_CleanSpawnedRigs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_CleanSpawnedRigs, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_CleanSpawnedRigs::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.CleanExtraMeshes
// 0x0020 (0x0020 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC9[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes) == 0x000008, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes) == 0x000020, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes, CallFunc_Array_Get_Item) == 0x000010, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_CleanExtraMeshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.RefreshPlayerCusto
// 0x0018 (0x0018 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_RefreshPlayerCusto final
{
public:
	TArray<class URBPlayerCustomizationOption*>   NewLocalVar_0;                                     // 0x0000(0x0010)(Edit, BlueprintVisible)
	class URBPawnCustomizationManager*            CallFunc_GetPawnCustomizationManager_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_RefreshPlayerCusto) == 0x000008, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_RefreshPlayerCusto");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_RefreshPlayerCusto) == 0x000018, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_RefreshPlayerCusto");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_RefreshPlayerCusto, NewLocalVar_0) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_RefreshPlayerCusto::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_RefreshPlayerCusto, CallFunc_GetPawnCustomizationManager_ReturnValue) == 0x000010, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_RefreshPlayerCusto::CallFunc_GetPawnCustomizationManager_ReturnValue' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.Show
// 0x0002 (0x0002 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_Show final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_Show) == 0x000001, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_Show");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_Show) == 0x000002, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_Show");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_Show, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_Show::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_Show, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_Show::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_ReceiveEndPlay");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_ReceiveEndPlay) == 0x000001, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_ReceiveEndPlay");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.OnExtraCustomizationMeshesAddedForSlot
// 0x0018 (0x0018 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_OnExtraCustomizationMeshesAddedForSlot final
{
public:
	TArray<class USkeletalMeshComponent*>         AddedExtraMeshes;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EPlayerCustomizationSlot                      Param_Slot;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_OnExtraCustomizationMeshesAddedForSlot) == 0x000008, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_OnExtraCustomizationMeshesAddedForSlot");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_OnExtraCustomizationMeshesAddedForSlot) == 0x000018, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_OnExtraCustomizationMeshesAddedForSlot");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OnExtraCustomizationMeshesAddedForSlot, AddedExtraMeshes) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OnExtraCustomizationMeshesAddedForSlot::AddedExtraMeshes' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_OnExtraCustomizationMeshesAddedForSlot, Param_Slot) == 0x000010, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_OnExtraCustomizationMeshesAddedForSlot::Param_Slot' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.ExecuteUbergraph_ReagentReleasePhotoBooth-02_BP
// 0x0048 (0x0048 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CCA[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_Event_addedExtraMeshes;                     // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	EPlayerCustomizationSlot                      K2Node_Event_slot;                                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CCB[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP) == 0x000008, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP) == 0x000048, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP, EntryPoint) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP, Temp_int_Array_Index_Variable) == 0x000004, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP, K2Node_Event_EndPlayReason) == 0x000010, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP, K2Node_Event_addedExtraMeshes) == 0x000018, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP::K2Node_Event_addedExtraMeshes' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP, K2Node_Event_slot) == 0x000028, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP::K2Node_Event_slot' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP, CallFunc_Array_Get_Item) == 0x000030, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_ExecuteUbergraph_ReagentReleasePhotoBoothMinus02_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.GetMainParentSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_GetMainParentSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_GetMainParentSkeletalMesh) == 0x000008, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_GetMainParentSkeletalMesh");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_GetMainParentSkeletalMesh) == 0x000008, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_GetMainParentSkeletalMesh");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_GetMainParentSkeletalMesh, ReturnValue) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_GetMainParentSkeletalMesh::ReturnValue' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.GetWatchComponent
// 0x0008 (0x0008 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_GetWatchComponent final
{
public:
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_GetWatchComponent) == 0x000008, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_GetWatchComponent");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_GetWatchComponent) == 0x000008, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_GetWatchComponent");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_GetWatchComponent, ReturnValue) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_GetWatchComponent::ReturnValue' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.GetPlayerCustomizationInfo
// 0x0070 (0x0070 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_GetPlayerCustomizationInfo final
{
public:
	struct FRBPlayerCustomizationInfo             ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ReturnParm)
	struct FRBPlayerCustomizationInfo             CallFunc_GetCustomizationInfo_ReturnValue;         // 0x0038(0x0038)(ConstParm)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_GetPlayerCustomizationInfo) == 0x000008, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_GetPlayerCustomizationInfo");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_GetPlayerCustomizationInfo) == 0x000070, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_GetPlayerCustomizationInfo");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_GetPlayerCustomizationInfo, ReturnValue) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_GetPlayerCustomizationInfo::ReturnValue' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_GetPlayerCustomizationInfo, CallFunc_GetCustomizationInfo_ReturnValue) == 0x000038, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_GetPlayerCustomizationInfo::CallFunc_GetCustomizationInfo_ReturnValue' has a wrong offset!");

// Function ReagentReleasePhotoBooth-02_BP.ReagentReleasePhotoBooth-02_BP_C.GetSkeletalMeshComponentForSlot
// 0x0018 (0x0018 - 0x0000)
struct ReagentReleasePhotoBoothMinus02_BP_C_GetSkeletalMeshComponentForSlot final
{
public:
	EPlayerCustomizationSlot                      Param_Slot;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CCC[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReagentReleasePhotoBoothMinus02_BP_C_GetSkeletalMeshComponentForSlot) == 0x000008, "Wrong alignment on ReagentReleasePhotoBoothMinus02_BP_C_GetSkeletalMeshComponentForSlot");
static_assert(sizeof(ReagentReleasePhotoBoothMinus02_BP_C_GetSkeletalMeshComponentForSlot) == 0x000018, "Wrong size on ReagentReleasePhotoBoothMinus02_BP_C_GetSkeletalMeshComponentForSlot");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_GetSkeletalMeshComponentForSlot, Param_Slot) == 0x000000, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_GetSkeletalMeshComponentForSlot::Param_Slot' has a wrong offset!");
static_assert(offsetof(ReagentReleasePhotoBoothMinus02_BP_C_GetSkeletalMeshComponentForSlot, ReturnValue) == 0x000008, "Member 'ReagentReleasePhotoBoothMinus02_BP_C_GetSkeletalMeshComponentForSlot::ReturnValue' has a wrong offset!");
