#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReleaseCorridorWindowShutterMinus01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ReleaseCorridorWindowShutter-01_BP.ReleaseCorridorWindowShutter-01_BP_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct ReleaseCorridorWindowShutterMinus01_BP_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReleaseCorridorWindowShutterMinus01_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on ReleaseCorridorWindowShutterMinus01_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(ReleaseCorridorWindowShutterMinus01_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on ReleaseCorridorWindowShutterMinus01_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(ReleaseCorridorWindowShutterMinus01_BP_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'ReleaseCorridorWindowShutterMinus01_BP_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

// Function ReleaseCorridorWindowShutter-01_BP.ReleaseCorridorWindowShutter-01_BP_C.ExecuteUbergraph_ReleaseCorridorWindowShutter-01_BP
// 0x0098 (0x0098 - 0x0000)
struct ReleaseCorridorWindowShutterMinus01_BP_C_ExecuteUbergraph_ReleaseCorridorWindowShutterMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ReleaseCorridorWindowShutterMinus01_BP_C_ExecuteUbergraph_ReleaseCorridorWindowShutterMinus01_BP) == 0x000004, "Wrong alignment on ReleaseCorridorWindowShutterMinus01_BP_C_ExecuteUbergraph_ReleaseCorridorWindowShutterMinus01_BP");
static_assert(sizeof(ReleaseCorridorWindowShutterMinus01_BP_C_ExecuteUbergraph_ReleaseCorridorWindowShutterMinus01_BP) == 0x000098, "Wrong size on ReleaseCorridorWindowShutterMinus01_BP_C_ExecuteUbergraph_ReleaseCorridorWindowShutterMinus01_BP");
static_assert(offsetof(ReleaseCorridorWindowShutterMinus01_BP_C_ExecuteUbergraph_ReleaseCorridorWindowShutterMinus01_BP, EntryPoint) == 0x000000, "Member 'ReleaseCorridorWindowShutterMinus01_BP_C_ExecuteUbergraph_ReleaseCorridorWindowShutterMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ReleaseCorridorWindowShutterMinus01_BP_C_ExecuteUbergraph_ReleaseCorridorWindowShutterMinus01_BP, CallFunc_VLerp_ReturnValue) == 0x000004, "Member 'ReleaseCorridorWindowShutterMinus01_BP_C_ExecuteUbergraph_ReleaseCorridorWindowShutterMinus01_BP::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReleaseCorridorWindowShutterMinus01_BP_C_ExecuteUbergraph_ReleaseCorridorWindowShutterMinus01_BP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000010, "Member 'ReleaseCorridorWindowShutterMinus01_BP_C_ExecuteUbergraph_ReleaseCorridorWindowShutterMinus01_BP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

}

