#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReligiousFrameMinus01_BP

#include "Basic.hpp"

#include "CellCustomizationPropBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ReligiousFrame-01_BP.ReligiousFrame-01_BP_C
// 0x0058 (0x02B0 - 0x0258)
class AReligiousFrameMinus01_BP_C final : public ACellCustomizationPropBase_C
{
public:
	class UNiagaraComponent*                      Ngr_MapSet_FunPark_CandleFlame3;                   // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_MapSet_FunPark_CandleFlame4;                   // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CandleMinus03;                                     // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CandleMinus02;                                     // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_MapSet_FunPark_CandleFlame2;                   // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_MapSet_FunPark_CandleFlame1;                   // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_MapSet_FunPark_CandleFlame;                    // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReligiousFrame-01_BP_C">();
	}
	static class AReligiousFrameMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReligiousFrameMinus01_BP_C>();
	}
};
static_assert(alignof(AReligiousFrameMinus01_BP_C) == 0x000008, "Wrong alignment on AReligiousFrameMinus01_BP_C");
static_assert(sizeof(AReligiousFrameMinus01_BP_C) == 0x0002B0, "Wrong size on AReligiousFrameMinus01_BP_C");
static_assert(offsetof(AReligiousFrameMinus01_BP_C, Ngr_MapSet_FunPark_CandleFlame3) == 0x000258, "Member 'AReligiousFrameMinus01_BP_C::Ngr_MapSet_FunPark_CandleFlame3' has a wrong offset!");
static_assert(offsetof(AReligiousFrameMinus01_BP_C, Ngr_MapSet_FunPark_CandleFlame4) == 0x000260, "Member 'AReligiousFrameMinus01_BP_C::Ngr_MapSet_FunPark_CandleFlame4' has a wrong offset!");
static_assert(offsetof(AReligiousFrameMinus01_BP_C, CandleMinus03) == 0x000268, "Member 'AReligiousFrameMinus01_BP_C::CandleMinus03' has a wrong offset!");
static_assert(offsetof(AReligiousFrameMinus01_BP_C, CandleMinus02) == 0x000270, "Member 'AReligiousFrameMinus01_BP_C::CandleMinus02' has a wrong offset!");
static_assert(offsetof(AReligiousFrameMinus01_BP_C, Ngr_MapSet_FunPark_CandleFlame2) == 0x000278, "Member 'AReligiousFrameMinus01_BP_C::Ngr_MapSet_FunPark_CandleFlame2' has a wrong offset!");
static_assert(offsetof(AReligiousFrameMinus01_BP_C, StaticMesh3) == 0x000280, "Member 'AReligiousFrameMinus01_BP_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(AReligiousFrameMinus01_BP_C, Ngr_MapSet_FunPark_CandleFlame1) == 0x000288, "Member 'AReligiousFrameMinus01_BP_C::Ngr_MapSet_FunPark_CandleFlame1' has a wrong offset!");
static_assert(offsetof(AReligiousFrameMinus01_BP_C, StaticMesh2) == 0x000290, "Member 'AReligiousFrameMinus01_BP_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(AReligiousFrameMinus01_BP_C, Ngr_MapSet_FunPark_CandleFlame) == 0x000298, "Member 'AReligiousFrameMinus01_BP_C::Ngr_MapSet_FunPark_CandleFlame' has a wrong offset!");
static_assert(offsetof(AReligiousFrameMinus01_BP_C, StaticMesh1) == 0x0002A0, "Member 'AReligiousFrameMinus01_BP_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AReligiousFrameMinus01_BP_C, StaticMesh) == 0x0002A8, "Member 'AReligiousFrameMinus01_BP_C::StaticMesh' has a wrong offset!");

}

