#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RigSlotButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RigSlotButton.RigSlotButton_C.RefreshNewStatus
// 0x0005 (0x0005 - 0x0000)
struct RigSlotButton_C_RefreshNewStatus final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasRecentlyBoughtUpgradeOfType_ReturnValue; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RigSlotButton_C_RefreshNewStatus) == 0x000001, "Wrong alignment on RigSlotButton_C_RefreshNewStatus");
static_assert(sizeof(RigSlotButton_C_RefreshNewStatus) == 0x000005, "Wrong size on RigSlotButton_C_RefreshNewStatus");
static_assert(offsetof(RigSlotButton_C_RefreshNewStatus, Temp_bool_Variable) == 0x000000, "Member 'RigSlotButton_C_RefreshNewStatus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_RefreshNewStatus, Temp_byte_Variable) == 0x000001, "Member 'RigSlotButton_C_RefreshNewStatus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_RefreshNewStatus, Temp_byte_Variable_1) == 0x000002, "Member 'RigSlotButton_C_RefreshNewStatus::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_RefreshNewStatus, CallFunc_HasRecentlyBoughtUpgradeOfType_ReturnValue) == 0x000003, "Member 'RigSlotButton_C_RefreshNewStatus::CallFunc_HasRecentlyBoughtUpgradeOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_RefreshNewStatus, K2Node_Select_Default) == 0x000004, "Member 'RigSlotButton_C_RefreshNewStatus::K2Node_Select_Default' has a wrong offset!");

// Function RigSlotButton.RigSlotButton_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct RigSlotButton_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(RigSlotButton_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on RigSlotButton_C_OnRemovedFromFocusPath");
static_assert(sizeof(RigSlotButton_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on RigSlotButton_C_OnRemovedFromFocusPath");
static_assert(offsetof(RigSlotButton_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'RigSlotButton_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function RigSlotButton.RigSlotButton_C.OnFocusReceived
// 0x01E0 (0x01E0 - 0x0000)
struct RigSlotButton_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_376C[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0108(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0128(0x00B8)()
};
static_assert(alignof(RigSlotButton_C_OnFocusReceived) == 0x000008, "Wrong alignment on RigSlotButton_C_OnFocusReceived");
static_assert(sizeof(RigSlotButton_C_OnFocusReceived) == 0x0001E0, "Wrong size on RigSlotButton_C_OnFocusReceived");
static_assert(offsetof(RigSlotButton_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'RigSlotButton_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'RigSlotButton_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'RigSlotButton_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_OnFocusReceived, CallFunc_GetMenuManager_ReturnValue) == 0x0000F8, "Member 'RigSlotButton_C_OnFocusReceived::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_OnFocusReceived, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000100, "Member 'RigSlotButton_C_OnFocusReceived::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_OnFocusReceived, CallFunc_MakeLiteralText_ReturnValue) == 0x000108, "Member 'RigSlotButton_C_OnFocusReceived::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_OnFocusReceived, CallFunc_MakeLiteralName_ReturnValue) == 0x000120, "Member 'RigSlotButton_C_OnFocusReceived::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000128, "Member 'RigSlotButton_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function RigSlotButton.RigSlotButton_C.ComputeTier
// 0x0258 (0x0258 - 0x0000)
struct RigSlotButton_C_ComputeTier final
{
public:
	int32                                         Tier;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRBItemProgressionData>         CallFunc_FilterItemProgressionData_ReturnValue;    // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_376D[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBItemProgressionData                 CallFunc_Array_Get_Item;                           // 0x0038(0x00E8)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_376E[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuUpgradeItemInfo                   CallFunc_GetUpgradeItemInfo_ReturnValue;           // 0x0128(0x0128)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RigSlotButton_C_ComputeTier) == 0x000008, "Wrong alignment on RigSlotButton_C_ComputeTier");
static_assert(sizeof(RigSlotButton_C_ComputeTier) == 0x000258, "Wrong size on RigSlotButton_C_ComputeTier");
static_assert(offsetof(RigSlotButton_C_ComputeTier, Tier) == 0x000000, "Member 'RigSlotButton_C_ComputeTier::Tier' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_ComputeTier, Temp_int_Variable) == 0x000004, "Member 'RigSlotButton_C_ComputeTier::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_ComputeTier, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'RigSlotButton_C_ComputeTier::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_ComputeTier, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'RigSlotButton_C_ComputeTier::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_ComputeTier, Temp_int_Array_Index_Variable) == 0x000010, "Member 'RigSlotButton_C_ComputeTier::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_ComputeTier, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'RigSlotButton_C_ComputeTier::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_ComputeTier, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x000018, "Member 'RigSlotButton_C_ComputeTier::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_ComputeTier, CallFunc_FilterItemProgressionData_ReturnValue) == 0x000020, "Member 'RigSlotButton_C_ComputeTier::CallFunc_FilterItemProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_ComputeTier, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'RigSlotButton_C_ComputeTier::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_ComputeTier, CallFunc_Array_Get_Item) == 0x000038, "Member 'RigSlotButton_C_ComputeTier::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_ComputeTier, CallFunc_Less_IntInt_ReturnValue) == 0x000120, "Member 'RigSlotButton_C_ComputeTier::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_ComputeTier, CallFunc_GetUpgradeItemInfo_ReturnValue) == 0x000128, "Member 'RigSlotButton_C_ComputeTier::CallFunc_GetUpgradeItemInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_ComputeTier, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000250, "Member 'RigSlotButton_C_ComputeTier::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function RigSlotButton.RigSlotButton_C.SetHovered
// 0x0002 (0x0002 - 0x0000)
struct RigSlotButton_C_SetHovered final
{
public:
	bool                                          bInHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RigSlotButton_C_SetHovered) == 0x000001, "Wrong alignment on RigSlotButton_C_SetHovered");
static_assert(sizeof(RigSlotButton_C_SetHovered) == 0x000002, "Wrong size on RigSlotButton_C_SetHovered");
static_assert(offsetof(RigSlotButton_C_SetHovered, bInHovered) == 0x000000, "Member 'RigSlotButton_C_SetHovered::bInHovered' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_SetHovered, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'RigSlotButton_C_SetHovered::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function RigSlotButton.RigSlotButton_C.Refresh
// 0x0140 (0x0140 - 0x0000)
struct RigSlotButton_C_Refresh final
{
public:
	struct FRBPlayerLoadout                       CallFunc_GetMenuLoadout_ReturnValue;               // 0x0000(0x0018)()
	struct FMenuUpgradeItemInfo                   CallFunc_GetActiveSkillUpgradeItemInfo_ReturnValue; // 0x0018(0x0128)()
};
static_assert(alignof(RigSlotButton_C_Refresh) == 0x000008, "Wrong alignment on RigSlotButton_C_Refresh");
static_assert(sizeof(RigSlotButton_C_Refresh) == 0x000140, "Wrong size on RigSlotButton_C_Refresh");
static_assert(offsetof(RigSlotButton_C_Refresh, CallFunc_GetMenuLoadout_ReturnValue) == 0x000000, "Member 'RigSlotButton_C_Refresh::CallFunc_GetMenuLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Refresh, CallFunc_GetActiveSkillUpgradeItemInfo_ReturnValue) == 0x000018, "Member 'RigSlotButton_C_Refresh::CallFunc_GetActiveSkillUpgradeItemInfo_ReturnValue' has a wrong offset!");

// Function RigSlotButton.RigSlotButton_C.Setup
// 0x02A8 (0x02A8 - 0x0000)
struct RigSlotButton_C_Setup final
{
public:
	class UTexture2D*                             Temp_object_Variable;                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_376F[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3770[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3771[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0058(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0080(0x0028)()
	bool                                          Temp_bool_Variable_3;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3772[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00B0(0x0028)()
	bool                                          Temp_bool_Variable_4;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3773[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActiveSkillType                              Temp_byte_Variable;                                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3774[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_5;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_6;                            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_7;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_8;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3775[0x2];                                     // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x0130(0x0028)()
	class UTexture2D*                             K2Node_Select_Default_3;                           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0160(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01B0(0x0018)()
	class FText                                   K2Node_Select_Default_4;                           // 0x01C8(0x0018)()
	class URBPlayerLoadoutConfig*                 CallFunc_GetPlayerLoadoutConfig_ReturnValue;       // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveSkillCommonParams               CallFunc_GetActiveSkillCommonParams_ReturnValue;   // 0x01E8(0x0078)(ConstParm)
	class FText                                   K2Node_Select_Default_5;                           // 0x0260(0x0018)()
	struct FSlateColor                            K2Node_Select_Default_6;                           // 0x0278(0x0028)()
	class UTexture2D*                             K2Node_Select_Default_7;                           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RigSlotButton_C_Setup) == 0x000008, "Wrong alignment on RigSlotButton_C_Setup");
static_assert(sizeof(RigSlotButton_C_Setup) == 0x0002A8, "Wrong size on RigSlotButton_C_Setup");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_object_Variable) == 0x000000, "Member 'RigSlotButton_C_Setup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_object_Variable_1) == 0x000008, "Member 'RigSlotButton_C_Setup::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_bool_Variable) == 0x000010, "Member 'RigSlotButton_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_text_Variable) == 0x000018, "Member 'RigSlotButton_C_Setup::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_bool_Variable_1) == 0x000030, "Member 'RigSlotButton_C_Setup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_text_Variable_1) == 0x000038, "Member 'RigSlotButton_C_Setup::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_bool_Variable_2) == 0x000050, "Member 'RigSlotButton_C_Setup::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, K2Node_MakeStruct_SlateColor) == 0x000058, "Member 'RigSlotButton_C_Setup::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, K2Node_MakeStruct_SlateColor_1) == 0x000080, "Member 'RigSlotButton_C_Setup::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_bool_Variable_3) == 0x0000A8, "Member 'RigSlotButton_C_Setup::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, K2Node_MakeStruct_SlateColor_2) == 0x0000B0, "Member 'RigSlotButton_C_Setup::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_bool_Variable_4) == 0x0000D8, "Member 'RigSlotButton_C_Setup::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_object_Variable_2) == 0x0000E0, "Member 'RigSlotButton_C_Setup::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_byte_Variable) == 0x0000E8, "Member 'RigSlotButton_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_object_Variable_3) == 0x0000F0, "Member 'RigSlotButton_C_Setup::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_object_Variable_4) == 0x0000F8, "Member 'RigSlotButton_C_Setup::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_object_Variable_5) == 0x000100, "Member 'RigSlotButton_C_Setup::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_object_Variable_6) == 0x000108, "Member 'RigSlotButton_C_Setup::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_object_Variable_7) == 0x000110, "Member 'RigSlotButton_C_Setup::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_object_Variable_8) == 0x000118, "Member 'RigSlotButton_C_Setup::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_bool_Variable_5) == 0x000120, "Member 'RigSlotButton_C_Setup::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_byte_Variable_1) == 0x000121, "Member 'RigSlotButton_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_byte_Variable_2) == 0x000122, "Member 'RigSlotButton_C_Setup::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, Temp_bool_Variable_6) == 0x000123, "Member 'RigSlotButton_C_Setup::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000124, "Member 'RigSlotButton_C_Setup::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, K2Node_Select_Default) == 0x000125, "Member 'RigSlotButton_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, K2Node_Select_Default_1) == 0x000128, "Member 'RigSlotButton_C_Setup::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, K2Node_Select_Default_2) == 0x000130, "Member 'RigSlotButton_C_Setup::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, K2Node_Select_Default_3) == 0x000158, "Member 'RigSlotButton_C_Setup::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, K2Node_MakeStruct_FormatArgumentData) == 0x000160, "Member 'RigSlotButton_C_Setup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, K2Node_MakeArray_Array) == 0x0001A0, "Member 'RigSlotButton_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, CallFunc_Format_ReturnValue) == 0x0001B0, "Member 'RigSlotButton_C_Setup::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, K2Node_Select_Default_4) == 0x0001C8, "Member 'RigSlotButton_C_Setup::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, CallFunc_GetPlayerLoadoutConfig_ReturnValue) == 0x0001E0, "Member 'RigSlotButton_C_Setup::CallFunc_GetPlayerLoadoutConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, CallFunc_GetActiveSkillCommonParams_ReturnValue) == 0x0001E8, "Member 'RigSlotButton_C_Setup::CallFunc_GetActiveSkillCommonParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, K2Node_Select_Default_5) == 0x000260, "Member 'RigSlotButton_C_Setup::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, K2Node_Select_Default_6) == 0x000278, "Member 'RigSlotButton_C_Setup::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_Setup, K2Node_Select_Default_7) == 0x0002A0, "Member 'RigSlotButton_C_Setup::K2Node_Select_Default_7' has a wrong offset!");

// Function RigSlotButton.RigSlotButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct RigSlotButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RigSlotButton_C_PreConstruct) == 0x000001, "Wrong alignment on RigSlotButton_C_PreConstruct");
static_assert(sizeof(RigSlotButton_C_PreConstruct) == 0x000001, "Wrong size on RigSlotButton_C_PreConstruct");
static_assert(offsetof(RigSlotButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'RigSlotButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function RigSlotButton.RigSlotButton_C.ExecuteUbergraph_RigSlotButton
// 0x0008 (0x0008 - 0x0000)
struct RigSlotButton_C_ExecuteUbergraph_RigSlotButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RigSlotButton_C_ExecuteUbergraph_RigSlotButton) == 0x000004, "Wrong alignment on RigSlotButton_C_ExecuteUbergraph_RigSlotButton");
static_assert(sizeof(RigSlotButton_C_ExecuteUbergraph_RigSlotButton) == 0x000008, "Wrong size on RigSlotButton_C_ExecuteUbergraph_RigSlotButton");
static_assert(offsetof(RigSlotButton_C_ExecuteUbergraph_RigSlotButton, EntryPoint) == 0x000000, "Member 'RigSlotButton_C_ExecuteUbergraph_RigSlotButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(RigSlotButton_C_ExecuteUbergraph_RigSlotButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'RigSlotButton_C_ExecuteUbergraph_RigSlotButton::K2Node_Event_IsDesignTime' has a wrong offset!");

}

