#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RollingDoorMinusBase_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.ConstructRepulsion_Editor
// 0x00C0 (0x00C0 - 0x0000)
struct RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor final
{
public:
	TArray<struct FRepulsionRule>                 RepulsionAnyoneBackwardOnly;                       // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<struct FRepulsionRule>                 RepulsionAnyoneForwardOnly;                        // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<struct FRepulsionRule>                 NoRepulsionRule;                                   // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<struct FRepulsionRule>                 RepulsionAnyoneBothSides;                          // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<struct FRepulsionRule>                 K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
	TArray<struct FRepulsionRule>                 K2Node_MakeArray_Array_1;                          // 0x0050(0x0010)(ReferenceParm)
	TArray<struct FRepulsionRule>                 K2Node_MakeArray_Array_2;                          // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3198[0x2];                                     // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x009C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor) == 0x000008, "Wrong alignment on RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor");
static_assert(sizeof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor) == 0x0000C0, "Wrong size on RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, RepulsionAnyoneBackwardOnly) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::RepulsionAnyoneBackwardOnly' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, RepulsionAnyoneForwardOnly) == 0x000010, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::RepulsionAnyoneForwardOnly' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, NoRepulsionRule) == 0x000020, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::NoRepulsionRule' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, RepulsionAnyoneBothSides) == 0x000030, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::RepulsionAnyoneBothSides' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, K2Node_MakeArray_Array) == 0x000040, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, K2Node_MakeArray_Array_1) == 0x000050, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, K2Node_MakeArray_Array_2) == 0x000060, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000070, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_Not_PreBool_ReturnValue) == 0x000071, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_Not_PreBool_ReturnValue_1) == 0x000072, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_BooleanAND_ReturnValue) == 0x000073, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x000074, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_BooleanAND_ReturnValue_1) == 0x000075, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_SelectFloat_ReturnValue) == 0x000078, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_SelectColor_ReturnValue) == 0x00007C, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_MakeVector_ReturnValue) == 0x00008C, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_SelectFloat_ReturnValue_1) == 0x000098, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_SelectColor_ReturnValue_1) == 0x00009C, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_MakeVector_ReturnValue_1) == 0x0000AC, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_BooleanAND_ReturnValue_2) == 0x0000B8, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_BooleanOR_ReturnValue) == 0x0000B9, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_BooleanAND_ReturnValue_3) == 0x0000BA, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor, CallFunc_BooleanOR_ReturnValue_1) == 0x0000BB, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion_Editor::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.TryResetElectricalSwitches
// 0x0002 (0x0002 - 0x0000)
struct RollingDoorMinusBase_BP_C_TryResetElectricalSwitches final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RollingDoorMinusBase_BP_C_TryResetElectricalSwitches) == 0x000001, "Wrong alignment on RollingDoorMinusBase_BP_C_TryResetElectricalSwitches");
static_assert(sizeof(RollingDoorMinusBase_BP_C_TryResetElectricalSwitches) == 0x000002, "Wrong size on RollingDoorMinusBase_BP_C_TryResetElectricalSwitches");
static_assert(offsetof(RollingDoorMinusBase_BP_C_TryResetElectricalSwitches, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_TryResetElectricalSwitches::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_TryResetElectricalSwitches, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'RollingDoorMinusBase_BP_C_TryResetElectricalSwitches::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.SetLightingSettings
// 0x0050 (0x0050 - 0x0000)
struct RollingDoorMinusBase_BP_C_SetLightingSettings final
{
public:
	TArray<class UActorComponent*>                Components;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3199[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UActorComponent*>                CallFunc_GetComponentByClass_outComponents;        // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319A[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RollingDoorMinusBase_BP_C_SetLightingSettings) == 0x000008, "Wrong alignment on RollingDoorMinusBase_BP_C_SetLightingSettings");
static_assert(sizeof(RollingDoorMinusBase_BP_C_SetLightingSettings) == 0x000050, "Wrong size on RollingDoorMinusBase_BP_C_SetLightingSettings");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetLightingSettings, Components) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_SetLightingSettings::Components' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetLightingSettings, Temp_int_Array_Index_Variable) == 0x000010, "Member 'RollingDoorMinusBase_BP_C_SetLightingSettings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetLightingSettings, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'RollingDoorMinusBase_BP_C_SetLightingSettings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetLightingSettings, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'RollingDoorMinusBase_BP_C_SetLightingSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetLightingSettings, CallFunc_Array_Get_Item) == 0x000020, "Member 'RollingDoorMinusBase_BP_C_SetLightingSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetLightingSettings, CallFunc_GetComponentByClass_outComponents) == 0x000028, "Member 'RollingDoorMinusBase_BP_C_SetLightingSettings::CallFunc_GetComponentByClass_outComponents' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetLightingSettings, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x000038, "Member 'RollingDoorMinusBase_BP_C_SetLightingSettings::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetLightingSettings, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'RollingDoorMinusBase_BP_C_SetLightingSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetLightingSettings, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'RollingDoorMinusBase_BP_C_SetLightingSettings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetLightingSettings, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'RollingDoorMinusBase_BP_C_SetLightingSettings::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetLightingSettings, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'RollingDoorMinusBase_BP_C_SetLightingSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.RefreshTimedLightSelectorState
// 0x001C (0x001C - 0x0000)
struct RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState final
{
public:
	float                                         CallFunc_GetTimedOpenDuration_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimedClosedDuration_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState) == 0x000004, "Wrong alignment on RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState");
static_assert(sizeof(RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState) == 0x00001C, "Wrong size on RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState");
static_assert(offsetof(RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState, CallFunc_GetTimedOpenDuration_ReturnValue) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState::CallFunc_GetTimedOpenDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState, CallFunc_GetTimedClosedDuration_ReturnValue) == 0x000004, "Member 'RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState::CallFunc_GetTimedClosedDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00000C, "Member 'RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState, CallFunc_SelectFloat_ReturnValue_1) == 0x000014, "Member 'RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState, K2Node_SwitchInteger_CmpSuccess) == 0x00001B, "Member 'RollingDoorMinusBase_BP_C_RefreshTimedLightSelectorState::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.DisplayTimeTimers
// 0x000C (0x000C - 0x0000)
struct RollingDoorMinusBase_BP_C_DisplayTimeTimers final
{
public:
	float                                         CallFunc_Get_Unlockable_Duration_Duration;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Unlockable_Duration_Duration_1;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RollingDoorMinusBase_BP_C_DisplayTimeTimers) == 0x000004, "Wrong alignment on RollingDoorMinusBase_BP_C_DisplayTimeTimers");
static_assert(sizeof(RollingDoorMinusBase_BP_C_DisplayTimeTimers) == 0x00000C, "Wrong size on RollingDoorMinusBase_BP_C_DisplayTimeTimers");
static_assert(offsetof(RollingDoorMinusBase_BP_C_DisplayTimeTimers, CallFunc_Get_Unlockable_Duration_Duration) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_DisplayTimeTimers::CallFunc_Get_Unlockable_Duration_Duration' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_DisplayTimeTimers, CallFunc_Get_Unlockable_Duration_Duration_1) == 0x000004, "Member 'RollingDoorMinusBase_BP_C_DisplayTimeTimers::CallFunc_Get_Unlockable_Duration_Duration_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_DisplayTimeTimers, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'RollingDoorMinusBase_BP_C_DisplayTimeTimers::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_DisplayTimeTimers, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'RollingDoorMinusBase_BP_C_DisplayTimeTimers::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.Wrap Time Inital Offset
// 0x0024 (0x0024 - 0x0000)
struct RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset final
{
public:
	float                                         In;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Out;                                               // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WrappedValue;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimedLoopFullDuration_ReturnValue;     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319B[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimedLoopFullDuration_ReturnValue_1;   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset) == 0x000004, "Wrong alignment on RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset");
static_assert(sizeof(RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset) == 0x000024, "Wrong size on RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset");
static_assert(offsetof(RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset, In) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset::In' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset, Out) == 0x000004, "Member 'RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset::Out' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset, WrappedValue) == 0x000008, "Member 'RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset::WrappedValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset, CallFunc_GetTimedLoopFullDuration_ReturnValue) == 0x00000C, "Member 'RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset::CallFunc_GetTimedLoopFullDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset, CallFunc_Less_FloatFloat_ReturnValue) == 0x000010, "Member 'RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset, CallFunc_GetTimedLoopFullDuration_ReturnValue_1) == 0x000018, "Member 'RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset::CallFunc_GetTimedLoopFullDuration_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00001C, "Member 'RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'RollingDoorMinusBase_BP_C_Wrap_Time_Inital_Offset::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.AdjustInitialTimedOffset
// 0x005C (0x005C - 0x0000)
struct RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset final
{
public:
	float                                         TimedInitialOffset;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentTimeDelay;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Wrap_Time_Inital_Offset_Out;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimedOpenDuration_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimedOpenDuration_ReturnValue_1;       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimedClosedDuration_ReturnValue;       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319C[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimedOpenDuration_ReturnValue_2;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimedLoopFullDuration_ReturnValue;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LevelRandomFloatRange_ReturnValue;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset) == 0x000004, "Wrong alignment on RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset");
static_assert(sizeof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset) == 0x00005C, "Wrong size on RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, TimedInitialOffset) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::TimedInitialOffset' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CurrentTimeDelay) == 0x000004, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CurrentTimeDelay' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_Wrap_Time_Inital_Offset_Out) == 0x000008, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_Wrap_Time_Inital_Offset_Out' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_GetTimedOpenDuration_ReturnValue) == 0x000010, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_GetTimedOpenDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_GetTimedOpenDuration_ReturnValue_1) == 0x000014, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_GetTimedOpenDuration_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_GetTimedClosedDuration_ReturnValue) == 0x00001C, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_GetTimedClosedDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_SelectInt_ReturnValue) == 0x000024, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_GetTimedOpenDuration_ReturnValue_2) == 0x000028, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_GetTimedOpenDuration_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_GetTimedLoopFullDuration_ReturnValue) == 0x00002C, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_GetTimedLoopFullDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_Add_FloatFloat_ReturnValue) == 0x000030, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000034, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000038, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00003C, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000040, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_LevelRandomFloatRange_ReturnValue) == 0x000044, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_LevelRandomFloatRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000048, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x00004C, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x000050, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000054, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_Less_FloatFloat_ReturnValue) == 0x000058, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000059, "Member 'RollingDoorMinusBase_BP_C_AdjustInitialTimedOffset::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.ConstructRepulsion
// 0x01C8 (0x01C8 - 0x0000)
struct RollingDoorMinusBase_BP_C_ConstructRepulsion final
{
public:
	TArray<struct FRepulsionRule>                 RepulsionAnyoneBackwardOnly;                       // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<struct FRepulsionRule>                 RepulsionAnyoneForwardOnly;                        // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<struct FRepulsionRule>                 NoRepulsionRule;                                   // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<struct FRepulsionRule>                 RepulsionAnyoneBothSides;                          // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<struct FRepulsionRule>                 K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
	TArray<struct FRepulsionRule>                 K2Node_MakeArray_Array_1;                          // 0x0050(0x0010)(ReferenceParm)
	TArray<struct FRepulsionRule>                 K2Node_MakeArray_Array_2;                          // 0x0060(0x0010)(ReferenceParm)
	struct FRepulsionRule                         CallFunc_AddRepulsionRule_ReturnValue;             // 0x0070(0x0030)()
	struct FRepulsionRule                         CallFunc_AddRepulsionRule_ReturnValue_1;           // 0x00A0(0x0030)()
	struct FRepulsionRule                         CallFunc_AddRepulsionRule_ReturnValue_2;           // 0x00D0(0x0030)()
	struct FRepulsionRule                         CallFunc_AddRepulsionRule_ReturnValue_3;           // 0x0100(0x0030)()
	struct FRepulsionRule                         CallFunc_AddRepulsionRule_ReturnValue_4;           // 0x0130(0x0030)()
	struct FRepulsionRule                         CallFunc_AddRepulsionRule_ReturnValue_5;           // 0x0160(0x0030)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319D[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRepulsionRule                         CallFunc_AddRepulsionRule_ReturnValue_6;           // 0x0198(0x0030)()
};
static_assert(alignof(RollingDoorMinusBase_BP_C_ConstructRepulsion) == 0x000008, "Wrong alignment on RollingDoorMinusBase_BP_C_ConstructRepulsion");
static_assert(sizeof(RollingDoorMinusBase_BP_C_ConstructRepulsion) == 0x0001C8, "Wrong size on RollingDoorMinusBase_BP_C_ConstructRepulsion");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, RepulsionAnyoneBackwardOnly) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::RepulsionAnyoneBackwardOnly' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, RepulsionAnyoneForwardOnly) == 0x000010, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::RepulsionAnyoneForwardOnly' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, NoRepulsionRule) == 0x000020, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::NoRepulsionRule' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, RepulsionAnyoneBothSides) == 0x000030, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::RepulsionAnyoneBothSides' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, K2Node_MakeArray_Array) == 0x000040, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, K2Node_MakeArray_Array_1) == 0x000050, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, K2Node_MakeArray_Array_2) == 0x000060, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, CallFunc_AddRepulsionRule_ReturnValue) == 0x000070, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::CallFunc_AddRepulsionRule_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, CallFunc_AddRepulsionRule_ReturnValue_1) == 0x0000A0, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::CallFunc_AddRepulsionRule_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, CallFunc_AddRepulsionRule_ReturnValue_2) == 0x0000D0, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::CallFunc_AddRepulsionRule_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, CallFunc_AddRepulsionRule_ReturnValue_3) == 0x000100, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::CallFunc_AddRepulsionRule_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, CallFunc_AddRepulsionRule_ReturnValue_4) == 0x000130, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::CallFunc_AddRepulsionRule_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, CallFunc_AddRepulsionRule_ReturnValue_5) == 0x000160, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::CallFunc_AddRepulsionRule_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, CallFunc_BooleanAND_ReturnValue) == 0x000190, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ConstructRepulsion, CallFunc_AddRepulsionRule_ReturnValue_6) == 0x000198, "Member 'RollingDoorMinusBase_BP_C_ConstructRepulsion::CallFunc_AddRepulsionRule_ReturnValue_6' has a wrong offset!");

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.SetShadowMode
// 0x0002 (0x0002 - 0x0000)
struct RollingDoorMinusBase_BP_C_SetShadowMode final
{
public:
	bool                                          UseRealDoorShadow;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RollingDoorMinusBase_BP_C_SetShadowMode) == 0x000001, "Wrong alignment on RollingDoorMinusBase_BP_C_SetShadowMode");
static_assert(sizeof(RollingDoorMinusBase_BP_C_SetShadowMode) == 0x000002, "Wrong size on RollingDoorMinusBase_BP_C_SetShadowMode");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetShadowMode, UseRealDoorShadow) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_SetShadowMode::UseRealDoorShadow' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetShadowMode, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'RollingDoorMinusBase_BP_C_SetShadowMode::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.OnRep_SoundDetector_Front
// 0x009C (0x009C - 0x0000)
struct RollingDoorMinusBase_BP_C_OnRep_SoundDetector_Front final
{
public:
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319E[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0014(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(RollingDoorMinusBase_BP_C_OnRep_SoundDetector_Front) == 0x000004, "Wrong alignment on RollingDoorMinusBase_BP_C_OnRep_SoundDetector_Front");
static_assert(sizeof(RollingDoorMinusBase_BP_C_OnRep_SoundDetector_Front) == 0x00009C, "Wrong size on RollingDoorMinusBase_BP_C_OnRep_SoundDetector_Front");
static_assert(offsetof(RollingDoorMinusBase_BP_C_OnRep_SoundDetector_Front, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_OnRep_SoundDetector_Front::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_OnRep_SoundDetector_Front, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'RollingDoorMinusBase_BP_C_OnRep_SoundDetector_Front::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_OnRep_SoundDetector_Front, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'RollingDoorMinusBase_BP_C_OnRep_SoundDetector_Front::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_OnRep_SoundDetector_Front, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000014, "Member 'RollingDoorMinusBase_BP_C_OnRep_SoundDetector_Front::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.SetCollisions
// 0x0001 (0x0001 - 0x0000)
struct RollingDoorMinusBase_BP_C_SetCollisions final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RollingDoorMinusBase_BP_C_SetCollisions) == 0x000001, "Wrong alignment on RollingDoorMinusBase_BP_C_SetCollisions");
static_assert(sizeof(RollingDoorMinusBase_BP_C_SetCollisions) == 0x000001, "Wrong size on RollingDoorMinusBase_BP_C_SetCollisions");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetCollisions, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_SetCollisions::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.SetSoundConnectors
// 0x00F0 (0x00F0 - 0x0000)
struct RollingDoorMinusBase_BP_C_SetSoundConnectors final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319F[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSoundConnectorComponent*             CallFunc_AddComponent_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0064(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RollingDoorMinusBase_BP_C_SetSoundConnectors) == 0x000010, "Wrong alignment on RollingDoorMinusBase_BP_C_SetSoundConnectors");
static_assert(sizeof(RollingDoorMinusBase_BP_C_SetSoundConnectors) == 0x0000F0, "Wrong size on RollingDoorMinusBase_BP_C_SetSoundConnectors");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetSoundConnectors, Temp_struct_Variable) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_SetSoundConnectors::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetSoundConnectors, Temp_int_Array_Index_Variable) == 0x000030, "Member 'RollingDoorMinusBase_BP_C_SetSoundConnectors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetSoundConnectors, CallFunc_AddComponent_ReturnValue) == 0x000038, "Member 'RollingDoorMinusBase_BP_C_SetSoundConnectors::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetSoundConnectors, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'RollingDoorMinusBase_BP_C_SetSoundConnectors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetSoundConnectors, CallFunc_BreakVector2D_X) == 0x000044, "Member 'RollingDoorMinusBase_BP_C_SetSoundConnectors::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetSoundConnectors, CallFunc_BreakVector2D_Y) == 0x000048, "Member 'RollingDoorMinusBase_BP_C_SetSoundConnectors::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetSoundConnectors, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'RollingDoorMinusBase_BP_C_SetSoundConnectors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetSoundConnectors, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000050, "Member 'RollingDoorMinusBase_BP_C_SetSoundConnectors::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetSoundConnectors, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'RollingDoorMinusBase_BP_C_SetSoundConnectors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetSoundConnectors, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000064, "Member 'RollingDoorMinusBase_BP_C_SetSoundConnectors::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetSoundConnectors, CallFunc_Less_IntInt_ReturnValue) == 0x0000EC, "Member 'RollingDoorMinusBase_BP_C_SetSoundConnectors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.SetGateAnimations
// 0x0020 (0x0020 - 0x0000)
struct RollingDoorMinusBase_BP_C_SetGateAnimations final
{
public:
	class UAnimSequenceBase*                      NewAnimation;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31A0[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RollingDoorMinusBase_BP_C_SetGateAnimations) == 0x000008, "Wrong alignment on RollingDoorMinusBase_BP_C_SetGateAnimations");
static_assert(sizeof(RollingDoorMinusBase_BP_C_SetGateAnimations) == 0x000020, "Wrong size on RollingDoorMinusBase_BP_C_SetGateAnimations");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetGateAnimations, NewAnimation) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_SetGateAnimations::NewAnimation' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetGateAnimations, Temp_bool_Variable) == 0x000008, "Member 'RollingDoorMinusBase_BP_C_SetGateAnimations::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetGateAnimations, Temp_float_Variable) == 0x00000C, "Member 'RollingDoorMinusBase_BP_C_SetGateAnimations::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetGateAnimations, Temp_float_Variable_1) == 0x000010, "Member 'RollingDoorMinusBase_BP_C_SetGateAnimations::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetGateAnimations, K2Node_Select_Default) == 0x000014, "Member 'RollingDoorMinusBase_BP_C_SetGateAnimations::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetGateAnimations, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'RollingDoorMinusBase_BP_C_SetGateAnimations::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.SetGateVisuals
// 0x0018 (0x0018 - 0x0000)
struct RollingDoorMinusBase_BP_C_SetGateVisuals final
{
public:
	class UAnimSequenceBase*                      NewAnimation;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          NewSkelMesh;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RollingDoorMinusBase_BP_C_SetGateVisuals) == 0x000008, "Wrong alignment on RollingDoorMinusBase_BP_C_SetGateVisuals");
static_assert(sizeof(RollingDoorMinusBase_BP_C_SetGateVisuals) == 0x000018, "Wrong size on RollingDoorMinusBase_BP_C_SetGateVisuals");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetGateVisuals, NewAnimation) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_SetGateVisuals::NewAnimation' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetGateVisuals, NewSkelMesh) == 0x000008, "Member 'RollingDoorMinusBase_BP_C_SetGateVisuals::NewSkelMesh' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetGateVisuals, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'RollingDoorMinusBase_BP_C_SetGateVisuals::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_SetGateVisuals, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'RollingDoorMinusBase_BP_C_SetGateVisuals::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.Set Current Delay
// 0x0004 (0x0004 - 0x0000)
struct RollingDoorMinusBase_BP_C_Set_Current_Delay final
{
public:
	float                                         CallFunc_GetCurrentTimedDelay_Delay;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
