#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SasDoorMinus03_BP1

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.HasPlayersInside
// 0x0028 (0x0028 - 0x0000)
struct SasDoorMinus03_BP1_C_HasPlayersInside final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3200[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBSASTube*                             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3201[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoorMinus03_BP1_C_HasPlayersInside) == 0x000008, "Wrong alignment on SasDoorMinus03_BP1_C_HasPlayersInside");
static_assert(sizeof(SasDoorMinus03_BP1_C_HasPlayersInside) == 0x000028, "Wrong size on SasDoorMinus03_BP1_C_HasPlayersInside");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasPlayersInside, Value) == 0x000000, "Member 'SasDoorMinus03_BP1_C_HasPlayersInside::Value' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasPlayersInside, Temp_int_Array_Index_Variable) == 0x000004, "Member 'SasDoorMinus03_BP1_C_HasPlayersInside::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasPlayersInside, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'SasDoorMinus03_BP1_C_HasPlayersInside::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasPlayersInside, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SasDoorMinus03_BP1_C_HasPlayersInside::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasPlayersInside, CallFunc_Array_Get_Item) == 0x000010, "Member 'SasDoorMinus03_BP1_C_HasPlayersInside::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasPlayersInside, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'SasDoorMinus03_BP1_C_HasPlayersInside::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasPlayersInside, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'SasDoorMinus03_BP1_C_HasPlayersInside::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasPlayersInside, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'SasDoorMinus03_BP1_C_HasPlayersInside::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasPlayersInside, CallFunc_Array_Length_ReturnValue_1) == 0x000020, "Member 'SasDoorMinus03_BP1_C_HasPlayersInside::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasPlayersInside, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'SasDoorMinus03_BP1_C_HasPlayersInside::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.IsStageExit
// 0x0005 (0x0005 - 0x0000)
struct SasDoorMinus03_BP1_C_IsStageExit final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSASDoor_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoorMinus03_BP1_C_IsStageExit) == 0x000001, "Wrong alignment on SasDoorMinus03_BP1_C_IsStageExit");
static_assert(sizeof(SasDoorMinus03_BP1_C_IsStageExit) == 0x000005, "Wrong size on SasDoorMinus03_BP1_C_IsStageExit");
static_assert(offsetof(SasDoorMinus03_BP1_C_IsStageExit, NewParam) == 0x000000, "Member 'SasDoorMinus03_BP1_C_IsStageExit::NewParam' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_IsStageExit, CallFunc_IsSASDoor_ReturnValue) == 0x000001, "Member 'SasDoorMinus03_BP1_C_IsStageExit::CallFunc_IsSASDoor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_IsStageExit, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'SasDoorMinus03_BP1_C_IsStageExit::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_IsStageExit, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'SasDoorMinus03_BP1_C_IsStageExit::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_IsStageExit, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'SasDoorMinus03_BP1_C_IsStageExit::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.SetAutoCloseWhenPlayerInside
// 0x0038 (0x0038 - 0x0000)
struct SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside final
{
public:
	bool                                          AutoClose;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3202[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3203[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBSASTube*                             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3204[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASASTubeMinus02_BP_C*                   K2Node_DynamicCast_AsSAS_Tube_02_BP;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside) == 0x000008, "Wrong alignment on SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside");
static_assert(sizeof(SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside) == 0x000038, "Wrong size on SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside, AutoClose) == 0x000000, "Member 'SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside::AutoClose' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside, Temp_int_Array_Index_Variable) == 0x000004, "Member 'SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside, CallFunc_Array_Get_Item) == 0x000018, "Member 'SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside, K2Node_DynamicCast_AsSAS_Tube_02_BP) == 0x000028, "Member 'SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside::K2Node_DynamicCast_AsSAS_Tube_02_BP' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SasDoorMinus03_BP1_C_SetAutoCloseWhenPlayerInside::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.SetAutoOpenWhenPlayerInside
// 0x0038 (0x0038 - 0x0000)
struct SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside final
{
public:
	bool                                          AutoOpen;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3205[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3206[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBSASTube*                             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3207[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASASTubeMinus02_BP_C*                   K2Node_DynamicCast_AsSAS_Tube_02_BP;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside) == 0x000008, "Wrong alignment on SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside");
static_assert(sizeof(SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside) == 0x000038, "Wrong size on SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside, AutoOpen) == 0x000000, "Member 'SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside::AutoOpen' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside, Temp_int_Array_Index_Variable) == 0x000004, "Member 'SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside, CallFunc_Array_Get_Item) == 0x000018, "Member 'SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside, K2Node_DynamicCast_AsSAS_Tube_02_BP) == 0x000028, "Member 'SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside::K2Node_DynamicCast_AsSAS_Tube_02_BP' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SasDoorMinus03_BP1_C_SetAutoOpenWhenPlayerInside::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.ForceLightDisabled
// 0x0038 (0x0038 - 0x0000)
struct SasDoorMinus03_BP1_C_ForceLightDisabled final
{
public:
	bool                                          Disabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3208[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3209[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBSASTube*                             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_320A[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASASTubeMinus02_BP_C*                   K2Node_DynamicCast_AsSAS_Tube_02_BP;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoorMinus03_BP1_C_ForceLightDisabled) == 0x000008, "Wrong alignment on SasDoorMinus03_BP1_C_ForceLightDisabled");
static_assert(sizeof(SasDoorMinus03_BP1_C_ForceLightDisabled) == 0x000038, "Wrong size on SasDoorMinus03_BP1_C_ForceLightDisabled");
static_assert(offsetof(SasDoorMinus03_BP1_C_ForceLightDisabled, Disabled) == 0x000000, "Member 'SasDoorMinus03_BP1_C_ForceLightDisabled::Disabled' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_ForceLightDisabled, Temp_int_Array_Index_Variable) == 0x000004, "Member 'SasDoorMinus03_BP1_C_ForceLightDisabled::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_ForceLightDisabled, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'SasDoorMinus03_BP1_C_ForceLightDisabled::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_ForceLightDisabled, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SasDoorMinus03_BP1_C_ForceLightDisabled::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_ForceLightDisabled, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'SasDoorMinus03_BP1_C_ForceLightDisabled::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_ForceLightDisabled, CallFunc_Array_Get_Item) == 0x000018, "Member 'SasDoorMinus03_BP1_C_ForceLightDisabled::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_ForceLightDisabled, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'SasDoorMinus03_BP1_C_ForceLightDisabled::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_ForceLightDisabled, K2Node_DynamicCast_AsSAS_Tube_02_BP) == 0x000028, "Member 'SasDoorMinus03_BP1_C_ForceLightDisabled::K2Node_DynamicCast_AsSAS_Tube_02_BP' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_ForceLightDisabled, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SasDoorMinus03_BP1_C_ForceLightDisabled::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.HasOpenedTube
// 0x0020 (0x0020 - 0x0000)
struct SasDoorMinus03_BP1_C_HasOpenedTube final
{
public:
	bool                                          Out;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_320B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBSASTube*                             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoorMinus03_BP1_C_HasOpenedTube) == 0x000008, "Wrong alignment on SasDoorMinus03_BP1_C_HasOpenedTube");
static_assert(sizeof(SasDoorMinus03_BP1_C_HasOpenedTube) == 0x000020, "Wrong size on SasDoorMinus03_BP1_C_HasOpenedTube");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasOpenedTube, Out) == 0x000000, "Member 'SasDoorMinus03_BP1_C_HasOpenedTube::Out' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasOpenedTube, Temp_int_Array_Index_Variable) == 0x000004, "Member 'SasDoorMinus03_BP1_C_HasOpenedTube::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasOpenedTube, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'SasDoorMinus03_BP1_C_HasOpenedTube::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasOpenedTube, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SasDoorMinus03_BP1_C_HasOpenedTube::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasOpenedTube, CallFunc_Array_Get_Item) == 0x000010, "Member 'SasDoorMinus03_BP1_C_HasOpenedTube::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasOpenedTube, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'SasDoorMinus03_BP1_C_HasOpenedTube::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasOpenedTube, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'SasDoorMinus03_BP1_C_HasOpenedTube::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_HasOpenedTube, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'SasDoorMinus03_BP1_C_HasOpenedTube::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.UpdateArmoredDoors
// 0x0007 (0x0007 - 0x0000)
struct SasDoorMinus03_BP1_C_UpdateArmoredDoors final
{
public:
	bool                                          ShouldBeOpened;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayersInside_Value;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasOpenedTube_out;                        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoorMinus03_BP1_C_UpdateArmoredDoors) == 0x000001, "Wrong alignment on SasDoorMinus03_BP1_C_UpdateArmoredDoors");
static_assert(sizeof(SasDoorMinus03_BP1_C_UpdateArmoredDoors) == 0x000007, "Wrong size on SasDoorMinus03_BP1_C_UpdateArmoredDoors");
static_assert(offsetof(SasDoorMinus03_BP1_C_UpdateArmoredDoors, ShouldBeOpened) == 0x000000, "Member 'SasDoorMinus03_BP1_C_UpdateArmoredDoors::ShouldBeOpened' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_UpdateArmoredDoors, CallFunc_HasPlayersInside_Value) == 0x000001, "Member 'SasDoorMinus03_BP1_C_UpdateArmoredDoors::CallFunc_HasPlayersInside_Value' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_UpdateArmoredDoors, CallFunc_HasOpenedTube_out) == 0x000002, "Member 'SasDoorMinus03_BP1_C_UpdateArmoredDoors::CallFunc_HasOpenedTube_out' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_UpdateArmoredDoors, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000003, "Member 'SasDoorMinus03_BP1_C_UpdateArmoredDoors::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_UpdateArmoredDoors, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'SasDoorMinus03_BP1_C_UpdateArmoredDoors::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_UpdateArmoredDoors, CallFunc_BooleanOR_ReturnValue_1) == 0x000005, "Member 'SasDoorMinus03_BP1_C_UpdateArmoredDoors::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_UpdateArmoredDoors, CallFunc_BooleanOR_ReturnValue_2) == 0x000006, "Member 'SasDoorMinus03_BP1_C_UpdateArmoredDoors::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.SetCurrentText
// 0x0020 (0x0020 - 0x0000)
struct SasDoorMinus03_BP1_C_SetCurrentText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoorMinus03_BP1_C_SetCurrentText) == 0x000008, "Wrong alignment on SasDoorMinus03_BP1_C_SetCurrentText");
static_assert(sizeof(SasDoorMinus03_BP1_C_SetCurrentText) == 0x000020, "Wrong size on SasDoorMinus03_BP1_C_SetCurrentText");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetCurrentText, Text) == 0x000000, "Member 'SasDoorMinus03_BP1_C_SetCurrentText::Text' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_SetCurrentText, CallFunc_NotEqual_TextText_ReturnValue) == 0x000018, "Member 'SasDoorMinus03_BP1_C_SetCurrentText::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.OnRep_CurrentText
// 0x0001 (0x0001 - 0x0000)
struct SasDoorMinus03_BP1_C_OnRep_CurrentText final
{
public:
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoorMinus03_BP1_C_OnRep_CurrentText) == 0x000001, "Wrong alignment on SasDoorMinus03_BP1_C_OnRep_CurrentText");
static_assert(sizeof(SasDoorMinus03_BP1_C_OnRep_CurrentText) == 0x000001, "Wrong size on SasDoorMinus03_BP1_C_OnRep_CurrentText");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnRep_CurrentText, CallFunc_TextIsEmpty_ReturnValue) == 0x000000, "Member 'SasDoorMinus03_BP1_C_OnRep_CurrentText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.GetCurrentStageText
// 0x00F8 (0x00F8 - 0x0000)
struct SasDoorMinus03_BP1_C_GetCurrentStageText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	bool                                          CallFunc_IsSASDoor_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_320C[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_320D[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBStageID                             CallFunc_GetStageID_ReturnValue;                   // 0x0030(0x0028)(ConstParm)
	class URBStageInfo*                           CallFunc_GetStageInfo_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStageIDValid_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_320E[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
};
static_assert(alignof(SasDoorMinus03_BP1_C_GetCurrentStageText) == 0x000008, "Wrong alignment on SasDoorMinus03_BP1_C_GetCurrentStageText");
static_assert(sizeof(SasDoorMinus03_BP1_C_GetCurrentStageText) == 0x0000F8, "Wrong size on SasDoorMinus03_BP1_C_GetCurrentStageText");
static_assert(offsetof(SasDoorMinus03_BP1_C_GetCurrentStageText, Text) == 0x000000, "Member 'SasDoorMinus03_BP1_C_GetCurrentStageText::Text' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_GetCurrentStageText, CallFunc_IsSASDoor_ReturnValue) == 0x000018, "Member 'SasDoorMinus03_BP1_C_GetCurrentStageText::CallFunc_IsSASDoor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_GetCurrentStageText, CallFunc_GetRBGameState_ReturnValue) == 0x000020, "Member 'SasDoorMinus03_BP1_C_GetCurrentStageText::CallFunc_GetRBGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_GetCurrentStageText, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'SasDoorMinus03_BP1_C_GetCurrentStageText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_GetCurrentStageText, CallFunc_GetStageID_ReturnValue) == 0x000030, "Member 'SasDoorMinus03_BP1_C_GetCurrentStageText::CallFunc_GetStageID_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_GetCurrentStageText, CallFunc_GetStageInfo_ReturnValue) == 0x000058, "Member 'SasDoorMinus03_BP1_C_GetCurrentStageText::CallFunc_GetStageInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_GetCurrentStageText, CallFunc_IsStageIDValid_ReturnValue) == 0x000060, "Member 'SasDoorMinus03_BP1_C_GetCurrentStageText::CallFunc_IsStageIDValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_GetCurrentStageText, CallFunc_GetDisplayName_ReturnValue) == 0x000068, "Member 'SasDoorMinus03_BP1_C_GetCurrentStageText::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_GetCurrentStageText, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'SasDoorMinus03_BP1_C_GetCurrentStageText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_GetCurrentStageText, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'SasDoorMinus03_BP1_C_GetCurrentStageText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_GetCurrentStageText, K2Node_MakeArray_Array) == 0x0000D0, "Member 'SasDoorMinus03_BP1_C_GetCurrentStageText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_GetCurrentStageText, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'SasDoorMinus03_BP1_C_GetCurrentStageText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.OnActivationChanged
// 0x0038 (0x0038 - 0x0000)
struct SasDoorMinus03_BP1_C_OnActivationChanged final
{
public:
	bool                                          LightsEnabled;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_320F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSASDoor_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3210[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBSASTube*                             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3211[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASASTubeMinus02_BP_C*                   K2Node_DynamicCast_AsSAS_Tube_02_BP;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoorMinus03_BP1_C_OnActivationChanged) == 0x000008, "Wrong alignment on SasDoorMinus03_BP1_C_OnActivationChanged");
static_assert(sizeof(SasDoorMinus03_BP1_C_OnActivationChanged) == 0x000038, "Wrong size on SasDoorMinus03_BP1_C_OnActivationChanged");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnActivationChanged, LightsEnabled) == 0x000000, "Member 'SasDoorMinus03_BP1_C_OnActivationChanged::LightsEnabled' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnActivationChanged, Temp_int_Array_Index_Variable) == 0x000004, "Member 'SasDoorMinus03_BP1_C_OnActivationChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnActivationChanged, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'SasDoorMinus03_BP1_C_OnActivationChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnActivationChanged, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SasDoorMinus03_BP1_C_OnActivationChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnActivationChanged, CallFunc_IsSASDoor_ReturnValue) == 0x000010, "Member 'SasDoorMinus03_BP1_C_OnActivationChanged::CallFunc_IsSASDoor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnActivationChanged, CallFunc_Array_Get_Item) == 0x000018, "Member 'SasDoorMinus03_BP1_C_OnActivationChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnActivationChanged, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'SasDoorMinus03_BP1_C_OnActivationChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnActivationChanged, K2Node_DynamicCast_AsSAS_Tube_02_BP) == 0x000028, "Member 'SasDoorMinus03_BP1_C_OnActivationChanged::K2Node_DynamicCast_AsSAS_Tube_02_BP' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnActivationChanged, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SasDoorMinus03_BP1_C_OnActivationChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnActivationChanged, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'SasDoorMinus03_BP1_C_OnActivationChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnActivationChanged, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'SasDoorMinus03_BP1_C_OnActivationChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnActivationChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000033, "Member 'SasDoorMinus03_BP1_C_OnActivationChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.InitializeTubes
// 0x0038 (0x0038 - 0x0000)
struct SasDoorMinus03_BP1_C_InitializeTubes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBSASTube*                             CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3212[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ASASTubeMinus02_BP_C*                   K2Node_DynamicCast_AsSAS_Tube_02_BP;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3213[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_2;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SasDoorMinus03_BP1_C_InitializeTubes) == 0x000008, "Wrong alignment on SasDoorMinus03_BP1_C_InitializeTubes");
static_assert(sizeof(SasDoorMinus03_BP1_C_InitializeTubes) == 0x000038, "Wrong size on SasDoorMinus03_BP1_C_InitializeTubes");
static_assert(offsetof(SasDoorMinus03_BP1_C_InitializeTubes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SasDoorMinus03_BP1_C_InitializeTubes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_InitializeTubes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SasDoorMinus03_BP1_C_InitializeTubes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_InitializeTubes, CallFunc_Array_Get_Item) == 0x000008, "Member 'SasDoorMinus03_BP1_C_InitializeTubes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_InitializeTubes, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'SasDoorMinus03_BP1_C_InitializeTubes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_InitializeTubes, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'SasDoorMinus03_BP1_C_InitializeTubes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_InitializeTubes, CallFunc_Less_IntInt_ReturnValue) == 0x000015, "Member 'SasDoorMinus03_BP1_C_InitializeTubes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_InitializeTubes, K2Node_DynamicCast_AsSAS_Tube_02_BP) == 0x000018, "Member 'SasDoorMinus03_BP1_C_InitializeTubes::K2Node_DynamicCast_AsSAS_Tube_02_BP' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_InitializeTubes, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SasDoorMinus03_BP1_C_InitializeTubes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_InitializeTubes, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'SasDoorMinus03_BP1_C_InitializeTubes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_InitializeTubes, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'SasDoorMinus03_BP1_C_InitializeTubes::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_InitializeTubes, CallFunc_Array_Get_Item_2) == 0x000030, "Member 'SasDoorMinus03_BP1_C_InitializeTubes::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.UserConstructionScript
// 0x0038 (0x0038 - 0x0000)
struct SasDoorMinus03_BP1_C_UserConstructionScript final
{
public:
	float                                         Rotation;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3214[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array_2;                          // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(SasDoorMinus03_BP1_C_UserConstructionScript) == 0x000008, "Wrong alignment on SasDoorMinus03_BP1_C_UserConstructionScript");
static_assert(sizeof(SasDoorMinus03_BP1_C_UserConstructionScript) == 0x000038, "Wrong size on SasDoorMinus03_BP1_C_UserConstructionScript");
static_assert(offsetof(SasDoorMinus03_BP1_C_UserConstructionScript, Rotation) == 0x000000, "Member 'SasDoorMinus03_BP1_C_UserConstructionScript::Rotation' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000008, "Member 'SasDoorMinus03_BP1_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_UserConstructionScript, K2Node_MakeArray_Array_1) == 0x000018, "Member 'SasDoorMinus03_BP1_C_UserConstructionScript::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_UserConstructionScript, K2Node_MakeArray_Array_2) == 0x000028, "Member 'SasDoorMinus03_BP1_C_UserConstructionScript::K2Node_MakeArray_Array_2' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.CanvasRenderUpdate
// 0x0010 (0x0010 - 0x0000)
struct SasDoorMinus03_BP1_C_CanvasRenderUpdate final
{
public:
	class UCanvas*                                Param_Canvas;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Width;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Height;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SasDoorMinus03_BP1_C_CanvasRenderUpdate) == 0x000008, "Wrong alignment on SasDoorMinus03_BP1_C_CanvasRenderUpdate");
static_assert(sizeof(SasDoorMinus03_BP1_C_CanvasRenderUpdate) == 0x000010, "Wrong size on SasDoorMinus03_BP1_C_CanvasRenderUpdate");
static_assert(offsetof(SasDoorMinus03_BP1_C_CanvasRenderUpdate, Param_Canvas) == 0x000000, "Member 'SasDoorMinus03_BP1_C_CanvasRenderUpdate::Param_Canvas' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_CanvasRenderUpdate, Width) == 0x000008, "Member 'SasDoorMinus03_BP1_C_CanvasRenderUpdate::Width' has a wrong offset!");
static_assert(offsetof(SasDoorMinus03_BP1_C_CanvasRenderUpdate, Height) == 0x00000C, "Member 'SasDoorMinus03_BP1_C_CanvasRenderUpdate::Height' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.BindEventsOnTube
// 0x0008 (0x0008 - 0x0000)
struct SasDoorMinus03_BP1_C_BindEventsOnTube final
{
public:
	class ASASTubeMinus02_BP_C*                   Tube;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SasDoorMinus03_BP1_C_BindEventsOnTube) == 0x000008, "Wrong alignment on SasDoorMinus03_BP1_C_BindEventsOnTube");
static_assert(sizeof(SasDoorMinus03_BP1_C_BindEventsOnTube) == 0x000008, "Wrong size on SasDoorMinus03_BP1_C_BindEventsOnTube");
static_assert(offsetof(SasDoorMinus03_BP1_C_BindEventsOnTube, Tube) == 0x000000, "Member 'SasDoorMinus03_BP1_C_BindEventsOnTube::Tube' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.OnOpenedStageChanged
// 0x0008 (0x0008 - 0x0000)
struct SasDoorMinus03_BP1_C_OnOpenedStageChanged final
{
public:
	class ASASTubeMinus02_BP_C*                   SASTube;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SasDoorMinus03_BP1_C_OnOpenedStageChanged) == 0x000008, "Wrong alignment on SasDoorMinus03_BP1_C_OnOpenedStageChanged");
static_assert(sizeof(SasDoorMinus03_BP1_C_OnOpenedStageChanged) == 0x000008, "Wrong size on SasDoorMinus03_BP1_C_OnOpenedStageChanged");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnOpenedStageChanged, SASTube) == 0x000000, "Member 'SasDoorMinus03_BP1_C_OnOpenedStageChanged::SASTube' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.OnPlayersInsideChanged
// 0x0008 (0x0008 - 0x0000)
struct SasDoorMinus03_BP1_C_OnPlayersInsideChanged final
{
public:
	class ARBSASTube*                             Tube;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SasDoorMinus03_BP1_C_OnPlayersInsideChanged) == 0x000008, "Wrong alignment on SasDoorMinus03_BP1_C_OnPlayersInsideChanged");
static_assert(sizeof(SasDoorMinus03_BP1_C_OnPlayersInsideChanged) == 0x000008, "Wrong size on SasDoorMinus03_BP1_C_OnPlayersInsideChanged");
static_assert(offsetof(SasDoorMinus03_BP1_C_OnPlayersInsideChanged, Tube) == 0x000000, "Member 'SasDoorMinus03_BP1_C_OnPlayersInsideChanged::Tube' has a wrong offset!");

// Function SasDoor-03_BP1.SasDoor-03_BP1_C.ExecuteUbergraph_SasDoor-03_BP1
// 0x03D0 (0x03D0 - 0x0000)
struct SasDoorMinus03_BP1_C_ExecuteUbergraph_SasDoorMinus03_BP1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3215[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0080(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class UCanvas* Canvas, int32 Width, int32 Height)> K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ASASTubeMinus02_BP_C* SASTube)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ARBSASTube* Tube)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3216[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x014C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3217[0x3];                                     // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x01DC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x0264(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvas*                                K2Node_CustomEvent_Canvas;                         // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Width;                          // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Height;                         // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0314(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasRenderTarget2D*                  CallFunc_CreateCanvasRenderTarget2D_ReturnValue;   // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClient_ReturnValue;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3218[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3219[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
