#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SASLoadoutMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SASLoadoutMenu.SASLoadoutMenu_C
// 0x0090 (0x03E8 - 0x0358)
class USASLoadoutMenu_C final : public URBCharacterSheetMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         ActionButtonContainer;                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg;                                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        bgBlur;                                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCharacterSheetTabs_C*                  CharacterSheetTabs;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        ExitButton;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_166;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULocalPlayerInfo_v2_C*                  LocalPlayerInfo;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuFocusActionButtonContainer_C*      MenuFocusActionButtonContainer;                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NavigationOverrideBox;                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PageSpecificButtonContainer;                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageSubTitle;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageSubTitleSeparator;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageTitle;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkListTabs_C*                        PerkListTabs;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerLoadoutsTab_C*                   PlayerLoadoutsTab;                                 // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        TabSwitch;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Refresh();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void Construct();
	void BndEvt__ExitButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void Event_StartTransitionOut();
	void Event_MenuTabRight_Pressed();
	void Event_MenuTabLeft_Pressed();
	void OnPlayerSASChanged(class ARBPlayerState* RBPlayerState, class ARBSAS* CurrentSAS);
	void Destruct();
	void ExecuteUbergraph_SASLoadoutMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SASLoadoutMenu_C">();
	}
	static class USASLoadoutMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USASLoadoutMenu_C>();
	}
};
static_assert(alignof(USASLoadoutMenu_C) == 0x000008, "Wrong alignment on USASLoadoutMenu_C");
static_assert(sizeof(USASLoadoutMenu_C) == 0x0003E8, "Wrong size on USASLoadoutMenu_C");
static_assert(offsetof(USASLoadoutMenu_C, UberGraphFrame) == 0x000358, "Member 'USASLoadoutMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, ActionButtonContainer) == 0x000360, "Member 'USASLoadoutMenu_C::ActionButtonContainer' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, bg) == 0x000368, "Member 'USASLoadoutMenu_C::bg' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, bgBlur) == 0x000370, "Member 'USASLoadoutMenu_C::bgBlur' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, CanvasPanel_1) == 0x000378, "Member 'USASLoadoutMenu_C::CanvasPanel_1' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, CharacterSheetTabs) == 0x000380, "Member 'USASLoadoutMenu_C::CharacterSheetTabs' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, ExitButton) == 0x000388, "Member 'USASLoadoutMenu_C::ExitButton' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, Image_166) == 0x000390, "Member 'USASLoadoutMenu_C::Image_166' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, LocalPlayerInfo) == 0x000398, "Member 'USASLoadoutMenu_C::LocalPlayerInfo' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, MenuFocusActionButtonContainer) == 0x0003A0, "Member 'USASLoadoutMenu_C::MenuFocusActionButtonContainer' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, NavigationOverrideBox) == 0x0003A8, "Member 'USASLoadoutMenu_C::NavigationOverrideBox' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, PageSpecificButtonContainer) == 0x0003B0, "Member 'USASLoadoutMenu_C::PageSpecificButtonContainer' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, PageSubTitle) == 0x0003B8, "Member 'USASLoadoutMenu_C::PageSubTitle' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, PageSubTitleSeparator) == 0x0003C0, "Member 'USASLoadoutMenu_C::PageSubTitleSeparator' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, PageTitle) == 0x0003C8, "Member 'USASLoadoutMenu_C::PageTitle' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, PerkListTabs) == 0x0003D0, "Member 'USASLoadoutMenu_C::PerkListTabs' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, PlayerLoadoutsTab) == 0x0003D8, "Member 'USASLoadoutMenu_C::PlayerLoadoutsTab' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenu_C, TabSwitch) == 0x0003E0, "Member 'USASLoadoutMenu_C::TabSwitch' has a wrong offset!");

}

