#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scientist_Lobby_AquariumAnnouncer_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Scientist_Lobby_AquariumAnnouncer_AnimBP.Scientist_Lobby_AquariumAnnouncer_AnimBP_C
// 0x0380 (0x0640 - 0x02C0)
class UScientist_Lobby_AquariumAnnouncer_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2F4D[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x02F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0320(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0348(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0370(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x03F0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0420(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x04A0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x04D0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0550(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0580(0x00B0)()
	bool                                          IsAnnouncing;                                      // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void AnimNotify_MicOn();
	void AnnouceTrial();
	void ExecuteUbergraph_Scientist_Lobby_AquariumAnnouncer_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Scientist_Lobby_AquariumAnnouncer_AnimBP_C">();
	}
	static class UScientist_Lobby_AquariumAnnouncer_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScientist_Lobby_AquariumAnnouncer_AnimBP_C>();
	}
};
static_assert(alignof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C) == 0x000010, "Wrong alignment on UScientist_Lobby_AquariumAnnouncer_AnimBP_C");
static_assert(sizeof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C) == 0x000640, "Wrong size on UScientist_Lobby_AquariumAnnouncer_AnimBP_C");
static_assert(offsetof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C, UberGraphFrame) == 0x0002C0, "Member 'UScientist_Lobby_AquariumAnnouncer_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UScientist_Lobby_AquariumAnnouncer_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x0002F8, "Member 'UScientist_Lobby_AquariumAnnouncer_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000320, "Member 'UScientist_Lobby_AquariumAnnouncer_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C, AnimGraphNode_TransitionResult) == 0x000348, "Member 'UScientist_Lobby_AquariumAnnouncer_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000370, "Member 'UScientist_Lobby_AquariumAnnouncer_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C, AnimGraphNode_StateResult_2) == 0x0003F0, "Member 'UScientist_Lobby_AquariumAnnouncer_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000420, "Member 'UScientist_Lobby_AquariumAnnouncer_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C, AnimGraphNode_StateResult_1) == 0x0004A0, "Member 'UScientist_Lobby_AquariumAnnouncer_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x0004D0, "Member 'UScientist_Lobby_AquariumAnnouncer_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C, AnimGraphNode_StateResult) == 0x000550, "Member 'UScientist_Lobby_AquariumAnnouncer_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C, AnimGraphNode_StateMachine) == 0x000580, "Member 'UScientist_Lobby_AquariumAnnouncer_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UScientist_Lobby_AquariumAnnouncer_AnimBP_C, IsAnnouncing) == 0x000630, "Member 'UScientist_Lobby_AquariumAnnouncer_AnimBP_C::IsAnnouncing' has a wrong offset!");

}

