#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScreenshotPlayer

#include "Basic.hpp"


namespace SDK::Params
{

// Function ScreenshotPlayer.ScreenshotPlayer_C.SetBlood
// 0x0048 (0x0048 - 0x0000)
struct ScreenshotPlayer_C_SetBlood final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341D[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScreenshotPlayer_C_SetBlood) == 0x000008, "Wrong alignment on ScreenshotPlayer_C_SetBlood");
static_assert(sizeof(ScreenshotPlayer_C_SetBlood) == 0x000048, "Wrong size on ScreenshotPlayer_C_SetBlood");
static_assert(offsetof(ScreenshotPlayer_C_SetBlood, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ScreenshotPlayer_C_SetBlood::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ScreenshotPlayer_C_SetBlood, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ScreenshotPlayer_C_SetBlood::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ScreenshotPlayer_C_SetBlood, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ScreenshotPlayer_C_SetBlood::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScreenshotPlayer_C_SetBlood, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'ScreenshotPlayer_C_SetBlood::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScreenshotPlayer_C_SetBlood, CallFunc_Array_Get_Item) == 0x000020, "Member 'ScreenshotPlayer_C_SetBlood::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ScreenshotPlayer_C_SetBlood, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'ScreenshotPlayer_C_SetBlood::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScreenshotPlayer_C_SetBlood, CallFunc_GetDisplayName_ReturnValue) == 0x000030, "Member 'ScreenshotPlayer_C_SetBlood::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScreenshotPlayer_C_SetBlood, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'ScreenshotPlayer_C_SetBlood::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScreenshotPlayer_C_SetBlood, CallFunc_Contains_ReturnValue) == 0x000041, "Member 'ScreenshotPlayer_C_SetBlood::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function ScreenshotPlayer.ScreenshotPlayer_C.UpdateStaticMesh
// 0x0018 (0x0018 - 0x0000)
struct ScreenshotPlayer_C_UpdateStaticMesh final
{
public:
	class UStaticMeshComponent*                   Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Param_Mesh;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScreenshotPlayer_C_UpdateStaticMesh) == 0x000008, "Wrong alignment on ScreenshotPlayer_C_UpdateStaticMesh");
static_assert(sizeof(ScreenshotPlayer_C_UpdateStaticMesh) == 0x000018, "Wrong size on ScreenshotPlayer_C_UpdateStaticMesh");
static_assert(offsetof(ScreenshotPlayer_C_UpdateStaticMesh, Component) == 0x000000, "Member 'ScreenshotPlayer_C_UpdateStaticMesh::Component' has a wrong offset!");
static_assert(offsetof(ScreenshotPlayer_C_UpdateStaticMesh, Param_Mesh) == 0x000008, "Member 'ScreenshotPlayer_C_UpdateStaticMesh::Param_Mesh' has a wrong offset!");
static_assert(offsetof(ScreenshotPlayer_C_UpdateStaticMesh, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ScreenshotPlayer_C_UpdateStaticMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScreenshotPlayer_C_UpdateStaticMesh, CallFunc_SetStaticMesh_ReturnValue) == 0x000011, "Member 'ScreenshotPlayer_C_UpdateStaticMesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function ScreenshotPlayer.ScreenshotPlayer_C.UpdateSkeletalMesh
// 0x0018 (0x0018 - 0x0000)
struct ScreenshotPlayer_C_UpdateSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Param_Mesh;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScreenshotPlayer_C_UpdateSkeletalMesh) == 0x000008, "Wrong alignment on ScreenshotPlayer_C_UpdateSkeletalMesh");
static_assert(sizeof(ScreenshotPlayer_C_UpdateSkeletalMesh) == 0x000018, "Wrong size on ScreenshotPlayer_C_UpdateSkeletalMesh");
static_assert(offsetof(ScreenshotPlayer_C_UpdateSkeletalMesh, Component) == 0x000000, "Member 'ScreenshotPlayer_C_UpdateSkeletalMesh::Component' has a wrong offset!");
static_assert(offsetof(ScreenshotPlayer_C_UpdateSkeletalMesh, Param_Mesh) == 0x000008, "Member 'ScreenshotPlayer_C_UpdateSkeletalMesh::Param_Mesh' has a wrong offset!");
static_assert(offsetof(ScreenshotPlayer_C_UpdateSkeletalMesh, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ScreenshotPlayer_C_UpdateSkeletalMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ScreenshotPlayer.ScreenshotPlayer_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct ScreenshotPlayer_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScreenshotPlayer_C_UserConstructionScript) == 0x000001, "Wrong alignment on ScreenshotPlayer_C_UserConstructionScript");
static_assert(sizeof(ScreenshotPlayer_C_UserConstructionScript) == 0x000001, "Wrong size on ScreenshotPlayer_C_UserConstructionScript");
static_assert(offsetof(ScreenshotPlayer_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'ScreenshotPlayer_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function ScreenshotPlayer.ScreenshotPlayer_C.ExecuteUbergraph_ScreenshotPlayer
// 0x0004 (0x0004 - 0x0000)
struct ScreenshotPlayer_C_ExecuteUbergraph_ScreenshotPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScreenshotPlayer_C_ExecuteUbergraph_ScreenshotPlayer) == 0x000004, "Wrong alignment on ScreenshotPlayer_C_ExecuteUbergraph_ScreenshotPlayer");
static_assert(sizeof(ScreenshotPlayer_C_ExecuteUbergraph_ScreenshotPlayer) == 0x000004, "Wrong size on ScreenshotPlayer_C_ExecuteUbergraph_ScreenshotPlayer");
static_assert(offsetof(ScreenshotPlayer_C_ExecuteUbergraph_ScreenshotPlayer, EntryPoint) == 0x000000, "Member 'ScreenshotPlayer_C_ExecuteUbergraph_ScreenshotPlayer::EntryPoint' has a wrong offset!");

}

