#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleActionTooltip

#include "Basic.hpp"


namespace SDK::Params
{

// Function SimpleActionTooltip.SimpleActionTooltip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SimpleActionTooltip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SimpleActionTooltip_C_PreConstruct) == 0x000001, "Wrong alignment on SimpleActionTooltip_C_PreConstruct");
static_assert(sizeof(SimpleActionTooltip_C_PreConstruct) == 0x000001, "Wrong size on SimpleActionTooltip_C_PreConstruct");
static_assert(offsetof(SimpleActionTooltip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SimpleActionTooltip_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SimpleActionTooltip.SimpleActionTooltip_C.ExecuteUbergraph_SimpleActionTooltip
// 0x0008 (0x0008 - 0x0000)
struct SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip) == 0x000004, "Wrong alignment on SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip");
static_assert(sizeof(SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip) == 0x000008, "Wrong size on SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip");
static_assert(offsetof(SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip, EntryPoint) == 0x000000, "Member 'SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip, K2Node_Event_IsDesignTime) == 0x000004, "Member 'SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip::K2Node_Event_IsDesignTime' has a wrong offset!");

}

