#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleMesh_Pickup_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function SimpleMesh_Pickup_BP.SimpleMesh_Pickup_BP_C.ExecuteUbergraph_SimpleMesh_Pickup_BP
// 0x0018 (0x0018 - 0x0000)
struct SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32D9[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBContainer*                           CallFunc_GetContainer_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP) == 0x000008, "Wrong alignment on SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP");
static_assert(sizeof(SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP) == 0x000018, "Wrong size on SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP");
static_assert(offsetof(SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP, EntryPoint) == 0x000000, "Member 'SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP, Temp_bool_Variable) == 0x000004, "Member 'SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP, Temp_bool_Variable_1) == 0x000005, "Member 'SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP, CallFunc_GetContainer_ReturnValue) == 0x000008, "Member 'SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP::CallFunc_GetContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP, K2Node_Select_Default) == 0x000011, "Member 'SimpleMesh_Pickup_BP_C_ExecuteUbergraph_SimpleMesh_Pickup_BP::K2Node_Select_Default' has a wrong offset!");

}

