#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleActionTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SimpleActionTooltip.SimpleActionTooltip_C
// 0x0038 (0x0298 - 0x0260)
class USimpleActionTooltip_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBMenuButton_C*                        SimplePrompt;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 DesiredAction;                                     // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   DesiredText;                                       // 0x0280(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void ExecuteUbergraph_SimpleActionTooltip(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SimpleActionTooltip_C">();
	}
	static class USimpleActionTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleActionTooltip_C>();
	}
};
static_assert(alignof(USimpleActionTooltip_C) == 0x000008, "Wrong alignment on USimpleActionTooltip_C");
static_assert(sizeof(USimpleActionTooltip_C) == 0x000298, "Wrong size on USimpleActionTooltip_C");
static_assert(offsetof(USimpleActionTooltip_C, UberGraphFrame) == 0x000260, "Member 'USimpleActionTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USimpleActionTooltip_C, SimplePrompt) == 0x000268, "Member 'USimpleActionTooltip_C::SimplePrompt' has a wrong offset!");
static_assert(offsetof(USimpleActionTooltip_C, DesiredAction) == 0x000270, "Member 'USimpleActionTooltip_C::DesiredAction' has a wrong offset!");
static_assert(offsetof(USimpleActionTooltip_C, DesiredText) == 0x000280, "Member 'USimpleActionTooltip_C::DesiredText' has a wrong offset!");

}

