#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_EntryList_PartyInvite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialMenu_EntryList_PartyInvite.SocialMenu_EntryList_PartyInvite_C
// 0x00E0 (0x0448 - 0x0368)
class USocialMenu_EntryList_PartyInvite_C final : public URBSocialMenuEntryListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideEmpty;                                         // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideGrid;                                          // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowEmpty;                                         // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowGrid;                                          // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideLoading;                                       // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowLoading;                                       // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                EmptyBox;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        GamepadLeftPageButton;                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               GamepadPageNav;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        GamepadRightPageButton;                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Grid;                                              // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingVideoWidget_C*                  LoadingVideoWidget;                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                NextPageButton;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageNavText;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PreviousPageButton;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_468;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_79;                                      // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HeaderText;                                        // 0x0400(0x0018)(Edit, BlueprintVisible)
	class FText                                   EmptyText;                                         // 0x0418(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnNoFocusPossible;                                 // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         LastFocusedIndex;                                  // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void RequestPageChange(bool Param_NextPage);
	void RegisterLastFocusedIndex();
	void UpdateGamepadPageNav();
	void SlotHasFocus(int32 Column, int32 Row, bool* bHasFocus);
	void SetupInitialFocus();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	bool GetPreviousPageButtonEnabled();
	bool GetNextPageButtonEnabled();
	void SetupEditorPreview();
	void UpdateEntry(class UWidget* Entry, int32 Column, int32 Row);
	void Setup();
	void Construct();
	void Event_RemoveEntry(class URBUserWidget* Entry);
	void Event_UpdateEntry(class URBUserWidget* Entry, int32 Column, int32 Row);
	void Event_Clear();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__PreviousPageButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__NextPageButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Event_OnDataPending(bool bIsDataPending);
	void Event_OnEmptyStateChanged(bool bIsEmpty);
	void OnMenuInputSourceChanged();
	void Destruct();
	void OnGamepadPageLeft();
	void OnGamepadPageRight();
	void ExecuteUbergraph_SocialMenu_EntryList_PartyInvite(int32 EntryPoint);
	void OnNoFocusPossible__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialMenu_EntryList_PartyInvite_C">();
	}
	static class USocialMenu_EntryList_PartyInvite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialMenu_EntryList_PartyInvite_C>();
	}
};
static_assert(alignof(USocialMenu_EntryList_PartyInvite_C) == 0x000008, "Wrong alignment on USocialMenu_EntryList_PartyInvite_C");
static_assert(sizeof(USocialMenu_EntryList_PartyInvite_C) == 0x000448, "Wrong size on USocialMenu_EntryList_PartyInvite_C");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, UberGraphFrame) == 0x000368, "Member 'USocialMenu_EntryList_PartyInvite_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, HideEmpty) == 0x000370, "Member 'USocialMenu_EntryList_PartyInvite_C::HideEmpty' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, HideGrid) == 0x000378, "Member 'USocialMenu_EntryList_PartyInvite_C::HideGrid' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, ShowEmpty) == 0x000380, "Member 'USocialMenu_EntryList_PartyInvite_C::ShowEmpty' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, ShowGrid) == 0x000388, "Member 'USocialMenu_EntryList_PartyInvite_C::ShowGrid' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, HideLoading) == 0x000390, "Member 'USocialMenu_EntryList_PartyInvite_C::HideLoading' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, ShowLoading) == 0x000398, "Member 'USocialMenu_EntryList_PartyInvite_C::ShowLoading' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, EmptyBox) == 0x0003A0, "Member 'USocialMenu_EntryList_PartyInvite_C::EmptyBox' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, GamepadLeftPageButton) == 0x0003A8, "Member 'USocialMenu_EntryList_PartyInvite_C::GamepadLeftPageButton' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, GamepadPageNav) == 0x0003B0, "Member 'USocialMenu_EntryList_PartyInvite_C::GamepadPageNav' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, GamepadRightPageButton) == 0x0003B8, "Member 'USocialMenu_EntryList_PartyInvite_C::GamepadRightPageButton' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, Grid) == 0x0003C0, "Member 'USocialMenu_EntryList_PartyInvite_C::Grid' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, LoadingVideoWidget) == 0x0003C8, "Member 'USocialMenu_EntryList_PartyInvite_C::LoadingVideoWidget' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, NextPageButton) == 0x0003D0, "Member 'USocialMenu_EntryList_PartyInvite_C::NextPageButton' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, PageNavText) == 0x0003D8, "Member 'USocialMenu_EntryList_PartyInvite_C::PageNavText' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, PreviousPageButton) == 0x0003E0, "Member 'USocialMenu_EntryList_PartyInvite_C::PreviousPageButton' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, SizeBox_468) == 0x0003E8, "Member 'USocialMenu_EntryList_PartyInvite_C::SizeBox_468' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, TextBlock_79) == 0x0003F0, "Member 'USocialMenu_EntryList_PartyInvite_C::TextBlock_79' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, Title) == 0x0003F8, "Member 'USocialMenu_EntryList_PartyInvite_C::Title' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, HeaderText) == 0x000400, "Member 'USocialMenu_EntryList_PartyInvite_C::HeaderText' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, EmptyText) == 0x000418, "Member 'USocialMenu_EntryList_PartyInvite_C::EmptyText' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, OnNoFocusPossible) == 0x000430, "Member 'USocialMenu_EntryList_PartyInvite_C::OnNoFocusPossible' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_PartyInvite_C, LastFocusedIndex) == 0x000440, "Member 'USocialMenu_EntryList_PartyInvite_C::LastFocusedIndex' has a wrong offset!");

}

