#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_Tab_Blocked

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SocialMenu_Tab_Blocked.SocialMenu_Tab_Blocked_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct SocialMenu_Tab_Blocked_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(SocialMenu_Tab_Blocked_C_OnFocusReceived) == 0x000008, "Wrong alignment on SocialMenu_Tab_Blocked_C_OnFocusReceived");
static_assert(sizeof(SocialMenu_Tab_Blocked_C_OnFocusReceived) == 0x0001B0, "Wrong size on SocialMenu_Tab_Blocked_C_OnFocusReceived");
static_assert(offsetof(SocialMenu_Tab_Blocked_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'SocialMenu_Tab_Blocked_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(SocialMenu_Tab_Blocked_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'SocialMenu_Tab_Blocked_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(SocialMenu_Tab_Blocked_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'SocialMenu_Tab_Blocked_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_Tab_Blocked_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'SocialMenu_Tab_Blocked_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function SocialMenu_Tab_Blocked.SocialMenu_Tab_Blocked_C.Activate
// 0x0008 (0x0008 - 0x0000)
struct SocialMenu_Tab_Blocked_C_Activate final
{
public:
	class URBSocialMenuManager*                   SocialMenu;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_Tab_Blocked_C_Activate) == 0x000008, "Wrong alignment on SocialMenu_Tab_Blocked_C_Activate");
static_assert(sizeof(SocialMenu_Tab_Blocked_C_Activate) == 0x000008, "Wrong size on SocialMenu_Tab_Blocked_C_Activate");
static_assert(offsetof(SocialMenu_Tab_Blocked_C_Activate, SocialMenu) == 0x000000, "Member 'SocialMenu_Tab_Blocked_C_Activate::SocialMenu' has a wrong offset!");

}

