#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_EntryList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialMenu_EntryList.SocialMenu_EntryList_C
// 0x01D0 (0x0538 - 0x0368)
class USocialMenu_EntryList_C final : public URBSocialMenuEntryListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideEmpty;                                         // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideGrid;                                          // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowEmpty;                                         // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowGrid;                                          // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideLoading;                                       // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowLoading;                                       // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                EmptyBox;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      EntryGrid;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        GamepadLeftPageButton;                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               GamepadPageNav;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        GamepadRightPageButton;                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingVideoWidget_C*                  LoadingVideoWidget;                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                NextPageButton_1;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               NextPageButtonContainer;                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PageNavText;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PreviousPageButton_1;                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PreviousPageButtonContainer;                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_468;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_79;                                      // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            TwoColumnBackgroundBrush;                          // 0x0408(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            SingleColumnBackgroundBrush;                       // 0x0490(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EmptyText;                                         // 0x0518(0x0018)(Edit, BlueprintVisible)
	bool                                          bShowPageNavigation;                               // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UpdateGamepadPageNav();
	void SlotHasFocus(int32 Column, int32 Row, bool* bHasFocus);
	void SetupInitialFocus();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	bool GetPreviousPageButtonEnabled();
	bool GetNextPageButtonEnabled();
	void SetSize();
	void SetupEditorPreview();
	void UpdateEntry(class UWidget* Entry, int32 Column, int32 Row);
	void Setup();
	void Construct();
	void Event_RemoveEntry(class URBUserWidget* Entry);
	void Event_UpdateEntry(class URBUserWidget* Entry, int32 Column, int32 Row);
	void Event_Clear();
	void PreConstruct(bool IsDesignTime);
	void Event_OnDataPending(bool bIsDataPending);
	void Event_OnEmptyStateChanged(bool bIsEmpty);
	void BndEvt__SocialMenu_EntryList_PreviousPageButton_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SocialMenu_EntryList_NextPageButton_1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void OnMenuInputSourceChanged();
	void Destruct();
	void OnGamepadPageLeft();
	void OnGamepadPageRight();
	void Event_EntriesUpdated();
	void ExecuteUbergraph_SocialMenu_EntryList(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialMenu_EntryList_C">();
	}
	static class USocialMenu_EntryList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialMenu_EntryList_C>();
	}
};
static_assert(alignof(USocialMenu_EntryList_C) == 0x000008, "Wrong alignment on USocialMenu_EntryList_C");
static_assert(sizeof(USocialMenu_EntryList_C) == 0x000538, "Wrong size on USocialMenu_EntryList_C");
static_assert(offsetof(USocialMenu_EntryList_C, UberGraphFrame) == 0x000368, "Member 'USocialMenu_EntryList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, HideEmpty) == 0x000370, "Member 'USocialMenu_EntryList_C::HideEmpty' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, HideGrid) == 0x000378, "Member 'USocialMenu_EntryList_C::HideGrid' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, ShowEmpty) == 0x000380, "Member 'USocialMenu_EntryList_C::ShowEmpty' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, ShowGrid) == 0x000388, "Member 'USocialMenu_EntryList_C::ShowGrid' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, HideLoading) == 0x000390, "Member 'USocialMenu_EntryList_C::HideLoading' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, ShowLoading) == 0x000398, "Member 'USocialMenu_EntryList_C::ShowLoading' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, EmptyBox) == 0x0003A0, "Member 'USocialMenu_EntryList_C::EmptyBox' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, EntryGrid) == 0x0003A8, "Member 'USocialMenu_EntryList_C::EntryGrid' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, GamepadLeftPageButton) == 0x0003B0, "Member 'USocialMenu_EntryList_C::GamepadLeftPageButton' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, GamepadPageNav) == 0x0003B8, "Member 'USocialMenu_EntryList_C::GamepadPageNav' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, GamepadRightPageButton) == 0x0003C0, "Member 'USocialMenu_EntryList_C::GamepadRightPageButton' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, LoadingVideoWidget) == 0x0003C8, "Member 'USocialMenu_EntryList_C::LoadingVideoWidget' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, NextPageButton_1) == 0x0003D0, "Member 'USocialMenu_EntryList_C::NextPageButton_1' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, NextPageButtonContainer) == 0x0003D8, "Member 'USocialMenu_EntryList_C::NextPageButtonContainer' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, PageNavText) == 0x0003E0, "Member 'USocialMenu_EntryList_C::PageNavText' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, PreviousPageButton_1) == 0x0003E8, "Member 'USocialMenu_EntryList_C::PreviousPageButton_1' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, PreviousPageButtonContainer) == 0x0003F0, "Member 'USocialMenu_EntryList_C::PreviousPageButtonContainer' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, SizeBox_468) == 0x0003F8, "Member 'USocialMenu_EntryList_C::SizeBox_468' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, TextBlock_79) == 0x000400, "Member 'USocialMenu_EntryList_C::TextBlock_79' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, TwoColumnBackgroundBrush) == 0x000408, "Member 'USocialMenu_EntryList_C::TwoColumnBackgroundBrush' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, SingleColumnBackgroundBrush) == 0x000490, "Member 'USocialMenu_EntryList_C::SingleColumnBackgroundBrush' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, EmptyText) == 0x000518, "Member 'USocialMenu_EntryList_C::EmptyText' has a wrong offset!");
static_assert(offsetof(USocialMenu_EntryList_C, bShowPageNavigation) == 0x000530, "Member 'USocialMenu_EntryList_C::bShowPageNavigation' has a wrong offset!");

}

