#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundDetector_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function SoundDetector_BP.SoundDetector_BP_C.UpdateSignStatus
// 0x001C (0x001C - 0x0000)
struct SoundDetector_BP_C_UpdateSignStatus final
{
public:
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AEB[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AEC[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundDetector_BP_C_UpdateSignStatus) == 0x000004, "Wrong alignment on SoundDetector_BP_C_UpdateSignStatus");
static_assert(sizeof(SoundDetector_BP_C_UpdateSignStatus) == 0x00001C, "Wrong size on SoundDetector_BP_C_UpdateSignStatus");
static_assert(offsetof(SoundDetector_BP_C_UpdateSignStatus, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000000, "Member 'SoundDetector_BP_C_UpdateSignStatus::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_UpdateSignStatus, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'SoundDetector_BP_C_UpdateSignStatus::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_UpdateSignStatus, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'SoundDetector_BP_C_UpdateSignStatus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_UpdateSignStatus, K2Node_MakeStruct_LinearColor) == 0x00000C, "Member 'SoundDetector_BP_C_UpdateSignStatus::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function SoundDetector_BP.SoundDetector_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SoundDetector_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundDetector_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on SoundDetector_BP_C_ReceiveTick");
static_assert(sizeof(SoundDetector_BP_C_ReceiveTick) == 0x000004, "Wrong size on SoundDetector_BP_C_ReceiveTick");
static_assert(offsetof(SoundDetector_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'SoundDetector_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function SoundDetector_BP.SoundDetector_BP_C.BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_0_OnSoundDetectionMeterChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_0_OnSoundDetectionMeterChanged__DelegateSignature final
{
public:
	float                                         CurrentMeterRatio;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_0_OnSoundDetectionMeterChanged__DelegateSignature) == 0x000004, "Wrong alignment on SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_0_OnSoundDetectionMeterChanged__DelegateSignature");
static_assert(sizeof(SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_0_OnSoundDetectionMeterChanged__DelegateSignature) == 0x000004, "Wrong size on SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_0_OnSoundDetectionMeterChanged__DelegateSignature");
static_assert(offsetof(SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_0_OnSoundDetectionMeterChanged__DelegateSignature, CurrentMeterRatio) == 0x000000, "Member 'SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_0_OnSoundDetectionMeterChanged__DelegateSignature::CurrentMeterRatio' has a wrong offset!");

// Function SoundDetector_BP.SoundDetector_BP_C.BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_1_OnSoundDetectionStateChanged__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_1_OnSoundDetectionStateChanged__DelegateSignature final
{
public:
	EPlayerSoundDetectionState                    OldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerSoundDetectionState                    NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_1_OnSoundDetectionStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_1_OnSoundDetectionStateChanged__DelegateSignature");
static_assert(sizeof(SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_1_OnSoundDetectionStateChanged__DelegateSignature) == 0x000002, "Wrong size on SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_1_OnSoundDetectionStateChanged__DelegateSignature");
static_assert(offsetof(SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_1_OnSoundDetectionStateChanged__DelegateSignature, OldState) == 0x000000, "Member 'SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_1_OnSoundDetectionStateChanged__DelegateSignature::OldState' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_1_OnSoundDetectionStateChanged__DelegateSignature, NewState) == 0x000001, "Member 'SoundDetector_BP_C_BndEvt__SoundDetector_BP_RBPlayerSoundDetection_K2Node_ComponentBoundEvent_1_OnSoundDetectionStateChanged__DelegateSignature::NewState' has a wrong offset!");

// Function SoundDetector_BP.SoundDetector_BP_C.SetVariatorEnabled
// 0x0001 (0x0001 - 0x0000)
struct SoundDetector_BP_C_SetVariatorEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SoundDetector_BP_C_SetVariatorEnabled) == 0x000001, "Wrong alignment on SoundDetector_BP_C_SetVariatorEnabled");
static_assert(sizeof(SoundDetector_BP_C_SetVariatorEnabled) == 0x000001, "Wrong size on SoundDetector_BP_C_SetVariatorEnabled");
static_assert(offsetof(SoundDetector_BP_C_SetVariatorEnabled, bEnabled) == 0x000000, "Member 'SoundDetector_BP_C_SetVariatorEnabled::bEnabled' has a wrong offset!");

// Function SoundDetector_BP.SoundDetector_BP_C.ExecuteUbergraph_SoundDetector_BP
// 0x00A0 (0x00A0 - 0x0000)
struct SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AED[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_currentMeterRatio;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerSoundDetectionState                    K2Node_ComponentBoundEvent_oldState;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerSoundDetectionState                    K2Node_ComponentBoundEvent_newState;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AEE[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AEF[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AF0[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance2D_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AF1[0x2];                                     // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue;      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue_1;    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AF2[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHUDTutorialTextData                   K2Node_MakeStruct_HUDTutorialTextData;             // 0x0058(0x0040)()
	bool                                          K2Node_Event_bEnabled;                             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP) == 0x000008, "Wrong alignment on SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP");
static_assert(sizeof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP) == 0x0000A0, "Wrong size on SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, EntryPoint) == 0x000000, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000005, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, K2Node_ComponentBoundEvent_currentMeterRatio) == 0x00000C, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::K2Node_ComponentBoundEvent_currentMeterRatio' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, K2Node_ComponentBoundEvent_oldState) == 0x000010, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::K2Node_ComponentBoundEvent_oldState' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, K2Node_ComponentBoundEvent_newState) == 0x000011, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::K2Node_ComponentBoundEvent_newState' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000013, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_GetLocalPawn_ReturnValue) == 0x000018, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_GetLocalPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000024, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000034, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_Vector_Distance2D_ReturnValue) == 0x000040, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000044, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_BooleanAND_ReturnValue_1) == 0x000045, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_PlayLoopingSoundOnActor_ReturnValue) == 0x000048, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_PlayLoopingSoundOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_PlayLoopingSoundOnActor_ReturnValue_1) == 0x00004C, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_PlayLoopingSoundOnActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000050, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, CallFunc_MapRangeClamped_ReturnValue) == 0x000054, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, K2Node_MakeStruct_HUDTutorialTextData) == 0x000058, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::K2Node_MakeStruct_HUDTutorialTextData' has a wrong offset!");
static_assert(offsetof(SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP, K2Node_Event_bEnabled) == 0x000098, "Member 'SoundDetector_BP_C_ExecuteUbergraph_SoundDetector_BP::K2Node_Event_bEnabled' has a wrong offset!");

}

