#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Speaker_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Speaker_BP.Speaker_BP_C
// 0x0030 (0x0278 - 0x0248)
class ASpeaker_BP_C final : public AActor
{
public:
	class URBIntercomSoundComponent*              RBIntercomSound;                                   // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      RBSoundIndividual;                                 // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SpeakerMinus01;                                    // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           SoundGroup;                                        // 0x0268(0x0010)(Edit, BlueprintVisible)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Speaker_BP_C">();
	}
	static class ASpeaker_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpeaker_BP_C>();
	}
};
static_assert(alignof(ASpeaker_BP_C) == 0x000008, "Wrong alignment on ASpeaker_BP_C");
static_assert(sizeof(ASpeaker_BP_C) == 0x000278, "Wrong size on ASpeaker_BP_C");
static_assert(offsetof(ASpeaker_BP_C, RBIntercomSound) == 0x000248, "Member 'ASpeaker_BP_C::RBIntercomSound' has a wrong offset!");
static_assert(offsetof(ASpeaker_BP_C, RBSoundIndividual) == 0x000250, "Member 'ASpeaker_BP_C::RBSoundIndividual' has a wrong offset!");
static_assert(offsetof(ASpeaker_BP_C, SpeakerMinus01) == 0x000258, "Member 'ASpeaker_BP_C::SpeakerMinus01' has a wrong offset!");
static_assert(offsetof(ASpeaker_BP_C, Scene) == 0x000260, "Member 'ASpeaker_BP_C::Scene' has a wrong offset!");
static_assert(offsetof(ASpeaker_BP_C, SoundGroup) == 0x000268, "Member 'ASpeaker_BP_C::SoundGroup' has a wrong offset!");

}

