#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpectatorInfoHudWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpectatorInfoHudWidget.SpectatorInfoHudWidget_C
// 0x0040 (0x0328 - 0x02E8)
class USpectatorInfoHudWidget_C final : public URBHUDSpectatorInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UActionIconWidget_C*                    ActionIconWidget;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UActionIconWidget_C*                    ActionIconWidget_153;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CyclePrompts;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_SpectatorInfoHudWidget;            // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SpectatedPlayerName;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGroupStatusWidget_C*                   SpectatorSelfWidget;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SpectatorInfoHudWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Event_OnSpectatedPlayerChanged(class ARBPlayer* NewSpectatedlPlayer);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Event_Hide();
	void Event_Show();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpectatorInfoHudWidget_C">();
	}
	static class USpectatorInfoHudWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpectatorInfoHudWidget_C>();
	}
};
static_assert(alignof(USpectatorInfoHudWidget_C) == 0x000008, "Wrong alignment on USpectatorInfoHudWidget_C");
static_assert(sizeof(USpectatorInfoHudWidget_C) == 0x000328, "Wrong size on USpectatorInfoHudWidget_C");
static_assert(offsetof(USpectatorInfoHudWidget_C, UberGraphFrame) == 0x0002E8, "Member 'USpectatorInfoHudWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpectatorInfoHudWidget_C, FadeIn) == 0x0002F0, "Member 'USpectatorInfoHudWidget_C::FadeIn' has a wrong offset!");
static_assert(offsetof(USpectatorInfoHudWidget_C, ActionIconWidget) == 0x0002F8, "Member 'USpectatorInfoHudWidget_C::ActionIconWidget' has a wrong offset!");
static_assert(offsetof(USpectatorInfoHudWidget_C, ActionIconWidget_153) == 0x000300, "Member 'USpectatorInfoHudWidget_C::ActionIconWidget_153' has a wrong offset!");
static_assert(offsetof(USpectatorInfoHudWidget_C, CyclePrompts) == 0x000308, "Member 'USpectatorInfoHudWidget_C::CyclePrompts' has a wrong offset!");
static_assert(offsetof(USpectatorInfoHudWidget_C, InvalidationBox_SpectatorInfoHudWidget) == 0x000310, "Member 'USpectatorInfoHudWidget_C::InvalidationBox_SpectatorInfoHudWidget' has a wrong offset!");
static_assert(offsetof(USpectatorInfoHudWidget_C, SpectatedPlayerName) == 0x000318, "Member 'USpectatorInfoHudWidget_C::SpectatedPlayerName' has a wrong offset!");
static_assert(offsetof(USpectatorInfoHudWidget_C, SpectatorSelfWidget) == 0x000320, "Member 'USpectatorInfoHudWidget_C::SpectatorSelfWidget' has a wrong offset!");

}

