#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpotLightMinus01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SpotLight-01.SpotLight-01_C
// 0x0020 (0x07C0 - 0x07A0)
class ASpotLightMinus01_C final : public ARBLight_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SpotLightMinus01_C;                 // 0x07A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    SpotLight_Static;                                  // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Movable;                                 // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_SpotLightMinus01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpotLight-01_C">();
	}
	static class ASpotLightMinus01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpotLightMinus01_C>();
	}
};
static_assert(alignof(ASpotLightMinus01_C) == 0x000010, "Wrong alignment on ASpotLightMinus01_C");
static_assert(sizeof(ASpotLightMinus01_C) == 0x0007C0, "Wrong size on ASpotLightMinus01_C");
static_assert(offsetof(ASpotLightMinus01_C, UberGraphFrame_SpotLightMinus01_C) == 0x0007A0, "Member 'ASpotLightMinus01_C::UberGraphFrame_SpotLightMinus01_C' has a wrong offset!");
static_assert(offsetof(ASpotLightMinus01_C, SpotLight_Static) == 0x0007A8, "Member 'ASpotLightMinus01_C::SpotLight_Static' has a wrong offset!");
static_assert(offsetof(ASpotLightMinus01_C, SpotLight_Movable) == 0x0007B0, "Member 'ASpotLightMinus01_C::SpotLight_Movable' has a wrong offset!");

}

