#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Stairs_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ModuleMeshDataMinus02_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MeshPopulate_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Stairs_BP.Stairs_BP_C
// 0x00A8 (0x0488 - 0x03E0)
class AStairs_BP_C : public AMeshPopulate_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Stairs_BP_C;                        // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   TopStairsBottomMarker;                             // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   TopStairsTopMarker;                                // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BottomStairsTopMarker;                             // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BottomStairsBottomMarker;                          // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FModuleMeshDataMinus02>         Meshes;                                            // 0x0408(0x0010)(Edit, BlueprintVisible)
	class UStaticMesh*                            PlateauMesh;                                       // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PlateauOffset;                                     // 0x0420(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Stair2Offset;                                      // 0x042C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PositiveX;                                         // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PositiveY;                                         // 0x0439(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D4[0x2];                                     // 0x043A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StairSize;                                         // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StairMeshSize;                                     // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLeftRails;                                      // 0x0444(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseRightRails;                                     // 0x0445(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D5[0x2];                                     // 0x0446(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModuleMeshDataMinus02>         MeshesRails;                                       // 0x0448(0x0010)(Edit, BlueprintVisible)
	float                                         RailHeight;                                        // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RailOffset;                                        // 0x045C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             RailsMaterials;                                    // 0x0460(0x0010)(Edit, BlueprintVisible)
	float                                         DrawDistance;                                      // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StairsLeftBuffer;                                  // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StairsRightBuffer;                                 // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRampsBlockVisibility;                             // 0x047C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bRampsBlockPing;                                   // 0x047D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D6[0x2];                                     // 0x047E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StepAdjustment;                                    // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bVisualOnly;                                       // 0x0484(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();
	void ClearStairsMarkers(class UChildActorComponent* TopMarker, class UChildActorComponent* BottomMarker);
	void UpdateStairsMarkers(class UChildActorComponent* TopMarker, class UChildActorComponent* BottomMarker, float StairsFlatDistance, int32 StepOffset);
	void PostDuplicated(class AActor* DuplicationParent);
	void ExecuteUbergraph_Stairs_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Stairs_BP_C">();
	}
	static class AStairs_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStairs_BP_C>();
	}
};
static_assert(alignof(AStairs_BP_C) == 0x000008, "Wrong alignment on AStairs_BP_C");
static_assert(sizeof(AStairs_BP_C) == 0x000488, "Wrong size on AStairs_BP_C");
static_assert(offsetof(AStairs_BP_C, UberGraphFrame_Stairs_BP_C) == 0x0003E0, "Member 'AStairs_BP_C::UberGraphFrame_Stairs_BP_C' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, TopStairsBottomMarker) == 0x0003E8, "Member 'AStairs_BP_C::TopStairsBottomMarker' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, TopStairsTopMarker) == 0x0003F0, "Member 'AStairs_BP_C::TopStairsTopMarker' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, BottomStairsTopMarker) == 0x0003F8, "Member 'AStairs_BP_C::BottomStairsTopMarker' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, BottomStairsBottomMarker) == 0x000400, "Member 'AStairs_BP_C::BottomStairsBottomMarker' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, Meshes) == 0x000408, "Member 'AStairs_BP_C::Meshes' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, PlateauMesh) == 0x000418, "Member 'AStairs_BP_C::PlateauMesh' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, PlateauOffset) == 0x000420, "Member 'AStairs_BP_C::PlateauOffset' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, Stair2Offset) == 0x00042C, "Member 'AStairs_BP_C::Stair2Offset' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, PositiveX) == 0x000438, "Member 'AStairs_BP_C::PositiveX' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, PositiveY) == 0x000439, "Member 'AStairs_BP_C::PositiveY' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, StairSize) == 0x00043C, "Member 'AStairs_BP_C::StairSize' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, StairMeshSize) == 0x000440, "Member 'AStairs_BP_C::StairMeshSize' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, UseLeftRails) == 0x000444, "Member 'AStairs_BP_C::UseLeftRails' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, UseRightRails) == 0x000445, "Member 'AStairs_BP_C::UseRightRails' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, MeshesRails) == 0x000448, "Member 'AStairs_BP_C::MeshesRails' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, RailHeight) == 0x000458, "Member 'AStairs_BP_C::RailHeight' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, RailOffset) == 0x00045C, "Member 'AStairs_BP_C::RailOffset' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, RailsMaterials) == 0x000460, "Member 'AStairs_BP_C::RailsMaterials' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, DrawDistance) == 0x000470, "Member 'AStairs_BP_C::DrawDistance' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, StairsLeftBuffer) == 0x000474, "Member 'AStairs_BP_C::StairsLeftBuffer' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, StairsRightBuffer) == 0x000478, "Member 'AStairs_BP_C::StairsRightBuffer' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, bRampsBlockVisibility) == 0x00047C, "Member 'AStairs_BP_C::bRampsBlockVisibility' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, bRampsBlockPing) == 0x00047D, "Member 'AStairs_BP_C::bRampsBlockPing' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, StepAdjustment) == 0x000480, "Member 'AStairs_BP_C::StepAdjustment' has a wrong offset!");
static_assert(offsetof(AStairs_BP_C, bVisualOnly) == 0x000484, "Member 'AStairs_BP_C::bVisualOnly' has a wrong offset!");

}

