#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StretchableModulesPartsRandomization

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct StretchableModulesPartsRandomization.StretchableModulesPartsRandomization
// 0x0020 (0x0020 - 0x0000)
struct FStretchableModulesPartsRandomization final
{
public:
	class UStaticMesh*                            Staticmesh_4_C4A80404408DC784724E21BBCB61E64D;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumPossibleInstances_5_8B2E0239481BA430E7D28FB6917394AC; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B89[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceConstant*>      MaterialOverrides_9_74B2CA0E47C17ACCBF6A4CA10E629D59; // 0x0010(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FStretchableModulesPartsRandomization) == 0x000008, "Wrong alignment on FStretchableModulesPartsRandomization");
static_assert(sizeof(FStretchableModulesPartsRandomization) == 0x000020, "Wrong size on FStretchableModulesPartsRandomization");
static_assert(offsetof(FStretchableModulesPartsRandomization, Staticmesh_4_C4A80404408DC784724E21BBCB61E64D) == 0x000000, "Member 'FStretchableModulesPartsRandomization::Staticmesh_4_C4A80404408DC784724E21BBCB61E64D' has a wrong offset!");
static_assert(offsetof(FStretchableModulesPartsRandomization, NumPossibleInstances_5_8B2E0239481BA430E7D28FB6917394AC) == 0x000008, "Member 'FStretchableModulesPartsRandomization::NumPossibleInstances_5_8B2E0239481BA430E7D28FB6917394AC' has a wrong offset!");
static_assert(offsetof(FStretchableModulesPartsRandomization, MaterialOverrides_9_74B2CA0E47C17ACCBF6A4CA10E629D59) == 0x000010, "Member 'FStretchableModulesPartsRandomization::MaterialOverrides_9_74B2CA0E47C17ACCBF6A4CA10E629D59' has a wrong offset!");

}

