#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimedGateLights_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TimedGateLights_BP.TimedGateLights_BP_C.PlayAlarmSound
// 0x0028 (0x0028 - 0x0000)
struct TimedGateLights_BP_C_PlayAlarmSound final
{
public:
	class UAkAudioEvent*                          Event;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInSAS_ReturnValue;                      // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TimedGateLights_BP_C_PlayAlarmSound) == 0x000008, "Wrong alignment on TimedGateLights_BP_C_PlayAlarmSound");
static_assert(sizeof(TimedGateLights_BP_C_PlayAlarmSound) == 0x000028, "Wrong size on TimedGateLights_BP_C_PlayAlarmSound");
static_assert(offsetof(TimedGateLights_BP_C_PlayAlarmSound, Event) == 0x000000, "Member 'TimedGateLights_BP_C_PlayAlarmSound::Event' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_PlayAlarmSound, Temp_delegate_Variable) == 0x000008, "Member 'TimedGateLights_BP_C_PlayAlarmSound::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_PlayAlarmSound, CallFunc_GetLocalPawn_ReturnValue) == 0x000018, "Member 'TimedGateLights_BP_C_PlayAlarmSound::CallFunc_GetLocalPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_PlayAlarmSound, CallFunc_PostEventGlobal_ReturnValue) == 0x000020, "Member 'TimedGateLights_BP_C_PlayAlarmSound::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_PlayAlarmSound, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'TimedGateLights_BP_C_PlayAlarmSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_PlayAlarmSound, CallFunc_IsInSAS_ReturnValue) == 0x000025, "Member 'TimedGateLights_BP_C_PlayAlarmSound::CallFunc_IsInSAS_ReturnValue' has a wrong offset!");

// Function TimedGateLights_BP.TimedGateLights_BP_C.OnRep_LightState
// 0x0002 (0x0002 - 0x0000)
struct TimedGateLights_BP_C_OnRep_LightState final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TimedGateLights_BP_C_OnRep_LightState) == 0x000001, "Wrong alignment on TimedGateLights_BP_C_OnRep_LightState");
static_assert(sizeof(TimedGateLights_BP_C_OnRep_LightState) == 0x000002, "Wrong size on TimedGateLights_BP_C_OnRep_LightState");
static_assert(offsetof(TimedGateLights_BP_C_OnRep_LightState, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'TimedGateLights_BP_C_OnRep_LightState::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_OnRep_LightState, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'TimedGateLights_BP_C_OnRep_LightState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function TimedGateLights_BP.TimedGateLights_BP_C.SetLightState
// 0x0038 (0x0038 - 0x0000)
struct TimedGateLights_BP_C_SetLightState final
{
public:
	class UStaticMeshComponent*                   MeshComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOn;                                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Green;                                             // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Blinking_Red_Green;                                // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Blinking_Red;                                      // 0x000B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Blinking_Green;                                    // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2747[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_2;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_3;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_4;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TimedGateLights_BP_C_SetLightState) == 0x000008, "Wrong alignment on TimedGateLights_BP_C_SetLightState");
static_assert(sizeof(TimedGateLights_BP_C_SetLightState) == 0x000038, "Wrong size on TimedGateLights_BP_C_SetLightState");
static_assert(offsetof(TimedGateLights_BP_C_SetLightState, MeshComponent) == 0x000000, "Member 'TimedGateLights_BP_C_SetLightState::MeshComponent' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_SetLightState, bOn) == 0x000008, "Member 'TimedGateLights_BP_C_SetLightState::bOn' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_SetLightState, Green) == 0x000009, "Member 'TimedGateLights_BP_C_SetLightState::Green' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_SetLightState, Blinking_Red_Green) == 0x00000A, "Member 'TimedGateLights_BP_C_SetLightState::Blinking_Red_Green' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_SetLightState, Blinking_Red) == 0x00000B, "Member 'TimedGateLights_BP_C_SetLightState::Blinking_Red' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_SetLightState, Blinking_Green) == 0x00000C, "Member 'TimedGateLights_BP_C_SetLightState::Blinking_Green' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_SetLightState, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000010, "Member 'TimedGateLights_BP_C_SetLightState::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_SetLightState, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000014, "Member 'TimedGateLights_BP_C_SetLightState::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_SetLightState, CallFunc_Conv_BoolToFloat_ReturnValue_2) == 0x000018, "Member 'TimedGateLights_BP_C_SetLightState::CallFunc_Conv_BoolToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_SetLightState, CallFunc_Conv_BoolToFloat_ReturnValue_3) == 0x00001C, "Member 'TimedGateLights_BP_C_SetLightState::CallFunc_Conv_BoolToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_SetLightState, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'TimedGateLights_BP_C_SetLightState::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_SetLightState, CallFunc_Conv_BoolToFloat_ReturnValue_4) == 0x000028, "Member 'TimedGateLights_BP_C_SetLightState::CallFunc_Conv_BoolToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_SetLightState, CallFunc_MakeVector_ReturnValue) == 0x00002C, "Member 'TimedGateLights_BP_C_SetLightState::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function TimedGateLights_BP.TimedGateLights_BP_C.SetTimedState
// 0x0008 (0x0008 - 0x0000)
struct TimedGateLights_BP_C_SetTimedState final
{
public:
	bool                                          Param_Open;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2748[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TimedGateLights_BP_C_SetTimedState) == 0x000004, "Wrong alignment on TimedGateLights_BP_C_SetTimedState");
static_assert(sizeof(TimedGateLights_BP_C_SetTimedState) == 0x000008, "Wrong size on TimedGateLights_BP_C_SetTimedState");
static_assert(offsetof(TimedGateLights_BP_C_SetTimedState, Param_Open) == 0x000000, "Member 'TimedGateLights_BP_C_SetTimedState::Param_Open' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_SetTimedState, Duration) == 0x000004, "Member 'TimedGateLights_BP_C_SetTimedState::Duration' has a wrong offset!");

// Function TimedGateLights_BP.TimedGateLights_BP_C.ExecuteUbergraph_TimedGateLights_BP
// 0x0010 (0x0010 - 0x0000)
struct TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Open;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2749[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Duration;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP) == 0x000004, "Wrong alignment on TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP");
static_assert(sizeof(TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP) == 0x000010, "Wrong size on TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP");
static_assert(offsetof(TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP, EntryPoint) == 0x000000, "Member 'TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP, K2Node_CustomEvent_Open) == 0x000005, "Member 'TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP::K2Node_CustomEvent_Open' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP, K2Node_CustomEvent_Duration) == 0x000008, "Member 'TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'TimedGateLights_BP_C_ExecuteUbergraph_TimedGateLights_BP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

}

