#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrialBoardPartyInviteLinkWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TrialBoardPartyInviteLinkWidget.TrialBoardPartyInviteLinkWidget_C
// 0x0030 (0x04A0 - 0x0470)
class UTrialBoardPartyInviteLinkWidget_C final : public URBSocialMenuEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focus;                                             // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               GradeOverlay;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScoreFrame;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ScoreText;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__TrialBoardPartyInviteLinkWidget_Button_0_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void Event_Refresh();
	void BndEvt__TrialBoardPartyInviteLinkWidget_Button_0_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__TrialBoardPartyInviteLinkWidget_Button_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_TrialBoardPartyInviteLinkWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TrialBoardPartyInviteLinkWidget_C">();
	}
	static class UTrialBoardPartyInviteLinkWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrialBoardPartyInviteLinkWidget_C>();
	}
};
static_assert(alignof(UTrialBoardPartyInviteLinkWidget_C) == 0x000008, "Wrong alignment on UTrialBoardPartyInviteLinkWidget_C");
static_assert(sizeof(UTrialBoardPartyInviteLinkWidget_C) == 0x0004A0, "Wrong size on UTrialBoardPartyInviteLinkWidget_C");
static_assert(offsetof(UTrialBoardPartyInviteLinkWidget_C, UberGraphFrame) == 0x000470, "Member 'UTrialBoardPartyInviteLinkWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTrialBoardPartyInviteLinkWidget_C, Focus) == 0x000478, "Member 'UTrialBoardPartyInviteLinkWidget_C::Focus' has a wrong offset!");
static_assert(offsetof(UTrialBoardPartyInviteLinkWidget_C, Button_0) == 0x000480, "Member 'UTrialBoardPartyInviteLinkWidget_C::Button_0' has a wrong offset!");
static_assert(offsetof(UTrialBoardPartyInviteLinkWidget_C, GradeOverlay) == 0x000488, "Member 'UTrialBoardPartyInviteLinkWidget_C::GradeOverlay' has a wrong offset!");
static_assert(offsetof(UTrialBoardPartyInviteLinkWidget_C, ScoreFrame) == 0x000490, "Member 'UTrialBoardPartyInviteLinkWidget_C::ScoreFrame' has a wrong offset!");
static_assert(offsetof(UTrialBoardPartyInviteLinkWidget_C, ScoreText) == 0x000498, "Member 'UTrialBoardPartyInviteLinkWidget_C::ScoreText' has a wrong offset!");

}

