#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrialBoardOverheadWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function TrialBoardOverheadWidget.TrialBoardOverheadWidget_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct TrialBoardOverheadWidget_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(TrialBoardOverheadWidget_C_OnFocusLost) == 0x000004, "Wrong alignment on TrialBoardOverheadWidget_C_OnFocusLost");
static_assert(sizeof(TrialBoardOverheadWidget_C_OnFocusLost) == 0x000008, "Wrong size on TrialBoardOverheadWidget_C_OnFocusLost");
static_assert(offsetof(TrialBoardOverheadWidget_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'TrialBoardOverheadWidget_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function TrialBoardOverheadWidget.TrialBoardOverheadWidget_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct TrialBoardOverheadWidget_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(TrialBoardOverheadWidget_C_OnFocusReceived) == 0x000008, "Wrong alignment on TrialBoardOverheadWidget_C_OnFocusReceived");
static_assert(sizeof(TrialBoardOverheadWidget_C_OnFocusReceived) == 0x0001B0, "Wrong size on TrialBoardOverheadWidget_C_OnFocusReceived");
static_assert(offsetof(TrialBoardOverheadWidget_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'TrialBoardOverheadWidget_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'TrialBoardOverheadWidget_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'TrialBoardOverheadWidget_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'TrialBoardOverheadWidget_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function TrialBoardOverheadWidget.TrialBoardOverheadWidget_C.SetupPerksList
// 0x0010 (0x0010 - 0x0000)
struct TrialBoardOverheadWidget_C_SetupPerksList final
{
public:
	const class ARBPlayerState*                   CallFunc_BP_GetRBPlayerState_ReturnValue;          // 0x0000(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrialBoardOverheadWidget_C_SetupPerksList) == 0x000008, "Wrong alignment on TrialBoardOverheadWidget_C_SetupPerksList");
static_assert(sizeof(TrialBoardOverheadWidget_C_SetupPerksList) == 0x000010, "Wrong size on TrialBoardOverheadWidget_C_SetupPerksList");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupPerksList, CallFunc_BP_GetRBPlayerState_ReturnValue) == 0x000000, "Member 'TrialBoardOverheadWidget_C_SetupPerksList::CallFunc_BP_GetRBPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupPerksList, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'TrialBoardOverheadWidget_C_SetupPerksList::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TrialBoardOverheadWidget.TrialBoardOverheadWidget_C.SetupPlayerLevel
// 0x0028 (0x0028 - 0x0000)
struct TrialBoardOverheadWidget_C_SetupPlayerLevel final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPlayerLevel_ReturnValue;               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetPlayerLevel_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_366E[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
};
static_assert(alignof(TrialBoardOverheadWidget_C_SetupPlayerLevel) == 0x000008, "Wrong alignment on TrialBoardOverheadWidget_C_SetupPlayerLevel");
static_assert(sizeof(TrialBoardOverheadWidget_C_SetupPlayerLevel) == 0x000028, "Wrong size on TrialBoardOverheadWidget_C_SetupPlayerLevel");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupPlayerLevel, Temp_bool_Variable) == 0x000000, "Member 'TrialBoardOverheadWidget_C_SetupPlayerLevel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupPlayerLevel, Temp_byte_Variable) == 0x000001, "Member 'TrialBoardOverheadWidget_C_SetupPlayerLevel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupPlayerLevel, Temp_byte_Variable_1) == 0x000002, "Member 'TrialBoardOverheadWidget_C_SetupPlayerLevel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupPlayerLevel, CallFunc_HasPlayerLevel_ReturnValue) == 0x000003, "Member 'TrialBoardOverheadWidget_C_SetupPlayerLevel::CallFunc_HasPlayerLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupPlayerLevel, CallFunc_GetPlayerLevel_ReturnValue) == 0x000004, "Member 'TrialBoardOverheadWidget_C_SetupPlayerLevel::CallFunc_GetPlayerLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupPlayerLevel, K2Node_Select_Default) == 0x000008, "Member 'TrialBoardOverheadWidget_C_SetupPlayerLevel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupPlayerLevel, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'TrialBoardOverheadWidget_C_SetupPlayerLevel::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function TrialBoardOverheadWidget.TrialBoardOverheadWidget_C.SetupPartyLeaderIcon
// 0x0005 (0x0005 - 0x0000)
struct TrialBoardOverheadWidget_C_SetupPartyLeaderIcon final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyOwner_ReturnValue;                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialBoardOverheadWidget_C_SetupPartyLeaderIcon) == 0x000001, "Wrong alignment on TrialBoardOverheadWidget_C_SetupPartyLeaderIcon");
static_assert(sizeof(TrialBoardOverheadWidget_C_SetupPartyLeaderIcon) == 0x000005, "Wrong size on TrialBoardOverheadWidget_C_SetupPartyLeaderIcon");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupPartyLeaderIcon, Temp_bool_Variable) == 0x000000, "Member 'TrialBoardOverheadWidget_C_SetupPartyLeaderIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupPartyLeaderIcon, Temp_byte_Variable) == 0x000001, "Member 'TrialBoardOverheadWidget_C_SetupPartyLeaderIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupPartyLeaderIcon, Temp_byte_Variable_1) == 0x000002, "Member 'TrialBoardOverheadWidget_C_SetupPartyLeaderIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupPartyLeaderIcon, CallFunc_IsPartyOwner_ReturnValue) == 0x000003, "Member 'TrialBoardOverheadWidget_C_SetupPartyLeaderIcon::CallFunc_IsPartyOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupPartyLeaderIcon, K2Node_Select_Default) == 0x000004, "Member 'TrialBoardOverheadWidget_C_SetupPartyLeaderIcon::K2Node_Select_Default' has a wrong offset!");

// Function TrialBoardOverheadWidget.TrialBoardOverheadWidget_C.SetupActiveSkill
// 0x0130 (0x0130 - 0x0000)
struct TrialBoardOverheadWidget_C_SetupActiveSkill final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEditLoadouts_ReturnValue;              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasFlag_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActiveSkillType                              CallFunc_GetSelectedActiveSkill_ReturnValue;       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMenuUpgradeItemInfo                   CallFunc_GetActiveSkillUpgradeItemInfo_ReturnValue; // 0x0008(0x0128)()
};
static_assert(alignof(TrialBoardOverheadWidget_C_SetupActiveSkill) == 0x000008, "Wrong alignment on TrialBoardOverheadWidget_C_SetupActiveSkill");
static_assert(sizeof(TrialBoardOverheadWidget_C_SetupActiveSkill) == 0x000130, "Wrong size on TrialBoardOverheadWidget_C_SetupActiveSkill");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupActiveSkill, Temp_bool_Variable) == 0x000000, "Member 'TrialBoardOverheadWidget_C_SetupActiveSkill::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupActiveSkill, Temp_byte_Variable) == 0x000001, "Member 'TrialBoardOverheadWidget_C_SetupActiveSkill::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupActiveSkill, Temp_byte_Variable_1) == 0x000002, "Member 'TrialBoardOverheadWidget_C_SetupActiveSkill::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupActiveSkill, CallFunc_CanEditLoadouts_ReturnValue) == 0x000003, "Member 'TrialBoardOverheadWidget_C_SetupActiveSkill::CallFunc_CanEditLoadouts_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupActiveSkill, CallFunc_HasFlag_ReturnValue) == 0x000004, "Member 'TrialBoardOverheadWidget_C_SetupActiveSkill::CallFunc_HasFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupActiveSkill, K2Node_Select_Default) == 0x000005, "Member 'TrialBoardOverheadWidget_C_SetupActiveSkill::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupActiveSkill, CallFunc_GetSelectedActiveSkill_ReturnValue) == 0x000006, "Member 'TrialBoardOverheadWidget_C_SetupActiveSkill::CallFunc_GetSelectedActiveSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupActiveSkill, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000007, "Member 'TrialBoardOverheadWidget_C_SetupActiveSkill::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetupActiveSkill, CallFunc_GetActiveSkillUpgradeItemInfo_ReturnValue) == 0x000008, "Member 'TrialBoardOverheadWidget_C_SetupActiveSkill::CallFunc_GetActiveSkillUpgradeItemInfo_ReturnValue' has a wrong offset!");

// Function TrialBoardOverheadWidget.TrialBoardOverheadWidget_C.SetName
// 0x0038 (0x0038 - 0x0000)
struct TrialBoardOverheadWidget_C_SetName final
{
public:
	class FString                                 CallFunc_GetName_ReturnValue;                      // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FormatPlayerDisplayName_formatedDisplayName; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(TrialBoardOverheadWidget_C_SetName) == 0x000008, "Wrong alignment on TrialBoardOverheadWidget_C_SetName");
static_assert(sizeof(TrialBoardOverheadWidget_C_SetName) == 0x000038, "Wrong size on TrialBoardOverheadWidget_C_SetName");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetName, CallFunc_GetName_ReturnValue) == 0x000000, "Member 'TrialBoardOverheadWidget_C_SetName::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetName, CallFunc_FormatPlayerDisplayName_formatedDisplayName) == 0x000010, "Member 'TrialBoardOverheadWidget_C_SetName::CallFunc_FormatPlayerDisplayName_formatedDisplayName' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_SetName, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'TrialBoardOverheadWidget_C_SetName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function TrialBoardOverheadWidget.TrialBoardOverheadWidget_C.BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_0_OnClickedEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_0_OnClickedEvent__DelegateSignature final
{
public:
	class UActiveSkillButton_C*                   Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_0_OnClickedEvent__DelegateSignature) == 0x000008, "Wrong alignment on TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_0_OnClickedEvent__DelegateSignature");
static_assert(sizeof(TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_0_OnClickedEvent__DelegateSignature) == 0x000008, "Wrong size on TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_0_OnClickedEvent__DelegateSignature");
static_assert(offsetof(TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_0_OnClickedEvent__DelegateSignature, Button) == 0x000000, "Member 'TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_0_OnClickedEvent__DelegateSignature::Button' has a wrong offset!");

// Function TrialBoardOverheadWidget.TrialBoardOverheadWidget_C.BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_1_OnHoveredEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_1_OnHoveredEvent__DelegateSignature final
{
public:
	class UActiveSkillButton_C*                   Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_1_OnHoveredEvent__DelegateSignature) == 0x000008, "Wrong alignment on TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_1_OnHoveredEvent__DelegateSignature");
static_assert(sizeof(TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_1_OnHoveredEvent__DelegateSignature) == 0x000008, "Wrong size on TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_1_OnHoveredEvent__DelegateSignature");
static_assert(offsetof(TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_1_OnHoveredEvent__DelegateSignature, Button) == 0x000000, "Member 'TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_1_OnHoveredEvent__DelegateSignature::Button' has a wrong offset!");

// Function TrialBoardOverheadWidget.TrialBoardOverheadWidget_C.BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_2_OnUnhoveredEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_2_OnUnhoveredEvent__DelegateSignature final
{
public:
	class UActiveSkillButton_C*                   Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_2_OnUnhoveredEvent__DelegateSignature) == 0x000008, "Wrong alignment on TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_2_OnUnhoveredEvent__DelegateSignature");
static_assert(sizeof(TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_2_OnUnhoveredEvent__DelegateSignature) == 0x000008, "Wrong size on TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_2_OnUnhoveredEvent__DelegateSignature");
static_assert(offsetof(TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_2_OnUnhoveredEvent__DelegateSignature, Button) == 0x000000, "Member 'TrialBoardOverheadWidget_C_BndEvt__TrialBoardOverheadWidget_ActiveSkillButton_K2Node_ComponentBoundEvent_2_OnUnhoveredEvent__DelegateSignature::Button' has a wrong offset!");

// Function TrialBoardOverheadWidget.TrialBoardOverheadWidget_C.ExecuteUbergraph_TrialBoardOverheadWidget
// 0x0078 (0x0078 - 0x0000)
struct TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_366F[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActiveSkillButton_C*                   K2Node_ComponentBoundEvent_Button_2;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FProfileId                             CallFunc_GetProfileId_ReturnValue;                 // 0x0020(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActiveSkillButton_C*                   K2Node_ComponentBoundEvent_Button_1;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActiveSkillButton_C*                   K2Node_ComponentBoundEvent_Button;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0048(0x0018)()
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue_1;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3670[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue_2;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget) == 0x000008, "Wrong alignment on TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget");
static_assert(sizeof(TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget) == 0x000078, "Wrong size on TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget");
static_assert(offsetof(TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget, EntryPoint) == 0x000000, "Member 'TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget, K2Node_ComponentBoundEvent_Button_2) == 0x000018, "Member 'TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget, CallFunc_GetProfileId_ReturnValue) == 0x000020, "Member 'TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget::CallFunc_GetProfileId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget, K2Node_ComponentBoundEvent_Button_1) == 0x000030, "Member 'TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget, K2Node_ComponentBoundEvent_Button) == 0x000038, "Member 'TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget, CallFunc_MakeLiteralName_ReturnValue) == 0x000040, "Member 'TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget, CallFunc_MakeLiteralText_ReturnValue) == 0x000048, "Member 'TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000060, "Member 'TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget, CallFunc_BP_IsUsingGamepad_ReturnValue_1) == 0x000061, "Member 'TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget::CallFunc_BP_IsUsingGamepad_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget, CallFunc_GetMenuManager_ReturnValue) == 0x000068, "Member 'TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget, CallFunc_BP_IsUsingGamepad_ReturnValue_2) == 0x000070, "Member 'TrialBoardOverheadWidget_C_ExecuteUbergraph_TrialBoardOverheadWidget::CallFunc_BP_IsUsingGamepad_ReturnValue_2' has a wrong offset!");

}

