#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VariatorCountPreviewWidget

#include "Basic.hpp"

#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function VariatorCountPreviewWidget.VariatorCountPreviewWidget_C.Init
// 0x01B0 (0x01B0 - 0x0000)
struct VariatorCountPreviewWidget_C_Init final
{
public:
	class FName                                   TrialId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3671[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVariatorPreviewWidget_C*               CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGameStructureConfig*                 CallFunc_GetGameStructureConfig_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGameStructureConfig*                 CallFunc_GetGameStructureConfig_ReturnValue_1;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBTrialInfoRow                        CallFunc_GetTrialInfo_ReturnValue;                 // 0x0038(0x0158)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0194(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3672[0x3];                                     // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBVariatorInfo*                        CallFunc_GetVariatorInfo_ReturnValue;              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VariatorCountPreviewWidget_C_Init) == 0x000008, "Wrong alignment on VariatorCountPreviewWidget_C_Init");
static_assert(sizeof(VariatorCountPreviewWidget_C_Init) == 0x0001B0, "Wrong size on VariatorCountPreviewWidget_C_Init");
static_assert(offsetof(VariatorCountPreviewWidget_C_Init, TrialId) == 0x000000, "Member 'VariatorCountPreviewWidget_C_Init::TrialId' has a wrong offset!");
static_assert(offsetof(VariatorCountPreviewWidget_C_Init, Temp_int_Array_Index_Variable) == 0x000008, "Member 'VariatorCountPreviewWidget_C_Init::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(VariatorCountPreviewWidget_C_Init, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'VariatorCountPreviewWidget_C_Init::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(VariatorCountPreviewWidget_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'VariatorCountPreviewWidget_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VariatorCountPreviewWidget_C_Init, CallFunc_Create_ReturnValue) == 0x000018, "Member 'VariatorCountPreviewWidget_C_Init::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(VariatorCountPreviewWidget_C_Init, CallFunc_GetGameStructureConfig_ReturnValue) == 0x000020, "Member 'VariatorCountPreviewWidget_C_Init::CallFunc_GetGameStructureConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(VariatorCountPreviewWidget_C_Init, CallFunc_GetGameStructureConfig_ReturnValue_1) == 0x000028, "Member 'VariatorCountPreviewWidget_C_Init::CallFunc_GetGameStructureConfig_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VariatorCountPreviewWidget_C_Init, CallFunc_AddChild_ReturnValue) == 0x000030, "Member 'VariatorCountPreviewWidget_C_Init::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(VariatorCountPreviewWidget_C_Init, CallFunc_GetTrialInfo_ReturnValue) == 0x000038, "Member 'VariatorCountPreviewWidget_C_Init::CallFunc_GetTrialInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(VariatorCountPreviewWidget_C_Init, CallFunc_Array_Length_ReturnValue) == 0x000190, "Member 'VariatorCountPreviewWidget_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(VariatorCountPreviewWidget_C_Init, CallFunc_Array_Get_Item) == 0x000194, "Member 'VariatorCountPreviewWidget_C_Init::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(VariatorCountPreviewWidget_C_Init, CallFunc_Less_IntInt_ReturnValue) == 0x00019C, "Member 'VariatorCountPreviewWidget_C_Init::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VariatorCountPreviewWidget_C_Init, CallFunc_GetVariatorInfo_ReturnValue) == 0x0001A0, "Member 'VariatorCountPreviewWidget_C_Init::CallFunc_GetVariatorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(VariatorCountPreviewWidget_C_Init, CallFunc_IsValid_ReturnValue) == 0x0001A8, "Member 'VariatorCountPreviewWidget_C_Init::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

