#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceChatOverheadWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function VoiceChatOverheadWidget.VoiceChatOverheadWidget_C.ExecuteUbergraph_VoiceChatOverheadWidget
// 0x0014 (0x0014 - 0x0000)
struct VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasVoiceChatPrivilege_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpeaking_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMuted_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBlocked_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasVoiceChatEnabled_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVoiceChatConnected_ReturnValue;         // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget) == 0x000004, "Wrong alignment on VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget");
static_assert(sizeof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget) == 0x000014, "Wrong size on VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget");
static_assert(offsetof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget, EntryPoint) == 0x000000, "Member 'VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget, CallFunc_HasVoiceChatPrivilege_ReturnValue) == 0x000004, "Member 'VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget::CallFunc_HasVoiceChatPrivilege_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget, Temp_bool_Variable) == 0x000005, "Member 'VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget, Temp_byte_Variable) == 0x000007, "Member 'VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget, Temp_byte_Variable_1) == 0x000008, "Member 'VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget, CallFunc_IsSpeaking_ReturnValue) == 0x000009, "Member 'VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget::CallFunc_IsSpeaking_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget, CallFunc_IsMuted_ReturnValue) == 0x00000A, "Member 'VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget::CallFunc_IsMuted_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget, CallFunc_IsBlocked_ReturnValue) == 0x00000B, "Member 'VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget::CallFunc_IsBlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget, CallFunc_HasVoiceChatEnabled_ReturnValue) == 0x00000C, "Member 'VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget::CallFunc_HasVoiceChatEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget, CallFunc_BooleanOR_ReturnValue) == 0x00000D, "Member 'VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget, CallFunc_IsVoiceChatConnected_ReturnValue) == 0x00000E, "Member 'VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget::CallFunc_IsVoiceChatConnected_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget, CallFunc_BooleanAND_ReturnValue) == 0x00000F, "Member 'VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget, K2Node_Select_Default) == 0x000010, "Member 'VoiceChatOverheadWidget_C_ExecuteUbergraph_VoiceChatOverheadWidget::K2Node_Select_Default' has a wrong offset!");

}

