#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WakeUpBed_GhostAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass WakeUpBed_GhostAnimBP.WakeUpBed_GhostAnimBP_C
// 0x0430 (0x0720 - 0x02F0)
class UWakeUpBed_GhostAnimBP_C final : public URBGhostAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0328(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0350(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0378(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x03A0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0420(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0450(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x04D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0500(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0580(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x05B0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0630(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0660(0x00B0)()
	bool                                          IsAwake;                                           // 0x0710(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanEntry;                                          // 0x0711(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	bool FinishGhost(EGhostFinishReason FinishReason, int32 GhostFinishCustomReason);
	void AnimNotify_Done();
	void AnimNotify_Entry();
	void BP_InitializeGhost();
	void ExecuteUbergraph_WakeUpBed_GhostAnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WakeUpBed_GhostAnimBP_C">();
	}
	static class UWakeUpBed_GhostAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWakeUpBed_GhostAnimBP_C>();
	}
};
static_assert(alignof(UWakeUpBed_GhostAnimBP_C) == 0x000010, "Wrong alignment on UWakeUpBed_GhostAnimBP_C");
static_assert(sizeof(UWakeUpBed_GhostAnimBP_C) == 0x000720, "Wrong size on UWakeUpBed_GhostAnimBP_C");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, UberGraphFrame) == 0x0002F0, "Member 'UWakeUpBed_GhostAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, AnimGraphNode_Root) == 0x0002F8, "Member 'UWakeUpBed_GhostAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, AnimGraphNode_TransitionResult_2) == 0x000328, "Member 'UWakeUpBed_GhostAnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000350, "Member 'UWakeUpBed_GhostAnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, AnimGraphNode_TransitionResult) == 0x000378, "Member 'UWakeUpBed_GhostAnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x0003A0, "Member 'UWakeUpBed_GhostAnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, AnimGraphNode_StateResult_3) == 0x000420, "Member 'UWakeUpBed_GhostAnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000450, "Member 'UWakeUpBed_GhostAnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, AnimGraphNode_StateResult_2) == 0x0004D0, "Member 'UWakeUpBed_GhostAnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000500, "Member 'UWakeUpBed_GhostAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, AnimGraphNode_StateResult_1) == 0x000580, "Member 'UWakeUpBed_GhostAnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, AnimGraphNode_SequencePlayer) == 0x0005B0, "Member 'UWakeUpBed_GhostAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, AnimGraphNode_StateResult) == 0x000630, "Member 'UWakeUpBed_GhostAnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, AnimGraphNode_StateMachine) == 0x000660, "Member 'UWakeUpBed_GhostAnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, IsAwake) == 0x000710, "Member 'UWakeUpBed_GhostAnimBP_C::IsAwake' has a wrong offset!");
static_assert(offsetof(UWakeUpBed_GhostAnimBP_C, CanEntry) == 0x000711, "Member 'UWakeUpBed_GhostAnimBP_C::CanEntry' has a wrong offset!");

}

