#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WallIndustrialLampMinus01

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WallIndustrialLamp-01.WallIndustrialLamp-01_C
// 0x0020 (0x07C0 - 0x07A0)
class AWallIndustrialLampMinus01_C final : public ARBLight_BP_C
{
public:
	class URBVolumetricFogLightComponent*         RBVolumetricFogLight;                              // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight_Dual;                                   // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Movable;                                 // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Static;                                  // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WallIndustrialLamp-01_C">();
	}
	static class AWallIndustrialLampMinus01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWallIndustrialLampMinus01_C>();
	}
};
static_assert(alignof(AWallIndustrialLampMinus01_C) == 0x000010, "Wrong alignment on AWallIndustrialLampMinus01_C");
static_assert(sizeof(AWallIndustrialLampMinus01_C) == 0x0007C0, "Wrong size on AWallIndustrialLampMinus01_C");
static_assert(offsetof(AWallIndustrialLampMinus01_C, RBVolumetricFogLight) == 0x0007A0, "Member 'AWallIndustrialLampMinus01_C::RBVolumetricFogLight' has a wrong offset!");
static_assert(offsetof(AWallIndustrialLampMinus01_C, PointLight_Dual) == 0x0007A8, "Member 'AWallIndustrialLampMinus01_C::PointLight_Dual' has a wrong offset!");
static_assert(offsetof(AWallIndustrialLampMinus01_C, SpotLight_Movable) == 0x0007B0, "Member 'AWallIndustrialLampMinus01_C::SpotLight_Movable' has a wrong offset!");
static_assert(offsetof(AWallIndustrialLampMinus01_C, SpotLight_Static) == 0x0007B8, "Member 'AWallIndustrialLampMinus01_C::SpotLight_Static' has a wrong offset!");

}

