#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WallFluorescentMinus02

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WallFluorescent-02.WallFluorescent-02_C
// 0x0020 (0x07C0 - 0x07A0)
class AWallFluorescentMinus02_C final : public ARBLight_BP_C
{
public:
	class UPointLightComponent*                   PointLight_Dual;                                   // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBVolumetricFogLightComponent*         RBVolumetricFogLight;                              // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight_Movable;                               // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight_Static;                                // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WallFluorescent-02_C">();
	}
	static class AWallFluorescentMinus02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWallFluorescentMinus02_C>();
	}
};
static_assert(alignof(AWallFluorescentMinus02_C) == 0x000010, "Wrong alignment on AWallFluorescentMinus02_C");
static_assert(sizeof(AWallFluorescentMinus02_C) == 0x0007C0, "Wrong size on AWallFluorescentMinus02_C");
static_assert(offsetof(AWallFluorescentMinus02_C, PointLight_Dual) == 0x0007A0, "Member 'AWallFluorescentMinus02_C::PointLight_Dual' has a wrong offset!");
static_assert(offsetof(AWallFluorescentMinus02_C, RBVolumetricFogLight) == 0x0007A8, "Member 'AWallFluorescentMinus02_C::RBVolumetricFogLight' has a wrong offset!");
static_assert(offsetof(AWallFluorescentMinus02_C, RBSpotLight_Movable) == 0x0007B0, "Member 'AWallFluorescentMinus02_C::RBSpotLight_Movable' has a wrong offset!");
static_assert(offsetof(AWallFluorescentMinus02_C, RBSpotLight_Static) == 0x0007B8, "Member 'AWallFluorescentMinus02_C::RBSpotLight_Static' has a wrong offset!");

}

