#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wernicke_Lobby_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Wernicke_Lobby_BP.Wernicke_Lobby_BP_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct Wernicke_Lobby_BP_C_UserConstructionScript final
{
public:
	TArray<class UPrimitiveComponent*>            K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Wernicke_Lobby_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on Wernicke_Lobby_BP_C_UserConstructionScript");
static_assert(sizeof(Wernicke_Lobby_BP_C_UserConstructionScript) == 0x000010, "Wrong size on Wernicke_Lobby_BP_C_UserConstructionScript");
static_assert(offsetof(Wernicke_Lobby_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'Wernicke_Lobby_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");

// Function Wernicke_Lobby_BP.Wernicke_Lobby_BP_C.ExecuteUbergraph_Wernicke_Lobby_BP
// 0x0038 (0x0038 - 0x0000)
struct Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D9[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWernicke_AnimBP_C*                     K2Node_DynamicCast_AsWernicke_Anim_BP;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33DA[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWernicke_WheelChair_AnimBP_C*          K2Node_DynamicCast_AsWernicke_Wheel_Chair_Anim_BP; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33DB[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP) == 0x000008, "Wrong alignment on Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP");
static_assert(sizeof(Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP) == 0x000038, "Wrong size on Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP");
static_assert(offsetof(Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP, EntryPoint) == 0x000000, "Member 'Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000010, "Member 'Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP, K2Node_DynamicCast_AsWernicke_Anim_BP) == 0x000018, "Member 'Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP::K2Node_DynamicCast_AsWernicke_Anim_BP' has a wrong offset!");
static_assert(offsetof(Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP, K2Node_DynamicCast_AsWernicke_Wheel_Chair_Anim_BP) == 0x000028, "Member 'Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP::K2Node_DynamicCast_AsWernicke_Wheel_Chair_Anim_BP' has a wrong offset!");
static_assert(offsetof(Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP, CallFunc_RandomFloatInRange_ReturnValue) == 0x000034, "Member 'Wernicke_Lobby_BP_C_ExecuteUbergraph_Wernicke_Lobby_BP::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");

}

