#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wernicke_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Wernicke_AnimBP.Wernicke_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Wernicke_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Wernicke_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Wernicke_AnimBP_C_AnimGraph");
static_assert(sizeof(Wernicke_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Wernicke_AnimBP_C_AnimGraph");
static_assert(offsetof(Wernicke_AnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'Wernicke_AnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function Wernicke_AnimBP.Wernicke_AnimBP_C.ExecuteUbergraph_Wernicke_AnimBP
// 0x0020 (0x0020 - 0x0000)
struct Wernicke_AnimBP_C_ExecuteUbergraph_Wernicke_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3420[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWernicke_Lobby_BP_C*                   K2Node_DynamicCast_AsWernicke_Lobby_BP;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Wernicke_AnimBP_C_ExecuteUbergraph_Wernicke_AnimBP) == 0x000008, "Wrong alignment on Wernicke_AnimBP_C_ExecuteUbergraph_Wernicke_AnimBP");
static_assert(sizeof(Wernicke_AnimBP_C_ExecuteUbergraph_Wernicke_AnimBP) == 0x000020, "Wrong size on Wernicke_AnimBP_C_ExecuteUbergraph_Wernicke_AnimBP");
static_assert(offsetof(Wernicke_AnimBP_C_ExecuteUbergraph_Wernicke_AnimBP, EntryPoint) == 0x000000, "Member 'Wernicke_AnimBP_C_ExecuteUbergraph_Wernicke_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Wernicke_AnimBP_C_ExecuteUbergraph_Wernicke_AnimBP, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'Wernicke_AnimBP_C_ExecuteUbergraph_Wernicke_AnimBP::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wernicke_AnimBP_C_ExecuteUbergraph_Wernicke_AnimBP, K2Node_DynamicCast_AsWernicke_Lobby_BP) == 0x000010, "Member 'Wernicke_AnimBP_C_ExecuteUbergraph_Wernicke_AnimBP::K2Node_DynamicCast_AsWernicke_Lobby_BP' has a wrong offset!");
static_assert(offsetof(Wernicke_AnimBP_C_ExecuteUbergraph_Wernicke_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Wernicke_AnimBP_C_ExecuteUbergraph_Wernicke_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

