#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccountUpgradeMenuWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function AccountUpgradeMenuWidget.AccountUpgradeMenuWidget_C.ExecuteUbergraph_AccountUpgradeMenuWidget
// 0x0004 (0x0004 - 0x0000)
struct AccountUpgradeMenuWidget_C_ExecuteUbergraph_AccountUpgradeMenuWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountUpgradeMenuWidget_C_ExecuteUbergraph_AccountUpgradeMenuWidget) == 0x000004, "Wrong alignment on AccountUpgradeMenuWidget_C_ExecuteUbergraph_AccountUpgradeMenuWidget");
static_assert(sizeof(AccountUpgradeMenuWidget_C_ExecuteUbergraph_AccountUpgradeMenuWidget) == 0x000004, "Wrong size on AccountUpgradeMenuWidget_C_ExecuteUbergraph_AccountUpgradeMenuWidget");
static_assert(offsetof(AccountUpgradeMenuWidget_C_ExecuteUbergraph_AccountUpgradeMenuWidget, EntryPoint) == 0x000000, "Member 'AccountUpgradeMenuWidget_C_ExecuteUbergraph_AccountUpgradeMenuWidget::EntryPoint' has a wrong offset!");

// Function AccountUpgradeMenuWidget.AccountUpgradeMenuWidget_C.SetSoloHovered
// 0x0001 (0x0001 - 0x0000)
struct AccountUpgradeMenuWidget_C_SetSoloHovered final
{
public:
	bool                                          bHovered;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AccountUpgradeMenuWidget_C_SetSoloHovered) == 0x000001, "Wrong alignment on AccountUpgradeMenuWidget_C_SetSoloHovered");
static_assert(sizeof(AccountUpgradeMenuWidget_C_SetSoloHovered) == 0x000001, "Wrong size on AccountUpgradeMenuWidget_C_SetSoloHovered");
static_assert(offsetof(AccountUpgradeMenuWidget_C_SetSoloHovered, bHovered) == 0x000000, "Member 'AccountUpgradeMenuWidget_C_SetSoloHovered::bHovered' has a wrong offset!");

// Function AccountUpgradeMenuWidget.AccountUpgradeMenuWidget_C.SetCoopHovered
// 0x0001 (0x0001 - 0x0000)
struct AccountUpgradeMenuWidget_C_SetCoopHovered final
{
public:
	bool                                          bHovered;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AccountUpgradeMenuWidget_C_SetCoopHovered) == 0x000001, "Wrong alignment on AccountUpgradeMenuWidget_C_SetCoopHovered");
static_assert(sizeof(AccountUpgradeMenuWidget_C_SetCoopHovered) == 0x000001, "Wrong size on AccountUpgradeMenuWidget_C_SetCoopHovered");
static_assert(offsetof(AccountUpgradeMenuWidget_C_SetCoopHovered, bHovered) == 0x000000, "Member 'AccountUpgradeMenuWidget_C_SetCoopHovered::bHovered' has a wrong offset!");

// Function AccountUpgradeMenuWidget.AccountUpgradeMenuWidget_C.UpdateDisplay
// 0x0008 (0x0008 - 0x0000)
struct AccountUpgradeMenuWidget_C_UpdateDisplay final
{
public:
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountUpgradeMenuWidget_C_UpdateDisplay) == 0x000004, "Wrong alignment on AccountUpgradeMenuWidget_C_UpdateDisplay");
static_assert(sizeof(AccountUpgradeMenuWidget_C_UpdateDisplay) == 0x000008, "Wrong size on AccountUpgradeMenuWidget_C_UpdateDisplay");
static_assert(offsetof(AccountUpgradeMenuWidget_C_UpdateDisplay, CallFunc_SelectFloat_ReturnValue) == 0x000000, "Member 'AccountUpgradeMenuWidget_C_UpdateDisplay::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_UpdateDisplay, CallFunc_SelectFloat_ReturnValue_1) == 0x000004, "Member 'AccountUpgradeMenuWidget_C_UpdateDisplay::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");

// Function AccountUpgradeMenuWidget.AccountUpgradeMenuWidget_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct AccountUpgradeMenuWidget_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(AccountUpgradeMenuWidget_C_OnFocusReceived) == 0x000008, "Wrong alignment on AccountUpgradeMenuWidget_C_OnFocusReceived");
static_assert(sizeof(AccountUpgradeMenuWidget_C_OnFocusReceived) == 0x0001B0, "Wrong size on AccountUpgradeMenuWidget_C_OnFocusReceived");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'AccountUpgradeMenuWidget_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'AccountUpgradeMenuWidget_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'AccountUpgradeMenuWidget_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'AccountUpgradeMenuWidget_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function AccountUpgradeMenuWidget.AccountUpgradeMenuWidget_C.OnMouseButtonDown
// 0x03B0 (0x03B0 - 0x0000)
struct AccountUpgradeMenuWidget_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0168(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0180(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0240(0x00B8)()
	struct FEventReply                            K2Node_Select_Default;                             // 0x02F8(0x00B8)()
};
static_assert(alignof(AccountUpgradeMenuWidget_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on AccountUpgradeMenuWidget_C_OnMouseButtonDown");
static_assert(sizeof(AccountUpgradeMenuWidget_C_OnMouseButtonDown) == 0x0003B0, "Wrong size on AccountUpgradeMenuWidget_C_OnMouseButtonDown");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'AccountUpgradeMenuWidget_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'AccountUpgradeMenuWidget_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'AccountUpgradeMenuWidget_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnMouseButtonDown, Temp_bool_Variable) == 0x000160, "Member 'AccountUpgradeMenuWidget_C_OnMouseButtonDown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000168, "Member 'AccountUpgradeMenuWidget_C_OnMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000180, "Member 'AccountUpgradeMenuWidget_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000238, "Member 'AccountUpgradeMenuWidget_C_OnMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000240, "Member 'AccountUpgradeMenuWidget_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountUpgradeMenuWidget_C_OnMouseButtonDown, K2Node_Select_Default) == 0x0002F8, "Member 'AccountUpgradeMenuWidget_C_OnMouseButtonDown::K2Node_Select_Default' has a wrong offset!");

}

