#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnalogOperatableTriggerablesStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct AnalogOperatableTriggerablesStruct.AnalogOperatableTriggerablesStruct
// 0x0010 (0x0010 - 0x0000)
struct FAnalogOperatableTriggerablesStruct final
{
public:
	class ARBTriggerable*                         RBTriggerable_2_B32157E24F755840893559A583D2B7A2;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurnOn_7_F6EE68124EDCD0BB1C897087B8FF01BE;         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActivateAt_11_3187D0584BBE4BDDECCF6B9F0FC2035D;    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FAnalogOperatableTriggerablesStruct) == 0x000008, "Wrong alignment on FAnalogOperatableTriggerablesStruct");
static_assert(sizeof(FAnalogOperatableTriggerablesStruct) == 0x000010, "Wrong size on FAnalogOperatableTriggerablesStruct");
static_assert(offsetof(FAnalogOperatableTriggerablesStruct, RBTriggerable_2_B32157E24F755840893559A583D2B7A2) == 0x000000, "Member 'FAnalogOperatableTriggerablesStruct::RBTriggerable_2_B32157E24F755840893559A583D2B7A2' has a wrong offset!");
static_assert(offsetof(FAnalogOperatableTriggerablesStruct, TurnOn_7_F6EE68124EDCD0BB1C897087B8FF01BE) == 0x000008, "Member 'FAnalogOperatableTriggerablesStruct::TurnOn_7_F6EE68124EDCD0BB1C897087B8FF01BE' has a wrong offset!");
static_assert(offsetof(FAnalogOperatableTriggerablesStruct, ActivateAt_11_3187D0584BBE4BDDECCF6B9F0FC2035D) == 0x00000C, "Member 'FAnalogOperatableTriggerablesStruct::ActivateAt_11_3187D0584BBE4BDDECCF6B9F0FC2035D' has a wrong offset!");

}

