#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvellanosMinus01_BP

#include "Basic.hpp"

#include "EAvellanosPointing_structs.hpp"


namespace SDK::Params
{

// Function Avellanos-01_BP.Avellanos-01_BP_C.SetPointingDirection
// 0x0002 (0x0002 - 0x0000)
struct AvellanosMinus01_BP_C_SetPointingDirection final
{
public:
	EAvellanosPointing                            AvellanosPointing_0;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AvellanosMinus01_BP_C_SetPointingDirection) == 0x000001, "Wrong alignment on AvellanosMinus01_BP_C_SetPointingDirection");
static_assert(sizeof(AvellanosMinus01_BP_C_SetPointingDirection) == 0x000002, "Wrong size on AvellanosMinus01_BP_C_SetPointingDirection");
static_assert(offsetof(AvellanosMinus01_BP_C_SetPointingDirection, AvellanosPointing_0) == 0x000000, "Member 'AvellanosMinus01_BP_C_SetPointingDirection::AvellanosPointing_0' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_BP_C_SetPointingDirection, CallFunc_HasAuthority_ReturnValue) == 0x000001, "Member 'AvellanosMinus01_BP_C_SetPointingDirection::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function Avellanos-01_BP.Avellanos-01_BP_C.OnRep_AvellanosPointing
// 0x0020 (0x0020 - 0x0000)
struct AvellanosMinus01_BP_C_OnRep_AvellanosPointing final
{
public:
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAvellanosMinus01_ABP_C*                K2Node_DynamicCast_AsAvellanos_01_ABP;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AvellanosMinus01_BP_C_OnRep_AvellanosPointing) == 0x000008, "Wrong alignment on AvellanosMinus01_BP_C_OnRep_AvellanosPointing");
static_assert(sizeof(AvellanosMinus01_BP_C_OnRep_AvellanosPointing) == 0x000020, "Wrong size on AvellanosMinus01_BP_C_OnRep_AvellanosPointing");
static_assert(offsetof(AvellanosMinus01_BP_C_OnRep_AvellanosPointing, CallFunc_GetValidValue_ReturnValue) == 0x000000, "Member 'AvellanosMinus01_BP_C_OnRep_AvellanosPointing::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_BP_C_OnRep_AvellanosPointing, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'AvellanosMinus01_BP_C_OnRep_AvellanosPointing::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_BP_C_OnRep_AvellanosPointing, K2Node_DynamicCast_AsAvellanos_01_ABP) == 0x000010, "Member 'AvellanosMinus01_BP_C_OnRep_AvellanosPointing::K2Node_DynamicCast_AsAvellanos_01_ABP' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_BP_C_OnRep_AvellanosPointing, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AvellanosMinus01_BP_C_OnRep_AvellanosPointing::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

