#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvellanosMinus01_ABP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EAvellanosPointing_structs.hpp"


namespace SDK::Params
{

// Function Avellanos-01_ABP.Avellanos-01_ABP_C.ExecuteUbergraph_Avellanos-01_ABP
// 0x001C (0x001C - 0x0000)
struct AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP) == 0x000004, "Wrong alignment on AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP");
static_assert(sizeof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP) == 0x00001C, "Wrong size on AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP");
static_assert(offsetof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP, EntryPoint) == 0x000000, "Member 'AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP::EntryPoint' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000009, "Member 'AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000B, "Member 'AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x00000C, "Member 'AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP, CallFunc_Less_FloatFloat_ReturnValue) == 0x000010, "Member 'AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000011, "Member 'AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x000014, "Member 'AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000018, "Member 'AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000019, "Member 'AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP, CallFunc_BooleanAND_ReturnValue_1) == 0x00001A, "Member 'AvellanosMinus01_ABP_C_ExecuteUbergraph_AvellanosMinus01_ABP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function Avellanos-01_ABP.Avellanos-01_ABP_C.SetAvellanosPointing
// 0x0001 (0x0001 - 0x0000)
struct AvellanosMinus01_ABP_C_SetAvellanosPointing final
{
public:
	EAvellanosPointing                            AvellanosPointing_0;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AvellanosMinus01_ABP_C_SetAvellanosPointing) == 0x000001, "Wrong alignment on AvellanosMinus01_ABP_C_SetAvellanosPointing");
static_assert(sizeof(AvellanosMinus01_ABP_C_SetAvellanosPointing) == 0x000001, "Wrong size on AvellanosMinus01_ABP_C_SetAvellanosPointing");
static_assert(offsetof(AvellanosMinus01_ABP_C_SetAvellanosPointing, AvellanosPointing_0) == 0x000000, "Member 'AvellanosMinus01_ABP_C_SetAvellanosPointing::AvellanosPointing_0' has a wrong offset!");

// Function Avellanos-01_ABP.Avellanos-01_ABP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AvellanosMinus01_ABP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AvellanosMinus01_ABP_C_AnimGraph) == 0x000008, "Wrong alignment on AvellanosMinus01_ABP_C_AnimGraph");
static_assert(sizeof(AvellanosMinus01_ABP_C_AnimGraph) == 0x000010, "Wrong size on AvellanosMinus01_ABP_C_AnimGraph");
static_assert(offsetof(AvellanosMinus01_ABP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'AvellanosMinus01_ABP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

