#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AvellanosMinus01_ABP

#include "Basic.hpp"

#include "EAvellanosPointing_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Avellanos-01_ABP.Avellanos-01_ABP_C
// 0x0630 (0x08F0 - 0x02C0)
class UAvellanosMinus01_ABP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x02C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x02F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0318(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0340(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0368(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0390(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0410(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0440(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x04C0(0x0080)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0540(0x00B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x05F8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0678(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x06A8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0728(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0758(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x07D8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0808(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x08B8(0x0030)()
	EAvellanosPointing                            AvellanosPointing;                                 // 0x08E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAvellanosPointing                            PreviousAvellanosPointing;                         // 0x08E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AvellanosMinus01_ABP_AnimGraphNode_TransitionResult_22AC208E408EBF656C8A9D9A099C5BC7();
	void ExecuteUbergraph_AvellanosMinus01_ABP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AvellanosMinus01_ABP_AnimGraphNode_TransitionResult_5745248F4D0C6AB3A43FF592581F1B56();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AvellanosMinus01_ABP_AnimGraphNode_TransitionResult_B3D859B24551D34AA4521EA92E7D8726();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AvellanosMinus01_ABP_AnimGraphNode_TransitionResult_8211F0FC4E1B13348F65A384249886A5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AvellanosMinus01_ABP_AnimGraphNode_TransitionResult_C6BE90A84210F83F60447EAAF137BDD3();
	void SetAvellanosPointing(EAvellanosPointing AvellanosPointing_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Avellanos-01_ABP_C">();
	}
	static class UAvellanosMinus01_ABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAvellanosMinus01_ABP_C>();
	}
};
static_assert(alignof(UAvellanosMinus01_ABP_C) == 0x000010, "Wrong alignment on UAvellanosMinus01_ABP_C");
static_assert(sizeof(UAvellanosMinus01_ABP_C) == 0x0008F0, "Wrong size on UAvellanosMinus01_ABP_C");
static_assert(offsetof(UAvellanosMinus01_ABP_C, UberGraphFrame) == 0x0002C0, "Member 'UAvellanosMinus01_ABP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_TransitionResult_4) == 0x0002C8, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_TransitionResult_3) == 0x0002F0, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_TransitionResult_2) == 0x000318, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_TransitionResult_1) == 0x000340, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_TransitionResult) == 0x000368, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_SequencePlayer_5) == 0x000390, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_StateResult_3) == 0x000410, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_SequencePlayer_4) == 0x000440, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_SequencePlayer_3) == 0x0004C0, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_BlendListByEnum) == 0x000540, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_SequencePlayer_2) == 0x0005F8, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_StateResult_2) == 0x000678, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_SequencePlayer_1) == 0x0006A8, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_StateResult_1) == 0x000728, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_SequencePlayer) == 0x000758, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_StateResult) == 0x0007D8, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_StateMachine) == 0x000808, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AnimGraphNode_Root) == 0x0008B8, "Member 'UAvellanosMinus01_ABP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, AvellanosPointing) == 0x0008E8, "Member 'UAvellanosMinus01_ABP_C::AvellanosPointing' has a wrong offset!");
static_assert(offsetof(UAvellanosMinus01_ABP_C, PreviousAvellanosPointing) == 0x0008E9, "Member 'UAvellanosMinus01_ABP_C::PreviousAvellanosPointing' has a wrong offset!");

}

