#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackgroundDoor_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BackgroundDoor_BP.BackgroundDoor_BP_C.MoveDoorInternal
// 0x0001 (0x0001 - 0x0000)
struct BackgroundDoor_BP_C_MoveDoorInternal final
{
public:
	bool                                          bClose;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BackgroundDoor_BP_C_MoveDoorInternal) == 0x000001, "Wrong alignment on BackgroundDoor_BP_C_MoveDoorInternal");
static_assert(sizeof(BackgroundDoor_BP_C_MoveDoorInternal) == 0x000001, "Wrong size on BackgroundDoor_BP_C_MoveDoorInternal");
static_assert(offsetof(BackgroundDoor_BP_C_MoveDoorInternal, bClose) == 0x000000, "Member 'BackgroundDoor_BP_C_MoveDoorInternal::bClose' has a wrong offset!");

// Function BackgroundDoor_BP.BackgroundDoor_BP_C.ExecuteUbergraph_BackgroundDoor_BP
// 0x02C8 (0x02C8 - 0x0000)
struct BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x002C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0064(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0074(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0084(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0094(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x011C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_1;           // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bClose;                         // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventOnActor_ReturnValue_2;           // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_3;           // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x01B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x0240(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP) == 0x000004, "Wrong alignment on BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP");
static_assert(sizeof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP) == 0x0002C8, "Wrong size on BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, EntryPoint) == 0x000000, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000010, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_MakeVector_ReturnValue) == 0x000014, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_MakeVector_ReturnValue_1) == 0x000020, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, Temp_delegate_Variable) == 0x00002C, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00003C, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000040, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000044, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000048, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_MakeVector_ReturnValue_2) == 0x00004C, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_MakeVector_ReturnValue_3) == 0x000058, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, Temp_delegate_Variable_1) == 0x000064, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, Temp_delegate_Variable_2) == 0x000074, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, Temp_delegate_Variable_3) == 0x000084, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000094, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x00011C, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_PostEventOnActor_ReturnValue) == 0x0001A4, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_PostEventOnActor_ReturnValue_1) == 0x0001A8, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_PostEventOnActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, K2Node_CustomEvent_bClose) == 0x0001AC, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::K2Node_CustomEvent_bClose' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_PostEventOnActor_ReturnValue_2) == 0x0001B0, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_PostEventOnActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_PostEventOnActor_ReturnValue_3) == 0x0001B4, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_PostEventOnActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x0001B8, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP, CallFunc_K2_SetRelativeLocation_SweepHitResult_3) == 0x000240, "Member 'BackgroundDoor_BP_C_ExecuteUbergraph_BackgroundDoor_BP::CallFunc_K2_SetRelativeLocation_SweepHitResult_3' has a wrong offset!");

}

