#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackgroundDoor_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BackgroundDoor_BP.BackgroundDoor_BP_C
// 0x0078 (0x02C0 - 0x0248)
class ABackgroundDoor_BP_C final : public ARBBackgroundDoor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBSoundConnectorComponent*             RBSoundConnector;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      RBSound;                                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SasDoorMinus01;                                    // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SasDoorMinus02b;                                   // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SasDoorMinus01a;                                   // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RollingDoorFrameMinus01;                           // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SasDoorMinus02;                                    // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         EntryDoorTimeline_DoorB_CFA0FEFD49A79C094F88C983D1EA8065; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EntryDoorTimeline_DoorOpenning_CFA0FEFD49A79C094F88C983D1EA8065; // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            EntryDoorTimeline__Direction_CFA0FEFD49A79C094F88C983D1EA8065; // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     EntryDoorTimeline;                                 // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          InsideStart;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          InsideStop;                                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          DoorOpening;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          DoorClosing;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EntryDoorTimeline__FinishedFunc();
	void EntryDoorTimeline__UpdateFunc();
	void EntryDoorTimeline__CollisionSwap__EventFunc();
	void MoveDoorInternal(bool bClose);
	void Event_OnResetStage();
	void Event_OpenDoor();
	void Event_CloseDoor();
	void ExecuteUbergraph_BackgroundDoor_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BackgroundDoor_BP_C">();
	}
	static class ABackgroundDoor_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABackgroundDoor_BP_C>();
	}
};
static_assert(alignof(ABackgroundDoor_BP_C) == 0x000008, "Wrong alignment on ABackgroundDoor_BP_C");
static_assert(sizeof(ABackgroundDoor_BP_C) == 0x0002C0, "Wrong size on ABackgroundDoor_BP_C");
static_assert(offsetof(ABackgroundDoor_BP_C, UberGraphFrame) == 0x000248, "Member 'ABackgroundDoor_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, RBSoundConnector) == 0x000250, "Member 'ABackgroundDoor_BP_C::RBSoundConnector' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, RBSound) == 0x000258, "Member 'ABackgroundDoor_BP_C::RBSound' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, SasDoorMinus01) == 0x000260, "Member 'ABackgroundDoor_BP_C::SasDoorMinus01' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, SasDoorMinus02b) == 0x000268, "Member 'ABackgroundDoor_BP_C::SasDoorMinus02b' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, SasDoorMinus01a) == 0x000270, "Member 'ABackgroundDoor_BP_C::SasDoorMinus01a' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, RollingDoorFrameMinus01) == 0x000278, "Member 'ABackgroundDoor_BP_C::RollingDoorFrameMinus01' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, SasDoorMinus02) == 0x000280, "Member 'ABackgroundDoor_BP_C::SasDoorMinus02' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, EntryDoorTimeline_DoorB_CFA0FEFD49A79C094F88C983D1EA8065) == 0x000288, "Member 'ABackgroundDoor_BP_C::EntryDoorTimeline_DoorB_CFA0FEFD49A79C094F88C983D1EA8065' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, EntryDoorTimeline_DoorOpenning_CFA0FEFD49A79C094F88C983D1EA8065) == 0x00028C, "Member 'ABackgroundDoor_BP_C::EntryDoorTimeline_DoorOpenning_CFA0FEFD49A79C094F88C983D1EA8065' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, EntryDoorTimeline__Direction_CFA0FEFD49A79C094F88C983D1EA8065) == 0x000290, "Member 'ABackgroundDoor_BP_C::EntryDoorTimeline__Direction_CFA0FEFD49A79C094F88C983D1EA8065' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, EntryDoorTimeline) == 0x000298, "Member 'ABackgroundDoor_BP_C::EntryDoorTimeline' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, InsideStart) == 0x0002A0, "Member 'ABackgroundDoor_BP_C::InsideStart' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, InsideStop) == 0x0002A8, "Member 'ABackgroundDoor_BP_C::InsideStop' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, DoorOpening) == 0x0002B0, "Member 'ABackgroundDoor_BP_C::DoorOpening' has a wrong offset!");
static_assert(offsetof(ABackgroundDoor_BP_C, DoorClosing) == 0x0002B8, "Member 'ABackgroundDoor_BP_C::DoorClosing' has a wrong offset!");

}

