#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackgroundCharacter_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function BackgroundCharacter_BP.BackgroundCharacter_BP_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct BackgroundCharacter_BP_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BackgroundCharacter_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on BackgroundCharacter_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(BackgroundCharacter_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on BackgroundCharacter_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(BackgroundCharacter_BP_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'BackgroundCharacter_BP_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

// Function BackgroundCharacter_BP.BackgroundCharacter_BP_C.InitializeParameters
// 0x0048 (0x0048 - 0x0000)
struct BackgroundCharacter_BP_C_InitializeParameters final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UActorComponent*>                CallFunc_GetComponentByClass_outComponents;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BackgroundCharacter_BP_C_InitializeParameters) == 0x000008, "Wrong alignment on BackgroundCharacter_BP_C_InitializeParameters");
static_assert(sizeof(BackgroundCharacter_BP_C_InitializeParameters) == 0x000048, "Wrong size on BackgroundCharacter_BP_C_InitializeParameters");
static_assert(offsetof(BackgroundCharacter_BP_C_InitializeParameters, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BackgroundCharacter_BP_C_InitializeParameters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_InitializeParameters, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BackgroundCharacter_BP_C_InitializeParameters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_InitializeParameters, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BackgroundCharacter_BP_C_InitializeParameters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_InitializeParameters, CallFunc_GetComponentByClass_outComponents) == 0x000010, "Member 'BackgroundCharacter_BP_C_InitializeParameters::CallFunc_GetComponentByClass_outComponents' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_InitializeParameters, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BackgroundCharacter_BP_C_InitializeParameters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_InitializeParameters, CallFunc_Array_Get_Item) == 0x000028, "Member 'BackgroundCharacter_BP_C_InitializeParameters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_InitializeParameters, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BackgroundCharacter_BP_C_InitializeParameters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_InitializeParameters, K2Node_DynamicCast_AsPrimitive_Component) == 0x000038, "Member 'BackgroundCharacter_BP_C_InitializeParameters::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_InitializeParameters, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BackgroundCharacter_BP_C_InitializeParameters::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BackgroundCharacter_BP.BackgroundCharacter_BP_C.SetPrecomputedVisSettings
// 0x0038 (0x0038 - 0x0000)
struct BackgroundCharacter_BP_C_SetPrecomputedVisSettings final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BackgroundCharacter_BP_C_SetPrecomputedVisSettings) == 0x000008, "Wrong alignment on BackgroundCharacter_BP_C_SetPrecomputedVisSettings");
static_assert(sizeof(BackgroundCharacter_BP_C_SetPrecomputedVisSettings) == 0x000038, "Wrong size on BackgroundCharacter_BP_C_SetPrecomputedVisSettings");
static_assert(offsetof(BackgroundCharacter_BP_C_SetPrecomputedVisSettings, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BackgroundCharacter_BP_C_SetPrecomputedVisSettings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_SetPrecomputedVisSettings, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BackgroundCharacter_BP_C_SetPrecomputedVisSettings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_SetPrecomputedVisSettings, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BackgroundCharacter_BP_C_SetPrecomputedVisSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_SetPrecomputedVisSettings, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'BackgroundCharacter_BP_C_SetPrecomputedVisSettings::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_SetPrecomputedVisSettings, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BackgroundCharacter_BP_C_SetPrecomputedVisSettings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_SetPrecomputedVisSettings, CallFunc_Array_Get_Item) == 0x000028, "Member 'BackgroundCharacter_BP_C_SetPrecomputedVisSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_SetPrecomputedVisSettings, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BackgroundCharacter_BP_C_SetPrecomputedVisSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BackgroundCharacter_BP.BackgroundCharacter_BP_C.GetFacePoseAsset
// 0x0008 (0x0008 - 0x0000)
struct BackgroundCharacter_BP_C_GetFacePoseAsset final
{
public:
	class UPoseAsset*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BackgroundCharacter_BP_C_GetFacePoseAsset) == 0x000008, "Wrong alignment on BackgroundCharacter_BP_C_GetFacePoseAsset");
static_assert(sizeof(BackgroundCharacter_BP_C_GetFacePoseAsset) == 0x000008, "Wrong size on BackgroundCharacter_BP_C_GetFacePoseAsset");
static_assert(offsetof(BackgroundCharacter_BP_C_GetFacePoseAsset, ReturnValue) == 0x000000, "Member 'BackgroundCharacter_BP_C_GetFacePoseAsset::ReturnValue' has a wrong offset!");

// Function BackgroundCharacter_BP.BackgroundCharacter_BP_C.BuildAppearance
// 0x0018 (0x0018 - 0x0000)
struct BackgroundCharacter_BP_C_BuildAppearance final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LevelRandomIntRange_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BackgroundCharacter_BP_C_BuildAppearance) == 0x000008, "Wrong alignment on BackgroundCharacter_BP_C_BuildAppearance");
static_assert(sizeof(BackgroundCharacter_BP_C_BuildAppearance) == 0x000018, "Wrong size on BackgroundCharacter_BP_C_BuildAppearance");
static_assert(offsetof(BackgroundCharacter_BP_C_BuildAppearance, Temp_bool_Variable) == 0x000000, "Member 'BackgroundCharacter_BP_C_BuildAppearance::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_BuildAppearance, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BackgroundCharacter_BP_C_BuildAppearance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_BuildAppearance, K2Node_Select_Default) == 0x000008, "Member 'BackgroundCharacter_BP_C_BuildAppearance::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_BuildAppearance, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'BackgroundCharacter_BP_C_BuildAppearance::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_BuildAppearance, CallFunc_LevelRandomIntRange_ReturnValue) == 0x000014, "Member 'BackgroundCharacter_BP_C_BuildAppearance::CallFunc_LevelRandomIntRange_ReturnValue' has a wrong offset!");

// Function BackgroundCharacter_BP.BackgroundCharacter_BP_C.UserConstructionScript
// 0x000C (0x000C - 0x0000)
struct BackgroundCharacter_BP_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BackgroundCharacter_BP_C_UserConstructionScript) == 0x000004, "Wrong alignment on BackgroundCharacter_BP_C_UserConstructionScript");
static_assert(sizeof(BackgroundCharacter_BP_C_UserConstructionScript) == 0x00000C, "Wrong size on BackgroundCharacter_BP_C_UserConstructionScript");
static_assert(offsetof(BackgroundCharacter_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'BackgroundCharacter_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_UserConstructionScript, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000004, "Member 'BackgroundCharacter_BP_C_UserConstructionScript::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackgroundCharacter_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue_1) == 0x000008, "Member 'BackgroundCharacter_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function BackgroundCharacter_BP.BackgroundCharacter_BP_C.ExecuteUbergraph_BackgroundCharacter_BP
// 0x0004 (0x0004 - 0x0000)
struct BackgroundCharacter_BP_C_ExecuteUbergraph_BackgroundCharacter_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BackgroundCharacter_BP_C_ExecuteUbergraph_BackgroundCharacter_BP) == 0x000004, "Wrong alignment on BackgroundCharacter_BP_C_ExecuteUbergraph_BackgroundCharacter_BP");
static_assert(sizeof(BackgroundCharacter_BP_C_ExecuteUbergraph_BackgroundCharacter_BP) == 0x000004, "Wrong size on BackgroundCharacter_BP_C_ExecuteUbergraph_BackgroundCharacter_BP");
static_assert(offsetof(BackgroundCharacter_BP_C_ExecuteUbergraph_BackgroundCharacter_BP, EntryPoint) == 0x000000, "Member 'BackgroundCharacter_BP_C_ExecuteUbergraph_BackgroundCharacter_BP::EntryPoint' has a wrong offset!");

}

