#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BadgeSashEntry

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BadgeSashEntry.BadgeSashEntry_C
// 0x01A8 (0x0408 - 0x0260)
class UBadgeSashEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AcquiredAnimation;                                 // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BadgeIcon;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_15;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Counter;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CounterTextWidget;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedBottomLeftBracket_1;                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedBottomRightBracket_1;                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedTopLeftBracket_1;                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedTopRightBracket_1;                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InteractionButton;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewNotification;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SelectionBorderPanel;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             BadgeIconTexture;                                  // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UnlockedCount;                                     // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLoading;                                          // 0x02D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsGamepad;                                        // 0x02D5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHovered;                                          // 0x02D6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFocused;                                          // 0x02D7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSelected;                                         // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bClaimable;                                        // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBPlayerBadgeRow                      BadgeSettings;                                     // 0x02E0(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnHovered;                                         // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUnhovered;                                       // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSlateColor                            HoverBracketsTint;                                 // 0x03A8(0x0028)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSlateColor                            SelectedBracketsTint;                              // 0x03E0(0x0028)(Edit, BlueprintVisible)

public:
	void SetClaimable(bool bInClaimable);
	void SetSelected(bool bInSelected);
	void PlayAcquiredAnimation();
	void IsConsideredHovered(bool* bConsideredHovered);
	void SetFocused(bool bInFocused);
	void SetHovered(bool bInHovered);
	void SetupEmpty();
	void Refresh();
	void OnLoaded_E635967C4C8D98AF198D06928C9FF87D(class UObject* Loaded);
	void PreConstruct(bool IsDesignTime);
	void Setup(int32 UnlockedCount_0, const struct FRBPlayerBadgeRow& BadgeSettings_0, bool bInClaimable);
	void BndEvt__BadgeSashEntry_Button_0_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__BadgeSashEntry_InteractionButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void Destruct();
	void OnMenuInputSourceChanged();
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__BadgeSashEntry_InteractionButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_BadgeSashEntry(int32 EntryPoint);
	void OnClicked__DelegateSignature(class UBadgeSashEntry_C* badgeEntry);
	void OnUnhovered__DelegateSignature(class UBadgeSashEntry_C* badgeEntry);
	void OnHovered__DelegateSignature(class UBadgeSashEntry_C* badgeEntry);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BadgeSashEntry_C">();
	}
	static class UBadgeSashEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBadgeSashEntry_C>();
	}
};
static_assert(alignof(UBadgeSashEntry_C) == 0x000008, "Wrong alignment on UBadgeSashEntry_C");
static_assert(sizeof(UBadgeSashEntry_C) == 0x000408, "Wrong size on UBadgeSashEntry_C");
static_assert(offsetof(UBadgeSashEntry_C, UberGraphFrame) == 0x000260, "Member 'UBadgeSashEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, AcquiredAnimation) == 0x000268, "Member 'UBadgeSashEntry_C::AcquiredAnimation' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, BadgeIcon) == 0x000270, "Member 'UBadgeSashEntry_C::BadgeIcon' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, CanvasPanel_15) == 0x000278, "Member 'UBadgeSashEntry_C::CanvasPanel_15' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, Counter) == 0x000280, "Member 'UBadgeSashEntry_C::Counter' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, CounterTextWidget) == 0x000288, "Member 'UBadgeSashEntry_C::CounterTextWidget' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, FocussedBottomLeftBracket_1) == 0x000290, "Member 'UBadgeSashEntry_C::FocussedBottomLeftBracket_1' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, FocussedBottomRightBracket_1) == 0x000298, "Member 'UBadgeSashEntry_C::FocussedBottomRightBracket_1' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, FocussedTopLeftBracket_1) == 0x0002A0, "Member 'UBadgeSashEntry_C::FocussedTopLeftBracket_1' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, FocussedTopRightBracket_1) == 0x0002A8, "Member 'UBadgeSashEntry_C::FocussedTopRightBracket_1' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, InteractionButton) == 0x0002B0, "Member 'UBadgeSashEntry_C::InteractionButton' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, NewNotification) == 0x0002B8, "Member 'UBadgeSashEntry_C::NewNotification' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, SelectionBorderPanel) == 0x0002C0, "Member 'UBadgeSashEntry_C::SelectionBorderPanel' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, BadgeIconTexture) == 0x0002C8, "Member 'UBadgeSashEntry_C::BadgeIconTexture' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, UnlockedCount) == 0x0002D0, "Member 'UBadgeSashEntry_C::UnlockedCount' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, bLoading) == 0x0002D4, "Member 'UBadgeSashEntry_C::bLoading' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, bIsGamepad) == 0x0002D5, "Member 'UBadgeSashEntry_C::bIsGamepad' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, bHovered) == 0x0002D6, "Member 'UBadgeSashEntry_C::bHovered' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, bFocused) == 0x0002D7, "Member 'UBadgeSashEntry_C::bFocused' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, bSelected) == 0x0002D8, "Member 'UBadgeSashEntry_C::bSelected' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, bClaimable) == 0x0002D9, "Member 'UBadgeSashEntry_C::bClaimable' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, BadgeSettings) == 0x0002E0, "Member 'UBadgeSashEntry_C::BadgeSettings' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, OnHovered) == 0x000388, "Member 'UBadgeSashEntry_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, OnUnhovered) == 0x000398, "Member 'UBadgeSashEntry_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, HoverBracketsTint) == 0x0003A8, "Member 'UBadgeSashEntry_C::HoverBracketsTint' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, OnClicked) == 0x0003D0, "Member 'UBadgeSashEntry_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UBadgeSashEntry_C, SelectedBracketsTint) == 0x0003E0, "Member 'UBadgeSashEntry_C::SelectedBracketsTint' has a wrong offset!");

}

