#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BadgeProgressionHudWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BadgeProgressionHudWidget.BadgeProgressionHudWidget_C
// 0x0040 (0x0328 - 0x02E8)
class UBadgeProgressionHudWidget_C final : public URBHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnimation;                                     // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnimation;                                     // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URichTextBlock*                         BadgeDescription;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BadgeIconImage;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BadgeName;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ARBPlayer*                              CurrentPlayer;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowing;                                          // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BadgeProgressionHudWidget(int32 EntryPoint);
	void Hide();
	void Show(const struct FRBBadgeHudProgressDisplayDetails& Details);
	void OnLoaded_297F3B8945FF1E7BC838EA8B27A8A839(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BadgeProgressionHudWidget_C">();
	}
	static class UBadgeProgressionHudWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBadgeProgressionHudWidget_C>();
	}
};
static_assert(alignof(UBadgeProgressionHudWidget_C) == 0x000008, "Wrong alignment on UBadgeProgressionHudWidget_C");
static_assert(sizeof(UBadgeProgressionHudWidget_C) == 0x000328, "Wrong size on UBadgeProgressionHudWidget_C");
static_assert(offsetof(UBadgeProgressionHudWidget_C, UberGraphFrame) == 0x0002E8, "Member 'UBadgeProgressionHudWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBadgeProgressionHudWidget_C, HideAnimation) == 0x0002F0, "Member 'UBadgeProgressionHudWidget_C::HideAnimation' has a wrong offset!");
static_assert(offsetof(UBadgeProgressionHudWidget_C, ShowAnimation) == 0x0002F8, "Member 'UBadgeProgressionHudWidget_C::ShowAnimation' has a wrong offset!");
static_assert(offsetof(UBadgeProgressionHudWidget_C, BadgeDescription) == 0x000300, "Member 'UBadgeProgressionHudWidget_C::BadgeDescription' has a wrong offset!");
static_assert(offsetof(UBadgeProgressionHudWidget_C, BadgeIconImage) == 0x000308, "Member 'UBadgeProgressionHudWidget_C::BadgeIconImage' has a wrong offset!");
static_assert(offsetof(UBadgeProgressionHudWidget_C, BadgeName) == 0x000310, "Member 'UBadgeProgressionHudWidget_C::BadgeName' has a wrong offset!");
static_assert(offsetof(UBadgeProgressionHudWidget_C, CurrentPlayer) == 0x000318, "Member 'UBadgeProgressionHudWidget_C::CurrentPlayer' has a wrong offset!");
static_assert(offsetof(UBadgeProgressionHudWidget_C, bShowing) == 0x000320, "Member 'UBadgeProgressionHudWidget_C::bShowing' has a wrong offset!");

}

