#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BarbWire_Parent

#include "Basic.hpp"

#include "MeshPopulateDirection_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ModuleMeshData_structs.hpp"


namespace SDK::Params
{

// Function BarbWire_Parent.BarbWire_Parent_C.UserConstructionScript
// 0x0108 (0x0108 - 0x0000)
struct BarbWire_Parent_C_UserConstructionScript final
{
public:
	float                                         SmallestMeshSize;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SmallestIndex;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshPopulateDirection                        Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshPopulateDirection                        Temp_byte_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshPopulateDirection                        Temp_byte_Variable_2;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModuleMeshData                        CallFunc_Array_Get_Item;                           // 0x0038(0x0020)(HasGetValueTypeHash)
	struct FModuleMeshData                        CallFunc_Array_Get_Item_1;                         // 0x0058(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateRow_LastLocation;                 // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_PopulateRow_StaticmeshComponents1;        // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_PopulateRow_LastAlphaMeshSize;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateRow_AlphaScale;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateRow_LastLocation_1;               // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_PopulateRow_StaticmeshComponents1_1;      // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_PopulateRow_LastAlphaMeshSize_1;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateRow_AlphaScale_1;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_PopulateStaticMesh_OutputPin;             // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BarbWire_Parent_C_UserConstructionScript) == 0x000008, "Wrong alignment on BarbWire_Parent_C_UserConstructionScript");
static_assert(sizeof(BarbWire_Parent_C_UserConstructionScript) == 0x000108, "Wrong size on BarbWire_Parent_C_UserConstructionScript");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, SmallestMeshSize) == 0x000000, "Member 'BarbWire_Parent_C_UserConstructionScript::SmallestMeshSize' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, SmallestIndex) == 0x000004, "Member 'BarbWire_Parent_C_UserConstructionScript::SmallestIndex' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, Temp_byte_Variable) == 0x000008, "Member 'BarbWire_Parent_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, Temp_float_Variable) == 0x00000C, "Member 'BarbWire_Parent_C_UserConstructionScript::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, Temp_byte_Variable_1) == 0x000010, "Member 'BarbWire_Parent_C_UserConstructionScript::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, Temp_float_Variable_1) == 0x000014, "Member 'BarbWire_Parent_C_UserConstructionScript::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BarbWire_Parent_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, Temp_float_Variable_2) == 0x00001C, "Member 'BarbWire_Parent_C_UserConstructionScript::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000020, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000024, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000028, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, K2Node_Select_Default) == 0x00002C, "Member 'BarbWire_Parent_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, Temp_byte_Variable_2) == 0x000030, "Member 'BarbWire_Parent_C_UserConstructionScript::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000038, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_Less_FloatFloat_ReturnValue) == 0x00007C, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'BarbWire_Parent_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000088, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_PopulateRow_LastLocation) == 0x00008C, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_PopulateRow_LastLocation' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_PopulateRow_StaticmeshComponents1) == 0x000098, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_PopulateRow_StaticmeshComponents1' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_PopulateRow_LastAlphaMeshSize) == 0x0000A8, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_PopulateRow_LastAlphaMeshSize' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_PopulateRow_AlphaScale) == 0x0000AC, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_PopulateRow_AlphaScale' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x0000B0, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x0000B4, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x0000B8, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, K2Node_Select_Default_1) == 0x0000BC, "Member 'BarbWire_Parent_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_PopulateRow_LastLocation_1) == 0x0000C0, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_PopulateRow_LastLocation_1' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_PopulateRow_StaticmeshComponents1_1) == 0x0000D0, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_PopulateRow_StaticmeshComponents1_1' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_PopulateRow_LastAlphaMeshSize_1) == 0x0000E0, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_PopulateRow_LastAlphaMeshSize_1' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_PopulateRow_AlphaScale_1) == 0x0000E4, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_PopulateRow_AlphaScale_1' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_BreakVector_X_2) == 0x0000E8, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_BreakVector_Y_2) == 0x0000EC, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_BreakVector_Z_2) == 0x0000F0, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, K2Node_Select_Default_2) == 0x0000F4, "Member 'BarbWire_Parent_C_UserConstructionScript::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000F8, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BarbWire_Parent_C_UserConstructionScript, CallFunc_PopulateStaticMesh_OutputPin) == 0x000100, "Member 'BarbWire_Parent_C_UserConstructionScript::CallFunc_PopulateStaticMesh_OutputPin' has a wrong offset!");

}

