#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BarbWire_Parent

#include "Basic.hpp"

#include "ModuleMeshData_structs.hpp"
#include "MeshPopulateDirection_structs.hpp"
#include "MeshPopulate_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BarbWire_Parent.BarbWire_Parent_C
// 0x0028 (0x03F8 - 0x03D0)
class ABarbWire_Parent_C : public AMeshPopulate_Parent_C
{
public:
	TArray<struct FModuleMeshData>                BarbwireMeshes;                                    // 0x03D0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FModuleMeshData>                PostMeshes;                                        // 0x03E0(0x0010)(Edit, BlueprintVisible)
	bool                                          UseLastPost;                                       // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EMeshPopulateDirection                        Direction;                                         // 0x03F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOverwriteMaterialOnBarbwire;                    // 0x03F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BarbWire_Parent_C">();
	}
	static class ABarbWire_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABarbWire_Parent_C>();
	}
};
static_assert(alignof(ABarbWire_Parent_C) == 0x000008, "Wrong alignment on ABarbWire_Parent_C");
static_assert(sizeof(ABarbWire_Parent_C) == 0x0003F8, "Wrong size on ABarbWire_Parent_C");
static_assert(offsetof(ABarbWire_Parent_C, BarbwireMeshes) == 0x0003D0, "Member 'ABarbWire_Parent_C::BarbwireMeshes' has a wrong offset!");
static_assert(offsetof(ABarbWire_Parent_C, PostMeshes) == 0x0003E0, "Member 'ABarbWire_Parent_C::PostMeshes' has a wrong offset!");
static_assert(offsetof(ABarbWire_Parent_C, UseLastPost) == 0x0003F0, "Member 'ABarbWire_Parent_C::UseLastPost' has a wrong offset!");
static_assert(offsetof(ABarbWire_Parent_C, Direction) == 0x0003F1, "Member 'ABarbWire_Parent_C::Direction' has a wrong offset!");
static_assert(offsetof(ABarbWire_Parent_C, UseOverwriteMaterialOnBarbwire) == 0x0003F2, "Member 'ABarbWire_Parent_C::UseOverwriteMaterialOnBarbwire' has a wrong offset!");

}

