#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Base_ConditionalContainer_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Base_ConditionalContainer_BP.Base_ConditionalContainer_BP_C
// 0x0040 (0x0378 - 0x0338)
class ABase_ConditionalContainer_BP_C : public ARBContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview;                           // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBActorPrevisComponent*                BottlePositionOverride;                            // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      AllItemsEditorSelectedPreview;                     // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    EditorIcon;                                        // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SpawnZoneVisualHelper01;                           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     SpawnLocation01;                                   // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            InteractionMeshCollision;                          // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Base_ConditionalContainer_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Base_ConditionalContainer_BP_C">();
	}
	static class ABase_ConditionalContainer_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABase_ConditionalContainer_BP_C>();
	}
};
static_assert(alignof(ABase_ConditionalContainer_BP_C) == 0x000008, "Wrong alignment on ABase_ConditionalContainer_BP_C");
static_assert(sizeof(ABase_ConditionalContainer_BP_C) == 0x000378, "Wrong size on ABase_ConditionalContainer_BP_C");
static_assert(offsetof(ABase_ConditionalContainer_BP_C, UberGraphFrame) == 0x000338, "Member 'ABase_ConditionalContainer_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABase_ConditionalContainer_BP_C, RBEditorSelectedPreview) == 0x000340, "Member 'ABase_ConditionalContainer_BP_C::RBEditorSelectedPreview' has a wrong offset!");
static_assert(offsetof(ABase_ConditionalContainer_BP_C, BottlePositionOverride) == 0x000348, "Member 'ABase_ConditionalContainer_BP_C::BottlePositionOverride' has a wrong offset!");
static_assert(offsetof(ABase_ConditionalContainer_BP_C, AllItemsEditorSelectedPreview) == 0x000350, "Member 'ABase_ConditionalContainer_BP_C::AllItemsEditorSelectedPreview' has a wrong offset!");
static_assert(offsetof(ABase_ConditionalContainer_BP_C, EditorIcon) == 0x000358, "Member 'ABase_ConditionalContainer_BP_C::EditorIcon' has a wrong offset!");
static_assert(offsetof(ABase_ConditionalContainer_BP_C, SpawnZoneVisualHelper01) == 0x000360, "Member 'ABase_ConditionalContainer_BP_C::SpawnZoneVisualHelper01' has a wrong offset!");
static_assert(offsetof(ABase_ConditionalContainer_BP_C, SpawnLocation01) == 0x000368, "Member 'ABase_ConditionalContainer_BP_C::SpawnLocation01' has a wrong offset!");
static_assert(offsetof(ABase_ConditionalContainer_BP_C, InteractionMeshCollision) == 0x000370, "Member 'ABase_ConditionalContainer_BP_C::InteractionMeshCollision' has a wrong offset!");

}

