#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Base_OpenSpaceContainer_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Base_OpenSpaceContainer_BP.Base_OpenSpaceContainer_BP_C
// 0x0088 (0x03C0 - 0x0338)
#pragma pack(push, 0x1)
class alignas(0x10) ABase_OpenSpaceContainer_BP_C : public ARBContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBActorPrevisComponent*                BottlePositionOverride;                            // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      AllItemsEditorSelectedPreview;                     // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview;                           // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SpawnZoneVisualHelper;                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     SpawnLocation;                                     // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    EditorIcon;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            InteractionStaticMesh;                             // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BaseTransform;                                     // 0x0380(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NeedAllItemsPreview;                               // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool FixUp();
	void UserConstructionScript();
	void OnEditorPostLoad();
	void OnPostActorsPasted(const TArray<class AActor*>& PastedActors);
	void PostAddedToLevel();
	void PostDuplicated(class AActor* DuplicationParent);
	void PostEditChange(const class FName& PropertyName);
	void PostEditMove(bool bFinished);
	void TickSelected();
	void ExecuteUbergraph_Base_OpenSpaceContainer_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Base_OpenSpaceContainer_BP_C">();
	}
	static class ABase_OpenSpaceContainer_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABase_OpenSpaceContainer_BP_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABase_OpenSpaceContainer_BP_C) == 0x000010, "Wrong alignment on ABase_OpenSpaceContainer_BP_C");
static_assert(sizeof(ABase_OpenSpaceContainer_BP_C) == 0x0003C0, "Wrong size on ABase_OpenSpaceContainer_BP_C");
static_assert(offsetof(ABase_OpenSpaceContainer_BP_C, UberGraphFrame) == 0x000338, "Member 'ABase_OpenSpaceContainer_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABase_OpenSpaceContainer_BP_C, BottlePositionOverride) == 0x000340, "Member 'ABase_OpenSpaceContainer_BP_C::BottlePositionOverride' has a wrong offset!");
static_assert(offsetof(ABase_OpenSpaceContainer_BP_C, AllItemsEditorSelectedPreview) == 0x000348, "Member 'ABase_OpenSpaceContainer_BP_C::AllItemsEditorSelectedPreview' has a wrong offset!");
static_assert(offsetof(ABase_OpenSpaceContainer_BP_C, RBEditorSelectedPreview) == 0x000350, "Member 'ABase_OpenSpaceContainer_BP_C::RBEditorSelectedPreview' has a wrong offset!");
static_assert(offsetof(ABase_OpenSpaceContainer_BP_C, SpawnZoneVisualHelper) == 0x000358, "Member 'ABase_OpenSpaceContainer_BP_C::SpawnZoneVisualHelper' has a wrong offset!");
static_assert(offsetof(ABase_OpenSpaceContainer_BP_C, SpawnLocation) == 0x000360, "Member 'ABase_OpenSpaceContainer_BP_C::SpawnLocation' has a wrong offset!");
static_assert(offsetof(ABase_OpenSpaceContainer_BP_C, EditorIcon) == 0x000368, "Member 'ABase_OpenSpaceContainer_BP_C::EditorIcon' has a wrong offset!");
static_assert(offsetof(ABase_OpenSpaceContainer_BP_C, InteractionStaticMesh) == 0x000370, "Member 'ABase_OpenSpaceContainer_BP_C::InteractionStaticMesh' has a wrong offset!");
static_assert(offsetof(ABase_OpenSpaceContainer_BP_C, BaseTransform) == 0x000380, "Member 'ABase_OpenSpaceContainer_BP_C::BaseTransform' has a wrong offset!");
static_assert(offsetof(ABase_OpenSpaceContainer_BP_C, NeedAllItemsPreview) == 0x0003B0, "Member 'ABase_OpenSpaceContainer_BP_C::NeedAllItemsPreview' has a wrong offset!");

}

