#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Base_ButtonPress_GhostAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Base_ButtonPress_GhostAnimBP.Base_ButtonPress_GhostAnimBP_C
// 0x0280 (0x0570 - 0x02F0)
class UBase_ButtonPress_GhostAnimBP_C final : public URBGhostAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0328(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0350(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x03D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0400(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0480(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x04B0(0x00B0)()
	float                                         InteractHeight;                                    // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          StartAnimSequence;                                 // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_Done();
	void BP_InitializeGhost();
	void ExecuteUbergraph_Base_ButtonPress_GhostAnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Base_ButtonPress_GhostAnimBP_C">();
	}
	static class UBase_ButtonPress_GhostAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBase_ButtonPress_GhostAnimBP_C>();
	}
};
static_assert(alignof(UBase_ButtonPress_GhostAnimBP_C) == 0x000010, "Wrong alignment on UBase_ButtonPress_GhostAnimBP_C");
static_assert(sizeof(UBase_ButtonPress_GhostAnimBP_C) == 0x000570, "Wrong size on UBase_ButtonPress_GhostAnimBP_C");
static_assert(offsetof(UBase_ButtonPress_GhostAnimBP_C, UberGraphFrame) == 0x0002F0, "Member 'UBase_ButtonPress_GhostAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBase_ButtonPress_GhostAnimBP_C, AnimGraphNode_Root) == 0x0002F8, "Member 'UBase_ButtonPress_GhostAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBase_ButtonPress_GhostAnimBP_C, AnimGraphNode_TransitionResult) == 0x000328, "Member 'UBase_ButtonPress_GhostAnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBase_ButtonPress_GhostAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000350, "Member 'UBase_ButtonPress_GhostAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBase_ButtonPress_GhostAnimBP_C, AnimGraphNode_StateResult_1) == 0x0003D0, "Member 'UBase_ButtonPress_GhostAnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBase_ButtonPress_GhostAnimBP_C, AnimGraphNode_SequencePlayer) == 0x000400, "Member 'UBase_ButtonPress_GhostAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBase_ButtonPress_GhostAnimBP_C, AnimGraphNode_StateResult) == 0x000480, "Member 'UBase_ButtonPress_GhostAnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBase_ButtonPress_GhostAnimBP_C, AnimGraphNode_StateMachine) == 0x0004B0, "Member 'UBase_ButtonPress_GhostAnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBase_ButtonPress_GhostAnimBP_C, InteractHeight) == 0x000560, "Member 'UBase_ButtonPress_GhostAnimBP_C::InteractHeight' has a wrong offset!");
static_assert(offsetof(UBase_ButtonPress_GhostAnimBP_C, StartAnimSequence) == 0x000568, "Member 'UBase_ButtonPress_GhostAnimBP_C::StartAnimSequence' has a wrong offset!");

}

