#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Base_DeadBody_Container_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Base_DeadBody_Container_BP.Base_DeadBody_Container_BP_C
// 0x0108 (0x04B0 - 0x03A8)
class ABase_DeadBody_Container_BP_C : public ARBDeadBodyContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Torso_Editor;                                      // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Leg_Editor;                                        // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 DeadHead_Editor;                                   // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      RBSound;                                           // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorClearanceCollisionBoxComponent* ArmFallAfterUseClearance;                          // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview1;                          // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview;                           // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorClearanceCollisionBoxComponent* FallAfterUseClearance;                             // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      LegCapsule;                                        // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Feet_Editor;                                       // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 LeftArm_Editor;                                    // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 RightArm_Editor;                                   // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      HeadCapsule;                                       // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      MainCapsule;                                       // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Watch;                                             // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 HairMesh;                                          // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Glove_Mesh;                                        // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 DeadHead;                                          // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBDeadBodySpawnLocationComponent*      ESOPSpawnLocation;                                 // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 NightVision;                                       // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Straps;                                            // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ESOP_Battery;                                      // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ESOP;                                              // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 DeadLegs;                                          // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 DeadTorso;                                         // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBDeadBodySpawnLocationComponent*      GroundSpawnLocation;                               // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBDeadBodySpawnLocationComponent*      HandSpawnLocation;                                 // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         ExtraCustomizationMeshes;                          // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UAnimSequenceBase*                      LastPlayedSequence;                                // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPoseAsset*                             FacePoseAsset;                                     // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EnableLODs();
	void UserConstructionScript();
	void PlayDeadBodyAnim(class UAnimSequenceBase* Anim);
	void OnInteractionStarted(class URBContainerSpawnLocationComponent* SpawnLocationComponent);
	void ReceiveBeginPlay();
	void Event_OnResetStage();
	void ForceEndPose(class UAnimSequenceBase* Anim);
	void Event_OnNotifyPlayRigSequence(class UAnimationAsset* AnimToPlay);
	void BndEvt__HandSpawnLocation_K2Node_ComponentBoundEvent_3_OnContainerPickupInteractionEvent__DelegateSignature(class URBContainerSpawnLocationComponent* Component, class ARBPawn* Interactor, class ARBPickup* Pickup);
	void BndEvt__ESOPSpawnLocation_K2Node_ComponentBoundEvent_4_OnContainerPickupInteractionEvent__DelegateSignature(class URBContainerSpawnLocationComponent* Component, class ARBPawn* Interactor, class ARBPickup* Pickup);
	void BndEvt__GroundSpawnLocation_K2Node_ComponentBoundEvent_5_OnContainerPickupInteractionEvent__DelegateSignature(class URBContainerSpawnLocationComponent* Component, class ARBPawn* Interactor, class ARBPickup* Pickup);
	void Event_OnCustomizationChanged();
	void ActivateHeadCapsule();
	void OnExtraCustomizationMeshesAddedForSlot(const TArray<class USkeletalMeshComponent*>& AddedExtraMeshes, EPlayerCustomizationSlot Slot);
	void ValidateMovedAnim();
	void Event_OnMovedDeadBodySequenceChanged();
	void ExecuteUbergraph_Base_DeadBody_Container_BP(int32 EntryPoint);

	class USkeletalMeshComponent* GetShadowSkeletalMeshComponentForSlot(EPlayerCustomizationSlot Slot, bool* OutFound) const;
	class USkeletalMeshComponent* GetMainParentSkeletalMesh() const;
	class UStaticMeshComponent* GetWatchComponent() const;
	struct FRBPlayerCustomizationInfo GetPlayerCustomizationInfo() const;
	class USkeletalMeshComponent* GetSkeletalMeshComponentForSlot(EPlayerCustomizationSlot Slot) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Base_DeadBody_Container_BP_C">();
	}
	static class ABase_DeadBody_Container_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABase_DeadBody_Container_BP_C>();
	}
};
static_assert(alignof(ABase_DeadBody_Container_BP_C) == 0x000008, "Wrong alignment on ABase_DeadBody_Container_BP_C");
static_assert(sizeof(ABase_DeadBody_Container_BP_C) == 0x0004B0, "Wrong size on ABase_DeadBody_Container_BP_C");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, UberGraphFrame) == 0x0003A8, "Member 'ABase_DeadBody_Container_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, Torso_Editor) == 0x0003B0, "Member 'ABase_DeadBody_Container_BP_C::Torso_Editor' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, Leg_Editor) == 0x0003B8, "Member 'ABase_DeadBody_Container_BP_C::Leg_Editor' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, DeadHead_Editor) == 0x0003C0, "Member 'ABase_DeadBody_Container_BP_C::DeadHead_Editor' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, RBSound) == 0x0003C8, "Member 'ABase_DeadBody_Container_BP_C::RBSound' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, ArmFallAfterUseClearance) == 0x0003D0, "Member 'ABase_DeadBody_Container_BP_C::ArmFallAfterUseClearance' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, RBEditorSelectedPreview1) == 0x0003D8, "Member 'ABase_DeadBody_Container_BP_C::RBEditorSelectedPreview1' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, RBEditorSelectedPreview) == 0x0003E0, "Member 'ABase_DeadBody_Container_BP_C::RBEditorSelectedPreview' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, FallAfterUseClearance) == 0x0003E8, "Member 'ABase_DeadBody_Container_BP_C::FallAfterUseClearance' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, LegCapsule) == 0x0003F0, "Member 'ABase_DeadBody_Container_BP_C::LegCapsule' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, Feet_Editor) == 0x0003F8, "Member 'ABase_DeadBody_Container_BP_C::Feet_Editor' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, LeftArm_Editor) == 0x000400, "Member 'ABase_DeadBody_Container_BP_C::LeftArm_Editor' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, RightArm_Editor) == 0x000408, "Member 'ABase_DeadBody_Container_BP_C::RightArm_Editor' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, HeadCapsule) == 0x000410, "Member 'ABase_DeadBody_Container_BP_C::HeadCapsule' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, MainCapsule) == 0x000418, "Member 'ABase_DeadBody_Container_BP_C::MainCapsule' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, Watch) == 0x000420, "Member 'ABase_DeadBody_Container_BP_C::Watch' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, HairMesh) == 0x000428, "Member 'ABase_DeadBody_Container_BP_C::HairMesh' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, Glove_Mesh) == 0x000430, "Member 'ABase_DeadBody_Container_BP_C::Glove_Mesh' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, DeadHead) == 0x000438, "Member 'ABase_DeadBody_Container_BP_C::DeadHead' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, ESOPSpawnLocation) == 0x000440, "Member 'ABase_DeadBody_Container_BP_C::ESOPSpawnLocation' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, NightVision) == 0x000448, "Member 'ABase_DeadBody_Container_BP_C::NightVision' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, Straps) == 0x000450, "Member 'ABase_DeadBody_Container_BP_C::Straps' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, ESOP_Battery) == 0x000458, "Member 'ABase_DeadBody_Container_BP_C::ESOP_Battery' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, ESOP) == 0x000460, "Member 'ABase_DeadBody_Container_BP_C::ESOP' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, DeadLegs) == 0x000468, "Member 'ABase_DeadBody_Container_BP_C::DeadLegs' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, DeadTorso) == 0x000470, "Member 'ABase_DeadBody_Container_BP_C::DeadTorso' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, GroundSpawnLocation) == 0x000478, "Member 'ABase_DeadBody_Container_BP_C::GroundSpawnLocation' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, HandSpawnLocation) == 0x000480, "Member 'ABase_DeadBody_Container_BP_C::HandSpawnLocation' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, SkeletalMesh) == 0x000488, "Member 'ABase_DeadBody_Container_BP_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, ExtraCustomizationMeshes) == 0x000490, "Member 'ABase_DeadBody_Container_BP_C::ExtraCustomizationMeshes' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, LastPlayedSequence) == 0x0004A0, "Member 'ABase_DeadBody_Container_BP_C::LastPlayedSequence' has a wrong offset!");
static_assert(offsetof(ABase_DeadBody_Container_BP_C, FacePoseAsset) == 0x0004A8, "Member 'ABase_DeadBody_Container_BP_C::FacePoseAsset' has a wrong offset!");

}

