#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Base_SinglePressButton_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Base_Button_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Base_SinglePressButton_BP.Base_SinglePressButton_BP_C
// 0x0018 (0x0298 - 0x0280)
class ABase_SinglePressButton_BP_C : public ABase_Button_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Base_SinglePressButton_BP_C;        // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBase_ButtonPress_InteractionComponent_BP_C* ButtonPressComponent;                              // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPressed;                                         // 0x0290(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          DoButtonPressActionsOnDoAction;                    // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetPressed(bool Pressed);
	void OnRep_IsPressed();
	void BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_1_OnInteractionEvent__DelegateSignature(class ARBPawn* Interactor, class URBInteractibleComponent* Component);
	void BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_2_OnInteractionEvent__DelegateSignature(class ARBPawn* Interactor, class URBInteractibleComponent* Component);
	void Event_OnResetStage();
	void ApplyColorDelayed();
	void DoButtonPressActions();
	void ExecuteUbergraph_Base_SinglePressButton_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Base_SinglePressButton_BP_C">();
	}
	static class ABase_SinglePressButton_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABase_SinglePressButton_BP_C>();
	}
};
static_assert(alignof(ABase_SinglePressButton_BP_C) == 0x000008, "Wrong alignment on ABase_SinglePressButton_BP_C");
static_assert(sizeof(ABase_SinglePressButton_BP_C) == 0x000298, "Wrong size on ABase_SinglePressButton_BP_C");
static_assert(offsetof(ABase_SinglePressButton_BP_C, UberGraphFrame_Base_SinglePressButton_BP_C) == 0x000280, "Member 'ABase_SinglePressButton_BP_C::UberGraphFrame_Base_SinglePressButton_BP_C' has a wrong offset!");
static_assert(offsetof(ABase_SinglePressButton_BP_C, ButtonPressComponent) == 0x000288, "Member 'ABase_SinglePressButton_BP_C::ButtonPressComponent' has a wrong offset!");
static_assert(offsetof(ABase_SinglePressButton_BP_C, IsPressed) == 0x000290, "Member 'ABase_SinglePressButton_BP_C::IsPressed' has a wrong offset!");
static_assert(offsetof(ABase_SinglePressButton_BP_C, DoButtonPressActionsOnDoAction) == 0x000291, "Member 'ABase_SinglePressButton_BP_C::DoButtonPressActionsOnDoAction' has a wrong offset!");

}

