#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Base_PropagandaPoster_GhostAnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Base_PropagandaPoster_GhostAnimBP.Base_PropagandaPoster_GhostAnimBP_C
// 0x03C0 (0x06B0 - 0x02F0)
class UBase_PropagandaPoster_GhostAnimBP_C final : public URBGhostAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0328(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0350(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0378(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x03F8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0428(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0510(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0540(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x05C0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x05F0(0x00B0)()
	float                                         InteractHeight;                                    // 0x06A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_Done();
	void BP_InitializeGhost();
	void ExecuteUbergraph_Base_PropagandaPoster_GhostAnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Base_PropagandaPoster_GhostAnimBP_C">();
	}
	static class UBase_PropagandaPoster_GhostAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBase_PropagandaPoster_GhostAnimBP_C>();
	}
};
static_assert(alignof(UBase_PropagandaPoster_GhostAnimBP_C) == 0x000010, "Wrong alignment on UBase_PropagandaPoster_GhostAnimBP_C");
static_assert(sizeof(UBase_PropagandaPoster_GhostAnimBP_C) == 0x0006B0, "Wrong size on UBase_PropagandaPoster_GhostAnimBP_C");
static_assert(offsetof(UBase_PropagandaPoster_GhostAnimBP_C, UberGraphFrame) == 0x0002F0, "Member 'UBase_PropagandaPoster_GhostAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBase_PropagandaPoster_GhostAnimBP_C, AnimGraphNode_Root) == 0x0002F8, "Member 'UBase_PropagandaPoster_GhostAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBase_PropagandaPoster_GhostAnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000328, "Member 'UBase_PropagandaPoster_GhostAnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UBase_PropagandaPoster_GhostAnimBP_C, AnimGraphNode_TransitionResult) == 0x000350, "Member 'UBase_PropagandaPoster_GhostAnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBase_PropagandaPoster_GhostAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000378, "Member 'UBase_PropagandaPoster_GhostAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBase_PropagandaPoster_GhostAnimBP_C, AnimGraphNode_StateResult_2) == 0x0003F8, "Member 'UBase_PropagandaPoster_GhostAnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UBase_PropagandaPoster_GhostAnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x000428, "Member 'UBase_PropagandaPoster_GhostAnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UBase_PropagandaPoster_GhostAnimBP_C, AnimGraphNode_StateResult_1) == 0x000510, "Member 'UBase_PropagandaPoster_GhostAnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBase_PropagandaPoster_GhostAnimBP_C, AnimGraphNode_SequencePlayer) == 0x000540, "Member 'UBase_PropagandaPoster_GhostAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBase_PropagandaPoster_GhostAnimBP_C, AnimGraphNode_StateResult) == 0x0005C0, "Member 'UBase_PropagandaPoster_GhostAnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBase_PropagandaPoster_GhostAnimBP_C, AnimGraphNode_StateMachine) == 0x0005F0, "Member 'UBase_PropagandaPoster_GhostAnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBase_PropagandaPoster_GhostAnimBP_C, InteractHeight) == 0x0006A0, "Member 'UBase_PropagandaPoster_GhostAnimBP_C::InteractHeight' has a wrong offset!");

}

