#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BASE_ElectricalSwitchMinus01_Ghost

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BASE_ElectricalSwitch-01_Ghost.BASE_ElectricalSwitch-01_Ghost_C
// 0x0430 (0x0720 - 0x02F0)
class UBASE_ElectricalSwitchMinus01_Ghost_C final : public URBGhostAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0328(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0350(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0378(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x03A0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0420(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0450(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x04D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0500(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0580(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x05B0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0630(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0660(0x00B0)()
	class ABASE_ElectricalSwitchMinus01_BP_C*     ElectricalSwitch;                                  // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Finished;                                          // 0x0718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost(int32 EntryPoint);
	void AnimNotify_Done();
	void AnimNotify_EnterDone();
	void OnGhostAnimNotify(EGhostAnimEvent AnimEvent, const class FName& AnimEventName);
	void BP_InitializeGhost();
	bool FinishGhost(EGhostFinishReason FinishReason, int32 GhostFinishCustomReason);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BASE_ElectricalSwitch-01_Ghost_C">();
	}
	static class UBASE_ElectricalSwitchMinus01_Ghost_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBASE_ElectricalSwitchMinus01_Ghost_C>();
	}
};
static_assert(alignof(UBASE_ElectricalSwitchMinus01_Ghost_C) == 0x000010, "Wrong alignment on UBASE_ElectricalSwitchMinus01_Ghost_C");
static_assert(sizeof(UBASE_ElectricalSwitchMinus01_Ghost_C) == 0x000720, "Wrong size on UBASE_ElectricalSwitchMinus01_Ghost_C");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, UberGraphFrame) == 0x0002F0, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, AnimGraphNode_Root) == 0x0002F8, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, AnimGraphNode_TransitionResult_2) == 0x000328, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, AnimGraphNode_TransitionResult_1) == 0x000350, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, AnimGraphNode_TransitionResult) == 0x000378, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, AnimGraphNode_SequencePlayer_3) == 0x0003A0, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, AnimGraphNode_StateResult_3) == 0x000420, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, AnimGraphNode_SequencePlayer_2) == 0x000450, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, AnimGraphNode_StateResult_2) == 0x0004D0, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, AnimGraphNode_SequencePlayer_1) == 0x000500, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, AnimGraphNode_StateResult_1) == 0x000580, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, AnimGraphNode_SequencePlayer) == 0x0005B0, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, AnimGraphNode_StateResult) == 0x000630, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, AnimGraphNode_StateMachine) == 0x000660, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, ElectricalSwitch) == 0x000710, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::ElectricalSwitch' has a wrong offset!");
static_assert(offsetof(UBASE_ElectricalSwitchMinus01_Ghost_C, Finished) == 0x000718, "Member 'UBASE_ElectricalSwitchMinus01_Ghost_C::Finished' has a wrong offset!");

}

