#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Base_Movable_Button_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Base_Movable_Button_BP.Base_Movable_Button_BP_C.FixUp
// 0x0001 (0x0001 - 0x0000)
struct Base_Movable_Button_BP_C_FixUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_Movable_Button_BP_C_FixUp) == 0x000001, "Wrong alignment on Base_Movable_Button_BP_C_FixUp");
static_assert(sizeof(Base_Movable_Button_BP_C_FixUp) == 0x000001, "Wrong size on Base_Movable_Button_BP_C_FixUp");
static_assert(offsetof(Base_Movable_Button_BP_C_FixUp, ReturnValue) == 0x000000, "Member 'Base_Movable_Button_BP_C_FixUp::ReturnValue' has a wrong offset!");

// Function Base_Movable_Button_BP.Base_Movable_Button_BP_C.UpdateButtonPosition
// 0x0284 (0x0284 - 0x0000)
struct Base_Movable_Button_BP_C_UpdateButtonPosition final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0064(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x0174(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x01FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Base_Movable_Button_BP_C_UpdateButtonPosition) == 0x000004, "Wrong alignment on Base_Movable_Button_BP_C_UpdateButtonPosition");
static_assert(sizeof(Base_Movable_Button_BP_C_UpdateButtonPosition) == 0x000284, "Wrong size on Base_Movable_Button_BP_C_UpdateButtonPosition");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, Time) == 0x000000, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::Time' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_FMin_ReturnValue) == 0x000010, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_FMax_ReturnValue) == 0x000014, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_Lerp_ReturnValue_1) == 0x00001C, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_MakeVector_ReturnValue) == 0x000020, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_MakeVector_ReturnValue_1) == 0x00002C, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000038, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_Lerp_ReturnValue_2) == 0x00003C, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_MakeVector_ReturnValue_2) == 0x000040, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_MakeVector_ReturnValue_3) == 0x00004C, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000064, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0000EC, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x000174, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_UpdateButtonPosition, CallFunc_K2_SetRelativeLocation_SweepHitResult_3) == 0x0001FC, "Member 'Base_Movable_Button_BP_C_UpdateButtonPosition::CallFunc_K2_SetRelativeLocation_SweepHitResult_3' has a wrong offset!");

// Function Base_Movable_Button_BP.Base_Movable_Button_BP_C.OnPostActorsPasted
// 0x0010 (0x0010 - 0x0000)
struct Base_Movable_Button_BP_C_OnPostActorsPasted final
{
public:
	TArray<class AActor*>                         PastedActors;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Base_Movable_Button_BP_C_OnPostActorsPasted) == 0x000008, "Wrong alignment on Base_Movable_Button_BP_C_OnPostActorsPasted");
static_assert(sizeof(Base_Movable_Button_BP_C_OnPostActorsPasted) == 0x000010, "Wrong size on Base_Movable_Button_BP_C_OnPostActorsPasted");
static_assert(offsetof(Base_Movable_Button_BP_C_OnPostActorsPasted, PastedActors) == 0x000000, "Member 'Base_Movable_Button_BP_C_OnPostActorsPasted::PastedActors' has a wrong offset!");

// Function Base_Movable_Button_BP.Base_Movable_Button_BP_C.PostDuplicated
// 0x0008 (0x0008 - 0x0000)
struct Base_Movable_Button_BP_C_PostDuplicated final
{
public:
	class AActor*                                 DuplicationParent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_Movable_Button_BP_C_PostDuplicated) == 0x000008, "Wrong alignment on Base_Movable_Button_BP_C_PostDuplicated");
static_assert(sizeof(Base_Movable_Button_BP_C_PostDuplicated) == 0x000008, "Wrong size on Base_Movable_Button_BP_C_PostDuplicated");
static_assert(offsetof(Base_Movable_Button_BP_C_PostDuplicated, DuplicationParent) == 0x000000, "Member 'Base_Movable_Button_BP_C_PostDuplicated::DuplicationParent' has a wrong offset!");

// Function Base_Movable_Button_BP.Base_Movable_Button_BP_C.PostEditChange
// 0x0008 (0x0008 - 0x0000)
struct Base_Movable_Button_BP_C_PostEditChange final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_Movable_Button_BP_C_PostEditChange) == 0x000004, "Wrong alignment on Base_Movable_Button_BP_C_PostEditChange");
static_assert(sizeof(Base_Movable_Button_BP_C_PostEditChange) == 0x000008, "Wrong size on Base_Movable_Button_BP_C_PostEditChange");
static_assert(offsetof(Base_Movable_Button_BP_C_PostEditChange, PropertyName) == 0x000000, "Member 'Base_Movable_Button_BP_C_PostEditChange::PropertyName' has a wrong offset!");

// Function Base_Movable_Button_BP.Base_Movable_Button_BP_C.PostEditMove
// 0x0001 (0x0001 - 0x0000)
struct Base_Movable_Button_BP_C_PostEditMove final
{
public:
	bool                                          bFinished;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_Movable_Button_BP_C_PostEditMove) == 0x000001, "Wrong alignment on Base_Movable_Button_BP_C_PostEditMove");
static_assert(sizeof(Base_Movable_Button_BP_C_PostEditMove) == 0x000001, "Wrong size on Base_Movable_Button_BP_C_PostEditMove");
static_assert(offsetof(Base_Movable_Button_BP_C_PostEditMove, bFinished) == 0x000000, "Member 'Base_Movable_Button_BP_C_PostEditMove::bFinished' has a wrong offset!");

// Function Base_Movable_Button_BP.Base_Movable_Button_BP_C.EnableVisual
// 0x0001 (0x0001 - 0x0000)
struct Base_Movable_Button_BP_C_EnableVisual final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_Movable_Button_BP_C_EnableVisual) == 0x000001, "Wrong alignment on Base_Movable_Button_BP_C_EnableVisual");
static_assert(sizeof(Base_Movable_Button_BP_C_EnableVisual) == 0x000001, "Wrong size on Base_Movable_Button_BP_C_EnableVisual");
static_assert(offsetof(Base_Movable_Button_BP_C_EnableVisual, Enable) == 0x000000, "Member 'Base_Movable_Button_BP_C_EnableVisual::Enable' has a wrong offset!");

// Function Base_Movable_Button_BP.Base_Movable_Button_BP_C.Unlock
// 0x0008 (0x0008 - 0x0000)
struct Base_Movable_Button_BP_C_Unlock final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_Movable_Button_BP_C_Unlock) == 0x000008, "Wrong alignment on Base_Movable_Button_BP_C_Unlock");
static_assert(sizeof(Base_Movable_Button_BP_C_Unlock) == 0x000008, "Wrong size on Base_Movable_Button_BP_C_Unlock");
static_assert(offsetof(Base_Movable_Button_BP_C_Unlock, Pawn) == 0x000000, "Member 'Base_Movable_Button_BP_C_Unlock::Pawn' has a wrong offset!");

// Function Base_Movable_Button_BP.Base_Movable_Button_BP_C.ExecuteUbergraph_Base_Movable_Button_BP
// 0x0040 (0x0040 - 0x0000)
struct Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_Event_pastedActors;                         // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 K2Node_Event_duplicationParent;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_propertyName;                         // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFinished;                            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_enable;                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_Event_pawn;                                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP) == 0x000008, "Wrong alignment on Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP");
static_assert(sizeof(Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP) == 0x000040, "Wrong size on Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP");
static_assert(offsetof(Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP, EntryPoint) == 0x000000, "Member 'Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP, K2Node_Event_pastedActors) == 0x000008, "Member 'Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP::K2Node_Event_pastedActors' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP, K2Node_Event_duplicationParent) == 0x000018, "Member 'Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP::K2Node_Event_duplicationParent' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP, K2Node_Event_propertyName) == 0x000020, "Member 'Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP::K2Node_Event_propertyName' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP, K2Node_Event_bFinished) == 0x000028, "Member 'Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP::K2Node_Event_bFinished' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP, K2Node_CustomEvent_enable) == 0x000029, "Member 'Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP::K2Node_CustomEvent_enable' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP, K2Node_Event_pawn) == 0x000030, "Member 'Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP::K2Node_Event_pawn' has a wrong offset!");
static_assert(offsetof(Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP, CallFunc_HasAuthority_ReturnValue_2) == 0x000038, "Member 'Base_Movable_Button_BP_C_ExecuteUbergraph_Base_Movable_Button_BP::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");

// Function Base_Movable_Button_BP.Base_Movable_Button_BP_C.IsLocked
// 0x0001 (0x0001 - 0x0000)
struct Base_Movable_Button_BP_C_IsLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_Movable_Button_BP_C_IsLocked) == 0x000001, "Wrong alignment on Base_Movable_Button_BP_C_IsLocked");
static_assert(sizeof(Base_Movable_Button_BP_C_IsLocked) == 0x000001, "Wrong size on Base_Movable_Button_BP_C_IsLocked");
static_assert(offsetof(Base_Movable_Button_BP_C_IsLocked, ReturnValue) == 0x000000, "Member 'Base_Movable_Button_BP_C_IsLocked::ReturnValue' has a wrong offset!");

}

