#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Base_SinglePressButton_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Base_SinglePressButton_BP.Base_SinglePressButton_BP_C.SetPressed
// 0x0002 (0x0002 - 0x0000)
struct Base_SinglePressButton_BP_C_SetPressed final
{
public:
	bool                                          Pressed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_SinglePressButton_BP_C_SetPressed) == 0x000001, "Wrong alignment on Base_SinglePressButton_BP_C_SetPressed");
static_assert(sizeof(Base_SinglePressButton_BP_C_SetPressed) == 0x000002, "Wrong size on Base_SinglePressButton_BP_C_SetPressed");
static_assert(offsetof(Base_SinglePressButton_BP_C_SetPressed, Pressed) == 0x000000, "Member 'Base_SinglePressButton_BP_C_SetPressed::Pressed' has a wrong offset!");
static_assert(offsetof(Base_SinglePressButton_BP_C_SetPressed, CallFunc_HasAuthority_ReturnValue) == 0x000001, "Member 'Base_SinglePressButton_BP_C_SetPressed::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function Base_SinglePressButton_BP.Base_SinglePressButton_BP_C.BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_1_OnInteractionEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_1_OnInteractionEvent__DelegateSignature final
{
public:
	class ARBPawn*                                Interactor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBInteractibleComponent*               Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_1_OnInteractionEvent__DelegateSignature) == 0x000008, "Wrong alignment on Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_1_OnInteractionEvent__DelegateSignature");
static_assert(sizeof(Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_1_OnInteractionEvent__DelegateSignature) == 0x000010, "Wrong size on Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_1_OnInteractionEvent__DelegateSignature");
static_assert(offsetof(Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_1_OnInteractionEvent__DelegateSignature, Interactor) == 0x000000, "Member 'Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_1_OnInteractionEvent__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_1_OnInteractionEvent__DelegateSignature, Component) == 0x000008, "Member 'Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_1_OnInteractionEvent__DelegateSignature::Component' has a wrong offset!");

// Function Base_SinglePressButton_BP.Base_SinglePressButton_BP_C.BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_2_OnInteractionEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_2_OnInteractionEvent__DelegateSignature final
{
public:
	class ARBPawn*                                Interactor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBInteractibleComponent*               Component;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_2_OnInteractionEvent__DelegateSignature) == 0x000008, "Wrong alignment on Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_2_OnInteractionEvent__DelegateSignature");
static_assert(sizeof(Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_2_OnInteractionEvent__DelegateSignature) == 0x000010, "Wrong size on Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_2_OnInteractionEvent__DelegateSignature");
static_assert(offsetof(Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_2_OnInteractionEvent__DelegateSignature, Interactor) == 0x000000, "Member 'Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_2_OnInteractionEvent__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_2_OnInteractionEvent__DelegateSignature, Component) == 0x000008, "Member 'Base_SinglePressButton_BP_C_BndEvt__Base_SinglePressButton_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_2_OnInteractionEvent__DelegateSignature::Component' has a wrong offset!");

// Function Base_SinglePressButton_BP.Base_SinglePressButton_BP_C.ExecuteUbergraph_Base_SinglePressButton_BP
// 0x0028 (0x0028 - 0x0000)
struct Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_ComponentBoundEvent_interactor_1;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBInteractibleComponent*               K2Node_ComponentBoundEvent_component_1;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_ComponentBoundEvent_interactor;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBInteractibleComponent*               K2Node_ComponentBoundEvent_component;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP) == 0x000008, "Wrong alignment on Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP");
static_assert(sizeof(Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP) == 0x000028, "Wrong size on Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP");
static_assert(offsetof(Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP, EntryPoint) == 0x000000, "Member 'Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP, K2Node_ComponentBoundEvent_interactor_1) == 0x000008, "Member 'Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP::K2Node_ComponentBoundEvent_interactor_1' has a wrong offset!");
static_assert(offsetof(Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP, K2Node_ComponentBoundEvent_component_1) == 0x000010, "Member 'Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP::K2Node_ComponentBoundEvent_component_1' has a wrong offset!");
static_assert(offsetof(Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP, K2Node_ComponentBoundEvent_interactor) == 0x000018, "Member 'Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP::K2Node_ComponentBoundEvent_interactor' has a wrong offset!");
static_assert(offsetof(Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP, K2Node_ComponentBoundEvent_component) == 0x000020, "Member 'Base_SinglePressButton_BP_C_ExecuteUbergraph_Base_SinglePressButton_BP::K2Node_ComponentBoundEvent_component' has a wrong offset!");

}

