#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BASE_ElectricalSwitchMinus01_Ghost

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function BASE_ElectricalSwitch-01_Ghost.BASE_ElectricalSwitch-01_Ghost_C.ExecuteUbergraph_BASE_ElectricalSwitch-01_Ghost
// 0x0030 (0x0030 - 0x0000)
struct BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGhostAnimEvent                               K2Node_Event_animEvent;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_animEventName;                        // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBInteractible*                        CallFunc_BP_GetCurrentARBInteractible_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABASE_ElectricalSwitchMinus01_BP_C*     K2Node_DynamicCast_AsBASE_Electrical_Switch_01_BP; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GhostAnimTransition_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GhostAnimTransition_ReturnValue_1;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost) == 0x000008, "Wrong alignment on BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost");
static_assert(sizeof(BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost) == 0x000030, "Wrong size on BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost, EntryPoint) == 0x000000, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost::EntryPoint' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost, K2Node_Event_animEvent) == 0x000004, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost::K2Node_Event_animEvent' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost, K2Node_Event_animEventName) == 0x000008, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost::K2Node_Event_animEventName' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost, CallFunc_BP_GetCurrentARBInteractible_ReturnValue) == 0x000010, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost::CallFunc_BP_GetCurrentARBInteractible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost, K2Node_SwitchName_CmpSuccess) == 0x000018, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost, K2Node_DynamicCast_AsBASE_Electrical_Switch_01_BP) == 0x000020, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost::K2Node_DynamicCast_AsBASE_Electrical_Switch_01_BP' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost, CallFunc_GhostAnimTransition_ReturnValue) == 0x000029, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost::CallFunc_GhostAnimTransition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost, CallFunc_GhostAnimTransition_ReturnValue_1) == 0x00002A, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_ExecuteUbergraph_BASE_ElectricalSwitchMinus01_Ghost::CallFunc_GhostAnimTransition_ReturnValue_1' has a wrong offset!");

// Function BASE_ElectricalSwitch-01_Ghost.BASE_ElectricalSwitch-01_Ghost_C.OnGhostAnimNotify
// 0x000C (0x000C - 0x0000)
struct BASE_ElectricalSwitchMinus01_Ghost_C_OnGhostAnimNotify final
{
public:
	EGhostAnimEvent                               AnimEvent;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AnimEventName;                                     // 0x0004(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BASE_ElectricalSwitchMinus01_Ghost_C_OnGhostAnimNotify) == 0x000004, "Wrong alignment on BASE_ElectricalSwitchMinus01_Ghost_C_OnGhostAnimNotify");
static_assert(sizeof(BASE_ElectricalSwitchMinus01_Ghost_C_OnGhostAnimNotify) == 0x00000C, "Wrong size on BASE_ElectricalSwitchMinus01_Ghost_C_OnGhostAnimNotify");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_OnGhostAnimNotify, AnimEvent) == 0x000000, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_OnGhostAnimNotify::AnimEvent' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_OnGhostAnimNotify, AnimEventName) == 0x000004, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_OnGhostAnimNotify::AnimEventName' has a wrong offset!");

// Function BASE_ElectricalSwitch-01_Ghost.BASE_ElectricalSwitch-01_Ghost_C.FinishGhost
// 0x000C (0x000C - 0x0000)
struct BASE_ElectricalSwitchMinus01_Ghost_C_FinishGhost final
{
public:
	EGhostFinishReason                            FinishReason;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GhostFinishCustomReason;                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BASE_ElectricalSwitchMinus01_Ghost_C_FinishGhost) == 0x000004, "Wrong alignment on BASE_ElectricalSwitchMinus01_Ghost_C_FinishGhost");
static_assert(sizeof(BASE_ElectricalSwitchMinus01_Ghost_C_FinishGhost) == 0x00000C, "Wrong size on BASE_ElectricalSwitchMinus01_Ghost_C_FinishGhost");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_FinishGhost, FinishReason) == 0x000000, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_FinishGhost::FinishReason' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_FinishGhost, GhostFinishCustomReason) == 0x000004, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_FinishGhost::GhostFinishCustomReason' has a wrong offset!");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_FinishGhost, ReturnValue) == 0x000008, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_FinishGhost::ReturnValue' has a wrong offset!");

// Function BASE_ElectricalSwitch-01_Ghost.BASE_ElectricalSwitch-01_Ghost_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BASE_ElectricalSwitchMinus01_Ghost_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BASE_ElectricalSwitchMinus01_Ghost_C_AnimGraph) == 0x000008, "Wrong alignment on BASE_ElectricalSwitchMinus01_Ghost_C_AnimGraph");
static_assert(sizeof(BASE_ElectricalSwitchMinus01_Ghost_C_AnimGraph) == 0x000010, "Wrong size on BASE_ElectricalSwitchMinus01_Ghost_C_AnimGraph");
static_assert(offsetof(BASE_ElectricalSwitchMinus01_Ghost_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BASE_ElectricalSwitchMinus01_Ghost_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

