#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Base_ButtonMinusCoop_Base_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.GetStateName
// 0x0028 (0x0028 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_GetStateName final
{
public:
	class FString                                 StateA;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StateB;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_GetStateName) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_GetStateName");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_GetStateName) == 0x000028, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_GetStateName");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetStateName, StateA) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetStateName::StateA' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetStateName, StateB) == 0x000010, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetStateName::StateB' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetStateName, ReturnValue) == 0x000020, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetStateName::ReturnValue' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.FixUp
// 0x0001 (0x0001 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_FixUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_FixUp) == 0x000001, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_FixUp");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_FixUp) == 0x000001, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_FixUp");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_FixUp, ReturnValue) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_FixUp::ReturnValue' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_UserConstructionScript final
{
public:
	class URBCoopOperatableComponent*             LinkedCoopComponent;                               // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBCoopOperatableComponent*             CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_UserConstructionScript");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_UserConstructionScript) == 0x000018, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_UserConstructionScript");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_UserConstructionScript, LinkedCoopComponent) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_UserConstructionScript::LinkedCoopComponent' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'Base_ButtonMinusCoop_Base_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'Base_ButtonMinusCoop_Base_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_UserConstructionScript, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'Base_ButtonMinusCoop_Base_BP_C_UserConstructionScript::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.PrepareState
// 0x0010 (0x0010 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_PrepareState final
{
public:
	bool                                          bStateA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RandomOwner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_PrepareState) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_PrepareState");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_PrepareState) == 0x000010, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_PrepareState");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_PrepareState, bStateA) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_PrepareState::bStateA' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_PrepareState, RandomOwner) == 0x000008, "Member 'Base_ButtonMinusCoop_Base_BP_C_PrepareState::RandomOwner' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.OnPostActorsPasted
// 0x0010 (0x0010 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_OnPostActorsPasted final
{
public:
	TArray<class AActor*>                         PastedActors;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_OnPostActorsPasted) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_OnPostActorsPasted");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_OnPostActorsPasted) == 0x000010, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_OnPostActorsPasted");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_OnPostActorsPasted, PastedActors) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_OnPostActorsPasted::PastedActors' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.PostDuplicated
// 0x0008 (0x0008 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_PostDuplicated final
{
public:
	class AActor*                                 DuplicationParent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_PostDuplicated) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_PostDuplicated");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_PostDuplicated) == 0x000008, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_PostDuplicated");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_PostDuplicated, DuplicationParent) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_PostDuplicated::DuplicationParent' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.PostEditChange
// 0x0008 (0x0008 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_PostEditChange final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_PostEditChange) == 0x000004, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_PostEditChange");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_PostEditChange) == 0x000008, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_PostEditChange");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_PostEditChange, PropertyName) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_PostEditChange::PropertyName' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.PostEditMove
// 0x0001 (0x0001 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_PostEditMove final
{
public:
	bool                                          bFinished;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_PostEditMove) == 0x000001, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_PostEditMove");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_PostEditMove) == 0x000001, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_PostEditMove");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_PostEditMove, bFinished) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_PostEditMove::bFinished' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.OnTriggerableActivated
// 0x0008 (0x0008 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_OnTriggerableActivated final
{
public:
	class ARBTriggerable*                         Triggerable;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_OnTriggerableActivated) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_OnTriggerableActivated");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_OnTriggerableActivated) == 0x000008, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_OnTriggerableActivated");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_OnTriggerableActivated, Triggerable) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_OnTriggerableActivated::Triggerable' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.OnTriggerableDeactivated
// 0x0008 (0x0008 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_OnTriggerableDeactivated final
{
public:
	class ARBTriggerable*                         Triggerable;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_OnTriggerableDeactivated) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_OnTriggerableDeactivated");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_OnTriggerableDeactivated) == 0x000008, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_OnTriggerableDeactivated");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_OnTriggerableDeactivated, Triggerable) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_OnTriggerableDeactivated::Triggerable' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.BndEvt__Base_Button-Coop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnCoopOperatableEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_BndEvt__Base_ButtonMinusCoop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnCoopOperatableEvent__DelegateSignature final
{
public:
	class URBCoopOperatableComponent*             Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_BndEvt__Base_ButtonMinusCoop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnCoopOperatableEvent__DelegateSignature) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_BndEvt__Base_ButtonMinusCoop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnCoopOperatableEvent__DelegateSignature");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_BndEvt__Base_ButtonMinusCoop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnCoopOperatableEvent__DelegateSignature) == 0x000008, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_BndEvt__Base_ButtonMinusCoop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnCoopOperatableEvent__DelegateSignature");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_BndEvt__Base_ButtonMinusCoop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnCoopOperatableEvent__DelegateSignature, Component) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_BndEvt__Base_ButtonMinusCoop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnCoopOperatableEvent__DelegateSignature::Component' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.BndEvt__Base_Button-Coop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_BndEvt__Base_ButtonMinusCoop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature final
{
public:
	class URBInteractionZoneComponent*            Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_BndEvt__Base_ButtonMinusCoop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_BndEvt__Base_ButtonMinusCoop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_BndEvt__Base_ButtonMinusCoop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature) == 0x000008, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_BndEvt__Base_ButtonMinusCoop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_BndEvt__Base_ButtonMinusCoop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature, Component) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_BndEvt__Base_ButtonMinusCoop_Base_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature::Component' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.SetState
// 0x0001 (0x0001 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_SetState final
{
public:
	bool                                          bStateA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_SetState) == 0x000001, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_SetState");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_SetState) == 0x000001, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_SetState");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_SetState, bStateA) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_SetState::bStateA' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.SetShouldBeIgnoredForLots
// 0x0001 (0x0001 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_SetShouldBeIgnoredForLots final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_SetShouldBeIgnoredForLots) == 0x000001, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_SetShouldBeIgnoredForLots");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_SetShouldBeIgnoredForLots) == 0x000001, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_SetShouldBeIgnoredForLots");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_SetShouldBeIgnoredForLots, bValue) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_SetShouldBeIgnoredForLots::bValue' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.ExecuteUbergraph_Base_Button-Coop_Base_BP
// 0x0118 (0x0118 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStateA_1;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_randomOwner;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_Event_pastedActors;                         // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 K2Node_Event_duplicationParent;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_propertyName;                         // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFinished;                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBTriggerable*                         K2Node_Event_triggerable_1;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBTriggerable*                         K2Node_Event_triggerable;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IRBOperatableInterface> CallFunc_OnTriggerableActivated_self_CastInput;    // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IRBOperatableInterface> CallFunc_OnTriggerableDeactivated_self_CastInput;  // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class URBCoopOperatableComponent*             K2Node_ComponentBoundEvent_component_1;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBInteractionZoneComponent*            K2Node_ComponentBoundEvent_component;              // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentValue_ScheduledBool_ReturnValue; // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStateA;                              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bValue;                               // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP) == 0x000118, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, EntryPoint) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, K2Node_Event_bStateA_1) == 0x000004, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::K2Node_Event_bStateA_1' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, K2Node_Event_randomOwner) == 0x000008, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::K2Node_Event_randomOwner' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, K2Node_Event_pastedActors) == 0x000010, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::K2Node_Event_pastedActors' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, K2Node_Event_duplicationParent) == 0x000020, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::K2Node_Event_duplicationParent' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, K2Node_Event_propertyName) == 0x000028, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::K2Node_Event_propertyName' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, K2Node_Event_bFinished) == 0x000030, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::K2Node_Event_bFinished' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, K2Node_Event_triggerable_1) == 0x000038, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::K2Node_Event_triggerable_1' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, K2Node_Event_triggerable) == 0x000040, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::K2Node_Event_triggerable' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, CallFunc_OnTriggerableActivated_self_CastInput) == 0x000048, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::CallFunc_OnTriggerableActivated_self_CastInput' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, CallFunc_OnTriggerableDeactivated_self_CastInput) == 0x000058, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::CallFunc_OnTriggerableDeactivated_self_CastInput' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, K2Node_ComponentBoundEvent_component_1) == 0x000068, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::K2Node_ComponentBoundEvent_component_1' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, K2Node_ComponentBoundEvent_component) == 0x000070, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::K2Node_ComponentBoundEvent_component' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, CallFunc_IsEnabled_ReturnValue) == 0x000078, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, CallFunc_GetCurrentValue_ScheduledBool_ReturnValue) == 0x00007A, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::CallFunc_GetCurrentValue_ScheduledBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, CallFunc_BooleanOR_ReturnValue) == 0x00007B, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, K2Node_Event_bStateA) == 0x00007C, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::K2Node_Event_bStateA' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, K2Node_Event_bValue) == 0x00007D, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::K2Node_Event_bValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, CallFunc_Lerp_ReturnValue) == 0x000080, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, CallFunc_MakeVector_ReturnValue) == 0x000084, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000090, "Member 'Base_ButtonMinusCoop_Base_BP_C_ExecuteUbergraph_Base_ButtonMinusCoop_Base_BP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.GetPingItemName
// 0x0020 (0x0020 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_GetPingItemName final
{
public:
	class FText                                   OutName;                                           // 0x0000(0x0018)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_GetPingItemName) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_GetPingItemName");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_GetPingItemName) == 0x000020, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_GetPingItemName");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPingItemName, OutName) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPingItemName::OutName' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPingItemName, ReturnValue) == 0x000018, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPingItemName::ReturnValue' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.ShouldPingFollowActor
// 0x0002 (0x0002 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_ShouldPingFollowActor final
{
public:
	bool                                          OutShouldFollow;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_ShouldPingFollowActor) == 0x000001, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_ShouldPingFollowActor");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_ShouldPingFollowActor) == 0x000002, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_ShouldPingFollowActor");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ShouldPingFollowActor, OutShouldFollow) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_ShouldPingFollowActor::OutShouldFollow' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ShouldPingFollowActor, ReturnValue) == 0x000001, "Member 'Base_ButtonMinusCoop_Base_BP_C_ShouldPingFollowActor::ReturnValue' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.GetPingEnabled
// 0x0098 (0x0098 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_GetPingEnabled final
{
public:
	class ARBPlayer*                              PingOwner;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0008(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          OutIsEnabled;                                      // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0091(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_GetPingEnabled) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_GetPingEnabled");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_GetPingEnabled) == 0x000098, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_GetPingEnabled");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPingEnabled, PingOwner) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPingEnabled::PingOwner' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPingEnabled, HitResult) == 0x000008, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPingEnabled::HitResult' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPingEnabled, OutIsEnabled) == 0x000090, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPingEnabled::OutIsEnabled' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPingEnabled, ReturnValue) == 0x000091, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPingEnabled::ReturnValue' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.GetPlayerPingData
// 0x0158 (0x0158 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData final
{
public:
	class ARBPlayer*                              PingOwner;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0008(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FPlayerPingData                        OutData;                                           // 0x0090(0x0030)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldActivateDelayedRelease_ReturnValue; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x00E4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerPingData                        CallFunc_Map_Find_Value;                           // 0x00F0(0x0030)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerPingData                        K2Node_MakeStruct_PlayerPingData;                  // 0x0128(0x0030)()
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData) == 0x000158, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, PingOwner) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::PingOwner' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, HitResult) == 0x000008, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::HitResult' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, OutData) == 0x000090, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::OutData' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, ReturnValue) == 0x0000C0, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, Temp_bool_Variable) == 0x0000C1, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, CallFunc_MakeLiteralName_ReturnValue) == 0x0000C4, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, CallFunc_IsEnabled_ReturnValue) == 0x0000CC, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, CallFunc_MakeLiteralName_ReturnValue_1) == 0x0000D0, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x0000D8, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, CallFunc_ShouldActivateDelayedRelease_ReturnValue) == 0x0000E0, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::CallFunc_ShouldActivateDelayedRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, CallFunc_Not_PreBool_ReturnValue) == 0x0000E1, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, CallFunc_BooleanAND_ReturnValue) == 0x0000E2, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, K2Node_Select_Default) == 0x0000E4, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, CallFunc_Map_Find_Value) == 0x0000F0, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, CallFunc_Map_Find_ReturnValue) == 0x000120, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData, K2Node_MakeStruct_PlayerPingData) == 0x000128, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingData::K2Node_MakeStruct_PlayerPingData' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.GetPlayerPingWorldLocation
// 0x00B0 (0x00B0 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation final
{
public:
	class ARBPlayer*                              PingOwner;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0008(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                OutLocation;                                       // 0x0090(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x009C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation) == 0x0000B0, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation, PingOwner) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation::PingOwner' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation, HitResult) == 0x000008, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation::HitResult' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation, OutLocation) == 0x000090, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation::OutLocation' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation, ReturnValue) == 0x00009C, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000A0, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetPlayerPingWorldLocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.IsRandomStateSet
// 0x0001 (0x0001 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_IsRandomStateSet final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_IsRandomStateSet) == 0x000001, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_IsRandomStateSet");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_IsRandomStateSet) == 0x000001, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_IsRandomStateSet");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_IsRandomStateSet, ReturnValue) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_IsRandomStateSet::ReturnValue' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.IsStateA
// 0x0002 (0x0002 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_IsStateA final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsStateA_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_IsStateA) == 0x000001, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_IsStateA");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_IsStateA) == 0x000002, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_IsStateA");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_IsStateA, ReturnValue) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_IsStateA::ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_IsStateA, CallFunc_BP_IsStateA_ReturnValue) == 0x000001, "Member 'Base_ButtonMinusCoop_Base_BP_C_IsStateA::CallFunc_BP_IsStateA_ReturnValue' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.ShouldBeIgnoredForLots
// 0x0002 (0x0002 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_ShouldBeIgnoredForLots final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_ShouldBeIgnoredForLots_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_ShouldBeIgnoredForLots) == 0x000001, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_ShouldBeIgnoredForLots");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_ShouldBeIgnoredForLots) == 0x000002, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_ShouldBeIgnoredForLots");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ShouldBeIgnoredForLots, ReturnValue) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_ShouldBeIgnoredForLots::ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_ShouldBeIgnoredForLots, CallFunc_BP_ShouldBeIgnoredForLots_ReturnValue) == 0x000001, "Member 'Base_ButtonMinusCoop_Base_BP_C_ShouldBeIgnoredForLots::CallFunc_BP_ShouldBeIgnoredForLots_ReturnValue' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.GetProgressionRatio
// 0x0020 (0x0020 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_GetProgressionRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRBOperatableInterface> CallFunc_GetProgressionRatio_self_CastInput;       // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetProgressionRatio_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_GetProgressionRatio) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_GetProgressionRatio");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_GetProgressionRatio) == 0x000020, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_GetProgressionRatio");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetProgressionRatio, ReturnValue) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetProgressionRatio::ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetProgressionRatio, CallFunc_GetProgressionRatio_self_CastInput) == 0x000008, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetProgressionRatio::CallFunc_GetProgressionRatio_self_CastInput' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetProgressionRatio, CallFunc_GetProgressionRatio_ReturnValue) == 0x000018, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetProgressionRatio::CallFunc_GetProgressionRatio_ReturnValue' has a wrong offset!");

// Function Base_Button-Coop_Base_BP.Base_Button-Coop_Base_BP_C.GetTriggerActionBehavior
// 0x0020 (0x0020 - 0x0000)
struct Base_ButtonMinusCoop_Base_BP_C_GetTriggerActionBehavior final
{
public:
	ETriggerableActionBehavior                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRBOperatableInterface> CallFunc_GetTriggerActionBehavior_self_CastInput;  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETriggerableActionBehavior                    CallFunc_GetTriggerActionBehavior_ReturnValue;     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_ButtonMinusCoop_Base_BP_C_GetTriggerActionBehavior) == 0x000008, "Wrong alignment on Base_ButtonMinusCoop_Base_BP_C_GetTriggerActionBehavior");
static_assert(sizeof(Base_ButtonMinusCoop_Base_BP_C_GetTriggerActionBehavior) == 0x000020, "Wrong size on Base_ButtonMinusCoop_Base_BP_C_GetTriggerActionBehavior");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetTriggerActionBehavior, ReturnValue) == 0x000000, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetTriggerActionBehavior::ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_ButtonMinusCoop_Base_BP_C_GetTriggerActionBehavior, CallFunc_GetTriggerActionBehavior_self_CastInput) == 0x000008, "Member 'Base_ButtonMinusCoop_Base_BP_C_GetTriggerActionBehavior::CallFunc_GetTriggerActionBehavior_self_CastInput' has a wrong offset!");
