#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Base_Pressable_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Base_Pressable_BP.Base_Pressable_BP_C
// 0x0078 (0x02A8 - 0x0230)
class ABase_Pressable_BP_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GenericButtonMinus01;                              // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GenericButtonBaseMinus02;                          // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_ButtonPressedRatio_9ECD0E3B4E9BD439402C9E9C91933B4E; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_9ECD0E3B4E9BD439402C9E9C91933B4E; // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ButtonMaterial;                                    // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynMaterial;                                       // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ButtonColor;                                       // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PushedButtonColor;                                 // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StartAnimation;                                    // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          StopAnimation;                                     // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void SetButton(const struct FLinearColor& ButtonColor_0);
	void PushButton(bool Condition, bool SetColor);
	void Init();
	void Event_OnResetStage();
	void SetColor(bool Pushed);
	void ExecuteUbergraph_Base_Pressable_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Base_Pressable_BP_C">();
	}
	static class ABase_Pressable_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABase_Pressable_BP_C>();
	}
};
static_assert(alignof(ABase_Pressable_BP_C) == 0x000008, "Wrong alignment on ABase_Pressable_BP_C");
static_assert(sizeof(ABase_Pressable_BP_C) == 0x0002A8, "Wrong size on ABase_Pressable_BP_C");
static_assert(offsetof(ABase_Pressable_BP_C, UberGraphFrame) == 0x000230, "Member 'ABase_Pressable_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABase_Pressable_BP_C, PointLight) == 0x000238, "Member 'ABase_Pressable_BP_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABase_Pressable_BP_C, GenericButtonMinus01) == 0x000240, "Member 'ABase_Pressable_BP_C::GenericButtonMinus01' has a wrong offset!");
static_assert(offsetof(ABase_Pressable_BP_C, GenericButtonBaseMinus02) == 0x000248, "Member 'ABase_Pressable_BP_C::GenericButtonBaseMinus02' has a wrong offset!");
static_assert(offsetof(ABase_Pressable_BP_C, DefaultSceneRoot) == 0x000250, "Member 'ABase_Pressable_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABase_Pressable_BP_C, Timeline_0_ButtonPressedRatio_9ECD0E3B4E9BD439402C9E9C91933B4E) == 0x000258, "Member 'ABase_Pressable_BP_C::Timeline_0_ButtonPressedRatio_9ECD0E3B4E9BD439402C9E9C91933B4E' has a wrong offset!");
static_assert(offsetof(ABase_Pressable_BP_C, Timeline_0__Direction_9ECD0E3B4E9BD439402C9E9C91933B4E) == 0x00025C, "Member 'ABase_Pressable_BP_C::Timeline_0__Direction_9ECD0E3B4E9BD439402C9E9C91933B4E' has a wrong offset!");
static_assert(offsetof(ABase_Pressable_BP_C, Timeline_0) == 0x000260, "Member 'ABase_Pressable_BP_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABase_Pressable_BP_C, ButtonMaterial) == 0x000268, "Member 'ABase_Pressable_BP_C::ButtonMaterial' has a wrong offset!");
static_assert(offsetof(ABase_Pressable_BP_C, DynMaterial) == 0x000270, "Member 'ABase_Pressable_BP_C::DynMaterial' has a wrong offset!");
static_assert(offsetof(ABase_Pressable_BP_C, ButtonColor) == 0x000278, "Member 'ABase_Pressable_BP_C::ButtonColor' has a wrong offset!");
static_assert(offsetof(ABase_Pressable_BP_C, PushedButtonColor) == 0x000288, "Member 'ABase_Pressable_BP_C::PushedButtonColor' has a wrong offset!");
static_assert(offsetof(ABase_Pressable_BP_C, StartAnimation) == 0x000298, "Member 'ABase_Pressable_BP_C::StartAnimation' has a wrong offset!");
static_assert(offsetof(ABase_Pressable_BP_C, StopAnimation) == 0x0002A0, "Member 'ABase_Pressable_BP_C::StopAnimation' has a wrong offset!");

}

