#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Base_Button_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Base_Button_BP.Base_Button_BP_C.SetIfButtonSFXHasTail
// 0x0010 (0x0010 - 0x0000)
struct Base_Button_BP_C_SetIfButtonSFXHasTail final
{
public:
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_Button_BP_C_SetIfButtonSFXHasTail) == 0x000008, "Wrong alignment on Base_Button_BP_C_SetIfButtonSFXHasTail");
static_assert(sizeof(Base_Button_BP_C_SetIfButtonSFXHasTail) == 0x000010, "Wrong size on Base_Button_BP_C_SetIfButtonSFXHasTail");
static_assert(offsetof(Base_Button_BP_C_SetIfButtonSFXHasTail, CallFunc_SelectString_ReturnValue) == 0x000000, "Member 'Base_Button_BP_C_SetIfButtonSFXHasTail::CallFunc_SelectString_ReturnValue' has a wrong offset!");

// Function Base_Button_BP.Base_Button_BP_C.GetStopAnimation
// 0x0010 (0x0010 - 0x0000)
struct Base_Button_BP_C_GetStopAnimation final
{
public:
	class UAnimSequence*                          Anim;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_Button_BP_C_GetStopAnimation) == 0x000008, "Wrong alignment on Base_Button_BP_C_GetStopAnimation");
static_assert(sizeof(Base_Button_BP_C_GetStopAnimation) == 0x000010, "Wrong size on Base_Button_BP_C_GetStopAnimation");
static_assert(offsetof(Base_Button_BP_C_GetStopAnimation, Anim) == 0x000000, "Member 'Base_Button_BP_C_GetStopAnimation::Anim' has a wrong offset!");
static_assert(offsetof(Base_Button_BP_C_GetStopAnimation, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'Base_Button_BP_C_GetStopAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Base_Button_BP.Base_Button_BP_C.GetStartAnimation
// 0x0020 (0x0020 - 0x0000)
struct Base_Button_BP_C_GetStartAnimation final
{
public:
	class UAnimSequence*                          Anim;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABase_Pressable_BP_C*                   K2Node_DynamicCast_AsBase_Pressable_BP;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_Button_BP_C_GetStartAnimation) == 0x000008, "Wrong alignment on Base_Button_BP_C_GetStartAnimation");
static_assert(sizeof(Base_Button_BP_C_GetStartAnimation) == 0x000020, "Wrong size on Base_Button_BP_C_GetStartAnimation");
static_assert(offsetof(Base_Button_BP_C_GetStartAnimation, Anim) == 0x000000, "Member 'Base_Button_BP_C_GetStartAnimation::Anim' has a wrong offset!");
static_assert(offsetof(Base_Button_BP_C_GetStartAnimation, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'Base_Button_BP_C_GetStartAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Base_Button_BP_C_GetStartAnimation, K2Node_DynamicCast_AsBase_Pressable_BP) == 0x000010, "Member 'Base_Button_BP_C_GetStartAnimation::K2Node_DynamicCast_AsBase_Pressable_BP' has a wrong offset!");
static_assert(offsetof(Base_Button_BP_C_GetStartAnimation, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Base_Button_BP_C_GetStartAnimation::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Base_Button_BP.Base_Button_BP_C.OnButtonPressed_Internal
// 0x0001 (0x0001 - 0x0000)
struct Base_Button_BP_C_OnButtonPressed_Internal final
{
public:
	bool                                          Pressed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_Button_BP_C_OnButtonPressed_Internal) == 0x000001, "Wrong alignment on Base_Button_BP_C_OnButtonPressed_Internal");
static_assert(sizeof(Base_Button_BP_C_OnButtonPressed_Internal) == 0x000001, "Wrong size on Base_Button_BP_C_OnButtonPressed_Internal");
static_assert(offsetof(Base_Button_BP_C_OnButtonPressed_Internal, Pressed) == 0x000000, "Member 'Base_Button_BP_C_OnButtonPressed_Internal::Pressed' has a wrong offset!");

// Function Base_Button_BP.Base_Button_BP_C.InitChildButton
// 0x0010 (0x0010 - 0x0000)
struct Base_Button_BP_C_InitChildButton final
{
public:
	class ABase_Pressable_BP_C*                   K2Node_DynamicCast_AsBase_Pressable_BP;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_Button_BP_C_InitChildButton) == 0x000008, "Wrong alignment on Base_Button_BP_C_InitChildButton");
static_assert(sizeof(Base_Button_BP_C_InitChildButton) == 0x000010, "Wrong size on Base_Button_BP_C_InitChildButton");
static_assert(offsetof(Base_Button_BP_C_InitChildButton, K2Node_DynamicCast_AsBase_Pressable_BP) == 0x000000, "Member 'Base_Button_BP_C_InitChildButton::K2Node_DynamicCast_AsBase_Pressable_BP' has a wrong offset!");
static_assert(offsetof(Base_Button_BP_C_InitChildButton, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'Base_Button_BP_C_InitChildButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Base_Button_BP.Base_Button_BP_C.ExecuteUbergraph_Base_Button_BP
// 0x0004 (0x0004 - 0x0000)
struct Base_Button_BP_C_ExecuteUbergraph_Base_Button_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Base_Button_BP_C_ExecuteUbergraph_Base_Button_BP) == 0x000004, "Wrong alignment on Base_Button_BP_C_ExecuteUbergraph_Base_Button_BP");
static_assert(sizeof(Base_Button_BP_C_ExecuteUbergraph_Base_Button_BP) == 0x000004, "Wrong size on Base_Button_BP_C_ExecuteUbergraph_Base_Button_BP");
static_assert(offsetof(Base_Button_BP_C_ExecuteUbergraph_Base_Button_BP, EntryPoint) == 0x000000, "Member 'Base_Button_BP_C_ExecuteUbergraph_Base_Button_BP::EntryPoint' has a wrong offset!");

// Function Base_Button_BP.Base_Button_BP_C.OnButtonPressed__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Base_Button_BP_C_OnButtonPressed__DelegateSignature final
{
public:
	bool                                          bPressed;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Base_Button_BP_C_OnButtonPressed__DelegateSignature) == 0x000001, "Wrong alignment on Base_Button_BP_C_OnButtonPressed__DelegateSignature");
static_assert(sizeof(Base_Button_BP_C_OnButtonPressed__DelegateSignature) == 0x000001, "Wrong size on Base_Button_BP_C_OnButtonPressed__DelegateSignature");
static_assert(offsetof(Base_Button_BP_C_OnButtonPressed__DelegateSignature, bPressed) == 0x000000, "Member 'Base_Button_BP_C_OnButtonPressed__DelegateSignature::bPressed' has a wrong offset!");

}

