#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BatteryMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SimpleMesh_Pickup_BP_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Battery-01_BP.Battery-01_BP_C
// 0x0040 (0x0AC0 - 0x0A80)
class ABatteryMinus01_BP_C : public ASimpleMesh_Pickup_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BatteryMinus01_BP_C;                // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Ngr_BatteryDestroyed;                              // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DestroyedVFXAnchor;                                // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_LensScale_64AFBFFE410614B7874B399354356EE1; // 0x0A98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_OverlayMulti_64AFBFFE410614B7874B399354356EE1; // 0x0A9C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_64AFBFFE410614B7874B399354356EE1; // 0x0AA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA1[0x7];                                      // 0x0AA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBurned;                                           // 0x0AB0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void PlayBurnedSFX();
	void PlayBurnedVFX();
	void OnRep_bBurned();
	void SetBurned(bool bNewBurnedState);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void OnConsumeItemCancelledNotify(class ARBPawn* Pawn);
	void OnConsumeItemStartNotify(class ARBPawn* Pawn);
	void ExecuteUbergraph_BatteryMinus01_BP(int32 EntryPoint);

	bool CanBeActivedInSpectra(const class ARBSpectraSkill* SpectraOwner) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Battery-01_BP_C">();
	}
	static class ABatteryMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABatteryMinus01_BP_C>();
	}
};
static_assert(alignof(ABatteryMinus01_BP_C) == 0x000010, "Wrong alignment on ABatteryMinus01_BP_C");
static_assert(sizeof(ABatteryMinus01_BP_C) == 0x000AC0, "Wrong size on ABatteryMinus01_BP_C");
static_assert(offsetof(ABatteryMinus01_BP_C, UberGraphFrame_BatteryMinus01_BP_C) == 0x000A80, "Member 'ABatteryMinus01_BP_C::UberGraphFrame_BatteryMinus01_BP_C' has a wrong offset!");
static_assert(offsetof(ABatteryMinus01_BP_C, Ngr_BatteryDestroyed) == 0x000A88, "Member 'ABatteryMinus01_BP_C::Ngr_BatteryDestroyed' has a wrong offset!");
static_assert(offsetof(ABatteryMinus01_BP_C, DestroyedVFXAnchor) == 0x000A90, "Member 'ABatteryMinus01_BP_C::DestroyedVFXAnchor' has a wrong offset!");
static_assert(offsetof(ABatteryMinus01_BP_C, Timeline_0_LensScale_64AFBFFE410614B7874B399354356EE1) == 0x000A98, "Member 'ABatteryMinus01_BP_C::Timeline_0_LensScale_64AFBFFE410614B7874B399354356EE1' has a wrong offset!");
static_assert(offsetof(ABatteryMinus01_BP_C, Timeline_0_OverlayMulti_64AFBFFE410614B7874B399354356EE1) == 0x000A9C, "Member 'ABatteryMinus01_BP_C::Timeline_0_OverlayMulti_64AFBFFE410614B7874B399354356EE1' has a wrong offset!");
static_assert(offsetof(ABatteryMinus01_BP_C, Timeline_0__Direction_64AFBFFE410614B7874B399354356EE1) == 0x000AA0, "Member 'ABatteryMinus01_BP_C::Timeline_0__Direction_64AFBFFE410614B7874B399354356EE1' has a wrong offset!");
static_assert(offsetof(ABatteryMinus01_BP_C, Timeline_0) == 0x000AA8, "Member 'ABatteryMinus01_BP_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABatteryMinus01_BP_C, bBurned) == 0x000AB0, "Member 'ABatteryMinus01_BP_C::bBurned' has a wrong offset!");

}

