#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FX_ENV_AmbientDust

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FX_ENV_AmbientDust.BP_FX_ENV_AmbientDust_C.UserConstructionScript
// 0x00AC (0x00AC - 0x0000)
struct BP_FX_ENV_AmbientDust_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FX_ENV_AmbientDust_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_FX_ENV_AmbientDust_C_UserConstructionScript");
static_assert(sizeof(BP_FX_ENV_AmbientDust_C_UserConstructionScript) == 0x0000AC, "Wrong size on BP_FX_ENV_AmbientDust_C_UserConstructionScript");
static_assert(offsetof(BP_FX_ENV_AmbientDust_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000000, "Member 'BP_FX_ENV_AmbientDust_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_AmbientDust_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'BP_FX_ENV_AmbientDust_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_AmbientDust_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000010, "Member 'BP_FX_ENV_AmbientDust_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_AmbientDust_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000098, "Member 'BP_FX_ENV_AmbientDust_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_AmbientDust_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00009C, "Member 'BP_FX_ENV_AmbientDust_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_AmbientDust_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x0000A0, "Member 'BP_FX_ENV_AmbientDust_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

}

