#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FX_Trial_03_OPH_01_BloodSprayTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FX_Trial_03_OPH_01_BloodSprayTrigger.BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C.ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger
// 0x0138 (0x0138 - 0x0000)
struct BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0060(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x00E8(0x0010)(ReferenceParm)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_1; // 0x0120(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_5;          // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger) == 0x000008, "Wrong alignment on BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger");
static_assert(sizeof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger) == 0x000138, "Wrong size on BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, EntryPoint) == 0x000000, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, K2Node_MakeStruct_LinearColor) == 0x000004, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, K2Node_MakeStruct_LinearColor_1) == 0x000014, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, CallFunc_IsDedicatedServer_ReturnValue) == 0x000024, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, K2Node_MakeStruct_LinearColor_2) == 0x000028, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::K2Node_MakeStruct_LinearColor_2' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000038, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000039, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x00003A, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000040, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000048, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000050, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000058, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, K2Node_ComponentBoundEvent_bFromSweep) == 0x00005C, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, K2Node_ComponentBoundEvent_SweepResult) == 0x000060, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, CallFunc_GetOverlappingActors_OverlappingActors) == 0x0000E8, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000F8, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, K2Node_ComponentBoundEvent_OtherActor) == 0x000100, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, K2Node_ComponentBoundEvent_OtherComp) == 0x000108, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000110, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000114, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000118, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, CallFunc_GetOverlappingActors_OverlappingActors_1) == 0x000120, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::CallFunc_GetOverlappingActors_OverlappingActors_1' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, CallFunc_IsDedicatedServer_ReturnValue_4) == 0x000130, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::CallFunc_IsDedicatedServer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger, CallFunc_IsDedicatedServer_ReturnValue_5) == 0x000131, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger::CallFunc_IsDedicatedServer_ReturnValue_5' has a wrong offset!");

// Function BP_FX_Trial_03_OPH_01_BloodSprayTrigger.BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C.BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_FX_Trial_03_OPH_01_BloodSprayTrigger.BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C.BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_FX_Trial_03_OPH_01_BloodSprayTrigger.BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C.SetBloodOnKids
// 0x0038 (0x0038 - 0x0000)
struct BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids final
{
public:
	float                                         IncrementalValue;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACommunionKids_Base_BP_C*               K2Node_DynamicCast_AsCommunion_Kids_Base_BP;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids) == 0x000008, "Wrong alignment on BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids");
static_assert(sizeof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids) == 0x000038, "Wrong size on BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids, IncrementalValue) == 0x000000, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids::IncrementalValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids, K2Node_DynamicCast_AsCommunion_Kids_Base_BP) == 0x000028, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids::K2Node_DynamicCast_AsCommunion_Kids_Base_BP' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_SetBloodOnKids::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_FX_Trial_03_OPH_01_BloodSprayTrigger.BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C.Set Pressure
// 0x0010 (0x0010 - 0x0000)
struct BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_Set_Pressure final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_Set_Pressure) == 0x000004, "Wrong alignment on BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_Set_Pressure");
static_assert(sizeof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_Set_Pressure) == 0x000010, "Wrong size on BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_Set_Pressure");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_Set_Pressure, Value) == 0x000000, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_Set_Pressure::Value' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_Set_Pressure, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_Set_Pressure::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_Set_Pressure, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_Set_Pressure::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_Set_Pressure, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_Set_Pressure::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_FX_Trial_03_OPH_01_BloodSprayTrigger.BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

}

