#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FX_ENV_SteamPressureLow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FX_ENV_SteamPressureLow.BP_FX_ENV_SteamPressureLow_C
// 0x0048 (0x0278 - 0x0230)
class ABP_FX_ENV_SteamPressureLow_C final : public ARBClientOnlyActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      RBSound;                                           // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SteamPtc;                                          // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SteamSizeScale;                                    // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZoneLength;                                        // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SteamColor;                                        // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldPlayAirDuctSFX;                             // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_FX_ENV_SteamPressureLow(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FX_ENV_SteamPressureLow_C">();
	}
	static class ABP_FX_ENV_SteamPressureLow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FX_ENV_SteamPressureLow_C>();
	}
};
static_assert(alignof(ABP_FX_ENV_SteamPressureLow_C) == 0x000008, "Wrong alignment on ABP_FX_ENV_SteamPressureLow_C");
static_assert(sizeof(ABP_FX_ENV_SteamPressureLow_C) == 0x000278, "Wrong size on ABP_FX_ENV_SteamPressureLow_C");
static_assert(offsetof(ABP_FX_ENV_SteamPressureLow_C, UberGraphFrame) == 0x000230, "Member 'ABP_FX_ENV_SteamPressureLow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureLow_C, Arrow) == 0x000238, "Member 'ABP_FX_ENV_SteamPressureLow_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureLow_C, RBSound) == 0x000240, "Member 'ABP_FX_ENV_SteamPressureLow_C::RBSound' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureLow_C, SteamPtc) == 0x000248, "Member 'ABP_FX_ENV_SteamPressureLow_C::SteamPtc' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureLow_C, DefaultSceneRoot) == 0x000250, "Member 'ABP_FX_ENV_SteamPressureLow_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureLow_C, SteamSizeScale) == 0x000258, "Member 'ABP_FX_ENV_SteamPressureLow_C::SteamSizeScale' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureLow_C, ZoneLength) == 0x00025C, "Member 'ABP_FX_ENV_SteamPressureLow_C::ZoneLength' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureLow_C, SteamColor) == 0x000260, "Member 'ABP_FX_ENV_SteamPressureLow_C::SteamColor' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_SteamPressureLow_C, bShouldPlayAirDuctSFX) == 0x000270, "Member 'ABP_FX_ENV_SteamPressureLow_C::bShouldPlayAirDuctSFX' has a wrong offset!");

}

