#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FX_Parent_Triggerable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FX_Parent_Triggerable.BP_FX_Parent_Triggerable_C
// 0x0030 (0x0450 - 0x0420)
class ABP_FX_Parent_Triggerable_C : public ARBTriggerable
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        DebugCenter;                                       // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr;                                               // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      Sound;                                             // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void StopSound();
	void PlaySound();
	void UserConstructionScript();
	void Event_OnTriggered();
	void Event_OnUntriggered();
	void Event_SnapToState();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_FX_Parent_Triggerable(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FX_Parent_Triggerable_C">();
	}
	static class ABP_FX_Parent_Triggerable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FX_Parent_Triggerable_C>();
	}
};
static_assert(alignof(ABP_FX_Parent_Triggerable_C) == 0x000010, "Wrong alignment on ABP_FX_Parent_Triggerable_C");
static_assert(sizeof(ABP_FX_Parent_Triggerable_C) == 0x000450, "Wrong size on ABP_FX_Parent_Triggerable_C");
static_assert(offsetof(ABP_FX_Parent_Triggerable_C, UberGraphFrame) == 0x000420, "Member 'ABP_FX_Parent_Triggerable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FX_Parent_Triggerable_C, Billboard) == 0x000428, "Member 'ABP_FX_Parent_Triggerable_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_FX_Parent_Triggerable_C, DebugCenter) == 0x000430, "Member 'ABP_FX_Parent_Triggerable_C::DebugCenter' has a wrong offset!");
static_assert(offsetof(ABP_FX_Parent_Triggerable_C, Ngr) == 0x000438, "Member 'ABP_FX_Parent_Triggerable_C::Ngr' has a wrong offset!");
static_assert(offsetof(ABP_FX_Parent_Triggerable_C, Sound) == 0x000440, "Member 'ABP_FX_Parent_Triggerable_C::Sound' has a wrong offset!");
static_assert(offsetof(ABP_FX_Parent_Triggerable_C, Root) == 0x000448, "Member 'ABP_FX_Parent_Triggerable_C::Root' has a wrong offset!");

}

