#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FX_ENV_WaterLeakDroplet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FX_ENV_WaterLeakDroplet.BP_FX_ENV_WaterLeakDroplet_C.UserConstructionScript
// 0x00B8 (0x00B8 - 0x0000)
struct BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x000C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_1;         // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript");
static_assert(sizeof(BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript) == 0x0000B8, "Wrong size on BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript");
static_assert(offsetof(BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000000, "Member 'BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00000C, "Member 'BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript, CallFunc_Divide_VectorFloat_ReturnValue_1) == 0x000094, "Member 'BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript::CallFunc_Divide_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x0000A0, "Member 'BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000AC, "Member 'BP_FX_ENV_WaterLeakDroplet_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function BP_FX_ENV_WaterLeakDroplet.BP_FX_ENV_WaterLeakDroplet_C.ExecuteUbergraph_BP_FX_ENV_WaterLeakDroplet
// 0x000C (0x000C - 0x0000)
struct BP_FX_ENV_WaterLeakDroplet_C_ExecuteUbergraph_BP_FX_ENV_WaterLeakDroplet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FX_ENV_WaterLeakDroplet_C_ExecuteUbergraph_BP_FX_ENV_WaterLeakDroplet) == 0x000004, "Wrong alignment on BP_FX_ENV_WaterLeakDroplet_C_ExecuteUbergraph_BP_FX_ENV_WaterLeakDroplet");
static_assert(sizeof(BP_FX_ENV_WaterLeakDroplet_C_ExecuteUbergraph_BP_FX_ENV_WaterLeakDroplet) == 0x00000C, "Wrong size on BP_FX_ENV_WaterLeakDroplet_C_ExecuteUbergraph_BP_FX_ENV_WaterLeakDroplet");
static_assert(offsetof(BP_FX_ENV_WaterLeakDroplet_C_ExecuteUbergraph_BP_FX_ENV_WaterLeakDroplet, EntryPoint) == 0x000000, "Member 'BP_FX_ENV_WaterLeakDroplet_C_ExecuteUbergraph_BP_FX_ENV_WaterLeakDroplet::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_WaterLeakDroplet_C_ExecuteUbergraph_BP_FX_ENV_WaterLeakDroplet, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_FX_ENV_WaterLeakDroplet_C_ExecuteUbergraph_BP_FX_ENV_WaterLeakDroplet::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_WaterLeakDroplet_C_ExecuteUbergraph_BP_FX_ENV_WaterLeakDroplet, CallFunc_FMin_ReturnValue) == 0x000008, "Member 'BP_FX_ENV_WaterLeakDroplet_C_ExecuteUbergraph_BP_FX_ENV_WaterLeakDroplet::CallFunc_FMin_ReturnValue' has a wrong offset!");

}

