#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FX_Trial_03_OPH_01_BloodSprayTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_FX_Parent_Triggerable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FX_Trial_03_OPH_01_BloodSprayTrigger.BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C
// 0x0060 (0x04B0 - 0x0450)
class ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C final : public ABP_FX_Parent_Triggerable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C; // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Capsule;                                           // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        BloodDecal;                                        // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ConeInner;                                         // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ConeOuter;                                         // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BloodRainOn_BloodOnKid_B8FE3A6A469324D771363BA25A45FDF1; // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BloodRainOn_RainBloodMesh_B8FE3A6A469324D771363BA25A45FDF1; // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BloodRainOn_DecalBlood_B8FE3A6A469324D771363BA25A45FDF1; // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BloodRainOn__Direction_B8FE3A6A469324D771363BA25A45FDF1; // 0x0484(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_485[0x3];                                      // 0x0485(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     BloodRainOn;                                       // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Kids;                                              // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          NewVar_0;                                          // 0x04A8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bBloodDecalVisible;                                // 0x04A9(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnWorldPopulateFinished();
	void ExecuteUbergraph_BP_FX_Trial_03_OPH_01_BloodSprayTrigger(int32 EntryPoint);
	void SetBloodOn();
	void ReceiveBeginPlay();
	void BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_FX_Trial_03_OPH_01_BloodSprayTrigger_Capsule_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Event_OnResetStage();
	void Event_OnUntriggered();
	void Event_OnTriggered();
	void OnWorldFullyLoaded();
	void BloodRainOn__UpdateFunc();
	void BloodRainOn__FinishedFunc();
	void UserConstructionScript();
	void SetBloodOnKids(float IncrementalValue);
	void Set_Pressure(float Value);
	bool OnWorldPopulateFinishedTimeSliced();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C">();
	}
	static class ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C>();
	}
};
static_assert(alignof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C) == 0x000010, "Wrong alignment on ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C");
static_assert(sizeof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C) == 0x0004B0, "Wrong size on ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C");
static_assert(offsetof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C, UberGraphFrame_BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C) == 0x000450, "Member 'ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C::UberGraphFrame_BP_FX_Trial_03_OPH_01_BloodSprayTrigger_C' has a wrong offset!");
static_assert(offsetof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C, Capsule) == 0x000458, "Member 'ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C::Capsule' has a wrong offset!");
static_assert(offsetof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C, BloodDecal) == 0x000460, "Member 'ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C::BloodDecal' has a wrong offset!");
static_assert(offsetof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C, ConeInner) == 0x000468, "Member 'ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C::ConeInner' has a wrong offset!");
static_assert(offsetof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C, ConeOuter) == 0x000470, "Member 'ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C::ConeOuter' has a wrong offset!");
static_assert(offsetof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C, BloodRainOn_BloodOnKid_B8FE3A6A469324D771363BA25A45FDF1) == 0x000478, "Member 'ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C::BloodRainOn_BloodOnKid_B8FE3A6A469324D771363BA25A45FDF1' has a wrong offset!");
static_assert(offsetof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C, BloodRainOn_RainBloodMesh_B8FE3A6A469324D771363BA25A45FDF1) == 0x00047C, "Member 'ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C::BloodRainOn_RainBloodMesh_B8FE3A6A469324D771363BA25A45FDF1' has a wrong offset!");
static_assert(offsetof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C, BloodRainOn_DecalBlood_B8FE3A6A469324D771363BA25A45FDF1) == 0x000480, "Member 'ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C::BloodRainOn_DecalBlood_B8FE3A6A469324D771363BA25A45FDF1' has a wrong offset!");
static_assert(offsetof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C, BloodRainOn__Direction_B8FE3A6A469324D771363BA25A45FDF1) == 0x000484, "Member 'ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C::BloodRainOn__Direction_B8FE3A6A469324D771363BA25A45FDF1' has a wrong offset!");
static_assert(offsetof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C, BloodRainOn) == 0x000488, "Member 'ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C::BloodRainOn' has a wrong offset!");
static_assert(offsetof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C, Time) == 0x000490, "Member 'ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C::Time' has a wrong offset!");
static_assert(offsetof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C, Kids) == 0x000498, "Member 'ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C::Kids' has a wrong offset!");
static_assert(offsetof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C, NewVar_0) == 0x0004A8, "Member 'ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C, bBloodDecalVisible) == 0x0004A9, "Member 'ABP_FX_Trial_03_OPH_01_BloodSprayTrigger_C::bBloodDecalVisible' has a wrong offset!");

}

