#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FX_ENV_AmbientDust

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FX_ENV_AmbientDust.BP_FX_ENV_AmbientDust_C
// 0x0050 (0x0280 - 0x0230)
class ABP_FX_ENV_AmbientDust_C final : public ARBClientOnlyActor
{
public:
	class UStaticMeshComponent*                   DebugArrow;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      DustCone;                                          // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      DustSphere;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_ConeShape;                                     // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Use_SphereShape;                                   // 0x0251(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpawnRateSphere;                                   // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SphereEmitterRadius;                               // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ConeAngle;                                         // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ConeFar;                                           // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnRateCone;                                     // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DustSize;                                          // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DustColor;                                         // 0x026C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ConeShapeBiasRadius;                               // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FX_ENV_AmbientDust_C">();
	}
	static class ABP_FX_ENV_AmbientDust_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FX_ENV_AmbientDust_C>();
	}
};
static_assert(alignof(ABP_FX_ENV_AmbientDust_C) == 0x000008, "Wrong alignment on ABP_FX_ENV_AmbientDust_C");
static_assert(sizeof(ABP_FX_ENV_AmbientDust_C) == 0x000280, "Wrong size on ABP_FX_ENV_AmbientDust_C");
static_assert(offsetof(ABP_FX_ENV_AmbientDust_C, DebugArrow) == 0x000230, "Member 'ABP_FX_ENV_AmbientDust_C::DebugArrow' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_AmbientDust_C, DustCone) == 0x000238, "Member 'ABP_FX_ENV_AmbientDust_C::DustCone' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_AmbientDust_C, DustSphere) == 0x000240, "Member 'ABP_FX_ENV_AmbientDust_C::DustSphere' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_AmbientDust_C, DefaultSceneRoot) == 0x000248, "Member 'ABP_FX_ENV_AmbientDust_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_AmbientDust_C, Use_ConeShape) == 0x000250, "Member 'ABP_FX_ENV_AmbientDust_C::Use_ConeShape' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_AmbientDust_C, Use_SphereShape) == 0x000251, "Member 'ABP_FX_ENV_AmbientDust_C::Use_SphereShape' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_AmbientDust_C, SpawnRateSphere) == 0x000254, "Member 'ABP_FX_ENV_AmbientDust_C::SpawnRateSphere' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_AmbientDust_C, SphereEmitterRadius) == 0x000258, "Member 'ABP_FX_ENV_AmbientDust_C::SphereEmitterRadius' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_AmbientDust_C, ConeAngle) == 0x00025C, "Member 'ABP_FX_ENV_AmbientDust_C::ConeAngle' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_AmbientDust_C, ConeFar) == 0x000260, "Member 'ABP_FX_ENV_AmbientDust_C::ConeFar' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_AmbientDust_C, SpawnRateCone) == 0x000264, "Member 'ABP_FX_ENV_AmbientDust_C::SpawnRateCone' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_AmbientDust_C, DustSize) == 0x000268, "Member 'ABP_FX_ENV_AmbientDust_C::DustSize' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_AmbientDust_C, DustColor) == 0x00026C, "Member 'ABP_FX_ENV_AmbientDust_C::DustColor' has a wrong offset!");
static_assert(offsetof(ABP_FX_ENV_AmbientDust_C, ConeShapeBiasRadius) == 0x00027C, "Member 'ABP_FX_ENV_AmbientDust_C::ConeShapeBiasRadius' has a wrong offset!");

}

