#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FX_ENV_LabDeviceShockBurst

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FX_ENV_LabDeviceShockBurst.BP_FX_ENV_LabDeviceShockBurst_C.ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst
// 0x0048 (0x0048 - 0x0000)
struct BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst) == 0x000008, "Wrong alignment on BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst");
static_assert(sizeof(BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst) == 0x000048, "Wrong size on BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst");
static_assert(offsetof(BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst, EntryPoint) == 0x000000, "Member 'BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst, Temp_struct_Variable) == 0x000008, "Member 'BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst, Temp_delegate_Variable) == 0x000028, "Member 'BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst, CallFunc_PostAkEvent_ReturnValue) == 0x000040, "Member 'BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst, CallFunc_IsDedicatedServer_ReturnValue) == 0x000044, "Member 'BP_FX_ENV_LabDeviceShockBurst_C_ExecuteUbergraph_BP_FX_ENV_LabDeviceShockBurst::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

}

