#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPF_FX_Footstep_Spectre_PhyxMatTag

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPF_FX_Footstep_Spectre_PhyxMatTag.BPF_FX_Footstep_Spectre_PhyxMatTag_C.Footstep FX Spectre
// 0x00B0 (0x00B0 - 0x0000)
struct BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre final
{
public:
	struct FFootstepData                          Footstep_data;                                     // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class ARBPawn*                                Rb_pawn;                                           // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ForwardVector;                                     // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPhysicalMaterial*>              PhyxMat_Array;                                     // 0x0058(0x0010)(Edit, BlueprintVisible)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_3;      // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPhysicalMaterial*>              K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
};
static_assert(alignof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre) == 0x000008, "Wrong alignment on BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre");
static_assert(sizeof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre) == 0x0000B0, "Wrong size on BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, Footstep_data) == 0x000000, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::Footstep_data' has a wrong offset!");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, Rb_pawn) == 0x000038, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::Rb_pawn' has a wrong offset!");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, ForwardVector) == 0x000040, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::ForwardVector' has a wrong offset!");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, __WorldContext) == 0x000050, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, PhyxMat_Array) == 0x000058, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::PhyxMat_Array' has a wrong offset!");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000068, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, CallFunc_Array_Find_ReturnValue) == 0x000074, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, CallFunc_Array_Contains_ReturnValue) == 0x000078, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, K2Node_SwitchInteger_CmpSuccess) == 0x000079, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, K2Node_SwitchInteger_CmpSuccess_1) == 0x00007A, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000080, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000088, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, CallFunc_SpawnSystemAtLocation_ReturnValue_2) == 0x000090, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::CallFunc_SpawnSystemAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, CallFunc_SpawnSystemAtLocation_ReturnValue_3) == 0x000098, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::CallFunc_SpawnSystemAtLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre, K2Node_MakeArray_Array) == 0x0000A0, "Member 'BPF_FX_Footstep_Spectre_PhyxMatTag_C_Footstep_FX_Spectre::K2Node_MakeArray_Array' has a wrong offset!");

}

