#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPF_FX_Weapon_Shotgun_PhyxMatTag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPF_FX_Weapon_Shotgun_PhyxMatTag.BPF_FX_Weapon_Shotgun_PhyxMatTag_C.Weapon Shotgun Impact FX
// 0x0268 (0x0268 - 0x0000)
struct BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX final
{
public:
	struct FHitResult                             OnHitResult;                                       // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_MinLifeSpan;                                 // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_MaxLifeSpan;                                 // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     WoodDecal_02;                                      // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     WoodDecal_01;                                      // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               HitSurfaceNormalRotation;                          // 0x00A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                HitSurfaceNormal;                                  // 0x00B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x00C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DecalSizeMin;                                      // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DecalSizeMax;                                      // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicalMaterial*>              PhyxMatArray;                                      // 0x00D8(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UPhysicalMaterial*>              K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_5;         // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_6;         // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_1;       // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_2;      // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_3;      // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_7;         // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_8;         // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_2;            // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue_2;       // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX) == 0x000008, "Wrong alignment on BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX");
static_assert(sizeof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX) == 0x000268, "Wrong size on BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, OnHitResult) == 0x000000, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::OnHitResult' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, __WorldContext) == 0x000088, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, Decal_MinLifeSpan) == 0x000090, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::Decal_MinLifeSpan' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, Decal_MaxLifeSpan) == 0x000094, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::Decal_MaxLifeSpan' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, WoodDecal_02) == 0x000098, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::WoodDecal_02' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, WoodDecal_01) == 0x0000A0, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::WoodDecal_01' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, HitSurfaceNormalRotation) == 0x0000A8, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::HitSurfaceNormalRotation' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, HitSurfaceNormal) == 0x0000B4, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::HitSurfaceNormal' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, HitLocation) == 0x0000C0, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::HitLocation' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, DecalSizeMin) == 0x0000CC, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::DecalSizeMin' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, DecalSizeMax) == 0x0000D0, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::DecalSizeMax' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, PhyxMatArray) == 0x0000D8, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::PhyxMatArray' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000E8, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_bBlockingHit) == 0x0000E9, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000EA, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_Time) == 0x0000EC, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_Distance) == 0x0000F0, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_Location) == 0x0000F4, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_ImpactPoint) == 0x000100, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_Normal) == 0x00010C, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_ImpactNormal) == 0x000118, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_PhysMat) == 0x000128, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_HitActor) == 0x000130, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_HitComponent) == 0x000138, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_HitBoneName) == 0x000140, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_HitItem) == 0x000148, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_ElementIndex) == 0x00014C, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_FaceIndex) == 0x000150, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_TraceStart) == 0x000154, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_BreakHitResult_TraceEnd) == 0x000160, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00016C, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, K2Node_MakeArray_Array) == 0x000178, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_RandomFloatInRange_ReturnValue) == 0x000188, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00018C, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000190, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_MakeVector_ReturnValue) == 0x000198, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0001A4, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_MakeRotator_ReturnValue) == 0x0001A8, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_ComposeRotators_ReturnValue) == 0x0001B4, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x0001C0, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x0001C8, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_RandomFloatInRange_ReturnValue_4) == 0x0001D0, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_RandomFloatInRange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x0001D8, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_MakeVector_ReturnValue_1) == 0x0001E0, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_RandomFloatInRange_ReturnValue_5) == 0x0001EC, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_RandomFloatInRange_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_MakeRotator_ReturnValue_1) == 0x0001F0, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_ComposeRotators_ReturnValue_1) == 0x0001FC, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_RandomFloatInRange_ReturnValue_6) == 0x000208, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_RandomFloatInRange_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_SpawnDecalAtLocation_ReturnValue_1) == 0x000210, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_SpawnDecalAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_SpawnSystemAtLocation_ReturnValue_2) == 0x000218, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_SpawnSystemAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_SpawnSystemAtLocation_ReturnValue_3) == 0x000220, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_SpawnSystemAtLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_RandomFloatInRange_ReturnValue_7) == 0x000228, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_RandomFloatInRange_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_Array_Find_ReturnValue) == 0x00022C, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_MakeVector_ReturnValue_2) == 0x000230, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, K2Node_SwitchInteger_CmpSuccess) == 0x00023C, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_RandomFloatInRange_ReturnValue_8) == 0x000240, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_RandomFloatInRange_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_MakeRotator_ReturnValue_2) == 0x000244, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_ComposeRotators_ReturnValue_2) == 0x000250, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_ComposeRotators_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX, CallFunc_SpawnDecalAtLocation_ReturnValue_2) == 0x000260, "Member 'BPF_FX_Weapon_Shotgun_PhyxMatTag_C_Weapon_Shotgun_Impact_FX::CallFunc_SpawnDecalAtLocation_ReturnValue_2' has a wrong offset!");

}

