#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Brick_Weapon_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Brick_Weapon_BP.Brick_Weapon_BP_C.ExecuteUbergraph_Brick_Weapon_BP
// 0x00C0 (0x00C0 - 0x0000)
struct Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP) == 0x000010, "Wrong alignment on Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP");
static_assert(sizeof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP) == 0x0000C0, "Wrong size on Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, EntryPoint) == 0x000000, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, Temp_struct_Variable) == 0x000008, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, Temp_delegate_Variable) == 0x00001C, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, CallFunc_Subtract_IntInt_ReturnValue) == 0x00002C, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, CallFunc_PostAkEvent_ReturnValue) == 0x000030, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, CallFunc_GetTransform_ReturnValue) == 0x000040, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, CallFunc_Min_ReturnValue) == 0x000070, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, CallFunc_BreakTransform_Location) == 0x000074, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, CallFunc_BreakTransform_Rotation) == 0x000080, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, CallFunc_BreakTransform_Scale) == 0x00008C, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, CallFunc_Array_Get_Item) == 0x000098, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, CallFunc_SetStaticMesh_ReturnValue) == 0x0000A8, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0000B0, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'Brick_Weapon_BP_C_ExecuteUbergraph_Brick_Weapon_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Brick_Weapon_BP.Brick_Weapon_BP_C.GetSecondaryInteractionZoneBox
// 0x0008 (0x0008 - 0x0000)
struct Brick_Weapon_BP_C_GetSecondaryInteractionZoneBox final
{
public:
	class URBInteractionZoneComponent*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Brick_Weapon_BP_C_GetSecondaryInteractionZoneBox) == 0x000008, "Wrong alignment on Brick_Weapon_BP_C_GetSecondaryInteractionZoneBox");
static_assert(sizeof(Brick_Weapon_BP_C_GetSecondaryInteractionZoneBox) == 0x000008, "Wrong size on Brick_Weapon_BP_C_GetSecondaryInteractionZoneBox");
static_assert(offsetof(Brick_Weapon_BP_C_GetSecondaryInteractionZoneBox, ReturnValue) == 0x000000, "Member 'Brick_Weapon_BP_C_GetSecondaryInteractionZoneBox::ReturnValue' has a wrong offset!");

}

