#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CaptureTextureDepth

#include "Basic.hpp"

#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass captureTextureDepth.captureTextureDepth_C
// 0x0060 (0x0480 - 0x0420)
class ACaptureTextureDepth_C final : public ARBTriggerable
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCapture2D;                                    // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Bias;                                              // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ortho_Width;                                       // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProjectionSymbol_BP_C*                 ProjectionSymboleBP;                               // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 TexturePath;                                       // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 TextureName;                                       // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class AActor>>          Actors;                                            // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Hide_Actors(bool bHidden_0, TArray<TSoftObjectPtr<class AActor>>& Actors1);
	void Checkoutfile(const class FString& PathName, const class FString& Texture);
	void Export_Depth_Texture(float Custom_Near_Clipping_Plane, float Custom_Far_Clipping_Plane, float Ortho_Width_0, const class FString& TexturePath_0, const class FString& TextureName_0, TArray<TSoftObjectPtr<class AActor>>& Actors1, float FOV);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"captureTextureDepth_C">();
	}
	static class ACaptureTextureDepth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACaptureTextureDepth_C>();
	}
};
static_assert(alignof(ACaptureTextureDepth_C) == 0x000010, "Wrong alignment on ACaptureTextureDepth_C");
static_assert(sizeof(ACaptureTextureDepth_C) == 0x000480, "Wrong size on ACaptureTextureDepth_C");
static_assert(offsetof(ACaptureTextureDepth_C, SceneCaptureComponent2D) == 0x000420, "Member 'ACaptureTextureDepth_C::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(ACaptureTextureDepth_C, DefaultSceneRoot) == 0x000428, "Member 'ACaptureTextureDepth_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACaptureTextureDepth_C, SceneCapture2D) == 0x000430, "Member 'ACaptureTextureDepth_C::SceneCapture2D' has a wrong offset!");
static_assert(offsetof(ACaptureTextureDepth_C, Bias) == 0x000438, "Member 'ACaptureTextureDepth_C::Bias' has a wrong offset!");
static_assert(offsetof(ACaptureTextureDepth_C, Ortho_Width) == 0x00043C, "Member 'ACaptureTextureDepth_C::Ortho_Width' has a wrong offset!");
static_assert(offsetof(ACaptureTextureDepth_C, ProjectionSymboleBP) == 0x000440, "Member 'ACaptureTextureDepth_C::ProjectionSymboleBP' has a wrong offset!");
static_assert(offsetof(ACaptureTextureDepth_C, TexturePath) == 0x000448, "Member 'ACaptureTextureDepth_C::TexturePath' has a wrong offset!");
static_assert(offsetof(ACaptureTextureDepth_C, TextureName) == 0x000458, "Member 'ACaptureTextureDepth_C::TextureName' has a wrong offset!");
static_assert(offsetof(ACaptureTextureDepth_C, Actors) == 0x000468, "Member 'ACaptureTextureDepth_C::Actors' has a wrong offset!");

}

