#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CaptureTextureDepth

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function captureTextureDepth.captureTextureDepth_C.Hide Actors
// 0x00E0 (0x00E0 - 0x0000)
struct CaptureTextureDepth_C_Hide_Actors final
{
public:
	bool                                          bHidden_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class AActor>>          Actors1;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item;                           // 0x0040(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADoorBase_BP_C*                         K2Node_DynamicCast_AsDoor_Base_BP;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllChildActors_ChildActors;            // 0x0090(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AParent_DestructibleDoor_BP_C*          K2Node_DynamicCast_AsParent_Destructible_Door_BP;  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x00C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_2;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CaptureTextureDepth_C_Hide_Actors) == 0x000008, "Wrong alignment on CaptureTextureDepth_C_Hide_Actors");
static_assert(sizeof(CaptureTextureDepth_C_Hide_Actors) == 0x0000E0, "Wrong size on CaptureTextureDepth_C_Hide_Actors");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, bHidden_0) == 0x000000, "Member 'CaptureTextureDepth_C_Hide_Actors::bHidden_0' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, Actors1) == 0x000008, "Member 'CaptureTextureDepth_C_Hide_Actors::Actors1' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'CaptureTextureDepth_C_Hide_Actors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, Temp_int_Array_Index_Variable) == 0x000024, "Member 'CaptureTextureDepth_C_Hide_Actors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'CaptureTextureDepth_C_Hide_Actors::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'CaptureTextureDepth_C_Hide_Actors::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, Temp_int_Array_Index_Variable_2) == 0x000038, "Member 'CaptureTextureDepth_C_Hide_Actors::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_Array_Get_Item) == 0x000040, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000068, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, K2Node_DynamicCast_AsActor) == 0x000070, "Member 'CaptureTextureDepth_C_Hide_Actors::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'CaptureTextureDepth_C_Hide_Actors::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, K2Node_DynamicCast_AsDoor_Base_BP) == 0x000080, "Member 'CaptureTextureDepth_C_Hide_Actors::K2Node_DynamicCast_AsDoor_Base_BP' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'CaptureTextureDepth_C_Hide_Actors::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, Temp_int_Loop_Counter_Variable_2) == 0x00008C, "Member 'CaptureTextureDepth_C_Hide_Actors::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_GetAllChildActors_ChildActors) == 0x000090, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_GetAllChildActors_ChildActors' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, K2Node_DynamicCast_AsParent_Destructible_Door_BP) == 0x0000B0, "Member 'CaptureTextureDepth_C_Hide_Actors::K2Node_DynamicCast_AsParent_Destructible_Door_BP' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'CaptureTextureDepth_C_Hide_Actors::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B9, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000BC, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x0000C0, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_Array_Get_Item_2) == 0x0000D0, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_Array_Length_ReturnValue_2) == 0x0000D8, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Hide_Actors, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000DC, "Member 'CaptureTextureDepth_C_Hide_Actors::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function captureTextureDepth.captureTextureDepth_C.checkoutfile
// 0x0140 (0x0140 - 0x0000)
struct CaptureTextureDepth_C_Checkoutfile final
{
public:
	class FString                                 PathName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Texture;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetProjectDirectory_ReturnValue;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckOutFile_ReturnValue;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAssetRegistry>        CallFunc_GetAssetRegistry_ReturnValue;             // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	struct FAssetData                             CallFunc_GetAssetByObjectPath_ReturnValue;         // 0x00D0(0x0060)(HasGetValueTypeHash)
	class UObject*                                CallFunc_GetAsset_ReturnValue;                     // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CaptureTextureDepth_C_Checkoutfile) == 0x000008, "Wrong alignment on CaptureTextureDepth_C_Checkoutfile");
static_assert(sizeof(CaptureTextureDepth_C_Checkoutfile) == 0x000140, "Wrong size on CaptureTextureDepth_C_Checkoutfile");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, PathName) == 0x000000, "Member 'CaptureTextureDepth_C_Checkoutfile::PathName' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, Texture) == 0x000010, "Member 'CaptureTextureDepth_C_Checkoutfile::Texture' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_GetSubstring_ReturnValue) == 0x000020, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_GetProjectDirectory_ReturnValue) == 0x000040, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_GetProjectDirectory_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000060, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000070, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000080, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000090, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_Concat_StrStr_ReturnValue_6) == 0x0000A0, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_Conv_StringToName_ReturnValue) == 0x0000B0, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_CheckOutFile_ReturnValue) == 0x0000B8, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_CheckOutFile_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_GetAssetRegistry_ReturnValue) == 0x0000C0, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_GetAssetRegistry_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_GetAssetByObjectPath_ReturnValue) == 0x0000D0, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_GetAssetByObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_GetAsset_ReturnValue) == 0x000130, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_GetAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Checkoutfile, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'CaptureTextureDepth_C_Checkoutfile::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function captureTextureDepth.captureTextureDepth_C.Export Depth Texture
// 0x0170 (0x0170 - 0x0000)
struct CaptureTextureDepth_C_Export_Depth_Texture final
{
public:
	float                                         Custom_Near_Clipping_Plane;                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Custom_Far_Clipping_Plane;                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ortho_Width_0;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TexturePath_0;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TextureName_0;                                     // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class AActor>>          Actors1;                                           // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         FOV;                                               // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CustomFarClippingPlane;                            // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               ScreneCapture;                                     // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetProjectDirectory_ReturnValue;          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatrix                                CallFunc_GetViewProjectionMatrix_ReturnValue;      // 0x00D0(0x0040)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ImportTexture_ReturnValue;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0124(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0134(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0x0144(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_3;                   // 0x0154(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CaptureTextureDepth_C_Export_Depth_Texture) == 0x000010, "Wrong alignment on CaptureTextureDepth_C_Export_Depth_Texture");
static_assert(sizeof(CaptureTextureDepth_C_Export_Depth_Texture) == 0x000170, "Wrong size on CaptureTextureDepth_C_Export_Depth_Texture");
static_assert(offsetof(CaptureTextureDepth_C_Export_Depth_Texture, Custom_Near_Clipping_Plane) == 0x000000, "Member 'CaptureTextureDepth_C_Export_Depth_Texture::Custom_Near_Clipping_Plane' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Export_Depth_Texture, Custom_Far_Clipping_Plane) == 0x000004, "Member 'CaptureTextureDepth_C_Export_Depth_Texture::Custom_Far_Clipping_Plane' has a wrong offset!");
static_assert(offsetof(CaptureTextureDepth_C_Export_Depth_Texture, Ortho_Width_0) == 0x000008, "Member 'CaptureTextureDepth_C_Export_Depth_Texture::Ortho_Width_0' has a wrong offset!");
