#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Carpet_LinearMinus01MinusBP

#include "Basic.hpp"

#include "ModuleMeshData_structs.hpp"
#include "MeshPopulateDirection_structs.hpp"
#include "MeshPopulate_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Carpet_Linear-01-BP.Carpet_Linear-01-BP_C
// 0x0028 (0x03F8 - 0x03D0)
class ACarpet_LinearMinus01MinusBP_C final : public AMeshPopulate_Parent_C
{
public:
	TArray<struct FModuleMeshData>                CarpetMeshes;                                      // 0x03D0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FModuleMeshData>                CarpetEndMeshes;                                   // 0x03E0(0x0010)(Edit, BlueprintVisible)
	bool                                          UseCarpetEnd;                                      // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EMeshPopulateDirection                        Direction;                                         // 0x03F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Carpet_Linear-01-BP_C">();
	}
	static class ACarpet_LinearMinus01MinusBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACarpet_LinearMinus01MinusBP_C>();
	}
};
static_assert(alignof(ACarpet_LinearMinus01MinusBP_C) == 0x000008, "Wrong alignment on ACarpet_LinearMinus01MinusBP_C");
static_assert(sizeof(ACarpet_LinearMinus01MinusBP_C) == 0x0003F8, "Wrong size on ACarpet_LinearMinus01MinusBP_C");
static_assert(offsetof(ACarpet_LinearMinus01MinusBP_C, CarpetMeshes) == 0x0003D0, "Member 'ACarpet_LinearMinus01MinusBP_C::CarpetMeshes' has a wrong offset!");
static_assert(offsetof(ACarpet_LinearMinus01MinusBP_C, CarpetEndMeshes) == 0x0003E0, "Member 'ACarpet_LinearMinus01MinusBP_C::CarpetEndMeshes' has a wrong offset!");
static_assert(offsetof(ACarpet_LinearMinus01MinusBP_C, UseCarpetEnd) == 0x0003F0, "Member 'ACarpet_LinearMinus01MinusBP_C::UseCarpetEnd' has a wrong offset!");
static_assert(offsetof(ACarpet_LinearMinus01MinusBP_C, Direction) == 0x0003F1, "Member 'ACarpet_LinearMinus01MinusBP_C::Direction' has a wrong offset!");

}

