#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CategoryTitle

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CategoryTitle.CategoryTitle_C.ExecuteUbergraph_CategoryTitle
// 0x000C (0x000C - 0x0000)
struct CategoryTitle_C_ExecuteUbergraph_CategoryTitle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CategoryTitle_C_ExecuteUbergraph_CategoryTitle) == 0x000004, "Wrong alignment on CategoryTitle_C_ExecuteUbergraph_CategoryTitle");
static_assert(sizeof(CategoryTitle_C_ExecuteUbergraph_CategoryTitle) == 0x00000C, "Wrong size on CategoryTitle_C_ExecuteUbergraph_CategoryTitle");
static_assert(offsetof(CategoryTitle_C_ExecuteUbergraph_CategoryTitle, EntryPoint) == 0x000000, "Member 'CategoryTitle_C_ExecuteUbergraph_CategoryTitle::EntryPoint' has a wrong offset!");
static_assert(offsetof(CategoryTitle_C_ExecuteUbergraph_CategoryTitle, Temp_bool_Variable) == 0x000004, "Member 'CategoryTitle_C_ExecuteUbergraph_CategoryTitle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CategoryTitle_C_ExecuteUbergraph_CategoryTitle, Temp_byte_Variable) == 0x000005, "Member 'CategoryTitle_C_ExecuteUbergraph_CategoryTitle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CategoryTitle_C_ExecuteUbergraph_CategoryTitle, Temp_byte_Variable_1) == 0x000006, "Member 'CategoryTitle_C_ExecuteUbergraph_CategoryTitle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CategoryTitle_C_ExecuteUbergraph_CategoryTitle, K2Node_Event_IsDesignTime) == 0x000007, "Member 'CategoryTitle_C_ExecuteUbergraph_CategoryTitle::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CategoryTitle_C_ExecuteUbergraph_CategoryTitle, K2Node_Select_Default) == 0x000008, "Member 'CategoryTitle_C_ExecuteUbergraph_CategoryTitle::K2Node_Select_Default' has a wrong offset!");

// Function CategoryTitle.CategoryTitle_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CategoryTitle_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CategoryTitle_C_PreConstruct) == 0x000001, "Wrong alignment on CategoryTitle_C_PreConstruct");
static_assert(sizeof(CategoryTitle_C_PreConstruct) == 0x000001, "Wrong size on CategoryTitle_C_PreConstruct");
static_assert(offsetof(CategoryTitle_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CategoryTitle_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CategoryTitle.CategoryTitle_C.SetText
// 0x0020 (0x0020 - 0x0000)
struct CategoryTitle_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	ETextTransformPolicy                          NewParam;                                          // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CategoryTitle_C_SetText) == 0x000008, "Wrong alignment on CategoryTitle_C_SetText");
static_assert(sizeof(CategoryTitle_C_SetText) == 0x000020, "Wrong size on CategoryTitle_C_SetText");
static_assert(offsetof(CategoryTitle_C_SetText, Text) == 0x000000, "Member 'CategoryTitle_C_SetText::Text' has a wrong offset!");
static_assert(offsetof(CategoryTitle_C_SetText, NewParam) == 0x000018, "Member 'CategoryTitle_C_SetText::NewParam' has a wrong offset!");

}

