#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CeilingBulbLightBaseMinus03

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CeilingBulbLightBase-03.CeilingBulbLightBase-03_C
// 0x0020 (0x0790 - 0x0770)
class ACeilingBulbLightBaseMinus03_C : public ARBLight_BP_C
{
public:
	class URBVolumetricFogLightComponent*         RBVolumetricFogPointLight;                         // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight_Dual;                                   // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Movable;                                 // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Static;                                  // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CeilingBulbLightBase-03_C">();
	}
	static class ACeilingBulbLightBaseMinus03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACeilingBulbLightBaseMinus03_C>();
	}
};
static_assert(alignof(ACeilingBulbLightBaseMinus03_C) == 0x000010, "Wrong alignment on ACeilingBulbLightBaseMinus03_C");
static_assert(sizeof(ACeilingBulbLightBaseMinus03_C) == 0x000790, "Wrong size on ACeilingBulbLightBaseMinus03_C");
static_assert(offsetof(ACeilingBulbLightBaseMinus03_C, RBVolumetricFogPointLight) == 0x000770, "Member 'ACeilingBulbLightBaseMinus03_C::RBVolumetricFogPointLight' has a wrong offset!");
static_assert(offsetof(ACeilingBulbLightBaseMinus03_C, PointLight_Dual) == 0x000778, "Member 'ACeilingBulbLightBaseMinus03_C::PointLight_Dual' has a wrong offset!");
static_assert(offsetof(ACeilingBulbLightBaseMinus03_C, SpotLight_Movable) == 0x000780, "Member 'ACeilingBulbLightBaseMinus03_C::SpotLight_Movable' has a wrong offset!");
static_assert(offsetof(ACeilingBulbLightBaseMinus03_C, SpotLight_Static) == 0x000788, "Member 'ACeilingBulbLightBaseMinus03_C::SpotLight_Static' has a wrong offset!");

}

