#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CeilingBulbLightBaseMinus01

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CeilingBulbLightBase-01.CeilingBulbLightBase-01_C
// 0x0020 (0x0790 - 0x0770)
class ACeilingBulbLightBaseMinus01_C : public ARBLight_BP_C
{
public:
	class URBVolumetricFogLightComponent*         RBVolumetricFogLight_ABC;                          // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1_Movable;                                // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1_Static;                                 // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CeilingBulbLightBase-01_C">();
	}
	static class ACeilingBulbLightBaseMinus01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACeilingBulbLightBaseMinus01_C>();
	}
};
static_assert(alignof(ACeilingBulbLightBaseMinus01_C) == 0x000010, "Wrong alignment on ACeilingBulbLightBaseMinus01_C");
static_assert(sizeof(ACeilingBulbLightBaseMinus01_C) == 0x000790, "Wrong size on ACeilingBulbLightBaseMinus01_C");
static_assert(offsetof(ACeilingBulbLightBaseMinus01_C, RBVolumetricFogLight_ABC) == 0x000770, "Member 'ACeilingBulbLightBaseMinus01_C::RBVolumetricFogLight_ABC' has a wrong offset!");
static_assert(offsetof(ACeilingBulbLightBaseMinus01_C, SpotLight1_Movable) == 0x000778, "Member 'ACeilingBulbLightBaseMinus01_C::SpotLight1_Movable' has a wrong offset!");
static_assert(offsetof(ACeilingBulbLightBaseMinus01_C, SpotLight1_Static) == 0x000780, "Member 'ACeilingBulbLightBaseMinus01_C::SpotLight1_Static' has a wrong offset!");

}

