#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CeilingBulbLightBaseMinus02

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CeilingBulbLightBase-02.CeilingBulbLightBase-02_C
// 0x0030 (0x07A0 - 0x0770)
#pragma pack(push, 0x1)
class alignas(0x10) ACeilingBulbLightBaseMinus02_C : public ARBLight_BP_C
{
public:
	class URBVolumetricFogLightComponent*         ARBVolumetricFogPointLight;                        // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   APointLight_Dual;                                  // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBVolumetricFogLightComponent*         ARBVolumetricFogSpotLight;                         // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    ASpotLight_Movable;                                // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    ASpotLight_Static;                                 // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CeilingBulbLightBase-02_C">();
	}
	static class ACeilingBulbLightBaseMinus02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACeilingBulbLightBaseMinus02_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ACeilingBulbLightBaseMinus02_C) == 0x000010, "Wrong alignment on ACeilingBulbLightBaseMinus02_C");
static_assert(sizeof(ACeilingBulbLightBaseMinus02_C) == 0x0007A0, "Wrong size on ACeilingBulbLightBaseMinus02_C");
static_assert(offsetof(ACeilingBulbLightBaseMinus02_C, ARBVolumetricFogPointLight) == 0x000770, "Member 'ACeilingBulbLightBaseMinus02_C::ARBVolumetricFogPointLight' has a wrong offset!");
static_assert(offsetof(ACeilingBulbLightBaseMinus02_C, APointLight_Dual) == 0x000778, "Member 'ACeilingBulbLightBaseMinus02_C::APointLight_Dual' has a wrong offset!");
static_assert(offsetof(ACeilingBulbLightBaseMinus02_C, ARBVolumetricFogSpotLight) == 0x000780, "Member 'ACeilingBulbLightBaseMinus02_C::ARBVolumetricFogSpotLight' has a wrong offset!");
static_assert(offsetof(ACeilingBulbLightBaseMinus02_C, ASpotLight_Movable) == 0x000788, "Member 'ACeilingBulbLightBaseMinus02_C::ASpotLight_Movable' has a wrong offset!");
static_assert(offsetof(ACeilingBulbLightBaseMinus02_C, ASpotLight_Static) == 0x000790, "Member 'ACeilingBulbLightBaseMinus02_C::ASpotLight_Static' has a wrong offset!");

}

