#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CeilingFluorescentMinus05

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CeilingFluorescent-05.CeilingFluorescent-05_C.UserConstructionScript
// 0x00E0 (0x00E0 - 0x0000)
struct CeilingFluorescentMinus05_C_UserConstructionScript final
{
public:
	struct FVector                                Temp_struct_Variable;                              // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_1;                            // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_2;                            // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_3;                            // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_2;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_2;                           // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_3;                           // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CeilingFluorescentMinus05_C_UserConstructionScript) == 0x000010, "Wrong alignment on CeilingFluorescentMinus05_C_UserConstructionScript");
static_assert(sizeof(CeilingFluorescentMinus05_C_UserConstructionScript) == 0x0000E0, "Wrong size on CeilingFluorescentMinus05_C_UserConstructionScript");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, Temp_int_Variable) == 0x00000C, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, Temp_struct_Variable_1) == 0x000010, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, Temp_int_Variable_1) == 0x00001C, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, Temp_struct_Variable_2) == 0x000020, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, Temp_struct_Variable_3) == 0x000030, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, Temp_int_Variable_2) == 0x000060, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000068, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000070, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000071, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, Temp_int_Variable_3) == 0x000078, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, Temp_int_Variable_4) == 0x00007C, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, K2Node_Select_Default) == 0x000080, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x00008C, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000090, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000094, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, K2Node_Select_Default_1) == 0x000098, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x0000A4, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B0, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x0000B4, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, K2Node_Select_Default_2) == 0x0000C0, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CeilingFluorescentMinus05_C_UserConstructionScript, K2Node_Select_Default_3) == 0x0000CC, "Member 'CeilingFluorescentMinus05_C_UserConstructionScript::K2Node_Select_Default_3' has a wrong offset!");

}

