#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CellCustomizationBundleBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CellCustomizationBundleBase.CellCustomizationBundleBase_C
// 0x0018 (0x0248 - 0x0230)
class ACellCustomizationBundleBase_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseCollisions;                                    // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CellCustomizationBundleBase(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetupCollisions();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CellCustomizationBundleBase_C">();
	}
	static class ACellCustomizationBundleBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACellCustomizationBundleBase_C>();
	}
};
static_assert(alignof(ACellCustomizationBundleBase_C) == 0x000008, "Wrong alignment on ACellCustomizationBundleBase_C");
static_assert(sizeof(ACellCustomizationBundleBase_C) == 0x000248, "Wrong size on ACellCustomizationBundleBase_C");
static_assert(offsetof(ACellCustomizationBundleBase_C, UberGraphFrame) == 0x000230, "Member 'ACellCustomizationBundleBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACellCustomizationBundleBase_C, DefaultSceneRoot) == 0x000238, "Member 'ACellCustomizationBundleBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ACellCustomizationBundleBase_C, bUseCollisions) == 0x000240, "Member 'ACellCustomizationBundleBase_C::bUseCollisions' has a wrong offset!");

}

