#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CellCustomizationPropBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CellCustomizationPropBase.CellCustomizationPropBase_C
// 0x0018 (0x0248 - 0x0230)
class ACellCustomizationPropBase_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBPropOptimizerComponent*              RBPropOptimizer;                                   // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CellCustomizationPropBase(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void Initialize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CellCustomizationPropBase_C">();
	}
	static class ACellCustomizationPropBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACellCustomizationPropBase_C>();
	}
};
static_assert(alignof(ACellCustomizationPropBase_C) == 0x000008, "Wrong alignment on ACellCustomizationPropBase_C");
static_assert(sizeof(ACellCustomizationPropBase_C) == 0x000248, "Wrong size on ACellCustomizationPropBase_C");
static_assert(offsetof(ACellCustomizationPropBase_C, UberGraphFrame) == 0x000230, "Member 'ACellCustomizationPropBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACellCustomizationPropBase_C, RBPropOptimizer) == 0x000238, "Member 'ACellCustomizationPropBase_C::RBPropOptimizer' has a wrong offset!");
static_assert(offsetof(ACellCustomizationPropBase_C, DefaultSceneRoot) == 0x000240, "Member 'ACellCustomizationPropBase_C::DefaultSceneRoot' has a wrong offset!");

}

