#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChainFenceMinus01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ModuleMeshData_structs.hpp"
#include "ModuleMeshDataMinus02_structs.hpp"
#include "ModuleAlternativeMeshData_structs.hpp"
#include "StaticmeshArray_Stuc_structs.hpp"


namespace SDK::Params
{

// Function ChainFence-01_BP.ChainFence-01_BP_C.UserConstructionScript
// 0x0340 (0x0340 - 0x0000)
struct ChainFenceMinus01_BP_C_UserConstructionScript final
{
public:
	float                                         _alphaScale;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _betaScale;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _LastLocation;                                     // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _NewSize;                                          // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_1;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_5;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_5;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_5;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_6;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_6;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_6;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_7;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_7;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_7;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModuleMeshDataMinus02                 CallFunc_Array_Get_Item;                           // 0x00B0(0x0018)(HasGetValueTypeHash)
	float                                         CallFunc_MinMeshSize_SmallerMeshSize;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModuleMeshDataMinus02                 CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0018)(HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Next_Mesh_Index;                      // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Next_Mesh_NewSizeLeft;                // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Next_Mesh_MeshSize;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_8;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_8;                          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_8;                          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_4;                           // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_9;                          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_9;                          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_9;                          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_10;                         // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_10;                         // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_10;                         // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_5;                           // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateSurface_LastLocation;             // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize;            // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale;              // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes;          // 0x0188(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize;        // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_11;                         // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_11;                         // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_11;                         // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_12;                         // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_12;                         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_12;                         // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateSurface_LastLocation_1;           // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize_1;          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale_1;            // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes_1;        // 0x01E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount_1;               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize_1;      // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale_1;             // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_13;                         // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_13;                         // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_13;                         // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_6;                           // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_5;                 // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_7;                           // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateSurface_LastLocation_2;           // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize_2;          // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale_2;            // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes_2;        // 0x0230(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount_2;               // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize_2;      // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale_2;             // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_6;                 // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_14;                         // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_14;                         // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_14;                         // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_7;                 // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_15;                         // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_15;                         // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_15;                         // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateSurface_LastLocation_3;           // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize_3;          // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale_3;            // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes_3;        // 0x0298(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount_3;               // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize_3;      // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale_3;             // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_8;                 // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateSurface_LastLocation_4;           // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize_4;          // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale_4;            // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes_4;        // 0x02D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount_4;               // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize_4;      // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale_4;             // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_16;                         // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_16;                         // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_16;                         // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_8;                           // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_9;                 // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateRow_LastLocation;                 // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_PopulateRow_StaticmeshComponents1;        // 0x0328(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_PopulateRow_LastAlphaMeshSize;            // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateRow_AlphaScale;                   // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChainFenceMinus01_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on ChainFenceMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(ChainFenceMinus01_BP_C_UserConstructionScript) == 0x000340, "Wrong size on ChainFenceMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, _alphaScale) == 0x000000, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::_alphaScale' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, _betaScale) == 0x000004, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::_betaScale' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, _LastLocation) == 0x000008, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::_LastLocation' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, _NewSize) == 0x000014, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::_NewSize' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, Temp_bool_Variable) == 0x000020, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, Temp_bool_Variable_1) == 0x000021, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, Temp_bool_Variable_2) == 0x000022, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, Temp_bool_Variable_3) == 0x000023, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, Temp_float_Variable) == 0x000024, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, Temp_float_Variable_1) == 0x000028, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, Temp_bool_Variable_4) == 0x00002C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, Temp_float_Variable_2) == 0x000030, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, Temp_bool_Variable_5) == 0x000034, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, Temp_bool_Variable_6) == 0x000035, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000038, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x00003C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000040, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, Temp_bool_Variable_7) == 0x000044, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x000048, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x00004C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x000050, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_2) == 0x000054, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_2) == 0x000058, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_2) == 0x00005C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_3) == 0x000060, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_3) == 0x000064, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_3) == 0x000068, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, K2Node_Select_Default) == 0x00006C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_4) == 0x000070, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_4) == 0x000074, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_4) == 0x000078, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, K2Node_Select_Default_1) == 0x00007C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_5) == 0x000080, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_5' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_5) == 0x000084, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_5' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_5) == 0x000088, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_5' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x00008C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_6) == 0x000098, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_6' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_6) == 0x00009C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_6' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_6) == 0x0000A0, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_6' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_7) == 0x0000A4, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_7' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_7) == 0x0000A8, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_7' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_7) == 0x0000AC, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_7' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_MinMeshSize_SmallerMeshSize) == 0x0000C8, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_MinMeshSize_SmallerMeshSize' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000CC, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, K2Node_Select_Default_2) == 0x0000D0, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000D4, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x0000D8, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_FMax_ReturnValue) == 0x0000E4, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, K2Node_Select_Default_3) == 0x0000E8, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x0000F0, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, Temp_float_Variable_3) == 0x000108, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_Get_Next_Mesh_Index) == 0x00010C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_Get_Next_Mesh_Index' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_Get_Next_Mesh_NewSizeLeft) == 0x000110, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_Get_Next_Mesh_NewSizeLeft' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_Get_Next_Mesh_MeshSize) == 0x000114, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_Get_Next_Mesh_MeshSize' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000118, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_8) == 0x00011C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_8' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_8) == 0x000120, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_8' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_8) == 0x000124, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_8' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000128, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_2) == 0x000134, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, K2Node_Select_Default_4) == 0x000140, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000144, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_3) == 0x000148, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000154, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, Temp_bool_Variable_8) == 0x000155, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_9) == 0x000158, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_9' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_9) == 0x00015C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_9' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_9) == 0x000160, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_9' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_10) == 0x000164, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_10' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_10) == 0x000168, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_10' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_10) == 0x00016C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_10' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, K2Node_Select_Default_5) == 0x000170, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation) == 0x000174, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize) == 0x000180, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale) == 0x000184, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes) == 0x000188, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount) == 0x000198, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize) == 0x00019C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale) == 0x0001A0, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_11) == 0x0001A4, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_11' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_11) == 0x0001A8, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_11' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_11) == 0x0001AC, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_11' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_4) == 0x0001B0, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_12) == 0x0001BC, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_12' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_12) == 0x0001C0, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_12' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_12) == 0x0001C4, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_12' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation_1) == 0x0001C8, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize_1) == 0x0001D4, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale_1) == 0x0001D8, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes_1) == 0x0001E0, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount_1) == 0x0001F0, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize_1) == 0x0001F4, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale_1) == 0x0001F8, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_13) == 0x0001FC, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_13' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_13) == 0x000200, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_13' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_13) == 0x000204, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_13' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, K2Node_Select_Default_6) == 0x000208, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_5) == 0x00020C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, K2Node_Select_Default_7) == 0x000218, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation_2) == 0x00021C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize_2) == 0x000228, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale_2) == 0x00022C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes_2) == 0x000230, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount_2) == 0x000240, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize_2) == 0x000244, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale_2) == 0x000248, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_6) == 0x00024C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_14) == 0x000258, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_14' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_14) == 0x00025C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_14' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_14) == 0x000260, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_14' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000264, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000268, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_7) == 0x00026C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_15) == 0x000278, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_15' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_15) == 0x00027C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_15' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_15) == 0x000280, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_15' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation_3) == 0x000284, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation_3' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize_3) == 0x000290, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize_3' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale_3) == 0x000294, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale_3' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes_3) == 0x000298, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes_3' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount_3) == 0x0002A8, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount_3' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize_3) == 0x0002AC, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize_3' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale_3) == 0x0002B0, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale_3' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_8) == 0x0002B4, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation_4) == 0x0002C0, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation_4' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize_4) == 0x0002CC, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize_4' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale_4) == 0x0002D0, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale_4' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes_4) == 0x0002D8, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes_4' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount_4) == 0x0002E8, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount_4' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize_4) == 0x0002EC, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize_4' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale_4) == 0x0002F0, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale_4' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_16) == 0x0002F4, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_16' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_16) == 0x0002F8, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_16' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_16) == 0x0002FC, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_16' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, K2Node_Select_Default_8) == 0x000300, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000304, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000308, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_9) == 0x00030C, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastLocation) == 0x000318, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastLocation' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_StaticmeshComponents1) == 0x000328, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_StaticmeshComponents1' has a wrong offset!");
static_assert(offsetof(ChainFenceMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastAlphaMeshSize) == 0x000338, "Member 'ChainFenceMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastAlphaMeshSize' has a wrong offset!");
