#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chemical_Steam_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Chemical_Steam_BP.Chemical_Steam_BP_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct Chemical_Steam_BP_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Chemical_Steam_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on Chemical_Steam_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(Chemical_Steam_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on Chemical_Steam_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(Chemical_Steam_BP_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'Chemical_Steam_BP_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

// Function Chemical_Steam_BP.Chemical_Steam_BP_C.RefreshVFXActive
// 0x0010 (0x0010 - 0x0000)
struct Chemical_Steam_BP_C_RefreshVFXActive final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StopLoopingSound_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayLoopingSound_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Chemical_Steam_BP_C_RefreshVFXActive) == 0x000004, "Wrong alignment on Chemical_Steam_BP_C_RefreshVFXActive");
static_assert(sizeof(Chemical_Steam_BP_C_RefreshVFXActive) == 0x000010, "Wrong size on Chemical_Steam_BP_C_RefreshVFXActive");
static_assert(offsetof(Chemical_Steam_BP_C_RefreshVFXActive, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'Chemical_Steam_BP_C_RefreshVFXActive::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_RefreshVFXActive, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Chemical_Steam_BP_C_RefreshVFXActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_RefreshVFXActive, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'Chemical_Steam_BP_C_RefreshVFXActive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_RefreshVFXActive, CallFunc_StopLoopingSound_ReturnValue) == 0x000004, "Member 'Chemical_Steam_BP_C_RefreshVFXActive::CallFunc_StopLoopingSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_RefreshVFXActive, CallFunc_PlayLoopingSound_ReturnValue) == 0x000008, "Member 'Chemical_Steam_BP_C_RefreshVFXActive::CallFunc_PlayLoopingSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_RefreshVFXActive, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'Chemical_Steam_BP_C_RefreshVFXActive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Chemical_Steam_BP.Chemical_Steam_BP_C.BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Chemical_Steam_BP_C_BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Chemical_Steam_BP_C_BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on Chemical_Steam_BP_C_BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature");
static_assert(sizeof(Chemical_Steam_BP_C_BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature) == 0x000001, "Wrong size on Chemical_Steam_BP_C_BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature");
static_assert(offsetof(Chemical_Steam_BP_C_BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature, bEnabled) == 0x000000, "Member 'Chemical_Steam_BP_C_BndEvt__Sanitization_FloorVent_BP_RBPropOptimizer_K2Node_ComponentBoundEvent_0_PropOptimizerComponentTickEnabledChangedEvent__DelegateSignature::bEnabled' has a wrong offset!");

// Function Chemical_Steam_BP.Chemical_Steam_BP_C.ExecuteUbergraph_Chemical_Steam_BP
// 0x0080 (0x0080 - 0x0000)
struct Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBObjectiveManager*                    CallFunc_GetRBObjectiveManager_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARBBaseObjectiveCoordinator*>    CallFunc_BP_GetAllObjectiveCoordinators_outCoordinators; // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBBaseObjectiveCoordinator*            CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bEnabled;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AChemical_Steam_BP_C>    CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0050(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP) == 0x000008, "Wrong alignment on Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP");
static_assert(sizeof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP) == 0x000080, "Wrong size on Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, EntryPoint) == 0x000000, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, CallFunc_GetRBObjectiveManager_ReturnValue) == 0x000008, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::CallFunc_GetRBObjectiveManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, CallFunc_BP_GetAllObjectiveCoordinators_outCoordinators) == 0x000018, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::CallFunc_BP_GetAllObjectiveCoordinators_outCoordinators' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, Temp_int_Array_Index_Variable) == 0x000038, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, CallFunc_HasAuthority_ReturnValue) == 0x00003C, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, CallFunc_Array_Get_Item) == 0x000040, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, K2Node_ComponentBoundEvent_bEnabled) == 0x000048, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::K2Node_ComponentBoundEvent_bEnabled' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, CallFunc_ActorHasTag_ReturnValue) == 0x000049, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000050, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP, CallFunc_Array_Add_ReturnValue) == 0x000078, "Member 'Chemical_Steam_BP_C_ExecuteUbergraph_Chemical_Steam_BP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function Chemical_Steam_BP.Chemical_Steam_BP_C.IsTriggered
// 0x0001 (0x0001 - 0x0000)
struct Chemical_Steam_BP_C_IsTriggered final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Chemical_Steam_BP_C_IsTriggered) == 0x000001, "Wrong alignment on Chemical_Steam_BP_C_IsTriggered");
static_assert(sizeof(Chemical_Steam_BP_C_IsTriggered) == 0x000001, "Wrong size on Chemical_Steam_BP_C_IsTriggered");
static_assert(offsetof(Chemical_Steam_BP_C_IsTriggered, ReturnValue) == 0x000000, "Member 'Chemical_Steam_BP_C_IsTriggered::ReturnValue' has a wrong offset!");

}

