#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CineGroupVeins

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CineGroupVeins.CineGroupVeins_C
// 0x00F8 (0x0328 - 0x0230)
class ACineGroupVeins_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh14;                                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh13;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh12;                                      // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh11;                                      // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh10;                                      // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GroupFloor03;                                      // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh9;                                       // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GroupFloor02;                                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GroupCeiling02;                                    // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Veins01d;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Veins01c;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Veins01b;                                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   VeinsF01d;                                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   VeinsF01a;                                         // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   VeinsF01e;                                         // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   VeinsF01c;                                         // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   VeinsF01f;                                         // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   VeinsF01b;                                         // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GroupFloor01;                                      // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Veins01a;                                          // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GroupCeiling01;                                    // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CineGroupVeins_C">();
	}
	static class ACineGroupVeins_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACineGroupVeins_C>();
	}
};
static_assert(alignof(ACineGroupVeins_C) == 0x000008, "Wrong alignment on ACineGroupVeins_C");
static_assert(sizeof(ACineGroupVeins_C) == 0x000328, "Wrong size on ACineGroupVeins_C");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh14) == 0x000230, "Member 'ACineGroupVeins_C::StaticMesh14' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh13) == 0x000238, "Member 'ACineGroupVeins_C::StaticMesh13' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh12) == 0x000240, "Member 'ACineGroupVeins_C::StaticMesh12' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh11) == 0x000248, "Member 'ACineGroupVeins_C::StaticMesh11' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh10) == 0x000250, "Member 'ACineGroupVeins_C::StaticMesh10' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, GroupFloor03) == 0x000258, "Member 'ACineGroupVeins_C::GroupFloor03' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh9) == 0x000260, "Member 'ACineGroupVeins_C::StaticMesh9' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh8) == 0x000268, "Member 'ACineGroupVeins_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh7) == 0x000270, "Member 'ACineGroupVeins_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh6) == 0x000278, "Member 'ACineGroupVeins_C::StaticMesh6' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh5) == 0x000280, "Member 'ACineGroupVeins_C::StaticMesh5' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh4) == 0x000288, "Member 'ACineGroupVeins_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh3) == 0x000290, "Member 'ACineGroupVeins_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, GroupFloor02) == 0x000298, "Member 'ACineGroupVeins_C::GroupFloor02' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh2) == 0x0002A0, "Member 'ACineGroupVeins_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh1) == 0x0002A8, "Member 'ACineGroupVeins_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, StaticMesh) == 0x0002B0, "Member 'ACineGroupVeins_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, GroupCeiling02) == 0x0002B8, "Member 'ACineGroupVeins_C::GroupCeiling02' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, Veins01d) == 0x0002C0, "Member 'ACineGroupVeins_C::Veins01d' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, Veins01c) == 0x0002C8, "Member 'ACineGroupVeins_C::Veins01c' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, Veins01b) == 0x0002D0, "Member 'ACineGroupVeins_C::Veins01b' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, VeinsF01d) == 0x0002D8, "Member 'ACineGroupVeins_C::VeinsF01d' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, VeinsF01a) == 0x0002E0, "Member 'ACineGroupVeins_C::VeinsF01a' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, VeinsF01e) == 0x0002E8, "Member 'ACineGroupVeins_C::VeinsF01e' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, VeinsF01c) == 0x0002F0, "Member 'ACineGroupVeins_C::VeinsF01c' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, VeinsF01f) == 0x0002F8, "Member 'ACineGroupVeins_C::VeinsF01f' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, VeinsF01b) == 0x000300, "Member 'ACineGroupVeins_C::VeinsF01b' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, GroupFloor01) == 0x000308, "Member 'ACineGroupVeins_C::GroupFloor01' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, Veins01a) == 0x000310, "Member 'ACineGroupVeins_C::Veins01a' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, GroupCeiling01) == 0x000318, "Member 'ACineGroupVeins_C::GroupCeiling01' has a wrong offset!");
static_assert(offsetof(ACineGroupVeins_C, DefaultSceneRoot) == 0x000320, "Member 'ACineGroupVeins_C::DefaultSceneRoot' has a wrong offset!");

}

