#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CineSpectre_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CineCharacterBase_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CineSpectre_BP.CineSpectre_BP_C
// 0x00A8 (0x0320 - 0x0278)
class ACineSpectre_BP_C final : public ACineCharacterBase_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CineSpectre_BP_C;                   // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Psychosis_03b;                                     // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Psychosis_03a;                                     // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_Spectre_HeadSmoke2;                            // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head2;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Spectre2;                                          // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SpectrePsychosis2;                                 // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Psychosis_02;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_Spectre_HeadSmoke1;                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head1;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Spectre1;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SpectrePsychosis1;                                 // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Psychosis_01;                                      // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_Spectre_HeadSmoke;                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head;                                              // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Spectre;                                           // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Timeline_0_NewTrack_0_2DDDAB4942E31C4C325735A9DBD736DE; // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_2DDDAB4942E31C4C325735A9DBD736DE; // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         Array;                                             // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void Hidding_Chid(class USkeletalMeshComponent* Parent, bool bNewVisibility);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void MotionBlurByBones(const TArray<class FName>& ListOfBones, const TArray<class USkeletalMeshComponent*>& Array_0, const struct FVector& Rotation);
	void MotionBlurSwap(float blurIntensity);
	void DesactivateParticles();
	void SetVisibility(bool Spectre01, bool Spectre02, bool Spectre03);
	void MotionBlurHold(float Blur_Intensity);
	void ExecuteUbergraph_CineSpectre_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CineSpectre_BP_C">();
	}
	static class ACineSpectre_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACineSpectre_BP_C>();
	}
};
static_assert(alignof(ACineSpectre_BP_C) == 0x000008, "Wrong alignment on ACineSpectre_BP_C");
static_assert(sizeof(ACineSpectre_BP_C) == 0x000320, "Wrong size on ACineSpectre_BP_C");
static_assert(offsetof(ACineSpectre_BP_C, UberGraphFrame_CineSpectre_BP_C) == 0x000278, "Member 'ACineSpectre_BP_C::UberGraphFrame_CineSpectre_BP_C' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Psychosis_03b) == 0x000280, "Member 'ACineSpectre_BP_C::Psychosis_03b' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Psychosis_03a) == 0x000288, "Member 'ACineSpectre_BP_C::Psychosis_03a' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Ngr_Spectre_HeadSmoke2) == 0x000290, "Member 'ACineSpectre_BP_C::Ngr_Spectre_HeadSmoke2' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Head2) == 0x000298, "Member 'ACineSpectre_BP_C::Head2' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Spectre2) == 0x0002A0, "Member 'ACineSpectre_BP_C::Spectre2' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, SpectrePsychosis2) == 0x0002A8, "Member 'ACineSpectre_BP_C::SpectrePsychosis2' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Psychosis_02) == 0x0002B0, "Member 'ACineSpectre_BP_C::Psychosis_02' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Ngr_Spectre_HeadSmoke1) == 0x0002B8, "Member 'ACineSpectre_BP_C::Ngr_Spectre_HeadSmoke1' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Head1) == 0x0002C0, "Member 'ACineSpectre_BP_C::Head1' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Spectre1) == 0x0002C8, "Member 'ACineSpectre_BP_C::Spectre1' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, SpectrePsychosis1) == 0x0002D0, "Member 'ACineSpectre_BP_C::SpectrePsychosis1' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Psychosis_01) == 0x0002D8, "Member 'ACineSpectre_BP_C::Psychosis_01' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Ngr_Spectre_HeadSmoke) == 0x0002E0, "Member 'ACineSpectre_BP_C::Ngr_Spectre_HeadSmoke' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Head) == 0x0002E8, "Member 'ACineSpectre_BP_C::Head' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Spectre) == 0x0002F0, "Member 'ACineSpectre_BP_C::Spectre' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Timeline_0_NewTrack_0_2DDDAB4942E31C4C325735A9DBD736DE) == 0x0002F8, "Member 'ACineSpectre_BP_C::Timeline_0_NewTrack_0_2DDDAB4942E31C4C325735A9DBD736DE' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Timeline_0__Direction_2DDDAB4942E31C4C325735A9DBD736DE) == 0x000304, "Member 'ACineSpectre_BP_C::Timeline_0__Direction_2DDDAB4942E31C4C325735A9DBD736DE' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Timeline_0) == 0x000308, "Member 'ACineSpectre_BP_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ACineSpectre_BP_C, Array) == 0x000310, "Member 'ACineSpectre_BP_C::Array' has a wrong offset!");

}

