#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cine_Body_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Cine_Body_AnimBP.Cine_Body_AnimBP_C
// 0x00D0 (0x0390 - 0x02C0)
class UCine_Body_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x02F8(0x0080)()
	class UAnimSequence*                          AnimSequence;                                      // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Position;                                          // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Cine_Body_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cine_Body_AnimBP_C">();
	}
	static class UCine_Body_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCine_Body_AnimBP_C>();
	}
};
static_assert(alignof(UCine_Body_AnimBP_C) == 0x000010, "Wrong alignment on UCine_Body_AnimBP_C");
static_assert(sizeof(UCine_Body_AnimBP_C) == 0x000390, "Wrong size on UCine_Body_AnimBP_C");
static_assert(offsetof(UCine_Body_AnimBP_C, UberGraphFrame) == 0x0002C0, "Member 'UCine_Body_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCine_Body_AnimBP_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UCine_Body_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UCine_Body_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x0002F8, "Member 'UCine_Body_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UCine_Body_AnimBP_C, AnimSequence) == 0x000378, "Member 'UCine_Body_AnimBP_C::AnimSequence' has a wrong offset!");
static_assert(offsetof(UCine_Body_AnimBP_C, Position) == 0x000380, "Member 'UCine_Body_AnimBP_C::Position' has a wrong offset!");

}

