#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Client_InGameMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function Client_InGameMenu.Client_InGameMenu_C.ExecuteUbergraph_Client_InGameMenu
// 0x0208 (0x0208 - 0x0000)
struct Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_AreCheatsEnabled_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInGameMenuOptionWidget_C*              K2Node_DynamicCast_AsIn_Game_Menu_Option_Widget;   // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuTabButton*                       K2Node_ComponentBoundEvent_Button_3;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuTabButton*                       K2Node_ComponentBoundEvent_Button_2;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBSocialMenuManager*                   CallFunc_GetSocialMenuManager_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOptionsMenu_C*                         CallFunc_Create_ReturnValue;                       // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBackToLobbyMenu_C*                     CallFunc_Create_ReturnValue_1;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBController*                          CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPopUpConfirmCancelWidget*            CallFunc_CreatePopUpConfirmCancel_ReturnValue;     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBController*                          CallFunc_GetLocalPlayerController_ReturnValue_1;   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue_1;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShouldHide;                          // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button_1;               // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBUserWidget*                          CallFunc_GetCurrentFocusedWidget_FocusedWidget;    // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Select_Default_1;                           // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsGamepad;                           // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckFeatureSwitch_ReturnValue;           // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x1];                                      // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x012C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button;                 // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInTutorialStage_ReturnValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0150(0x0018)()
	class FText                                   CallFunc_FormatTextForDecorator_ReturnValue;       // 0x0168(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Description;                    // 0x0188(0x0018)()
	class URBSocialMenuEntry*                     K2Node_ComponentBoundEvent_entry;                  // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERBSocialMenuEntryAction                      K2Node_ComponentBoundEvent_action;                 // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuitMenu_C*                            CallFunc_Create_ReturnValue_2;                     // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLobbyPlayerController*               CallFunc_GetLocalLobbyPlayerController_ReturnValue; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListeningForInputAction_ReturnValue;    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuWidget*                          CallFunc_Create_ReturnValue_3;                     // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuWithTabsWidget*                  K2Node_DynamicCast_AsRB_Menu_with_Tabs_Widget;     // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGameUserPreferences*                 CallFunc_GetRBGameUserPreferences_ReturnValue;     // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSoloMode_ReturnValue;                   // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu) == 0x000008, "Wrong alignment on Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu");
static_assert(sizeof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu) == 0x000208, "Wrong size on Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, EntryPoint) == 0x000000, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_byte_Variable) == 0x000004, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_byte_Variable_1) == 0x00001C, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_bool_Variable) == 0x000030, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_bool_Variable_1) == 0x000031, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_byte_Variable_2) == 0x000032, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_byte_Variable_3) == 0x000033, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_bool_Variable_2) == 0x000054, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_AreCheatsEnabled_ReturnValue) == 0x000068, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_AreCheatsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_Event_IsDesignTime) == 0x000069, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_Array_Get_Item) == 0x000070, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_DynamicCast_AsIn_Game_Menu_Option_Widget) == 0x000078, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_DynamicCast_AsIn_Game_Menu_Option_Widget' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_ComponentBoundEvent_Button_3) == 0x000088, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_ComponentBoundEvent_Button_2) == 0x000090, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetSocialMenuManager_ReturnValue) == 0x000098, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetSocialMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_Create_ReturnValue) == 0x0000A0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_Create_ReturnValue_1) == 0x0000A8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x0000B0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0000B8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsConsole_ReturnValue) == 0x0000C1, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetRBGameStateLobby_ReturnValue) == 0x0000C8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetRBGameStateLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_Not_PreBool_ReturnValue) == 0x0000D0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsValid_ReturnValue_1) == 0x0000D1, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_CreatePopUpConfirmCancel_ReturnValue) == 0x0000D8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_CreatePopUpConfirmCancel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_BooleanAND_ReturnValue) == 0x0000E0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetLocalPlayerController_ReturnValue_1) == 0x0000E8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetLocalPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsValid_ReturnValue_2) == 0x0000F0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetRBGameStateLobby_ReturnValue_1) == 0x0000F8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetRBGameStateLobby_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsValid_ReturnValue_3) == 0x000100, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_Event_bShouldHide) == 0x000101, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_Event_bShouldHide' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_Select_Default) == 0x000102, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_ComponentBoundEvent_Button_1) == 0x000108, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetCurrentFocusedWidget_FocusedWidget) == 0x000110, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetCurrentFocusedWidget_FocusedWidget' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsVisible_ReturnValue) == 0x000118, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsVisible_ReturnValue_1) == 0x000119, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsValid_ReturnValue_4) == 0x00011A, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_Select_Default_1) == 0x000120, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_Event_bIsGamepad) == 0x000128, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_Event_bIsGamepad' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsVisible_ReturnValue_2) == 0x000129, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_CheckFeatureSwitch_ReturnValue) == 0x00012A, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_CheckFeatureSwitch_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_CreateDelegate_OutputDelegate_4) == 0x00012C, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_ComponentBoundEvent_Button) == 0x000140, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsInTutorialStage_ReturnValue) == 0x000148, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsInTutorialStage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_Not_PreBool_ReturnValue_1) == 0x000149, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_BooleanAND_ReturnValue_1) == 0x00014A, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_MakeLiteralText_ReturnValue) == 0x000150, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_FormatTextForDecorator_ReturnValue) == 0x000168, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_FormatTextForDecorator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_Select_Default_2) == 0x000180, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_CustomEvent_Description) == 0x000188, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_CustomEvent_Description' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_ComponentBoundEvent_entry) == 0x0001A0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_ComponentBoundEvent_entry' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_ComponentBoundEvent_action) == 0x0001A8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_ComponentBoundEvent_action' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_Create_ReturnValue_2) == 0x0001B0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001B8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetMenuManager_ReturnValue) == 0x0001C0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetLocalLobbyPlayerController_ReturnValue) == 0x0001C8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetLocalLobbyPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsListeningForInputAction_ReturnValue) == 0x0001D0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsListeningForInputAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_Create_ReturnValue_3) == 0x0001D8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_DynamicCast_AsRB_Menu_with_Tabs_Widget) == 0x0001E0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_DynamicCast_AsRB_Menu_with_Tabs_Widget' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, K2Node_DynamicCast_bSuccess_1) == 0x0001E8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_GetRBGameUserPreferences_ReturnValue) == 0x0001F0, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_GetRBGameUserPreferences_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_IsSoloMode_ReturnValue) == 0x0001F8, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_IsSoloMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_BooleanOR_ReturnValue) == 0x0001F9, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, Temp_int_Loop_Counter_Variable) == 0x0001FC, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000200, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000204, "Member 'Client_InGameMenu_C_ExecuteUbergraph_Client_InGameMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.BndEvt__Client_InGameMenu_PartyWidget_K2Node_ComponentBoundEvent_7_OnSocialMenuEntryActionRequested__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Client_InGameMenu_C_BndEvt__Client_InGameMenu_PartyWidget_K2Node_ComponentBoundEvent_7_OnSocialMenuEntryActionRequested__DelegateSignature final
{
public:
	class URBSocialMenuEntry*                     Entry;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERBSocialMenuEntryAction                      Action;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_PartyWidget_K2Node_ComponentBoundEvent_7_OnSocialMenuEntryActionRequested__DelegateSignature) == 0x000008, "Wrong alignment on Client_InGameMenu_C_BndEvt__Client_InGameMenu_PartyWidget_K2Node_ComponentBoundEvent_7_OnSocialMenuEntryActionRequested__DelegateSignature");
static_assert(sizeof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_PartyWidget_K2Node_ComponentBoundEvent_7_OnSocialMenuEntryActionRequested__DelegateSignature) == 0x000010, "Wrong size on Client_InGameMenu_C_BndEvt__Client_InGameMenu_PartyWidget_K2Node_ComponentBoundEvent_7_OnSocialMenuEntryActionRequested__DelegateSignature");
static_assert(offsetof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_PartyWidget_K2Node_ComponentBoundEvent_7_OnSocialMenuEntryActionRequested__DelegateSignature, Entry) == 0x000000, "Member 'Client_InGameMenu_C_BndEvt__Client_InGameMenu_PartyWidget_K2Node_ComponentBoundEvent_7_OnSocialMenuEntryActionRequested__DelegateSignature::Entry' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_PartyWidget_K2Node_ComponentBoundEvent_7_OnSocialMenuEntryActionRequested__DelegateSignature, Action) == 0x000008, "Member 'Client_InGameMenu_C_BndEvt__Client_InGameMenu_PartyWidget_K2Node_ComponentBoundEvent_7_OnSocialMenuEntryActionRequested__DelegateSignature::Action' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.OnVariatorHovered
// 0x0018 (0x0018 - 0x0000)
struct Client_InGameMenu_C_OnVariatorHovered final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Client_InGameMenu_C_OnVariatorHovered) == 0x000008, "Wrong alignment on Client_InGameMenu_C_OnVariatorHovered");
static_assert(sizeof(Client_InGameMenu_C_OnVariatorHovered) == 0x000018, "Wrong size on Client_InGameMenu_C_OnVariatorHovered");
static_assert(offsetof(Client_InGameMenu_C_OnVariatorHovered, Description) == 0x000000, "Member 'Client_InGameMenu_C_OnVariatorHovered::Description' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature");
static_assert(sizeof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature) == 0x000008, "Wrong size on Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature");
static_assert(offsetof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupOptionsBtn_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.Event_InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct Client_InGameMenu_C_Event_InputSourceChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_Event_InputSourceChanged) == 0x000001, "Wrong alignment on Client_InGameMenu_C_Event_InputSourceChanged");
static_assert(sizeof(Client_InGameMenu_C_Event_InputSourceChanged) == 0x000001, "Wrong size on Client_InGameMenu_C_Event_InputSourceChanged");
static_assert(offsetof(Client_InGameMenu_C_Event_InputSourceChanged, bIsGamepad) == 0x000000, "Member 'Client_InGameMenu_C_Event_InputSourceChanged::bIsGamepad' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Client_InGameMenu_C_BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on Client_InGameMenu_C_BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(sizeof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature) == 0x000008, "Wrong size on Client_InGameMenu_C_BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature");
static_assert(offsetof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'Client_InGameMenu_C_BndEvt__Client_InGameMenu_ExitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.Event_OnUnfocusMenu
// 0x0001 (0x0001 - 0x0000)
struct Client_InGameMenu_C_Event_OnUnfocusMenu final
{
public:
	bool                                          bShouldHide;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_Event_OnUnfocusMenu) == 0x000001, "Wrong alignment on Client_InGameMenu_C_Event_OnUnfocusMenu");
static_assert(sizeof(Client_InGameMenu_C_Event_OnUnfocusMenu) == 0x000001, "Wrong size on Client_InGameMenu_C_Event_OnUnfocusMenu");
static_assert(offsetof(Client_InGameMenu_C_Event_OnUnfocusMenu, bShouldHide) == 0x000000, "Member 'Client_InGameMenu_C_Event_OnUnfocusMenu::bShouldHide' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature final
{
public:
	class URBMenuTabButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature");
static_assert(sizeof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature");
static_assert(offsetof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Client_InGameMenu_C_BndEvt__Client_InGameMenu_GroupButtom_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Client_InGameMenu_C_BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature final
{
public:
	class URBMenuTabButton*                       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Client_InGameMenu_C_BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature");
static_assert(sizeof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Client_InGameMenu_C_BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature");
static_assert(offsetof(Client_InGameMenu_C_BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Client_InGameMenu_C_BndEvt__Client_InGameMenu_SystemButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Client_InGameMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_PreConstruct) == 0x000001, "Wrong alignment on Client_InGameMenu_C_PreConstruct");
static_assert(sizeof(Client_InGameMenu_C_PreConstruct) == 0x000001, "Wrong size on Client_InGameMenu_C_PreConstruct");
static_assert(offsetof(Client_InGameMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Client_InGameMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.GetDevOptionsBtnVisibility
// 0x0002 (0x0002 - 0x0000)
struct Client_InGameMenu_C_GetDevOptionsBtnVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreCheatsEnabled_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_GetDevOptionsBtnVisibility) == 0x000001, "Wrong alignment on Client_InGameMenu_C_GetDevOptionsBtnVisibility");
static_assert(sizeof(Client_InGameMenu_C_GetDevOptionsBtnVisibility) == 0x000002, "Wrong size on Client_InGameMenu_C_GetDevOptionsBtnVisibility");
static_assert(offsetof(Client_InGameMenu_C_GetDevOptionsBtnVisibility, ReturnValue) == 0x000000, "Member 'Client_InGameMenu_C_GetDevOptionsBtnVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_GetDevOptionsBtnVisibility, CallFunc_AreCheatsEnabled_ReturnValue) == 0x000001, "Member 'Client_InGameMenu_C_GetDevOptionsBtnVisibility::CallFunc_AreCheatsEnabled_ReturnValue' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.GetReturnToLobbyBtnVisibility
// 0x0018 (0x0018 - 0x0000)
struct Client_InGameMenu_C_GetReturnToLobbyBtnVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_GetReturnToLobbyBtnVisibility) == 0x000008, "Wrong alignment on Client_InGameMenu_C_GetReturnToLobbyBtnVisibility");
static_assert(sizeof(Client_InGameMenu_C_GetReturnToLobbyBtnVisibility) == 0x000018, "Wrong size on Client_InGameMenu_C_GetReturnToLobbyBtnVisibility");
static_assert(offsetof(Client_InGameMenu_C_GetReturnToLobbyBtnVisibility, ReturnValue) == 0x000000, "Member 'Client_InGameMenu_C_GetReturnToLobbyBtnVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_GetReturnToLobbyBtnVisibility, CallFunc_GetRBGameStateLobby_ReturnValue) == 0x000008, "Member 'Client_InGameMenu_C_GetReturnToLobbyBtnVisibility::CallFunc_GetRBGameStateLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_GetReturnToLobbyBtnVisibility, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Client_InGameMenu_C_GetReturnToLobbyBtnVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.GetReturnToLobbyBtnIsEnabled
// 0x0018 (0x0018 - 0x0000)
struct Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBController*                          CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLeaving_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled) == 0x000008, "Wrong alignment on Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled");
static_assert(sizeof(Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled) == 0x000018, "Wrong size on Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled");
static_assert(offsetof(Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled, ReturnValue) == 0x000000, "Member 'Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000008, "Member 'Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled, CallFunc_IsLeaving_ReturnValue) == 0x000010, "Member 'Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled::CallFunc_IsLeaving_ReturnValue' has a wrong offset!");
static_assert(offsetof(Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'Client_InGameMenu_C_GetReturnToLobbyBtnIsEnabled::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.GetQuitFacilityButtonsEnabled
// 0x0001 (0x0001 - 0x0000)
struct Client_InGameMenu_C_GetQuitFacilityButtonsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Client_InGameMenu_C_GetQuitFacilityButtonsEnabled) == 0x000001, "Wrong alignment on Client_InGameMenu_C_GetQuitFacilityButtonsEnabled");
static_assert(sizeof(Client_InGameMenu_C_GetQuitFacilityButtonsEnabled) == 0x000001, "Wrong size on Client_InGameMenu_C_GetQuitFacilityButtonsEnabled");
static_assert(offsetof(Client_InGameMenu_C_GetQuitFacilityButtonsEnabled, ReturnValue) == 0x000000, "Member 'Client_InGameMenu_C_GetQuitFacilityButtonsEnabled::ReturnValue' has a wrong offset!");

// Function Client_InGameMenu.Client_InGameMenu_C.SetupVariators
// 0x0140 (0x0140 - 0x0000)
struct Client_InGameMenu_C_SetupVariators final
{
public:
	int32                                         VisibleVariatorCount;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInGameMenuVariatorEntry_C*             CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FText Description)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_ShouldDisplayVariators_bShouldDisplayVariators; // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGameStructureConfig*                 CallFunc_GetGameStructureConfig_ReturnValue;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBVariatorManager*                     CallFunc_GetVariatorManager_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVariatorUniqueTypeActive_ReturnValue;   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVariatorUniqueTypeActive_ReturnValue_1; // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBVariatorManager*                     CallFunc_GetVariatorManager_ReturnValue_1;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class URBVariatorInfo*>                CallFunc_GetCurrentVariatorConfigs_ReturnValue;    // 0x0098(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBVariatorInfo*                        CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
