#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectibleDocument_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CollectibleDocument_BP.CollectibleDocument_BP_C
// 0x0020 (0x0AC0 - 0x0AA0)
class ACollectibleDocument_BP_C final : public ARBCollectibleDocumentPickup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   InWorldMesh;                                       // 0x0AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SpawnedActor;                                      // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CollectibleDocument_BP(int32 EntryPoint);
	void Event_OnWorldPopulateFinished();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnPawnSpecialMoveStarted(class ARBPawn* Pawn, ESpecialMove SpecialMove);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CollectibleDocument_BP_C">();
	}
	static class ACollectibleDocument_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACollectibleDocument_BP_C>();
	}
};
static_assert(alignof(ACollectibleDocument_BP_C) == 0x000010, "Wrong alignment on ACollectibleDocument_BP_C");
static_assert(sizeof(ACollectibleDocument_BP_C) == 0x000AC0, "Wrong size on ACollectibleDocument_BP_C");
static_assert(offsetof(ACollectibleDocument_BP_C, UberGraphFrame) == 0x000AA0, "Member 'ACollectibleDocument_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACollectibleDocument_BP_C, InWorldMesh) == 0x000AA8, "Member 'ACollectibleDocument_BP_C::InWorldMesh' has a wrong offset!");
static_assert(offsetof(ACollectibleDocument_BP_C, SpawnedActor) == 0x000AB0, "Member 'ACollectibleDocument_BP_C::SpawnedActor' has a wrong offset!");

}

