#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectibleDocument_BP

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CollectibleDocument_BP.CollectibleDocument_BP_C.ExecuteUbergraph_CollectibleDocument_BP
// 0x0028 (0x0028 - 0x0000)
struct CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_Event_pawn;                                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  K2Node_Event_specialMove;                          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetDocumentId_ReturnValue;                // 0x001C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemAcquired_ReturnValue;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP) == 0x000008, "Wrong alignment on CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP");
static_assert(sizeof(CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP) == 0x000028, "Wrong size on CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP");
static_assert(offsetof(CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP, EntryPoint) == 0x000000, "Member 'CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000008, "Member 'CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP, K2Node_Event_pawn) == 0x000010, "Member 'CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP::K2Node_Event_pawn' has a wrong offset!");
static_assert(offsetof(CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP, K2Node_Event_specialMove) == 0x000018, "Member 'CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP::K2Node_Event_specialMove' has a wrong offset!");
static_assert(offsetof(CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP, CallFunc_IsLocallyControlled_ReturnValue) == 0x00001A, "Member 'CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP, CallFunc_GetDocumentId_ReturnValue) == 0x00001C, "Member 'CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP::CallFunc_GetDocumentId_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP, K2Node_Event_EndPlayReason) == 0x000024, "Member 'CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP, CallFunc_IsItemAcquired_ReturnValue) == 0x000025, "Member 'CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP::CallFunc_IsItemAcquired_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP, CallFunc_IsValid_ReturnValue_1) == 0x000026, "Member 'CollectibleDocument_BP_C_ExecuteUbergraph_CollectibleDocument_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function CollectibleDocument_BP.CollectibleDocument_BP_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct CollectibleDocument_BP_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CollectibleDocument_BP_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on CollectibleDocument_BP_C_ReceiveEndPlay");
static_assert(sizeof(CollectibleDocument_BP_C_ReceiveEndPlay) == 0x000001, "Wrong size on CollectibleDocument_BP_C_ReceiveEndPlay");
static_assert(offsetof(CollectibleDocument_BP_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'CollectibleDocument_BP_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function CollectibleDocument_BP.CollectibleDocument_BP_C.OnPawnSpecialMoveStarted
// 0x0010 (0x0010 - 0x0000)
struct CollectibleDocument_BP_C_OnPawnSpecialMoveStarted final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  SpecialMove;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CollectibleDocument_BP_C_OnPawnSpecialMoveStarted) == 0x000008, "Wrong alignment on CollectibleDocument_BP_C_OnPawnSpecialMoveStarted");
static_assert(sizeof(CollectibleDocument_BP_C_OnPawnSpecialMoveStarted) == 0x000010, "Wrong size on CollectibleDocument_BP_C_OnPawnSpecialMoveStarted");
static_assert(offsetof(CollectibleDocument_BP_C_OnPawnSpecialMoveStarted, Pawn) == 0x000000, "Member 'CollectibleDocument_BP_C_OnPawnSpecialMoveStarted::Pawn' has a wrong offset!");
static_assert(offsetof(CollectibleDocument_BP_C_OnPawnSpecialMoveStarted, SpecialMove) == 0x000008, "Member 'CollectibleDocument_BP_C_OnPawnSpecialMoveStarted::SpecialMove' has a wrong offset!");

}

