#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommunionKids_Base_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass CommunionKids_Base_AnimBP.CommunionKids_Base_AnimBP_C
// 0x0A10 (0x0CD0 - 0x02C0)
class UCommunionKids_Base_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x02F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x0320(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0348(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x03C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x03F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0420(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0448(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0470(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0498(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x04C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x04E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0510(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0538(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0560(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0588(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x05B0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x05D8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0658(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0688(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0708(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0738(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x07B8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x07E8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0868(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0898(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0918(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0948(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x09C8(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0A48(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0B08(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0B38(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0BE8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0C18(0x00B0)()
	bool                                          IsFinished;                                        // 0x0CC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsLooking;                                         // 0x0CC9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsPraying;                                         // 0x0CCA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEating;                                          // 0x0CCB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSpinning;                                        // 0x0CCC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void StartEat();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CommunionKids_Base_AnimBP_AnimGraphNode_TransitionResult_227B87124A616DB46B321482661DE352();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimNotify_Eating();
	void ExecuteUbergraph_CommunionKids_Base_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CommunionKids_Base_AnimBP_C">();
	}
	static class UCommunionKids_Base_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommunionKids_Base_AnimBP_C>();
	}
};
static_assert(alignof(UCommunionKids_Base_AnimBP_C) == 0x000010, "Wrong alignment on UCommunionKids_Base_AnimBP_C");
static_assert(sizeof(UCommunionKids_Base_AnimBP_C) == 0x000CD0, "Wrong size on UCommunionKids_Base_AnimBP_C");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, UberGraphFrame) == 0x0002C0, "Member 'UCommunionKids_Base_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_TransitionResult_13) == 0x0002F8, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_TransitionResult_12) == 0x000320, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x000348, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_StateResult_7) == 0x0003C8, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_TransitionResult_11) == 0x0003F8, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_TransitionResult_10) == 0x000420, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_TransitionResult_9) == 0x000448, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_TransitionResult_8) == 0x000470, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_TransitionResult_7) == 0x000498, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_TransitionResult_6) == 0x0004C0, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_TransitionResult_5) == 0x0004E8, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_TransitionResult_4) == 0x000510, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_TransitionResult_3) == 0x000538, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_TransitionResult_2) == 0x000560, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000588, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_TransitionResult) == 0x0005B0, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x0005D8, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_StateResult_6) == 0x000658, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x000688, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_StateResult_5) == 0x000708, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000738, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_StateResult_4) == 0x0007B8, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x0007E8, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_StateResult_3) == 0x000868, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000898, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_StateResult_2) == 0x000918, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000948, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x0009C8, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x000A48, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_StateResult_1) == 0x000B08, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_StateMachine_1) == 0x000B38, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_StateResult) == 0x000BE8, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, AnimGraphNode_StateMachine) == 0x000C18, "Member 'UCommunionKids_Base_AnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, IsFinished) == 0x000CC8, "Member 'UCommunionKids_Base_AnimBP_C::IsFinished' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, IsLooking) == 0x000CC9, "Member 'UCommunionKids_Base_AnimBP_C::IsLooking' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, IsPraying) == 0x000CCA, "Member 'UCommunionKids_Base_AnimBP_C::IsPraying' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, IsEating) == 0x000CCB, "Member 'UCommunionKids_Base_AnimBP_C::IsEating' has a wrong offset!");
static_assert(offsetof(UCommunionKids_Base_AnimBP_C, IsSpinning) == 0x000CCC, "Member 'UCommunionKids_Base_AnimBP_C::IsSpinning' has a wrong offset!");

}

