#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommunionKids_Base_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CommunionKids_Base_AnimBP.CommunionKids_Base_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct CommunionKids_Base_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(CommunionKids_Base_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on CommunionKids_Base_AnimBP_C_AnimGraph");
static_assert(sizeof(CommunionKids_Base_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on CommunionKids_Base_AnimBP_C_AnimGraph");
static_assert(offsetof(CommunionKids_Base_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'CommunionKids_Base_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function CommunionKids_Base_AnimBP.CommunionKids_Base_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct CommunionKids_Base_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommunionKids_Base_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on CommunionKids_Base_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(CommunionKids_Base_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on CommunionKids_Base_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(CommunionKids_Base_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'CommunionKids_Base_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function CommunionKids_Base_AnimBP.CommunionKids_Base_AnimBP_C.ExecuteUbergraph_CommunionKids_Base_AnimBP
// 0x0028 (0x0028 - 0x0000)
struct CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AScriptedNPC_Base_BP_C*                 K2Node_DynamicCast_AsScripted_NPC_Base_BP;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP) == 0x000008, "Wrong alignment on CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP");
static_assert(sizeof(CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP) == 0x000028, "Wrong size on CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP");
static_assert(offsetof(CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP, EntryPoint) == 0x000000, "Member 'CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP, CallFunc_Less_FloatFloat_ReturnValue) == 0x000009, "Member 'CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP, K2Node_Event_DeltaTimeX) == 0x00000C, "Member 'CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP, CallFunc_GetOwningActor_ReturnValue) == 0x000010, "Member 'CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP, K2Node_DynamicCast_AsScripted_NPC_Base_BP) == 0x000018, "Member 'CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP::K2Node_DynamicCast_AsScripted_NPC_Base_BP' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CommunionKids_Base_AnimBP_C_ExecuteUbergraph_CommunionKids_Base_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

