#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommunionKids_Base_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CommunionKids_Base_BP.CommunionKids_Base_BP_C.setBlood
// 0x0068 (0x0068 - 0x0000)
struct CommunionKids_Base_BP_C_SetBlood final
{
public:
	float                                         IncrementalValue;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _BloodAmount;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommunionKids_Base_BP_C_SetBlood) == 0x000008, "Wrong alignment on CommunionKids_Base_BP_C_SetBlood");
static_assert(sizeof(CommunionKids_Base_BP_C_SetBlood) == 0x000068, "Wrong size on CommunionKids_Base_BP_C_SetBlood");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, IncrementalValue) == 0x000000, "Member 'CommunionKids_Base_BP_C_SetBlood::IncrementalValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, _BloodAmount) == 0x000004, "Member 'CommunionKids_Base_BP_C_SetBlood::_BloodAmount' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, Temp_int_Array_Index_Variable) == 0x000008, "Member 'CommunionKids_Base_BP_C_SetBlood::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'CommunionKids_Base_BP_C_SetBlood::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'CommunionKids_Base_BP_C_SetBlood::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'CommunionKids_Base_BP_C_SetBlood::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'CommunionKids_Base_BP_C_SetBlood::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, K2Node_MakeStruct_LinearColor) == 0x00001C, "Member 'CommunionKids_Base_BP_C_SetBlood::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'CommunionKids_Base_BP_C_SetBlood::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, CallFunc_Array_Get_Item) == 0x000030, "Member 'CommunionKids_Base_BP_C_SetBlood::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'CommunionKids_Base_BP_C_SetBlood::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'CommunionKids_Base_BP_C_SetBlood::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'CommunionKids_Base_BP_C_SetBlood::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, CallFunc_Add_FloatFloat_ReturnValue) == 0x000048, "Member 'CommunionKids_Base_BP_C_SetBlood::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, CallFunc_FMin_ReturnValue) == 0x00004C, "Member 'CommunionKids_Base_BP_C_SetBlood::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'CommunionKids_Base_BP_C_SetBlood::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, CallFunc_Less_IntInt_ReturnValue_1) == 0x000054, "Member 'CommunionKids_Base_BP_C_SetBlood::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_SetBlood, K2Node_MakeStruct_LinearColor_1) == 0x000058, "Member 'CommunionKids_Base_BP_C_SetBlood::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");

// Function CommunionKids_Base_BP.CommunionKids_Base_BP_C.ApplyStateToAnimInstance
// 0x0030 (0x0030 - 0x0000)
struct CommunionKids_Base_BP_C_ApplyStateToAnimInstance final
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommunionKids_Base_AnimBP_C*           K2Node_DynamicCast_AsCommunion_Kids_Base_Anim_BP;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommunionKids_Base_BP_C_ApplyStateToAnimInstance) == 0x000008, "Wrong alignment on CommunionKids_Base_BP_C_ApplyStateToAnimInstance");
static_assert(sizeof(CommunionKids_Base_BP_C_ApplyStateToAnimInstance) == 0x000030, "Wrong size on CommunionKids_Base_BP_C_ApplyStateToAnimInstance");
static_assert(offsetof(CommunionKids_Base_BP_C_ApplyStateToAnimInstance, SkeletalMesh) == 0x000000, "Member 'CommunionKids_Base_BP_C_ApplyStateToAnimInstance::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ApplyStateToAnimInstance, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'CommunionKids_Base_BP_C_ApplyStateToAnimInstance::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ApplyStateToAnimInstance, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'CommunionKids_Base_BP_C_ApplyStateToAnimInstance::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ApplyStateToAnimInstance, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'CommunionKids_Base_BP_C_ApplyStateToAnimInstance::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ApplyStateToAnimInstance, K2Node_DynamicCast_AsCommunion_Kids_Base_Anim_BP) == 0x000020, "Member 'CommunionKids_Base_BP_C_ApplyStateToAnimInstance::K2Node_DynamicCast_AsCommunion_Kids_Base_Anim_BP' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ApplyStateToAnimInstance, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CommunionKids_Base_BP_C_ApplyStateToAnimInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ApplyStateToAnimInstance, CallFunc_BooleanOR_ReturnValue) == 0x000029, "Member 'CommunionKids_Base_BP_C_ApplyStateToAnimInstance::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function CommunionKids_Base_BP.CommunionKids_Base_BP_C.TickRecentering
// 0x0170 (0x0170 - 0x0000)
struct CommunionKids_Base_BP_C_TickRecentering final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeRotationAngle_ReturnValue;       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0048(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Approach_ReturnValue;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x00E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(CommunionKids_Base_BP_C_TickRecentering) == 0x000008, "Wrong alignment on CommunionKids_Base_BP_C_TickRecentering");
static_assert(sizeof(CommunionKids_Base_BP_C_TickRecentering) == 0x000170, "Wrong size on CommunionKids_Base_BP_C_TickRecentering");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, DeltaTime) == 0x000000, "Member 'CommunionKids_Base_BP_C_TickRecentering::DeltaTime' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000010, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_BreakRotator_Roll) == 0x00001C, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_BreakRotator_Pitch) == 0x000020, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_BreakRotator_Yaw) == 0x000024, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000028, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00002C, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000030, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_NormalizeRotationAngle_ReturnValue) == 0x000034, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_NormalizeRotationAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_MakeRotator_ReturnValue) == 0x000038, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_Add_FloatFloat_ReturnValue) == 0x000044, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000048, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_Approach_ReturnValue) == 0x0000D0, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_Approach_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_MakeRotator_ReturnValue_1) == 0x0000D4, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_BooleanAND_ReturnValue) == 0x0000E0, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickRecentering, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0000E4, "Member 'CommunionKids_Base_BP_C_TickRecentering::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");

// Function CommunionKids_Base_BP.CommunionKids_Base_BP_C.ShouldBPTick
// 0x0048 (0x0048 - 0x0000)
struct CommunionKids_Base_BP_C_ShouldBPTick final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_1;     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommunionKids_Base_BP_C_ShouldBPTick) == 0x000008, "Wrong alignment on CommunionKids_Base_BP_C_ShouldBPTick");
static_assert(sizeof(CommunionKids_Base_BP_C_ShouldBPTick) == 0x000048, "Wrong size on CommunionKids_Base_BP_C_ShouldBPTick");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, NewParam) == 0x000000, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::NewParam' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_BreakRotator_Roll) == 0x000014, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_BreakRotator_Pitch) == 0x000018, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_BreakRotator_Yaw) == 0x00001C, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000024, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_Not_PreBool_ReturnValue_1) == 0x000030, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_BreakRotator_Roll_1) == 0x000034, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_BreakRotator_Pitch_1) == 0x000038, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_BreakRotator_Yaw_1) == 0x00003C, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_NearlyEqual_FloatFloat_ReturnValue_1) == 0x000040, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_NearlyEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_Not_PreBool_ReturnValue_2) == 0x000042, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_BooleanAND_ReturnValue_1) == 0x000043, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_BooleanOR_ReturnValue) == 0x000044, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ShouldBPTick, CallFunc_BooleanAND_ReturnValue_2) == 0x000045, "Member 'CommunionKids_Base_BP_C_ShouldBPTick::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function CommunionKids_Base_BP.CommunionKids_Base_BP_C.TickReorientingAngle
// 0x0050 (0x0050 - 0x0000)
struct CommunionKids_Base_BP_C_TickReorientingAngle final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_NormalizeRotationAngle_ReturnValue;       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Approach_ReturnValue;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommunionKids_Base_BP_C_TickReorientingAngle) == 0x000004, "Wrong alignment on CommunionKids_Base_BP_C_TickReorientingAngle");
static_assert(sizeof(CommunionKids_Base_BP_C_TickReorientingAngle) == 0x000050, "Wrong size on CommunionKids_Base_BP_C_TickReorientingAngle");
static_assert(offsetof(CommunionKids_Base_BP_C_TickReorientingAngle, DeltaTime) == 0x000000, "Member 'CommunionKids_Base_BP_C_TickReorientingAngle::DeltaTime' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickReorientingAngle, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000004, "Member 'CommunionKids_Base_BP_C_TickReorientingAngle::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickReorientingAngle, CallFunc_BreakRotator_Roll) == 0x000010, "Member 'CommunionKids_Base_BP_C_TickReorientingAngle::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickReorientingAngle, CallFunc_BreakRotator_Pitch) == 0x000014, "Member 'CommunionKids_Base_BP_C_TickReorientingAngle::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickReorientingAngle, CallFunc_BreakRotator_Yaw) == 0x000018, "Member 'CommunionKids_Base_BP_C_TickReorientingAngle::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickReorientingAngle, CallFunc_MakeRotator_ReturnValue) == 0x00001C, "Member 'CommunionKids_Base_BP_C_TickReorientingAngle::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickReorientingAngle, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000028, "Member 'CommunionKids_Base_BP_C_TickReorientingAngle::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickReorientingAngle, CallFunc_K2_SetActorRotation_ReturnValue) == 0x00002C, "Member 'CommunionKids_Base_BP_C_TickReorientingAngle::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickReorientingAngle, CallFunc_NormalizeRotationAngle_ReturnValue) == 0x000030, "Member 'CommunionKids_Base_BP_C_TickReorientingAngle::CallFunc_NormalizeRotationAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickReorientingAngle, CallFunc_Add_FloatFloat_ReturnValue) == 0x000034, "Member 'CommunionKids_Base_BP_C_TickReorientingAngle::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickReorientingAngle, CallFunc_Approach_ReturnValue) == 0x000038, "Member 'CommunionKids_Base_BP_C_TickReorientingAngle::CallFunc_Approach_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickReorientingAngle, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00003C, "Member 'CommunionKids_Base_BP_C_TickReorientingAngle::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickReorientingAngle, CallFunc_MakeRotator_ReturnValue_1) == 0x000040, "Member 'CommunionKids_Base_BP_C_TickReorientingAngle::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_TickReorientingAngle, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x00004C, "Member 'CommunionKids_Base_BP_C_TickReorientingAngle::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");

// Function CommunionKids_Base_BP.CommunionKids_Base_BP_C.StartStaring
// 0x0008 (0x0008 - 0x0000)
struct CommunionKids_Base_BP_C_StartStaring final
{
public:
	class AActor*                                 StaringActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommunionKids_Base_BP_C_StartStaring) == 0x000008, "Wrong alignment on CommunionKids_Base_BP_C_StartStaring");
static_assert(sizeof(CommunionKids_Base_BP_C_StartStaring) == 0x000008, "Wrong size on CommunionKids_Base_BP_C_StartStaring");
static_assert(offsetof(CommunionKids_Base_BP_C_StartStaring, StaringActor) == 0x000000, "Member 'CommunionKids_Base_BP_C_StartStaring::StaringActor' has a wrong offset!");

// Function CommunionKids_Base_BP.CommunionKids_Base_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct CommunionKids_Base_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommunionKids_Base_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on CommunionKids_Base_BP_C_ReceiveTick");
static_assert(sizeof(CommunionKids_Base_BP_C_ReceiveTick) == 0x000004, "Wrong size on CommunionKids_Base_BP_C_ReceiveTick");
static_assert(offsetof(CommunionKids_Base_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'CommunionKids_Base_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function CommunionKids_Base_BP.CommunionKids_Base_BP_C.ExecuteUbergraph_CommunionKids_Base_BP
// 0x00C0 (0x00C0 - 0x0000)
struct CommunionKids_Base_BP_C_ExecuteUbergraph_CommunionKids_Base_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_StaringActor;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetYawPitchFromVector_Yaw;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetYawPitchFromVector_Pitch;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBPTick_NewParam;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommunionKids_Base_AnimBP_C*           K2Node_DynamicCast_AsCommunion_Kids_Base_Anim_BP;  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommunionKids_Base_AnimBP_C*           K2Node_DynamicCast_AsCommunion_Kids_Base_Anim_BP_1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(CommunionKids_Base_BP_C_ExecuteUbergraph_CommunionKids_Base_BP) == 0x000008, "Wrong alignment on CommunionKids_Base_BP_C_ExecuteUbergraph_CommunionKids_Base_BP");
static_assert(sizeof(CommunionKids_Base_BP_C_ExecuteUbergraph_CommunionKids_Base_BP) == 0x0000C0, "Wrong size on CommunionKids_Base_BP_C_ExecuteUbergraph_CommunionKids_Base_BP");
static_assert(offsetof(CommunionKids_Base_BP_C_ExecuteUbergraph_CommunionKids_Base_BP, EntryPoint) == 0x000000, "Member 'CommunionKids_Base_BP_C_ExecuteUbergraph_CommunionKids_Base_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CommunionKids_Base_BP_C_ExecuteUbergraph_CommunionKids_Base_BP, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000008, "Member 'CommunionKids_Base_BP_C_ExecuteUbergraph_CommunionKids_Base_BP::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
