#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommunionKids_Base_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CommunionKids_Base_BP.CommunionKids_Base_BP_C
// 0x0060 (0x0388 - 0x0328)
class ACommunionKids_Base_BP_C final : public ARBScriptedAnimStation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   RHand;                                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LHand;                                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ViolentKid_Solo;                                   // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ARBBot*                                 bot;                                               // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPraying;                                         // 0x0350(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          IsStaring;                                         // 0x0351(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OrientationYaw;                                    // 0x0354(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRecentering;                                     // 0x0358(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InitialYaw;                                        // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsReorienting;                                     // 0x0360(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          IsSpinning;                                        // 0x0361(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_362[0x2];                                      // 0x0362(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Blood;                                             // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         SkeletalMeshes;                                    // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           Staticmeshes;                                      // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void SetBlood(float IncrementalValue);
	void OnRep_OrientationYaw();
	void ApplyStateToAnimInstance(class USkeletalMeshComponent* SkeletalMesh);
	void OnRep_IsReorienting();
	void TickRecentering(float DeltaTime);
	void ShouldBPTick(bool* NewParam);
	void OnRep_IsRecentering();
	void TickReorientingAngle(float DeltaTime);
	void OnRep_IsLooking();
	void Refresh_Anim_State();
	void OnRep_IsPraying();
	void StartExiting();
	void Event_StartedScriptedAnim();
	void Event_OnResetStage();
	void Detach();
	void StartPraying();
	void StartStaring(class AActor* StaringActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_CommunionKids_Base_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CommunionKids_Base_BP_C">();
	}
	static class ACommunionKids_Base_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACommunionKids_Base_BP_C>();
	}
};
static_assert(alignof(ACommunionKids_Base_BP_C) == 0x000008, "Wrong alignment on ACommunionKids_Base_BP_C");
static_assert(sizeof(ACommunionKids_Base_BP_C) == 0x000388, "Wrong size on ACommunionKids_Base_BP_C");
static_assert(offsetof(ACommunionKids_Base_BP_C, UberGraphFrame) == 0x000328, "Member 'ACommunionKids_Base_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACommunionKids_Base_BP_C, RHand) == 0x000330, "Member 'ACommunionKids_Base_BP_C::RHand' has a wrong offset!");
static_assert(offsetof(ACommunionKids_Base_BP_C, LHand) == 0x000338, "Member 'ACommunionKids_Base_BP_C::LHand' has a wrong offset!");
static_assert(offsetof(ACommunionKids_Base_BP_C, ViolentKid_Solo) == 0x000340, "Member 'ACommunionKids_Base_BP_C::ViolentKid_Solo' has a wrong offset!");
static_assert(offsetof(ACommunionKids_Base_BP_C, bot) == 0x000348, "Member 'ACommunionKids_Base_BP_C::bot' has a wrong offset!");
static_assert(offsetof(ACommunionKids_Base_BP_C, IsPraying) == 0x000350, "Member 'ACommunionKids_Base_BP_C::IsPraying' has a wrong offset!");
static_assert(offsetof(ACommunionKids_Base_BP_C, IsStaring) == 0x000351, "Member 'ACommunionKids_Base_BP_C::IsStaring' has a wrong offset!");
static_assert(offsetof(ACommunionKids_Base_BP_C, OrientationYaw) == 0x000354, "Member 'ACommunionKids_Base_BP_C::OrientationYaw' has a wrong offset!");
static_assert(offsetof(ACommunionKids_Base_BP_C, IsRecentering) == 0x000358, "Member 'ACommunionKids_Base_BP_C::IsRecentering' has a wrong offset!");
static_assert(offsetof(ACommunionKids_Base_BP_C, InitialYaw) == 0x00035C, "Member 'ACommunionKids_Base_BP_C::InitialYaw' has a wrong offset!");
static_assert(offsetof(ACommunionKids_Base_BP_C, IsReorienting) == 0x000360, "Member 'ACommunionKids_Base_BP_C::IsReorienting' has a wrong offset!");
static_assert(offsetof(ACommunionKids_Base_BP_C, IsSpinning) == 0x000361, "Member 'ACommunionKids_Base_BP_C::IsSpinning' has a wrong offset!");
static_assert(offsetof(ACommunionKids_Base_BP_C, Blood) == 0x000364, "Member 'ACommunionKids_Base_BP_C::Blood' has a wrong offset!");
static_assert(offsetof(ACommunionKids_Base_BP_C, SkeletalMeshes) == 0x000368, "Member 'ACommunionKids_Base_BP_C::SkeletalMeshes' has a wrong offset!");
static_assert(offsetof(ACommunionKids_Base_BP_C, Staticmeshes) == 0x000378, "Member 'ACommunionKids_Base_BP_C::Staticmeshes' has a wrong offset!");

}

