#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConsumingProgressWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ConsumingProgressWidget.ConsumingProgressWidget_C
// 0x0038 (0x0320 - 0x02E8)
class UConsumingProgressWidget_C final : public URBHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_ConsumingProgressWidget;           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Progress;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         ProgressRatio;                                     // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DynamicMaterial_Circle;                            // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial_Status;                            // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerActionStatus                           CurrentStatus;                                     // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNeedVisibilityUpdate;                             // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ConsumingProgressWidget(int32 EntryPoint);
	void OnStatusChanged(EPlayerActionStatus Status);
	void Event_Hide();
	void OnProgressChanged(float NewProgress, EActionProgressContext Context);
	void Construct();
	void UpdateProgress(float Progress_0);
	void UpdateTextures();

	bool ShouldShow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ConsumingProgressWidget_C">();
	}
	static class UConsumingProgressWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConsumingProgressWidget_C>();
	}
};
static_assert(alignof(UConsumingProgressWidget_C) == 0x000008, "Wrong alignment on UConsumingProgressWidget_C");
static_assert(sizeof(UConsumingProgressWidget_C) == 0x000320, "Wrong size on UConsumingProgressWidget_C");
static_assert(offsetof(UConsumingProgressWidget_C, UberGraphFrame) == 0x0002E8, "Member 'UConsumingProgressWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UConsumingProgressWidget_C, InvalidationBox_ConsumingProgressWidget) == 0x0002F0, "Member 'UConsumingProgressWidget_C::InvalidationBox_ConsumingProgressWidget' has a wrong offset!");
static_assert(offsetof(UConsumingProgressWidget_C, Progress) == 0x0002F8, "Member 'UConsumingProgressWidget_C::Progress' has a wrong offset!");
static_assert(offsetof(UConsumingProgressWidget_C, ProgressRatio) == 0x000300, "Member 'UConsumingProgressWidget_C::ProgressRatio' has a wrong offset!");
static_assert(offsetof(UConsumingProgressWidget_C, DynamicMaterial_Circle) == 0x000308, "Member 'UConsumingProgressWidget_C::DynamicMaterial_Circle' has a wrong offset!");
static_assert(offsetof(UConsumingProgressWidget_C, DynamicMaterial_Status) == 0x000310, "Member 'UConsumingProgressWidget_C::DynamicMaterial_Status' has a wrong offset!");
static_assert(offsetof(UConsumingProgressWidget_C, CurrentStatus) == 0x000318, "Member 'UConsumingProgressWidget_C::CurrentStatus' has a wrong offset!");
static_assert(offsetof(UConsumingProgressWidget_C, bNeedVisibilityUpdate) == 0x000319, "Member 'UConsumingProgressWidget_C::bNeedVisibilityUpdate' has a wrong offset!");

}

