#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContMinusDirectSurfaceMinusBoxOpenMinus03_BP

#include "Basic.hpp"

#include "Base_Cont_DirectSurface_DualSpawn_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Cont-DirectSurface-BoxOpen-03_BP.Cont-DirectSurface-BoxOpen-03_BP_C
// 0x0020 (0x03A0 - 0x0380)
class AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C final : public ABase_Cont_DirectSurface_DualSpawn_BP_C
{
public:
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview03;                         // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    EditorIcon2;                                       // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SpawningBVPreviz03;                                // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     SpawnLocation03;                                   // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cont-DirectSurface-BoxOpen-03_BP_C">();
	}
	static class AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C>();
	}
};
static_assert(alignof(AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C) == 0x000008, "Wrong alignment on AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C");
static_assert(sizeof(AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C) == 0x0003A0, "Wrong size on AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C");
static_assert(offsetof(AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C, RBEditorSelectedPreview03) == 0x000380, "Member 'AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C::RBEditorSelectedPreview03' has a wrong offset!");
static_assert(offsetof(AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C, EditorIcon2) == 0x000388, "Member 'AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C::EditorIcon2' has a wrong offset!");
static_assert(offsetof(AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C, SpawningBVPreviz03) == 0x000390, "Member 'AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C::SpawningBVPreviz03' has a wrong offset!");
static_assert(offsetof(AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C, SpawnLocation03) == 0x000398, "Member 'AContMinusDirectSurfaceMinusBoxOpenMinus03_BP_C::SpawnLocation03' has a wrong offset!");

}

