#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContainerTrap_Base_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ContainerTrap_Base_BP.ContainerTrap_Base_BP_C
// 0x0140 (0x0560 - 0x0420)
class AContainerTrap_Base_BP_C : public ARBContainerTrapTriggerable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBSoundComponent*                      RBSound;                                           // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      OnHackVFX;                                         // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBHackableComponent*                   RBHackable;                                        // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBActiveSkillVisionComponent*          RBActiveSkillVision;                               // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Gas_PS;                                            // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          GasBox;                                            // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GasTrapTriggerMinus01;                             // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GasTrapMesh;                                       // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TrapTimeline_TrapRatio_C8FC944E452CDFE4159C5C884366215E; // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TrapTimeline__Direction_C8FC944E452CDFE4159C5C884366215E; // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TrapTimeline;                                      // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ARBPlayer*>                      GassedPlayers;                                     // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FConfigurableFloat                     PsychosisValue;                                    // 0x0490(0x00C8)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   TrapReactionDelayMultiplierSettingName;            // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateGas();
	void TrapTimeline__FinishedFunc();
	void TrapTimeline__UpdateFunc();
	void Event_OnTriggered();
	void Event_OnResetStage();
	void BndEvt__ContainerTrap_Base_BP_RBHackable_K2Node_ComponentBoundEvent_0_OnCurrentHackStateChanged__DelegateSignature(class URBHackableComponent* HackableComponent);
	void ExecuteUbergraph_ContainerTrap_Base_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ContainerTrap_Base_BP_C">();
	}
	static class AContainerTrap_Base_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AContainerTrap_Base_BP_C>();
	}
};
static_assert(alignof(AContainerTrap_Base_BP_C) == 0x000010, "Wrong alignment on AContainerTrap_Base_BP_C");
static_assert(sizeof(AContainerTrap_Base_BP_C) == 0x000560, "Wrong size on AContainerTrap_Base_BP_C");
static_assert(offsetof(AContainerTrap_Base_BP_C, UberGraphFrame) == 0x000420, "Member 'AContainerTrap_Base_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, RBSound) == 0x000428, "Member 'AContainerTrap_Base_BP_C::RBSound' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, OnHackVFX) == 0x000430, "Member 'AContainerTrap_Base_BP_C::OnHackVFX' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, RBHackable) == 0x000438, "Member 'AContainerTrap_Base_BP_C::RBHackable' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, RBActiveSkillVision) == 0x000440, "Member 'AContainerTrap_Base_BP_C::RBActiveSkillVision' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, Gas_PS) == 0x000448, "Member 'AContainerTrap_Base_BP_C::Gas_PS' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, GasBox) == 0x000450, "Member 'AContainerTrap_Base_BP_C::GasBox' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, GasTrapTriggerMinus01) == 0x000458, "Member 'AContainerTrap_Base_BP_C::GasTrapTriggerMinus01' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, GasTrapMesh) == 0x000460, "Member 'AContainerTrap_Base_BP_C::GasTrapMesh' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, Root) == 0x000468, "Member 'AContainerTrap_Base_BP_C::Root' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, TrapTimeline_TrapRatio_C8FC944E452CDFE4159C5C884366215E) == 0x000470, "Member 'AContainerTrap_Base_BP_C::TrapTimeline_TrapRatio_C8FC944E452CDFE4159C5C884366215E' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, TrapTimeline__Direction_C8FC944E452CDFE4159C5C884366215E) == 0x000474, "Member 'AContainerTrap_Base_BP_C::TrapTimeline__Direction_C8FC944E452CDFE4159C5C884366215E' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, TrapTimeline) == 0x000478, "Member 'AContainerTrap_Base_BP_C::TrapTimeline' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, GassedPlayers) == 0x000480, "Member 'AContainerTrap_Base_BP_C::GassedPlayers' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, PsychosisValue) == 0x000490, "Member 'AContainerTrap_Base_BP_C::PsychosisValue' has a wrong offset!");
static_assert(offsetof(AContainerTrap_Base_BP_C, TrapReactionDelayMultiplierSettingName) == 0x000558, "Member 'AContainerTrap_Base_BP_C::TrapReactionDelayMultiplierSettingName' has a wrong offset!");

}

