#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContMinusHealthMinusMedkit_GhostAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Cont-Health-Medkit_GhostAnimBP.Cont-Health-Medkit_GhostAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ContMinusHealthMinusMedkit_GhostAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ContMinusHealthMinusMedkit_GhostAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on ContMinusHealthMinusMedkit_GhostAnimBP_C_AnimGraph");
static_assert(sizeof(ContMinusHealthMinusMedkit_GhostAnimBP_C_AnimGraph) == 0x000010, "Wrong size on ContMinusHealthMinusMedkit_GhostAnimBP_C_AnimGraph");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Cont-Health-Medkit_GhostAnimBP.Cont-Health-Medkit_GhostAnimBP_C.ExecuteUbergraph_Cont-Health-Medkit_GhostAnimBP
// 0x0060 (0x0060 - 0x0000)
struct ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsInFirstPerson_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BP_GetPawnTargetLocation_ReturnValue;     // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentValue_ScheduledUObject_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AContMinusHealthMinusMedkit_BP_C*       K2Node_DynamicCast_AsCont__Health__Medkit_BP;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GhostAnimTransition_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP) == 0x000008, "Wrong alignment on ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP");
static_assert(sizeof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP) == 0x000060, "Wrong size on ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, EntryPoint) == 0x000000, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, CallFunc_BP_IsInFirstPerson_ReturnValue) == 0x000004, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::CallFunc_BP_IsInFirstPerson_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000005, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, CallFunc_BP_GetPawnTargetLocation_ReturnValue) == 0x000008, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::CallFunc_BP_GetPawnTargetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, CallFunc_GetCurrentValue_ScheduledUObject_ReturnValue) == 0x000018, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::CallFunc_GetCurrentValue_ScheduledUObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, CallFunc_BreakVector_X) == 0x000020, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, CallFunc_BreakVector_Y) == 0x000024, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, CallFunc_BreakVector_Z) == 0x000028, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, K2Node_DynamicCast_AsCont__Health__Medkit_BP) == 0x000030, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::K2Node_DynamicCast_AsCont__Health__Medkit_BP' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00003C, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, CallFunc_BreakVector_X_1) == 0x000048, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, CallFunc_BreakVector_Y_1) == 0x00004C, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, CallFunc_BreakVector_Z_1) == 0x000050, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, CallFunc_GhostAnimTransition_ReturnValue) == 0x000054, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::CallFunc_GhostAnimTransition_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000058, "Member 'ContMinusHealthMinusMedkit_GhostAnimBP_C_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

}

