#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlSchemeEntry

#include "Basic.hpp"

#include "BaseOptionsEntry_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ControlSchemeEntry.ControlSchemeEntry_C
// 0x0038 (0x03B0 - 0x0378)
class UControlSchemeEntry_C final : public UBaseOptionsEntry_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ControlSchemeEntry_C;               // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                GamepadFocusHolder;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OptionValue;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UValueCounter_C*                        ValueCounter;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ValueSelectionArrows;                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArrowButton_C*                         VS_LeftArrowBtn;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArrowButton_C*                         VS_RightArrowBtn;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ControlSchemeEntry(int32 EntryPoint);
	void BndEvt__ControlSchemeEntry_VS_LeftArrowBtn_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();
	void BndEvt__ControlSchemeEntry_VS_RightArrowBtn_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void BndEvt__ControlSchemeEntry_VS_RightArrowBtn_K2Node_ComponentBoundEvent_3_OnUnhovered__DelegateSignature();
	void BndEvt__ControlSchemeEntry_VS_LeftArrowBtn_K2Node_ComponentBoundEvent_2_OnUnhovered__DelegateSignature();
	void BndEvt__ControlSchemeEntry_VS_RightArrowBtn_K2Node_ComponentBoundEvent_1_OnHovered__DelegateSignature();
	void BndEvt__ControlSchemeEntry_VS_LeftArrowBtn_K2Node_ComponentBoundEvent_0_OnHovered__DelegateSignature();
	void Event_UpdateTextValue(const class FText& NewValue);
	void PreConstruct(bool IsDesignTime);
	void RefreshCounter();
	void SetupCounter();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void GetArrowBtn(bool Left, class UArrowButton_C** ArrowButton);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ControlSchemeEntry_C">();
	}
	static class UControlSchemeEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlSchemeEntry_C>();
	}
};
static_assert(alignof(UControlSchemeEntry_C) == 0x000008, "Wrong alignment on UControlSchemeEntry_C");
static_assert(sizeof(UControlSchemeEntry_C) == 0x0003B0, "Wrong size on UControlSchemeEntry_C");
static_assert(offsetof(UControlSchemeEntry_C, UberGraphFrame_ControlSchemeEntry_C) == 0x000378, "Member 'UControlSchemeEntry_C::UberGraphFrame_ControlSchemeEntry_C' has a wrong offset!");
static_assert(offsetof(UControlSchemeEntry_C, GamepadFocusHolder) == 0x000380, "Member 'UControlSchemeEntry_C::GamepadFocusHolder' has a wrong offset!");
static_assert(offsetof(UControlSchemeEntry_C, OptionValue) == 0x000388, "Member 'UControlSchemeEntry_C::OptionValue' has a wrong offset!");
static_assert(offsetof(UControlSchemeEntry_C, ValueCounter) == 0x000390, "Member 'UControlSchemeEntry_C::ValueCounter' has a wrong offset!");
static_assert(offsetof(UControlSchemeEntry_C, ValueSelectionArrows) == 0x000398, "Member 'UControlSchemeEntry_C::ValueSelectionArrows' has a wrong offset!");
static_assert(offsetof(UControlSchemeEntry_C, VS_LeftArrowBtn) == 0x0003A0, "Member 'UControlSchemeEntry_C::VS_LeftArrowBtn' has a wrong offset!");
static_assert(offsetof(UControlSchemeEntry_C, VS_RightArrowBtn) == 0x0003A8, "Member 'UControlSchemeEntry_C::VS_RightArrowBtn' has a wrong offset!");

}

