#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContMinusHealthMinusMedkit_GhostAnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Cont-Health-Medkit_GhostAnimBP.Cont-Health-Medkit_GhostAnimBP_C
// 0x09F0 (0x0CE0 - 0x02F0)
class UContMinusHealthMinusMedkit_GhostAnimBP_C final : public URBGhostAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0328(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0350(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0378(0x00A8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0420(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x04C8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0548(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x05C8(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0648(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x06F0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0770(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x07A0(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0888(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0908(0x00A8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x09B0(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0A98(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0B40(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0B70(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0BF0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0C20(0x00B0)()
	float                                         InteractHeight;                                    // 0x0CD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFirstPerson;                                     // 0x0CD4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP_AnimGraphNode_BlendListByBool_AC2BDA67490D9D22F496C19817E00767();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP_AnimGraphNode_BlendListByBool_8C0AD33F4AC8B3BB75819EAB53B0F18C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP_AnimGraphNode_BlendListByBool_B2B7ADBA493AE523A39125A1F3555C99();
	void BlueprintInitializeAnimation();
	void AnimNotify_MedDone();
	void ExecuteUbergraph_ContMinusHealthMinusMedkit_GhostAnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cont-Health-Medkit_GhostAnimBP_C">();
	}
	static class UContMinusHealthMinusMedkit_GhostAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContMinusHealthMinusMedkit_GhostAnimBP_C>();
	}
};
static_assert(alignof(UContMinusHealthMinusMedkit_GhostAnimBP_C) == 0x000010, "Wrong alignment on UContMinusHealthMinusMedkit_GhostAnimBP_C");
static_assert(sizeof(UContMinusHealthMinusMedkit_GhostAnimBP_C) == 0x000CE0, "Wrong size on UContMinusHealthMinusMedkit_GhostAnimBP_C");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, UberGraphFrame) == 0x0002F0, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_Root) == 0x0002F8, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_TransitionResult_1) == 0x000328, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_TransitionResult) == 0x000350, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x000378, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x000420, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x0004C8, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000548, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x0005C8, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x000648, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x0006F0, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_StateResult_2) == 0x000770, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x0007A0, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000888, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x000908, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x0009B0, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_BlendListByBool) == 0x000A98, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_StateResult_1) == 0x000B40, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_SequencePlayer) == 0x000B70, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_StateResult) == 0x000BF0, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, AnimGraphNode_StateMachine) == 0x000C20, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, InteractHeight) == 0x000CD0, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::InteractHeight' has a wrong offset!");
static_assert(offsetof(UContMinusHealthMinusMedkit_GhostAnimBP_C, IsFirstPerson) == 0x000CD4, "Member 'UContMinusHealthMinusMedkit_GhostAnimBP_C::IsFirstPerson' has a wrong offset!");

}

