#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContMinusDirectSurfaceMinusWoodboxMinus02_BP

#include "Basic.hpp"

#include "Base_Cont_DirectSurface_DualSpawn_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Cont-DirectSurface-Woodbox-02_BP.Cont-DirectSurface-Woodbox-02_BP_C
// 0x0040 (0x03C0 - 0x0380)
class AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C final : public ABase_Cont_DirectSurface_DualSpawn_BP_C
{
public:
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview04;                         // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview03;                         // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    EditorIcon3;                                       // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    EditorIcon2;                                       // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SpawnZoneVisualHelper04;                           // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SpawnZoneVisualHelper03;                           // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     SpawnLocation04;                                   // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     SpawnLocation03;                                   // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cont-DirectSurface-Woodbox-02_BP_C">();
	}
	static class AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C>();
	}
};
static_assert(alignof(AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C) == 0x000008, "Wrong alignment on AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C");
static_assert(sizeof(AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C) == 0x0003C0, "Wrong size on AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C");
static_assert(offsetof(AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C, RBEditorSelectedPreview04) == 0x000380, "Member 'AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C::RBEditorSelectedPreview04' has a wrong offset!");
static_assert(offsetof(AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C, RBEditorSelectedPreview03) == 0x000388, "Member 'AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C::RBEditorSelectedPreview03' has a wrong offset!");
static_assert(offsetof(AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C, EditorIcon3) == 0x000390, "Member 'AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C::EditorIcon3' has a wrong offset!");
static_assert(offsetof(AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C, EditorIcon2) == 0x000398, "Member 'AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C::EditorIcon2' has a wrong offset!");
static_assert(offsetof(AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C, SpawnZoneVisualHelper04) == 0x0003A0, "Member 'AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C::SpawnZoneVisualHelper04' has a wrong offset!");
static_assert(offsetof(AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C, SpawnZoneVisualHelper03) == 0x0003A8, "Member 'AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C::SpawnZoneVisualHelper03' has a wrong offset!");
static_assert(offsetof(AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C, SpawnLocation04) == 0x0003B0, "Member 'AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C::SpawnLocation04' has a wrong offset!");
static_assert(offsetof(AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C, SpawnLocation03) == 0x0003B8, "Member 'AContMinusDirectSurfaceMinusWoodboxMinus02_BP_C::SpawnLocation03' has a wrong offset!");

}

