#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CoopButton_OperatableComponent_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function CoopButton_OperatableComponent_BP.CoopButton_OperatableComponent_BP_C.OnTriggerableActivated
// 0x0008 (0x0008 - 0x0000)
struct CoopButton_OperatableComponent_BP_C_OnTriggerableActivated final
{
public:
	class ARBTriggerable*                         Triggerable;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopButton_OperatableComponent_BP_C_OnTriggerableActivated) == 0x000008, "Wrong alignment on CoopButton_OperatableComponent_BP_C_OnTriggerableActivated");
static_assert(sizeof(CoopButton_OperatableComponent_BP_C_OnTriggerableActivated) == 0x000008, "Wrong size on CoopButton_OperatableComponent_BP_C_OnTriggerableActivated");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_OnTriggerableActivated, Triggerable) == 0x000000, "Member 'CoopButton_OperatableComponent_BP_C_OnTriggerableActivated::Triggerable' has a wrong offset!");

// Function CoopButton_OperatableComponent_BP.CoopButton_OperatableComponent_BP_C.OnPawnDoSpecialMoveAction
// 0x0010 (0x0010 - 0x0000)
struct CoopButton_OperatableComponent_BP_C_OnPawnDoSpecialMoveAction final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  SpecialMove;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopButton_OperatableComponent_BP_C_OnPawnDoSpecialMoveAction) == 0x000008, "Wrong alignment on CoopButton_OperatableComponent_BP_C_OnPawnDoSpecialMoveAction");
static_assert(sizeof(CoopButton_OperatableComponent_BP_C_OnPawnDoSpecialMoveAction) == 0x000010, "Wrong size on CoopButton_OperatableComponent_BP_C_OnPawnDoSpecialMoveAction");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_OnPawnDoSpecialMoveAction, Pawn) == 0x000000, "Member 'CoopButton_OperatableComponent_BP_C_OnPawnDoSpecialMoveAction::Pawn' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_OnPawnDoSpecialMoveAction, SpecialMove) == 0x000008, "Member 'CoopButton_OperatableComponent_BP_C_OnPawnDoSpecialMoveAction::SpecialMove' has a wrong offset!");

// Function CoopButton_OperatableComponent_BP.CoopButton_OperatableComponent_BP_C.ExecuteUbergraph_CoopButton_OperatableComponent_BP
// 0x0088 (0x0088 - 0x0000)
struct CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_1;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x002C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x003C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBTriggerable*                         K2Node_Event_triggerable;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnabled_ReturnValue_1;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_Event_pawn;                                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  K2Node_Event_specialMove;                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventOnActor_ReturnValue_2;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_3;           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP) == 0x000008, "Wrong alignment on CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP");
static_assert(sizeof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP) == 0x000088, "Wrong size on CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, EntryPoint) == 0x000000, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, Temp_delegate_Variable) == 0x000004, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, Temp_delegate_Variable_1) == 0x000014, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, CallFunc_PostEventOnActor_ReturnValue) == 0x000024, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, CallFunc_PostEventOnActor_ReturnValue_1) == 0x000028, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::CallFunc_PostEventOnActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, Temp_delegate_Variable_2) == 0x00002C, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, Temp_delegate_Variable_3) == 0x00003C, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, Temp_bool_Variable) == 0x00004C, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, K2Node_Event_triggerable) == 0x000050, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::K2Node_Event_triggerable' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, CallFunc_IsEnabled_ReturnValue) == 0x000058, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, CallFunc_IsEnabled_ReturnValue_1) == 0x000059, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::CallFunc_IsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, K2Node_Event_pawn) == 0x000060, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::K2Node_Event_pawn' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, K2Node_Event_specialMove) == 0x000068, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::K2Node_Event_specialMove' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, CallFunc_PostEventOnActor_ReturnValue_2) == 0x00006C, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::CallFunc_PostEventOnActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, CallFunc_Less_FloatFloat_ReturnValue) == 0x000071, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, K2Node_Select_Default) == 0x000078, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP, CallFunc_PostEventOnActor_ReturnValue_3) == 0x000080, "Member 'CoopButton_OperatableComponent_BP_C_ExecuteUbergraph_CoopButton_OperatableComponent_BP::CallFunc_PostEventOnActor_ReturnValue_3' has a wrong offset!");

// Function CoopButton_OperatableComponent_BP.CoopButton_OperatableComponent_BP_C.GetProgressionRatio
// 0x0008 (0x0008 - 0x0000)
struct CoopButton_OperatableComponent_BP_C_GetProgressionRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetProgressionRatio_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopButton_OperatableComponent_BP_C_GetProgressionRatio) == 0x000004, "Wrong alignment on CoopButton_OperatableComponent_BP_C_GetProgressionRatio");
static_assert(sizeof(CoopButton_OperatableComponent_BP_C_GetProgressionRatio) == 0x000008, "Wrong size on CoopButton_OperatableComponent_BP_C_GetProgressionRatio");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_GetProgressionRatio, ReturnValue) == 0x000000, "Member 'CoopButton_OperatableComponent_BP_C_GetProgressionRatio::ReturnValue' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_GetProgressionRatio, CallFunc_GetProgressionRatio_ReturnValue) == 0x000004, "Member 'CoopButton_OperatableComponent_BP_C_GetProgressionRatio::CallFunc_GetProgressionRatio_ReturnValue' has a wrong offset!");

// Function CoopButton_OperatableComponent_BP.CoopButton_OperatableComponent_BP_C.GetOperatorStopAnimation
// 0x0018 (0x0018 - 0x0000)
struct CoopButton_OperatableComponent_BP_C_GetOperatorStopAnimation final
{
public:
	const class ARBPawn*                          Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFirstPerson;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopButton_OperatableComponent_BP_C_GetOperatorStopAnimation) == 0x000008, "Wrong alignment on CoopButton_OperatableComponent_BP_C_GetOperatorStopAnimation");
static_assert(sizeof(CoopButton_OperatableComponent_BP_C_GetOperatorStopAnimation) == 0x000018, "Wrong size on CoopButton_OperatableComponent_BP_C_GetOperatorStopAnimation");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_GetOperatorStopAnimation, Pawn) == 0x000000, "Member 'CoopButton_OperatableComponent_BP_C_GetOperatorStopAnimation::Pawn' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_GetOperatorStopAnimation, bFirstPerson) == 0x000008, "Member 'CoopButton_OperatableComponent_BP_C_GetOperatorStopAnimation::bFirstPerson' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_GetOperatorStopAnimation, ReturnValue) == 0x000010, "Member 'CoopButton_OperatableComponent_BP_C_GetOperatorStopAnimation::ReturnValue' has a wrong offset!");

// Function CoopButton_OperatableComponent_BP.CoopButton_OperatableComponent_BP_C.GetOperatorLoopAnimation
// 0x0018 (0x0018 - 0x0000)
struct CoopButton_OperatableComponent_BP_C_GetOperatorLoopAnimation final
{
public:
	const class ARBPawn*                          Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFirstPerson;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopButton_OperatableComponent_BP_C_GetOperatorLoopAnimation) == 0x000008, "Wrong alignment on CoopButton_OperatableComponent_BP_C_GetOperatorLoopAnimation");
static_assert(sizeof(CoopButton_OperatableComponent_BP_C_GetOperatorLoopAnimation) == 0x000018, "Wrong size on CoopButton_OperatableComponent_BP_C_GetOperatorLoopAnimation");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_GetOperatorLoopAnimation, Pawn) == 0x000000, "Member 'CoopButton_OperatableComponent_BP_C_GetOperatorLoopAnimation::Pawn' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_GetOperatorLoopAnimation, bFirstPerson) == 0x000008, "Member 'CoopButton_OperatableComponent_BP_C_GetOperatorLoopAnimation::bFirstPerson' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_GetOperatorLoopAnimation, ReturnValue) == 0x000010, "Member 'CoopButton_OperatableComponent_BP_C_GetOperatorLoopAnimation::ReturnValue' has a wrong offset!");

// Function CoopButton_OperatableComponent_BP.CoopButton_OperatableComponent_BP_C.GetOperatorStartAnimation
// 0x0018 (0x0018 - 0x0000)
struct CoopButton_OperatableComponent_BP_C_GetOperatorStartAnimation final
{
public:
	const class ARBPawn*                          Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFirstPerson;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CoopButton_OperatableComponent_BP_C_GetOperatorStartAnimation) == 0x000008, "Wrong alignment on CoopButton_OperatableComponent_BP_C_GetOperatorStartAnimation");
static_assert(sizeof(CoopButton_OperatableComponent_BP_C_GetOperatorStartAnimation) == 0x000018, "Wrong size on CoopButton_OperatableComponent_BP_C_GetOperatorStartAnimation");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_GetOperatorStartAnimation, Pawn) == 0x000000, "Member 'CoopButton_OperatableComponent_BP_C_GetOperatorStartAnimation::Pawn' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_GetOperatorStartAnimation, bFirstPerson) == 0x000008, "Member 'CoopButton_OperatableComponent_BP_C_GetOperatorStartAnimation::bFirstPerson' has a wrong offset!");
static_assert(offsetof(CoopButton_OperatableComponent_BP_C_GetOperatorStartAnimation, ReturnValue) == 0x000010, "Member 'CoopButton_OperatableComponent_BP_C_GetOperatorStartAnimation::ReturnValue' has a wrong offset!");

}

