#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COOPOnlySign_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass COOPOnlySign_BP.COOPOnlySign_BP_C
// 0x0018 (0x0248 - 0x0230)
class ACOOPOnlySign_BP_C final : public AActor
{
public:
	class URBSinglePlayerHelperComponent*         RBSinglePlayerHelper;                              // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CoopSignMesh;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"COOPOnlySign_BP_C">();
	}
	static class ACOOPOnlySign_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACOOPOnlySign_BP_C>();
	}
};
static_assert(alignof(ACOOPOnlySign_BP_C) == 0x000008, "Wrong alignment on ACOOPOnlySign_BP_C");
static_assert(sizeof(ACOOPOnlySign_BP_C) == 0x000248, "Wrong size on ACOOPOnlySign_BP_C");
static_assert(offsetof(ACOOPOnlySign_BP_C, RBSinglePlayerHelper) == 0x000230, "Member 'ACOOPOnlySign_BP_C::RBSinglePlayerHelper' has a wrong offset!");
static_assert(offsetof(ACOOPOnlySign_BP_C, CoopSignMesh) == 0x000238, "Member 'ACOOPOnlySign_BP_C::CoopSignMesh' has a wrong offset!");
static_assert(offsetof(ACOOPOnlySign_BP_C, DefaultSceneRoot) == 0x000240, "Member 'ACOOPOnlySign_BP_C::DefaultSceneRoot' has a wrong offset!");

}

