#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CoreUpgradeList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CoreUpgradeList.CoreUpgradeList_C
// 0x0068 (0x02E0 - 0x0278)
class UCoreUpgradeList_C final : public URBUpgradeMenuTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           CoreUpgradeList;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCoreUpgradeTierButton_C*               CoreUpgradeTierButton;                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsLoadout;                                        // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnUpgradeHovered;                                  // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUpgradeUnhovered;                                // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnUpgradeClicked;                                  // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Tier;                                              // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnTierChanged;                                     // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void HandleGamepadFocus();
	void CycleTier(bool Left);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnUpgradeReleasedEvent(class FName ItemId);
	void OnUpgradePressedEvent(class FName ItemId);
	void OnUpgradeClickedEvent(class FName ItemId);
	void OnUpgradeUnhoveredEvent(class FName ItemId);
	void OnUpgradeHoveredEvent(class FName ItemId);
	void Refresh();
	void Init(bool bIsLoadout_0, int32 Tier_0);
	void Setup();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_CoreUpgradeList(int32 EntryPoint);
	void OnTierChanged__DelegateSignature(int32 NewTier);
	void OnUpgradeClicked__DelegateSignature(class FName ItemId);
	void OnUpgradeUnhovered__DelegateSignature(class FName ItemId);
	void OnUpgradeHovered__DelegateSignature(class FName ItemId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CoreUpgradeList_C">();
	}
	static class UCoreUpgradeList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCoreUpgradeList_C>();
	}
};
static_assert(alignof(UCoreUpgradeList_C) == 0x000008, "Wrong alignment on UCoreUpgradeList_C");
static_assert(sizeof(UCoreUpgradeList_C) == 0x0002E0, "Wrong size on UCoreUpgradeList_C");
static_assert(offsetof(UCoreUpgradeList_C, UberGraphFrame) == 0x000278, "Member 'UCoreUpgradeList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeList_C, CoreUpgradeList) == 0x000280, "Member 'UCoreUpgradeList_C::CoreUpgradeList' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeList_C, CoreUpgradeTierButton) == 0x000288, "Member 'UCoreUpgradeList_C::CoreUpgradeTierButton' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeList_C, bIsLoadout) == 0x000290, "Member 'UCoreUpgradeList_C::bIsLoadout' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeList_C, OnUpgradeHovered) == 0x000298, "Member 'UCoreUpgradeList_C::OnUpgradeHovered' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeList_C, OnUpgradeUnhovered) == 0x0002A8, "Member 'UCoreUpgradeList_C::OnUpgradeUnhovered' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeList_C, OnUpgradeClicked) == 0x0002B8, "Member 'UCoreUpgradeList_C::OnUpgradeClicked' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeList_C, Tier) == 0x0002C8, "Member 'UCoreUpgradeList_C::Tier' has a wrong offset!");
static_assert(offsetof(UCoreUpgradeList_C, OnTierChanged) == 0x0002D0, "Member 'UCoreUpgradeList_C::OnTierChanged' has a wrong offset!");

}

