#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationCategories_V2

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CustomizationCategories_V2.CustomizationCategories_V2_C.EventOnCategoryClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CustomizationCategories_V2_C_EventOnCategoryClicked__DelegateSignature final
{
public:
	ECustomizationMenuCategory                    CustoCategory;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationCategories_V2_C_EventOnCategoryClicked__DelegateSignature) == 0x000001, "Wrong alignment on CustomizationCategories_V2_C_EventOnCategoryClicked__DelegateSignature");
static_assert(sizeof(CustomizationCategories_V2_C_EventOnCategoryClicked__DelegateSignature) == 0x000001, "Wrong size on CustomizationCategories_V2_C_EventOnCategoryClicked__DelegateSignature");
static_assert(offsetof(CustomizationCategories_V2_C_EventOnCategoryClicked__DelegateSignature, CustoCategory) == 0x000000, "Member 'CustomizationCategories_V2_C_EventOnCategoryClicked__DelegateSignature::CustoCategory' has a wrong offset!");

// Function CustomizationCategories_V2.CustomizationCategories_V2_C.ExecuteUbergraph_CustomizationCategories_V2
// 0x0014 (0x0014 - 0x0000)
struct CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2) == 0x000004, "Wrong alignment on CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2");
static_assert(sizeof(CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2) == 0x000014, "Wrong size on CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2");
static_assert(offsetof(CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2, EntryPoint) == 0x000000, "Member 'CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2, Temp_bool_Variable) == 0x000004, "Member 'CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2, Temp_byte_Variable) == 0x00000C, "Member 'CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2, CallFunc_Greater_IntInt_ReturnValue) == 0x00000D, "Member 'CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2, Temp_byte_Variable_1) == 0x00000E, "Member 'CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2, K2Node_Select_Default) == 0x00000F, "Member 'CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2, K2Node_Event_IsDesignTime) == 0x000010, "Member 'CustomizationCategories_V2_C_ExecuteUbergraph_CustomizationCategories_V2::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function CustomizationCategories_V2.CustomizationCategories_V2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CustomizationCategories_V2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationCategories_V2_C_PreConstruct) == 0x000001, "Wrong alignment on CustomizationCategories_V2_C_PreConstruct");
static_assert(sizeof(CustomizationCategories_V2_C_PreConstruct) == 0x000001, "Wrong size on CustomizationCategories_V2_C_PreConstruct");
static_assert(offsetof(CustomizationCategories_V2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CustomizationCategories_V2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CustomizationCategories_V2.CustomizationCategories_V2_C.CreateCategoryButtons
// 0x0068 (0x0068 - 0x0000)
struct CustomizationCategories_V2_C_CreateCategoryButtons final
{
public:
	bool                                          IsTutorial_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentIndex;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECustomizationMenuCategory>            CallFunc_GetCurrentCategoryList_CategoryList;      // 0x0018(0x0010)(ReferenceParm)
	ECustomizationMenuCategory                    CallFunc_Array_Get_Item;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCustomizationCategoryWidget_V2_C* buttonClicked)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetItemCountForCategory_ReturnValue;      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomizationCategoryWidget_V2_C*      CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationCategories_V2_C_CreateCategoryButtons) == 0x000008, "Wrong alignment on CustomizationCategories_V2_C_CreateCategoryButtons");
static_assert(sizeof(CustomizationCategories_V2_C_CreateCategoryButtons) == 0x000068, "Wrong size on CustomizationCategories_V2_C_CreateCategoryButtons");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, IsTutorial_0) == 0x000000, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::IsTutorial_0' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, CurrentIndex) == 0x000004, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::CurrentIndex' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, Temp_int_Array_Index_Variable) == 0x000010, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, CallFunc_GetCurrentCategoryList_CategoryList) == 0x000018, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::CallFunc_GetCurrentCategoryList_CategoryList' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, CallFunc_Array_Get_Item) == 0x000028, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000031, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, Temp_int_Variable) == 0x000034, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, CallFunc_GetItemCountForCategory_ReturnValue) == 0x00004C, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::CallFunc_GetItemCountForCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, CallFunc_Create_ReturnValue) == 0x000050, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_CreateCategoryButtons, CallFunc_AddChild_ReturnValue) == 0x000060, "Member 'CustomizationCategories_V2_C_CreateCategoryButtons::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function CustomizationCategories_V2.CustomizationCategories_V2_C.SelectCategory
// 0x0010 (0x0010 - 0x0000)
struct CustomizationCategories_V2_C_SelectCategory final
{
public:
	class UCustomizationCategoryWidget_V2_C*      buttonClicked;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationCategories_V2_C_SelectCategory) == 0x000008, "Wrong alignment on CustomizationCategories_V2_C_SelectCategory");
static_assert(sizeof(CustomizationCategories_V2_C_SelectCategory) == 0x000010, "Wrong size on CustomizationCategories_V2_C_SelectCategory");
static_assert(offsetof(CustomizationCategories_V2_C_SelectCategory, buttonClicked) == 0x000000, "Member 'CustomizationCategories_V2_C_SelectCategory::buttonClicked' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_SelectCategory, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'CustomizationCategories_V2_C_SelectCategory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_SelectCategory, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'CustomizationCategories_V2_C_SelectCategory::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function CustomizationCategories_V2.CustomizationCategories_V2_C.Init
// 0x0002 (0x0002 - 0x0000)
struct CustomizationCategories_V2_C_Init final
{
public:
	bool                                          IsTutorial_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsCustomizingFemale_0;                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationCategories_V2_C_Init) == 0x000001, "Wrong alignment on CustomizationCategories_V2_C_Init");
static_assert(sizeof(CustomizationCategories_V2_C_Init) == 0x000002, "Wrong size on CustomizationCategories_V2_C_Init");
static_assert(offsetof(CustomizationCategories_V2_C_Init, IsTutorial_0) == 0x000000, "Member 'CustomizationCategories_V2_C_Init::IsTutorial_0' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_Init, IsCustomizingFemale_0) == 0x000001, "Member 'CustomizationCategories_V2_C_Init::IsCustomizingFemale_0' has a wrong offset!");

// Function CustomizationCategories_V2.CustomizationCategories_V2_C.GetCurrentCategoryList
// 0x0060 (0x0060 - 0x0000)
struct CustomizationCategories_V2_C_GetCurrentCategoryList final
{
public:
	TArray<ECustomizationMenuCategory>            CategoryList;                                      // 0x0000(0x0010)(Parm, OutParm)
	ECustomizationCategory                        Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECustomizationMenuCategory>            Temp_byte_Variable_1;                              // 0x0018(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECustomizationMenuCategory>            K2Node_Select_Default;                             // 0x0030(0x0010)(ReferenceParm)
	TArray<ECustomizationMenuCategory>            K2Node_Select_Default_1;                           // 0x0040(0x0010)(ReferenceParm)
	TArray<ECustomizationMenuCategory>            K2Node_Select_Default_2;                           // 0x0050(0x0010)(ReferenceParm)
};
static_assert(alignof(CustomizationCategories_V2_C_GetCurrentCategoryList) == 0x000008, "Wrong alignment on CustomizationCategories_V2_C_GetCurrentCategoryList");
static_assert(sizeof(CustomizationCategories_V2_C_GetCurrentCategoryList) == 0x000060, "Wrong size on CustomizationCategories_V2_C_GetCurrentCategoryList");
static_assert(offsetof(CustomizationCategories_V2_C_GetCurrentCategoryList, CategoryList) == 0x000000, "Member 'CustomizationCategories_V2_C_GetCurrentCategoryList::CategoryList' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetCurrentCategoryList, Temp_byte_Variable) == 0x000010, "Member 'CustomizationCategories_V2_C_GetCurrentCategoryList::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetCurrentCategoryList, Temp_byte_Variable_1) == 0x000018, "Member 'CustomizationCategories_V2_C_GetCurrentCategoryList::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetCurrentCategoryList, Temp_bool_Variable) == 0x000028, "Member 'CustomizationCategories_V2_C_GetCurrentCategoryList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetCurrentCategoryList, Temp_bool_Variable_1) == 0x000029, "Member 'CustomizationCategories_V2_C_GetCurrentCategoryList::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetCurrentCategoryList, K2Node_Select_Default) == 0x000030, "Member 'CustomizationCategories_V2_C_GetCurrentCategoryList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetCurrentCategoryList, K2Node_Select_Default_1) == 0x000040, "Member 'CustomizationCategories_V2_C_GetCurrentCategoryList::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetCurrentCategoryList, K2Node_Select_Default_2) == 0x000050, "Member 'CustomizationCategories_V2_C_GetCurrentCategoryList::K2Node_Select_Default_2' has a wrong offset!");

// Function CustomizationCategories_V2.CustomizationCategories_V2_C.GetButtonFromCategory
// 0x0058 (0x0058 - 0x0000)
struct CustomizationCategories_V2_C_GetButtonFromCategory final
{
public:
	ECustomizationMenuCategory                    Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationCategoryWidget_V2_C*      Button;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationCategoryWidget_V2_C*      K2Node_DynamicCast_AsCustomization_Category_Widget_V2; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationCategories_V2_C_GetButtonFromCategory) == 0x000008, "Wrong alignment on CustomizationCategories_V2_C_GetButtonFromCategory");
static_assert(sizeof(CustomizationCategories_V2_C_GetButtonFromCategory) == 0x000058, "Wrong size on CustomizationCategories_V2_C_GetButtonFromCategory");
static_assert(offsetof(CustomizationCategories_V2_C_GetButtonFromCategory, Category) == 0x000000, "Member 'CustomizationCategories_V2_C_GetButtonFromCategory::Category' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetButtonFromCategory, Button) == 0x000008, "Member 'CustomizationCategories_V2_C_GetButtonFromCategory::Button' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetButtonFromCategory, Temp_int_Array_Index_Variable) == 0x000010, "Member 'CustomizationCategories_V2_C_GetButtonFromCategory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetButtonFromCategory, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'CustomizationCategories_V2_C_GetButtonFromCategory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetButtonFromCategory, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'CustomizationCategories_V2_C_GetButtonFromCategory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetButtonFromCategory, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'CustomizationCategories_V2_C_GetButtonFromCategory::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetButtonFromCategory, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'CustomizationCategories_V2_C_GetButtonFromCategory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetButtonFromCategory, CallFunc_Array_Get_Item) == 0x000038, "Member 'CustomizationCategories_V2_C_GetButtonFromCategory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetButtonFromCategory, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'CustomizationCategories_V2_C_GetButtonFromCategory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetButtonFromCategory, K2Node_DynamicCast_AsCustomization_Category_Widget_V2) == 0x000048, "Member 'CustomizationCategories_V2_C_GetButtonFromCategory::K2Node_DynamicCast_AsCustomization_Category_Widget_V2' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetButtonFromCategory, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'CustomizationCategories_V2_C_GetButtonFromCategory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_GetButtonFromCategory, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000051, "Member 'CustomizationCategories_V2_C_GetButtonFromCategory::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function CustomizationCategories_V2.CustomizationCategories_V2_C.OnCategoryClicked
// 0x0008 (0x0008 - 0x0000)
struct CustomizationCategories_V2_C_OnCategoryClicked final
{
public:
	class UCustomizationCategoryWidget_V2_C*      buttonClicked;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationCategories_V2_C_OnCategoryClicked) == 0x000008, "Wrong alignment on CustomizationCategories_V2_C_OnCategoryClicked");
static_assert(sizeof(CustomizationCategories_V2_C_OnCategoryClicked) == 0x000008, "Wrong size on CustomizationCategories_V2_C_OnCategoryClicked");
static_assert(offsetof(CustomizationCategories_V2_C_OnCategoryClicked, buttonClicked) == 0x000000, "Member 'CustomizationCategories_V2_C_OnCategoryClicked::buttonClicked' has a wrong offset!");

// Function CustomizationCategories_V2.CustomizationCategories_V2_C.OnCategoryCycled
// 0x0008 (0x0008 - 0x0000)
struct CustomizationCategories_V2_C_OnCategoryCycled final
{
public:
	class UCustomizationCategoryWidget_V2_C*      CategoryButton;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationCategories_V2_C_OnCategoryCycled) == 0x000008, "Wrong alignment on CustomizationCategories_V2_C_OnCategoryCycled");
static_assert(sizeof(CustomizationCategories_V2_C_OnCategoryCycled) == 0x000008, "Wrong size on CustomizationCategories_V2_C_OnCategoryCycled");
static_assert(offsetof(CustomizationCategories_V2_C_OnCategoryCycled, CategoryButton) == 0x000000, "Member 'CustomizationCategories_V2_C_OnCategoryCycled::CategoryButton' has a wrong offset!");

// Function CustomizationCategories_V2.CustomizationCategories_V2_C.UpdateNewStatus
// 0x0048 (0x0048 - 0x0000)
struct CustomizationCategories_V2_C_UpdateNewStatus final
{
public:
	ECustomizationMenuCategory                    Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationCategoryWidget_V2_C*      K2Node_DynamicCast_AsCustomization_Category_Widget_V2; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CustomizationCategoryContainsSameItems_ReturnValue; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationCategories_V2_C_UpdateNewStatus) == 0x000008, "Wrong alignment on CustomizationCategories_V2_C_UpdateNewStatus");
static_assert(sizeof(CustomizationCategories_V2_C_UpdateNewStatus) == 0x000048, "Wrong size on CustomizationCategories_V2_C_UpdateNewStatus");
static_assert(offsetof(CustomizationCategories_V2_C_UpdateNewStatus, Category) == 0x000000, "Member 'CustomizationCategories_V2_C_UpdateNewStatus::Category' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_UpdateNewStatus, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CustomizationCategories_V2_C_UpdateNewStatus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategories_V2_C_UpdateNewStatus, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'CustomizationCategories_V2_C_UpdateNewStatus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
