#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationContentWidget_V2

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.OnItemPreviewed__DelegateSignature
// 0x0058 (0x0058 - 0x0000)
struct CustomizationContentWidget_V2_C_OnItemPreviewed__DelegateSignature final
{
public:
	struct FUICustomizationItem                   Custo_Item;                                        // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_OnItemPreviewed__DelegateSignature) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_OnItemPreviewed__DelegateSignature");
static_assert(sizeof(CustomizationContentWidget_V2_C_OnItemPreviewed__DelegateSignature) == 0x000058, "Wrong size on CustomizationContentWidget_V2_C_OnItemPreviewed__DelegateSignature");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnItemPreviewed__DelegateSignature, Custo_Item) == 0x000000, "Member 'CustomizationContentWidget_V2_C_OnItemPreviewed__DelegateSignature::Custo_Item' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.OnStoppedPreview__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CustomizationContentWidget_V2_C_OnStoppedPreview__DelegateSignature final
{
public:
	class URBPlayerIconCustomizationOption*       CustoItem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationContentWidget_V2_C_OnStoppedPreview__DelegateSignature) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_OnStoppedPreview__DelegateSignature");
static_assert(sizeof(CustomizationContentWidget_V2_C_OnStoppedPreview__DelegateSignature) == 0x000008, "Wrong size on CustomizationContentWidget_V2_C_OnStoppedPreview__DelegateSignature");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnStoppedPreview__DelegateSignature, CustoItem) == 0x000000, "Member 'CustomizationContentWidget_V2_C_OnStoppedPreview__DelegateSignature::CustoItem' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.UpdatePaletteDisplay__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CustomizationContentWidget_V2_C_UpdatePaletteDisplay__DelegateSignature final
{
public:
	bool                                          ShouldShowPalette;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_UpdatePaletteDisplay__DelegateSignature) == 0x000001, "Wrong alignment on CustomizationContentWidget_V2_C_UpdatePaletteDisplay__DelegateSignature");
static_assert(sizeof(CustomizationContentWidget_V2_C_UpdatePaletteDisplay__DelegateSignature) == 0x000001, "Wrong size on CustomizationContentWidget_V2_C_UpdatePaletteDisplay__DelegateSignature");
static_assert(offsetof(CustomizationContentWidget_V2_C_UpdatePaletteDisplay__DelegateSignature, ShouldShowPalette) == 0x000000, "Member 'CustomizationContentWidget_V2_C_UpdatePaletteDisplay__DelegateSignature::ShouldShowPalette' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.OnItemEquippedEvent__DelegateSignature
// 0x0058 (0x0058 - 0x0000)
struct CustomizationContentWidget_V2_C_OnItemEquippedEvent__DelegateSignature final
{
public:
	struct FUICustomizationItem                   Item;                                              // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_OnItemEquippedEvent__DelegateSignature) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_OnItemEquippedEvent__DelegateSignature");
static_assert(sizeof(CustomizationContentWidget_V2_C_OnItemEquippedEvent__DelegateSignature) == 0x000058, "Wrong size on CustomizationContentWidget_V2_C_OnItemEquippedEvent__DelegateSignature");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnItemEquippedEvent__DelegateSignature, Item) == 0x000000, "Member 'CustomizationContentWidget_V2_C_OnItemEquippedEvent__DelegateSignature::Item' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.OnItemsAdded__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct CustomizationContentWidget_V2_C_OnItemsAdded__DelegateSignature final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationContentWidget_V2_C_OnItemsAdded__DelegateSignature) == 0x000004, "Wrong alignment on CustomizationContentWidget_V2_C_OnItemsAdded__DelegateSignature");
static_assert(sizeof(CustomizationContentWidget_V2_C_OnItemsAdded__DelegateSignature) == 0x000004, "Wrong size on CustomizationContentWidget_V2_C_OnItemsAdded__DelegateSignature");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnItemsAdded__DelegateSignature, Amount) == 0x000000, "Member 'CustomizationContentWidget_V2_C_OnItemsAdded__DelegateSignature::Amount' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.OnItemHoveredEvent__DelegateSignature
// 0x0058 (0x0058 - 0x0000)
struct CustomizationContentWidget_V2_C_OnItemHoveredEvent__DelegateSignature final
{
public:
	struct FUICustomizationItem                   CustoItem;                                         // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_OnItemHoveredEvent__DelegateSignature) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_OnItemHoveredEvent__DelegateSignature");
static_assert(sizeof(CustomizationContentWidget_V2_C_OnItemHoveredEvent__DelegateSignature) == 0x000058, "Wrong size on CustomizationContentWidget_V2_C_OnItemHoveredEvent__DelegateSignature");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnItemHoveredEvent__DelegateSignature, CustoItem) == 0x000000, "Member 'CustomizationContentWidget_V2_C_OnItemHoveredEvent__DelegateSignature::CustoItem' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.ExecuteUbergraph_CustomizationContentWidget_V2
// 0x04B0 (0x04B0 - 0x0000)
struct CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class URBMenuButton_C* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class URBMenuButton_C*                        CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        CallFunc_Create_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class URBMenuButton_C*                        CallFunc_Create_ReturnValue_2;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class URBMenuButton_C* Button)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue_1; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x00D8(0x0018)(ConstParm)
	bool                                          K2Node_CustomEvent_isTutorial;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMenuCharacter_C*                       K2Node_CustomEvent__MenuCharacter;                 // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_viewerReturnTarget;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACellCustomizationCameraActor_C*        K2Node_CustomEvent_CellCustomizationActor;         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FUICustomizationItem>           K2Node_Event_items_1;                              // 0x0110(0x0010)(ConstParm, ReferenceParm)
	struct FUICustomizationItem                   K2Node_CustomEvent_item_2;                         // 0x0120(0x0058)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUICustomizationItem                   K2Node_CustomEvent_item_1;                         // 0x0180(0x0058)(NoDestructor)
	struct FUICustomizationItem                   K2Node_CustomEvent_item;                           // 0x01D8(0x0058)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0238(0x0018)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUICustomizationItem>           K2Node_Event_items;                                // 0x0268(0x0010)(ConstParm, ReferenceParm)
	class URBMenuButton_C*                        K2Node_CustomEvent_Button_1;                       // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_2;                              // 0x0280(0x0018)(ConstParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29E[0x2];                                      // 0x029E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        CallFunc_Create_ReturnValue_3;                     // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAngle_ReturnValue;                   // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x02F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue_1;          // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0385(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_386[0x2];                                      // 0x0386(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLobbyPlayerState*                    K2Node_DynamicCast_AsRB_Lobby_Player_State;        // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B2[0x6];                                      // 0x03B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRBPlayerCellCustomizationEntry> CallFunc_GetPlayerCellCustomization_ReturnValue;   // 0x03B8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerCell*                          CallFunc_GetPlayerCell_ReturnValue;                // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBPlayerCustomizationInfo             CallFunc_BP_GetCurrentPreviewOptions_ReturnValue;  // 0x03D8(0x0050)()
	class FText                                   Temp_text_Variable_3;                              // 0x0428(0x0018)(ConstParm)
	class URBCustomizationOption*                 CallFunc_GetValidCustomizationOption_ReturnValue;  // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSettings_Gameplay*                   CallFunc_GetRBSettings_Gameplay_ReturnValue;       // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizationMenuCategoryParams       CallFunc_Map_Find_Value;                           // 0x0460(0x0020)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x3];                                      // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_4;          // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x3];                                      // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x048C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_5;          // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x049D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49E[0x2];                                      // 0x049E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_CustomEvent_Button;                         // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2");
static_assert(sizeof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2) == 0x0004B0, "Wrong size on CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, EntryPoint) == 0x000000, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000004, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Create_ReturnValue) == 0x000018, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, Temp_bool_Variable) == 0x000020, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, Temp_bool_Variable_1) == 0x000021, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Create_ReturnValue_1) == 0x000028, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Create_ReturnValue_2) == 0x000040, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CreateDelegate_OutputDelegate_2) == 0x000048, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CreateDelegate_OutputDelegate_4) == 0x000068, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CreateDelegate_OutputDelegate_5) == 0x000078, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CreateDelegate_OutputDelegate_6) == 0x000088, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_K2_SetTimer_ReturnValue) == 0x000098, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x0000A0, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_BreakVector2D_X) == 0x0000A8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_BreakVector2D_Y) == 0x0000AC, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000B0, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B4, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000B8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000BC, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_GetMousePositionOnViewport_ReturnValue_1) == 0x0000C0, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_GetMousePositionOnViewport_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000C8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_BreakVector2D_X_1) == 0x0000CC, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_BreakVector2D_Y_1) == 0x0000D0, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, Temp_text_Variable) == 0x0000D8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CustomEvent_isTutorial) == 0x0000F0, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CustomEvent_isTutorial' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CustomEvent__MenuCharacter) == 0x0000F8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CustomEvent__MenuCharacter' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CustomEvent_viewerReturnTarget) == 0x000100, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CustomEvent_viewerReturnTarget' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CustomEvent_CellCustomizationActor) == 0x000108, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CustomEvent_CellCustomizationActor' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_Event_items_1) == 0x000110, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_Event_items_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CustomEvent_item_2) == 0x000120, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CustomEvent_item_2' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Array_Length_ReturnValue) == 0x000178, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CustomEvent_item_1) == 0x000180, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CustomEvent_item_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CustomEvent_item) == 0x0001D8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CustomEvent_item' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_IsValid_ReturnValue) == 0x000230, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, Temp_text_Variable_1) == 0x000238, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000250, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000258, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_IsValid_ReturnValue_1) == 0x000260, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000261, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_Event_items) == 0x000268, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_Event_items' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CustomEvent_Button_1) == 0x000278, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, Temp_text_Variable_2) == 0x000280, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Array_Add_ReturnValue) == 0x000298, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_IsValid_ReturnValue_2) == 0x00029C, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x00029D, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_BreakRotator_Roll) == 0x0002A0, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_BreakRotator_Pitch) == 0x0002A4, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_BreakRotator_Yaw) == 0x0002A8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x0002AC, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0002B0, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0002B4, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0002B8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_Select_Default) == 0x0002BC, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0002C0, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002C4, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x0002C8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0002CC, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x0002D0, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_Select_Default_1) == 0x0002D4, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0002D8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Create_ReturnValue_3) == 0x0002E0, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_ClampAngle_ReturnValue) == 0x0002E8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_ClampAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_MakeRotator_ReturnValue) == 0x0002EC, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0002F8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Array_Add_ReturnValue_1) == 0x000380, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_BP_IsUsingGamepad_ReturnValue_1) == 0x000384, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_BP_IsUsingGamepad_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_BooleanAND_ReturnValue) == 0x000385, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_GetMenuManager_ReturnValue) == 0x000388, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Array_Add_ReturnValue_2) == 0x000390, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000394, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000398, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0003A0, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_DynamicCast_AsRB_Lobby_Player_State) == 0x0003A8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_DynamicCast_AsRB_Lobby_Player_State' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_DynamicCast_bSuccess) == 0x0003B0, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x0003B1, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_GetPlayerCellCustomization_ReturnValue) == 0x0003B8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_GetPlayerCellCustomization_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_BooleanAND_ReturnValue_1) == 0x0003C8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_GetPlayerCell_ReturnValue) == 0x0003D0, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_GetPlayerCell_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_BP_GetCurrentPreviewOptions_ReturnValue) == 0x0003D8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_BP_GetCurrentPreviewOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, Temp_text_Variable_3) == 0x000428, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_GetValidCustomizationOption_ReturnValue) == 0x000440, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_GetValidCustomizationOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_IsValid_ReturnValue_3) == 0x000448, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_GetRBSettings_Gameplay_ReturnValue) == 0x000450, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_GetRBSettings_Gameplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x000458, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Map_Find_Value) == 0x000460, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Map_Find_ReturnValue) == 0x000480, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_Array_Add_ReturnValue_3) == 0x000484, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_NotEqual_ByteByte_ReturnValue_4) == 0x000488, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_NotEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CreateDelegate_OutputDelegate_7) == 0x00048C, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_NotEqual_ByteByte_ReturnValue_5) == 0x00049C, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_NotEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_BooleanAND_ReturnValue_2) == 0x00049D, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, K2Node_CustomEvent_Button) == 0x0004A0, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x0004A8, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0004A9, "Member 'CustomizationContentWidget_V2_C_ExecuteUbergraph_CustomizationContentWidget_V2::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.OnSortingButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct CustomizationContentWidget_V2_C_OnSortingButtonClicked final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationContentWidget_V2_C_OnSortingButtonClicked) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_OnSortingButtonClicked");
static_assert(sizeof(CustomizationContentWidget_V2_C_OnSortingButtonClicked) == 0x000008, "Wrong size on CustomizationContentWidget_V2_C_OnSortingButtonClicked");
static_assert(offsetof(CustomizationContentWidget_V2_C_OnSortingButtonClicked, Button) == 0x000000, "Member 'CustomizationContentWidget_V2_C_OnSortingButtonClicked::Button' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.Event_CycleFocus
// 0x0008 (0x0008 - 0x0000)
struct CustomizationContentWidget_V2_C_Event_CycleFocus final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationContentWidget_V2_C_Event_CycleFocus) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_Event_CycleFocus");
static_assert(sizeof(CustomizationContentWidget_V2_C_Event_CycleFocus) == 0x000008, "Wrong size on CustomizationContentWidget_V2_C_Event_CycleFocus");
static_assert(offsetof(CustomizationContentWidget_V2_C_Event_CycleFocus, Button) == 0x000000, "Member 'CustomizationContentWidget_V2_C_Event_CycleFocus::Button' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.Event_RefreshItemInfos
// 0x0010 (0x0010 - 0x0000)
struct CustomizationContentWidget_V2_C_Event_RefreshItemInfos final
{
public:
	TArray<struct FUICustomizationItem>           Items;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CustomizationContentWidget_V2_C_Event_RefreshItemInfos) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_Event_RefreshItemInfos");
static_assert(sizeof(CustomizationContentWidget_V2_C_Event_RefreshItemInfos) == 0x000010, "Wrong size on CustomizationContentWidget_V2_C_Event_RefreshItemInfos");
static_assert(offsetof(CustomizationContentWidget_V2_C_Event_RefreshItemInfos, Items) == 0x000000, "Member 'CustomizationContentWidget_V2_C_Event_RefreshItemInfos::Items' has a wrong offset!");

// Function CustomizationContentWidget_V2.CustomizationContentWidget_V2_C.EventOnItemReleased_Event_0
// 0x0058 (0x0058 - 0x0000)
struct CustomizationContentWidget_V2_C_EventOnItemReleased_Event_0 final
{
public:
	struct FUICustomizationItem                   Item;                                              // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CustomizationContentWidget_V2_C_EventOnItemReleased_Event_0) == 0x000008, "Wrong alignment on CustomizationContentWidget_V2_C_EventOnItemReleased_Event_0");
static_assert(sizeof(CustomizationContentWidget_V2_C_EventOnItemReleased_Event_0) == 0x000058, "Wrong size on CustomizationContentWidget_V2_C_EventOnItemReleased_Event_0");
