#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationOptionThumbnail

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function CustomizationOptionThumbnail.CustomizationOptionThumbnail_C.Event_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CustomizationOptionThumbnail_C_Event_OnClicked__DelegateSignature final
{
public:
	class UCustomizationOptionThumbnail_C*        Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationOptionThumbnail_C_Event_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on CustomizationOptionThumbnail_C_Event_OnClicked__DelegateSignature");
static_assert(sizeof(CustomizationOptionThumbnail_C_Event_OnClicked__DelegateSignature) == 0x000008, "Wrong size on CustomizationOptionThumbnail_C_Event_OnClicked__DelegateSignature");
static_assert(offsetof(CustomizationOptionThumbnail_C_Event_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'CustomizationOptionThumbnail_C_Event_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function CustomizationOptionThumbnail.CustomizationOptionThumbnail_C.Event_OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CustomizationOptionThumbnail_C_Event_OnHovered__DelegateSignature final
{
public:
	class UCustomizationOptionThumbnail_C*        Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationOptionThumbnail_C_Event_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on CustomizationOptionThumbnail_C_Event_OnHovered__DelegateSignature");
static_assert(sizeof(CustomizationOptionThumbnail_C_Event_OnHovered__DelegateSignature) == 0x000008, "Wrong size on CustomizationOptionThumbnail_C_Event_OnHovered__DelegateSignature");
static_assert(offsetof(CustomizationOptionThumbnail_C_Event_OnHovered__DelegateSignature, Widget) == 0x000000, "Member 'CustomizationOptionThumbnail_C_Event_OnHovered__DelegateSignature::Widget' has a wrong offset!");

// Function CustomizationOptionThumbnail.CustomizationOptionThumbnail_C.Event_OnUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CustomizationOptionThumbnail_C_Event_OnUnhovered__DelegateSignature final
{
public:
	class UCustomizationOptionThumbnail_C*        Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationOptionThumbnail_C_Event_OnUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on CustomizationOptionThumbnail_C_Event_OnUnhovered__DelegateSignature");
static_assert(sizeof(CustomizationOptionThumbnail_C_Event_OnUnhovered__DelegateSignature) == 0x000008, "Wrong size on CustomizationOptionThumbnail_C_Event_OnUnhovered__DelegateSignature");
static_assert(offsetof(CustomizationOptionThumbnail_C_Event_OnUnhovered__DelegateSignature, Widget) == 0x000000, "Member 'CustomizationOptionThumbnail_C_Event_OnUnhovered__DelegateSignature::Widget' has a wrong offset!");

// Function CustomizationOptionThumbnail.CustomizationOptionThumbnail_C.Event_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CustomizationOptionThumbnail_C_Event_OnPressed__DelegateSignature final
{
public:
	class UCustomizationOptionThumbnail_C*        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationOptionThumbnail_C_Event_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on CustomizationOptionThumbnail_C_Event_OnPressed__DelegateSignature");
static_assert(sizeof(CustomizationOptionThumbnail_C_Event_OnPressed__DelegateSignature) == 0x000008, "Wrong size on CustomizationOptionThumbnail_C_Event_OnPressed__DelegateSignature");
static_assert(offsetof(CustomizationOptionThumbnail_C_Event_OnPressed__DelegateSignature, Button) == 0x000000, "Member 'CustomizationOptionThumbnail_C_Event_OnPressed__DelegateSignature::Button' has a wrong offset!");

// Function CustomizationOptionThumbnail.CustomizationOptionThumbnail_C.Event_OnReleased__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CustomizationOptionThumbnail_C_Event_OnReleased__DelegateSignature final
{
public:
	class UCustomizationOptionThumbnail_C*        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationOptionThumbnail_C_Event_OnReleased__DelegateSignature) == 0x000008, "Wrong alignment on CustomizationOptionThumbnail_C_Event_OnReleased__DelegateSignature");
static_assert(sizeof(CustomizationOptionThumbnail_C_Event_OnReleased__DelegateSignature) == 0x000008, "Wrong size on CustomizationOptionThumbnail_C_Event_OnReleased__DelegateSignature");
static_assert(offsetof(CustomizationOptionThumbnail_C_Event_OnReleased__DelegateSignature, Button) == 0x000000, "Member 'CustomizationOptionThumbnail_C_Event_OnReleased__DelegateSignature::Button' has a wrong offset!");

// Function CustomizationOptionThumbnail.CustomizationOptionThumbnail_C.ExecuteUbergraph_CustomizationOptionThumbnail
// 0x0004 (0x0004 - 0x0000)
struct CustomizationOptionThumbnail_C_ExecuteUbergraph_CustomizationOptionThumbnail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationOptionThumbnail_C_ExecuteUbergraph_CustomizationOptionThumbnail) == 0x000004, "Wrong alignment on CustomizationOptionThumbnail_C_ExecuteUbergraph_CustomizationOptionThumbnail");
static_assert(sizeof(CustomizationOptionThumbnail_C_ExecuteUbergraph_CustomizationOptionThumbnail) == 0x000004, "Wrong size on CustomizationOptionThumbnail_C_ExecuteUbergraph_CustomizationOptionThumbnail");
static_assert(offsetof(CustomizationOptionThumbnail_C_ExecuteUbergraph_CustomizationOptionThumbnail, EntryPoint) == 0x000000, "Member 'CustomizationOptionThumbnail_C_ExecuteUbergraph_CustomizationOptionThumbnail::EntryPoint' has a wrong offset!");

// Function CustomizationOptionThumbnail.CustomizationOptionThumbnail_C.Initialize
// 0x0298 (0x0298 - 0x0000)
struct CustomizationOptionThumbnail_C_Initialize final
{
public:
	struct FUICustomizationItem                   Item_0;                                            // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         Index_0;                                           // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECustomizationMenuCategory                    Category_0;                                        // 0x005C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECustomizationInteractionType                 PreviousInteractionType;                           // 0x005D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBCustomizationOption*                 CallFunc_GetValidCustomizationOption_ReturnValue;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBEmoteCustomizationOption*            K2Node_DynamicCast_AsRB_Emote_Customization_Option; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_2;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_3;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_4; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_4;                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_5; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_5;                 // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerCustomizationOption*           CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_6; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_6;                 // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_7; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_7;                 // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBCustomizationOption*                 CallFunc_GetValidCustomizationOption_ReturnValue_1; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDevOption_ReturnValue;                  // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBCustomizationOption*                 CallFunc_GetValidCustomizationOption_ReturnValue_2; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BB[0x5];                                      // 0x01BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_2;                           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CB[0x5];                                      // 0x01CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_8; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_8;                 // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F3[0x5];                                      // 0x01F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_2;         // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22B[0x5];                                      // 0x022B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0230(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0258(0x0028)()
	class UTexture2D*                             Temp_object_Variable;                              // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_4;                           // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationOptionThumbnail_C_Initialize) == 0x000008, "Wrong alignment on CustomizationOptionThumbnail_C_Initialize");
static_assert(sizeof(CustomizationOptionThumbnail_C_Initialize) == 0x000298, "Wrong size on CustomizationOptionThumbnail_C_Initialize");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, Item_0) == 0x000000, "Member 'CustomizationOptionThumbnail_C_Initialize::Item_0' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, Index_0) == 0x000058, "Member 'CustomizationOptionThumbnail_C_Initialize::Index_0' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, Category_0) == 0x00005C, "Member 'CustomizationOptionThumbnail_C_Initialize::Category_0' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, PreviousInteractionType) == 0x00005D, "Member 'CustomizationOptionThumbnail_C_Initialize::PreviousInteractionType' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, Temp_bool_Variable) == 0x00005E, "Member 'CustomizationOptionThumbnail_C_Initialize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, Temp_bool_Variable_1) == 0x00005F, "Member 'CustomizationOptionThumbnail_C_Initialize::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000060, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000068, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_GetValidCustomizationOption_ReturnValue) == 0x000070, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_GetValidCustomizationOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_AsRB_Emote_Customization_Option) == 0x000078, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_AsRB_Emote_Customization_Option' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_IsValid_ReturnValue_1) == 0x000082, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_BooleanOR_ReturnValue) == 0x000083, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000088, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_AsTexture_2D) == 0x000090, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0000A0, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_AsTexture_2D_1) == 0x0000A8, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x0000B8, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_AsTexture_2D_2) == 0x0000C0, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_AsTexture_2D_2' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_bSuccess_3) == 0x0000C8, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3) == 0x0000D0, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_IsValid_ReturnValue_2) == 0x0000D8, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_AsTexture_2D_3) == 0x0000E0, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_AsTexture_2D_3' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_bSuccess_4) == 0x0000E8, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_Select_Default) == 0x0000F0, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_IsValid_ReturnValue_3) == 0x0000F8, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_IsValid_ReturnValue_4) == 0x0000F9, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_4) == 0x000100, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_AsTexture_2D_4) == 0x000108, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_AsTexture_2D_4' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_bSuccess_5) == 0x000110, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_5) == 0x000118, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_AsTexture_2D_5) == 0x000120, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_AsTexture_2D_5' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_bSuccess_6) == 0x000128, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_Array_Get_Item) == 0x000130, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_Select_Default_1) == 0x000138, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_6) == 0x000140, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_IsValid_ReturnValue_5) == 0x000148, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_AsTexture_2D_6) == 0x000150, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_AsTexture_2D_6' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_bSuccess_7) == 0x000158, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_7) == 0x000160, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_AsTexture_2D_7) == 0x000168, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_AsTexture_2D_7' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_bSuccess_8) == 0x000170, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000178, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000180, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_IsValid_ReturnValue_6) == 0x000188, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000190, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, Temp_byte_Variable) == 0x000198, "Member 'CustomizationOptionThumbnail_C_Initialize::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, Temp_byte_Variable_1) == 0x000199, "Member 'CustomizationOptionThumbnail_C_Initialize::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_GetValidCustomizationOption_ReturnValue_1) == 0x0001A0, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_GetValidCustomizationOption_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_IsValid_ReturnValue_7) == 0x0001A8, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_IsDevOption_ReturnValue) == 0x0001A9, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_IsDevOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_GetValidCustomizationOption_ReturnValue_2) == 0x0001B0, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_GetValidCustomizationOption_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_IsValid_ReturnValue_8) == 0x0001B8, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_Not_PreBool_ReturnValue) == 0x0001B9, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, Temp_bool_Variable_2) == 0x0001BA, "Member 'CustomizationOptionThumbnail_C_Initialize::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_Select_Default_2) == 0x0001C0, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, Temp_bool_Variable_3) == 0x0001C8, "Member 'CustomizationOptionThumbnail_C_Initialize::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_Select_Default_3) == 0x0001C9, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_IsValid_ReturnValue_9) == 0x0001CA, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_8) == 0x0001D0, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_AsTexture_2D_8) == 0x0001D8, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_AsTexture_2D_8' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_DynamicCast_bSuccess_9) == 0x0001E0, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_Map_Find_Value) == 0x0001E8, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_Map_Find_ReturnValue) == 0x0001F0, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_NotEqual_NameName_ReturnValue) == 0x0001F1, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_BooleanOR_ReturnValue_1) == 0x0001F2, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_LoadAsset_Blocking_ReturnValue_2) == 0x0001F8, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_LoadAsset_Blocking_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_MakeStruct_Margin) == 0x000200, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_PlayAnimationForward_ReturnValue) == 0x000210, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_MakeStruct_Margin_1) == 0x000218, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000228, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000229, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, CallFunc_BooleanAND_ReturnValue) == 0x00022A, "Member 'CustomizationOptionThumbnail_C_Initialize::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_MakeStruct_SlateColor) == 0x000230, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_MakeStruct_SlateColor_1) == 0x000258, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, Temp_object_Variable) == 0x000280, "Member 'CustomizationOptionThumbnail_C_Initialize::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, Temp_bool_Variable_4) == 0x000288, "Member 'CustomizationOptionThumbnail_C_Initialize::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_Initialize, K2Node_Select_Default_4) == 0x000290, "Member 'CustomizationOptionThumbnail_C_Initialize::K2Node_Select_Default_4' has a wrong offset!");

// Function CustomizationOptionThumbnail.CustomizationOptionThumbnail_C.SetHovered
// 0x0001 (0x0001 - 0x0000)
struct CustomizationOptionThumbnail_C_SetHovered final
{
public:
	bool                                          IsHovered_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationOptionThumbnail_C_SetHovered) == 0x000001, "Wrong alignment on CustomizationOptionThumbnail_C_SetHovered");
static_assert(sizeof(CustomizationOptionThumbnail_C_SetHovered) == 0x000001, "Wrong size on CustomizationOptionThumbnail_C_SetHovered");
static_assert(offsetof(CustomizationOptionThumbnail_C_SetHovered, IsHovered_0) == 0x000000, "Member 'CustomizationOptionThumbnail_C_SetHovered::IsHovered_0' has a wrong offset!");

// Function CustomizationOptionThumbnail.CustomizationOptionThumbnail_C.SetIsEquipped
// 0x0001 (0x0001 - 0x0000)
struct CustomizationOptionThumbnail_C_SetIsEquipped final
{
public:
	bool                                          Equipped;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationOptionThumbnail_C_SetIsEquipped) == 0x000001, "Wrong alignment on CustomizationOptionThumbnail_C_SetIsEquipped");
static_assert(sizeof(CustomizationOptionThumbnail_C_SetIsEquipped) == 0x000001, "Wrong size on CustomizationOptionThumbnail_C_SetIsEquipped");
static_assert(offsetof(CustomizationOptionThumbnail_C_SetIsEquipped, Equipped) == 0x000000, "Member 'CustomizationOptionThumbnail_C_SetIsEquipped::Equipped' has a wrong offset!");

// Function CustomizationOptionThumbnail.CustomizationOptionThumbnail_C.UpdateRarity
// 0x00D0 (0x00D0 - 0x0000)
struct CustomizationOptionThumbnail_C_UpdateRarity final
{
public:
	EPlayerCustomizationRarity                    Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	class URBPlayerCustomizationConfig*           CallFunc_GetPlayerCustomizationConfig_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCustomizationRarityUIInfo             CallFunc_Map_Find_Value;                           // 0x0038(0x0068)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x00A8(0x0028)()
};
static_assert(alignof(CustomizationOptionThumbnail_C_UpdateRarity) == 0x000008, "Wrong alignment on CustomizationOptionThumbnail_C_UpdateRarity");
static_assert(sizeof(CustomizationOptionThumbnail_C_UpdateRarity) == 0x0000D0, "Wrong size on CustomizationOptionThumbnail_C_UpdateRarity");
static_assert(offsetof(CustomizationOptionThumbnail_C_UpdateRarity, Rarity) == 0x000000, "Member 'CustomizationOptionThumbnail_C_UpdateRarity::Rarity' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_UpdateRarity, Temp_bool_Variable) == 0x000001, "Member 'CustomizationOptionThumbnail_C_UpdateRarity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_UpdateRarity, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'CustomizationOptionThumbnail_C_UpdateRarity::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_UpdateRarity, CallFunc_GetPlayerCustomizationConfig_ReturnValue) == 0x000030, "Member 'CustomizationOptionThumbnail_C_UpdateRarity::CallFunc_GetPlayerCustomizationConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_UpdateRarity, CallFunc_Map_Find_Value) == 0x000038, "Member 'CustomizationOptionThumbnail_C_UpdateRarity::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_UpdateRarity, CallFunc_Map_Find_ReturnValue) == 0x0000A0, "Member 'CustomizationOptionThumbnail_C_UpdateRarity::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_UpdateRarity, K2Node_Select_Default) == 0x0000A8, "Member 'CustomizationOptionThumbnail_C_UpdateRarity::K2Node_Select_Default' has a wrong offset!");

// Function CustomizationOptionThumbnail.CustomizationOptionThumbnail_C.SetIsNew
// 0x0008 (0x0008 - 0x0000)
struct CustomizationOptionThumbnail_C_SetIsNew final
{
public:
	bool                                          IsNew;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          WasNew;                                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationOptionThumbnail_C_SetIsNew) == 0x000001, "Wrong alignment on CustomizationOptionThumbnail_C_SetIsNew");
static_assert(sizeof(CustomizationOptionThumbnail_C_SetIsNew) == 0x000008, "Wrong size on CustomizationOptionThumbnail_C_SetIsNew");
static_assert(offsetof(CustomizationOptionThumbnail_C_SetIsNew, IsNew) == 0x000000, "Member 'CustomizationOptionThumbnail_C_SetIsNew::IsNew' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_SetIsNew, WasNew) == 0x000001, "Member 'CustomizationOptionThumbnail_C_SetIsNew::WasNew' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_SetIsNew, Temp_bool_Variable) == 0x000002, "Member 'CustomizationOptionThumbnail_C_SetIsNew::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_SetIsNew, Temp_byte_Variable) == 0x000003, "Member 'CustomizationOptionThumbnail_C_SetIsNew::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_SetIsNew, Temp_byte_Variable_1) == 0x000004, "Member 'CustomizationOptionThumbnail_C_SetIsNew::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_SetIsNew, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'CustomizationOptionThumbnail_C_SetIsNew::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_SetIsNew, K2Node_Select_Default) == 0x000006, "Member 'CustomizationOptionThumbnail_C_SetIsNew::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomizationOptionThumbnail_C_SetIsNew, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'CustomizationOptionThumbnail_C_SetIsNew::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CustomizationOptionThumbnail.CustomizationOptionThumbnail_C.InitCost
// 0x01C0 (0x01C0 - 0x0000)
struct CustomizationOptionThumbnail_C_InitCost final
{
public:
	bool                                          bIsUnlocked;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CostText;                                          // 0x0008(0x0018)(Edit, BlueprintVisible)
	bool                                          bHasCost;                                          // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsAcquired;                                       // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ECurrencyType                                 Temp_byte_Variable;                                // 0x0022(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECurrencyType                                 Temp_byte_Variable_1;                              // 0x0025(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECurrencyType                                 Temp_byte_Variable_2;                              // 0x0029(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECurrencyType                                 Temp_byte_Variable_3;                              // 0x002A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECurrencyType                                 Temp_byte_Variable_4;                              // 0x002C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSettings_Gameplay*                   CallFunc_GetRBSettings_Gameplay_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBCustomizationOption*                 CallFunc_GetValidCustomizationOption_ReturnValue;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAcquired_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUnlocked_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ECurrencyType, int32>                    CallFunc_BP_GetCost_ReturnValue;                   // 0x0060(0x0050)()
	int32                                         CallFunc_Map_Find_Value;                           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value_1;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value_2;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value_3;                         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECurrencyType                                 K2Node_Select_Default;                             // 0x00CD(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
