#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationCategoryButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CustomizationCategoryButton.CustomizationCategoryButton_C
// 0x0080 (0x02E0 - 0x0260)
class UCustomizationCategoryButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BackgroundImage;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CustomizationCategoryIcon;                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CustomizationCategoryName;                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedBottomLeftBracket_1;                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedBottomRightBracket_1;                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedTopLeftBracket_1;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedTopRightBracket_1;                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InteractionButton;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewNotification;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              NewScale;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SelectionBorderPanel;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ECustomizationCategory                        CustomizationCategory;                             // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFocused;                                          // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHovered;                                          // 0x02C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C3[0x5];                                      // 0x02C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCustomizationCategoryClicked;                    // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsLoadout;                                        // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsHeader;                                         // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bForceHighlight;                                   // 0x02DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void OnCustomizationCategoryClicked__DelegateSignature(ECustomizationCategory Category);
	void ExecuteUbergraph_CustomizationCategoryButton(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnCustomizationCategoriesPageDisplayed();
	void BndEvt__PerkCategoryButton_InteractionButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__PerkCategoryButton_InteractionButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__PerkCategoryButton_InteractionButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void Setup();
	void Refresh();
	void SetHovered(bool IsHovered_0);
	void SetFocused(bool bInFocused);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void IsConsideredHovered(bool* bConsideredHovered);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void Update_Is_New();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomizationCategoryButton_C">();
	}
	static class UCustomizationCategoryButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizationCategoryButton_C>();
	}
};
static_assert(alignof(UCustomizationCategoryButton_C) == 0x000008, "Wrong alignment on UCustomizationCategoryButton_C");
static_assert(sizeof(UCustomizationCategoryButton_C) == 0x0002E0, "Wrong size on UCustomizationCategoryButton_C");
static_assert(offsetof(UCustomizationCategoryButton_C, UberGraphFrame) == 0x000260, "Member 'UCustomizationCategoryButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, BackgroundImage) == 0x000268, "Member 'UCustomizationCategoryButton_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, CustomizationCategoryIcon) == 0x000270, "Member 'UCustomizationCategoryButton_C::CustomizationCategoryIcon' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, CustomizationCategoryName) == 0x000278, "Member 'UCustomizationCategoryButton_C::CustomizationCategoryName' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, FocussedBottomLeftBracket_1) == 0x000280, "Member 'UCustomizationCategoryButton_C::FocussedBottomLeftBracket_1' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, FocussedBottomRightBracket_1) == 0x000288, "Member 'UCustomizationCategoryButton_C::FocussedBottomRightBracket_1' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, FocussedTopLeftBracket_1) == 0x000290, "Member 'UCustomizationCategoryButton_C::FocussedTopLeftBracket_1' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, FocussedTopRightBracket_1) == 0x000298, "Member 'UCustomizationCategoryButton_C::FocussedTopRightBracket_1' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, InteractionButton) == 0x0002A0, "Member 'UCustomizationCategoryButton_C::InteractionButton' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, NewNotification) == 0x0002A8, "Member 'UCustomizationCategoryButton_C::NewNotification' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, NewScale) == 0x0002B0, "Member 'UCustomizationCategoryButton_C::NewScale' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, SelectionBorderPanel) == 0x0002B8, "Member 'UCustomizationCategoryButton_C::SelectionBorderPanel' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, CustomizationCategory) == 0x0002C0, "Member 'UCustomizationCategoryButton_C::CustomizationCategory' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, bFocused) == 0x0002C1, "Member 'UCustomizationCategoryButton_C::bFocused' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, bHovered) == 0x0002C2, "Member 'UCustomizationCategoryButton_C::bHovered' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, OnCustomizationCategoryClicked) == 0x0002C8, "Member 'UCustomizationCategoryButton_C::OnCustomizationCategoryClicked' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, bIsLoadout) == 0x0002D8, "Member 'UCustomizationCategoryButton_C::bIsLoadout' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, bIsHeader) == 0x0002D9, "Member 'UCustomizationCategoryButton_C::bIsHeader' has a wrong offset!");
static_assert(offsetof(UCustomizationCategoryButton_C, bForceHighlight) == 0x0002DA, "Member 'UCustomizationCategoryButton_C::bForceHighlight' has a wrong offset!");

}

