#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationMenu

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CustomizationMenu.CustomizationMenu_C.ExecuteUbergraph_CustomizationMenu
// 0x04A0 (0x04A0 - 0x0000)
struct CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool ShouldShowPalette)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FRBHairColorOption& NewHairColor)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FRBHairColorOption& HoveredHairColor)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FUICustomizationItem& CustoItem)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isTutorial;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsCellCusto;                   // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMenuCharacter_C*                       K2Node_CustomEvent_MenuCharacter;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACellCustomizationCameraActor_C*        K2Node_CustomEvent_CellCustomization;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomizationContentWidget_V2_C*       K2Node_DynamicCast_AsCustomization_Content_Widget_V2; // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationContentWidget_V2_C*       K2Node_DynamicCast_AsCustomization_Content_Widget_V2_1; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEquippedHairColor_ReturnValue;         // 0x00FC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationContentWidget_V2_C*       K2Node_DynamicCast_AsCustomization_Content_Widget_V2_2; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue_1;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLobbyPlayerState*                    K2Node_DynamicCast_AsRB_Lobby_Player_State;        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLobbyPlayerState*                    K2Node_DynamicCast_AsRB_Lobby_Player_State_1;      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerCell*                          CallFunc_GetPlayerCell_ReturnValue;                // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayerCell*                          CallFunc_GetPlayerCell_ReturnValue_1;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUICustomizationItem                   K2Node_CustomEvent_custoItem_1;                    // 0x0158(0x0058)(NoDestructor)
	class URBPlayerIconCustomizationOption*       K2Node_CustomEvent_custoItem;                      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShouldShowPalette;              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x2];                                      // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBHairColorOption                     K2Node_CustomEvent_newHairColor;                   // 0x01BC(0x0028)(NoDestructor)
	struct FRBHairColorOption                     K2Node_CustomEvent_HoveredHairColor;               // 0x01E4(0x0028)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x020E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20F[0x1];                                      // 0x020F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsGamepad;                           // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_216[0x2];                                      // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUICustomizationItem                   K2Node_ComponentBoundEvent_item;                   // 0x0218(0x0058)(NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0273(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0274(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetLocalCellMenuCharacter_ReturnValue;    // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMenuCharacter_C*                       K2Node_DynamicCast_AsMenu_Character;               // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameStateLobby*                      CallFunc_GetRBGameStateLobby_ReturnValue;          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_amount;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x02D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_FactorX;                        // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_FactorY;                        // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0310(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39A[0x6];                                      // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLobbyPlayerController*               CallFunc_GetLocalLobbyPlayerController_ReturnValue; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetNarrator_ClientOnly_ReturnValue;       // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECustomizationCategory                        K2Node_ComponentBoundEvent_Category_2;             // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECustomizationCategory                        K2Node_ComponentBoundEvent_Category_1;             // 0x03B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECustomizationCategory                        K2Node_ComponentBoundEvent_Category;               // 0x03B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationContentWidget_V2_C*       K2Node_DynamicCast_AsCustomization_Content_Widget_V2_3; // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationContentWidget_V2_C*       CallFunc_GetCustomizationContentWidget_CustomizationContent; // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x03D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x03D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x03D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x03D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomizationContentWidget_V2_C*       CallFunc_GetCustomizationContentWidget_CustomizationContent_1; // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomizationContentWidget_V2_C*       CallFunc_GetCustomizationContentWidget_CustomizationContent_2; // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationContentWidget_V2_C*       CallFunc_GetCustomizationContentWidget_CustomizationContent_3; // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomizationContentWidget_V2_C*       CallFunc_GetCustomizationContentWidget_CustomizationContent_4; // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0420(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0438(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomizationCategoryButton_C*         K2Node_DynamicCast_AsCustomization_Category_Button; // 0x0440(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_452[0x2];                                      // 0x0452(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class URBPlayerIconCustomizationOption* CustoItem)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0454(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationContentWidget_V2_C*       CallFunc_GetCustomizationContentWidget_CustomizationContent_5; // 0x0468(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidget*                          CallFunc_GetFocusedChild_ReturnValue;              // 0x0478(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidget*                          CallFunc_GetFocusedChild_ReturnValue_1;            // 0x0488(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue_1;             // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue_1;          // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x049A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanRotate_ReturnValue;                    // 0x049B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu) == 0x000008, "Wrong alignment on CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu");
static_assert(sizeof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu) == 0x0004A0, "Wrong size on CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, EntryPoint) == 0x000000, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_bool_Variable) == 0x000004, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_byte_Variable) == 0x000018, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_byte_Variable_1) == 0x000019, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_4) == 0x000058, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_5) == 0x000068, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_bool_Variable_1) == 0x000078, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_byte_Variable_2) == 0x000079, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_byte_Variable_3) == 0x00007A, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_Abs_ReturnValue) == 0x00007C, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_Abs_ReturnValue_1) == 0x000080, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000084, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000085, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_6) == 0x000088, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_bool_Variable_2) == 0x000098, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_byte_Variable_4) == 0x000099, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_byte_Variable_5) == 0x00009A, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_int_Array_Index_Variable) == 0x0000A4, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000A8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_byte_Variable_6) == 0x0000B8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_ComponentBoundEvent_Button) == 0x0000C0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CustomEvent_isTutorial) == 0x0000C8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CustomEvent_isTutorial' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CustomEvent_bIsCellCusto) == 0x0000C9, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CustomEvent_bIsCellCusto' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CustomEvent_MenuCharacter) == 0x0000D0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CustomEvent_MenuCharacter' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CustomEvent_CellCustomization) == 0x0000D8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CustomEvent_CellCustomization' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_DynamicCast_AsCustomization_Content_Widget_V2) == 0x0000E0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_DynamicCast_AsCustomization_Content_Widget_V2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_DynamicCast_AsCustomization_Content_Widget_V2_1) == 0x0000F0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_DynamicCast_AsCustomization_Content_Widget_V2_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GetEquippedHairColor_ReturnValue) == 0x0000FC, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GetEquippedHairColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_DynamicCast_AsCustomization_Content_Widget_V2_2) == 0x000108, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_DynamicCast_AsCustomization_Content_Widget_V2_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_DynamicCast_bSuccess_2) == 0x000110, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_byte_Variable_7) == 0x000111, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000118, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GetLocalPlayerState_ReturnValue_1) == 0x000120, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GetLocalPlayerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_DynamicCast_AsRB_Lobby_Player_State) == 0x000128, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_DynamicCast_AsRB_Lobby_Player_State' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_DynamicCast_bSuccess_3) == 0x000130, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_DynamicCast_AsRB_Lobby_Player_State_1) == 0x000138, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_DynamicCast_AsRB_Lobby_Player_State_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_DynamicCast_bSuccess_4) == 0x000140, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GetPlayerCell_ReturnValue) == 0x000148, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GetPlayerCell_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GetPlayerCell_ReturnValue_1) == 0x000150, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GetPlayerCell_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CustomEvent_custoItem_1) == 0x000158, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CustomEvent_custoItem_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CustomEvent_custoItem) == 0x0001B0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CustomEvent_custoItem' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CustomEvent_ShouldShowPalette) == 0x0001B8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CustomEvent_ShouldShowPalette' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_Select_Default) == 0x0001B9, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CustomEvent_newHairColor) == 0x0001BC, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CustomEvent_newHairColor' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CustomEvent_HoveredHairColor) == 0x0001E4, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CustomEvent_HoveredHairColor' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_IsValid_ReturnValue_1) == 0x00020C, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x00020D, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_K2_IsValidTimerHandle_ReturnValue_1) == 0x00020E, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_K2_IsValidTimerHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000210, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_Event_bIsGamepad) == 0x000214, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_Event_bIsGamepad' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_IsValid_ReturnValue_2) == 0x000215, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_ComponentBoundEvent_item) == 0x000218, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_ComponentBoundEvent_item' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_byte_Variable_8) == 0x000270, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_IsValid_ReturnValue_3) == 0x000271, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_IsValid_ReturnValue_4) == 0x000272, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_IsValid_ReturnValue_5) == 0x000273, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_Event_MyGeometry) == 0x000274, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_Event_InDeltaTime) == 0x0002AC, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GetLocalCellMenuCharacter_ReturnValue) == 0x0002B0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GetLocalCellMenuCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_DynamicCast_AsMenu_Character) == 0x0002B8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_DynamicCast_AsMenu_Character' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_DynamicCast_bSuccess_5) == 0x0002C0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GetRBGameStateLobby_ReturnValue) == 0x0002C8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GetRBGameStateLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_ComponentBoundEvent_amount) == 0x0002D0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_ComponentBoundEvent_amount' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002D4, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_Not_PreBool_ReturnValue) == 0x0002D5, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_BooleanAND_ReturnValue) == 0x0002D6, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_Select_Default_1) == 0x0002D7, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_BreakRotator_Roll) == 0x0002D8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_BreakRotator_Pitch) == 0x0002DC, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_BreakRotator_Yaw) == 0x0002E0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x0002E4, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002E8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x0002EC, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CustomEvent_FactorX) == 0x0002F0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CustomEvent_FactorX' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0002F4, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_InRange_FloatFloat_ReturnValue) == 0x0002F8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_CustomEvent_FactorY) == 0x0002FC, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_CustomEvent_FactorY' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_SelectFloat_ReturnValue) == 0x000300, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_MakeRotator_ReturnValue) == 0x000304, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000310, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_BooleanAND_ReturnValue_1) == 0x000398, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_BooleanOR_ReturnValue) == 0x000399, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GetLocalLobbyPlayerController_ReturnValue) == 0x0003A0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GetLocalLobbyPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GetNarrator_ClientOnly_ReturnValue) == 0x0003A8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GetNarrator_ClientOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_byte_Variable_9) == 0x0003B0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_ComponentBoundEvent_Category_2) == 0x0003B1, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_ComponentBoundEvent_Category_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_ComponentBoundEvent_Category_1) == 0x0003B2, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_ComponentBoundEvent_Category_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_ComponentBoundEvent_Category) == 0x0003B3, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_ComponentBoundEvent_Category' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_Event_IsDesignTime) == 0x0003B4, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_DynamicCast_AsCustomization_Content_Widget_V2_3) == 0x0003B8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_DynamicCast_AsCustomization_Content_Widget_V2_3' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_DynamicCast_bSuccess_6) == 0x0003C0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GetCustomizationContentWidget_CustomizationContent) == 0x0003C8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GetCustomizationContentWidget_CustomizationContent' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_IsVisible_ReturnValue) == 0x0003D0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_BooleanOR_ReturnValue_1) == 0x0003D1, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_Not_PreBool_ReturnValue_1) == 0x0003D2, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_BooleanAND_ReturnValue_2) == 0x0003D3, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_bool_Variable_3) == 0x0003D4, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, Temp_bool_Variable_4) == 0x0003D5, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_Select_Default_2) == 0x0003D6, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, K2Node_Select_Default_3) == 0x0003D7, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GetCustomizationContentWidget_CustomizationContent_1) == 0x0003D8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GetCustomizationContentWidget_CustomizationContent_1' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GetCustomizationContentWidget_CustomizationContent_2) == 0x0003E0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GetCustomizationContentWidget_CustomizationContent_2' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0003E8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0003F0, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_IsValid_ReturnValue_6) == 0x0003F8, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GetCustomizationContentWidget_CustomizationContent_3) == 0x000400, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GetCustomizationContentWidget_CustomizationContent_3' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_GetCustomizationContentWidget_CustomizationContent_4) == 0x000408, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_GetCustomizationContentWidget_CustomizationContent_4' has a wrong offset!");
static_assert(offsetof(CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu, CallFunc_BooleanOR_ReturnValue_2) == 0x000410, "Member 'CustomizationMenu_C_ExecuteUbergraph_CustomizationMenu::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
