#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationCategoryButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function CustomizationCategoryButton.CustomizationCategoryButton_C.OnCustomizationCategoryClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CustomizationCategoryButton_C_OnCustomizationCategoryClicked__DelegateSignature final
{
public:
	ECustomizationCategory                        Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationCategoryButton_C_OnCustomizationCategoryClicked__DelegateSignature) == 0x000001, "Wrong alignment on CustomizationCategoryButton_C_OnCustomizationCategoryClicked__DelegateSignature");
static_assert(sizeof(CustomizationCategoryButton_C_OnCustomizationCategoryClicked__DelegateSignature) == 0x000001, "Wrong size on CustomizationCategoryButton_C_OnCustomizationCategoryClicked__DelegateSignature");
static_assert(offsetof(CustomizationCategoryButton_C_OnCustomizationCategoryClicked__DelegateSignature, Category) == 0x000000, "Member 'CustomizationCategoryButton_C_OnCustomizationCategoryClicked__DelegateSignature::Category' has a wrong offset!");

// Function CustomizationCategoryButton.CustomizationCategoryButton_C.ExecuteUbergraph_CustomizationCategoryButton
// 0x0010 (0x0010 - 0x0000)
struct CustomizationCategoryButton_C_ExecuteUbergraph_CustomizationCategoryButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0008(0x0008)(NoDestructor)
};
static_assert(alignof(CustomizationCategoryButton_C_ExecuteUbergraph_CustomizationCategoryButton) == 0x000004, "Wrong alignment on CustomizationCategoryButton_C_ExecuteUbergraph_CustomizationCategoryButton");
static_assert(sizeof(CustomizationCategoryButton_C_ExecuteUbergraph_CustomizationCategoryButton) == 0x000010, "Wrong size on CustomizationCategoryButton_C_ExecuteUbergraph_CustomizationCategoryButton");
static_assert(offsetof(CustomizationCategoryButton_C_ExecuteUbergraph_CustomizationCategoryButton, EntryPoint) == 0x000000, "Member 'CustomizationCategoryButton_C_ExecuteUbergraph_CustomizationCategoryButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_ExecuteUbergraph_CustomizationCategoryButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'CustomizationCategoryButton_C_ExecuteUbergraph_CustomizationCategoryButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_ExecuteUbergraph_CustomizationCategoryButton, K2Node_Event_InFocusEvent) == 0x000008, "Member 'CustomizationCategoryButton_C_ExecuteUbergraph_CustomizationCategoryButton::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function CustomizationCategoryButton.CustomizationCategoryButton_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct CustomizationCategoryButton_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CustomizationCategoryButton_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on CustomizationCategoryButton_C_OnAddedToFocusPath");
static_assert(sizeof(CustomizationCategoryButton_C_OnAddedToFocusPath) == 0x000008, "Wrong size on CustomizationCategoryButton_C_OnAddedToFocusPath");
static_assert(offsetof(CustomizationCategoryButton_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'CustomizationCategoryButton_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function CustomizationCategoryButton.CustomizationCategoryButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CustomizationCategoryButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationCategoryButton_C_PreConstruct) == 0x000001, "Wrong alignment on CustomizationCategoryButton_C_PreConstruct");
static_assert(sizeof(CustomizationCategoryButton_C_PreConstruct) == 0x000001, "Wrong size on CustomizationCategoryButton_C_PreConstruct");
static_assert(offsetof(CustomizationCategoryButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CustomizationCategoryButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CustomizationCategoryButton.CustomizationCategoryButton_C.Setup
// 0x0060 (0x0060 - 0x0000)
struct CustomizationCategoryButton_C_Setup final
{
public:
	ECustomizationCategory                        Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0040(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationCategoryButton_C_Setup) == 0x000008, "Wrong alignment on CustomizationCategoryButton_C_Setup");
static_assert(sizeof(CustomizationCategoryButton_C_Setup) == 0x000060, "Wrong size on CustomizationCategoryButton_C_Setup");
static_assert(offsetof(CustomizationCategoryButton_C_Setup, Temp_byte_Variable) == 0x000000, "Member 'CustomizationCategoryButton_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Setup, Temp_object_Variable) == 0x000008, "Member 'CustomizationCategoryButton_C_Setup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Setup, Temp_object_Variable_1) == 0x000010, "Member 'CustomizationCategoryButton_C_Setup::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Setup, Temp_object_Variable_2) == 0x000018, "Member 'CustomizationCategoryButton_C_Setup::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Setup, Temp_object_Variable_3) == 0x000020, "Member 'CustomizationCategoryButton_C_Setup::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Setup, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'CustomizationCategoryButton_C_Setup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Setup, K2Node_Select_Default) == 0x000030, "Member 'CustomizationCategoryButton_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Setup, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000038, "Member 'CustomizationCategoryButton_C_Setup::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Setup, CallFunc_Map_Find_Value) == 0x000040, "Member 'CustomizationCategoryButton_C_Setup::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Setup, CallFunc_Map_Find_ReturnValue) == 0x000058, "Member 'CustomizationCategoryButton_C_Setup::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function CustomizationCategoryButton.CustomizationCategoryButton_C.Refresh
// 0x00E0 (0x00E0 - 0x0000)
struct CustomizationCategoryButton_C_Refresh final
{
public:
	int32                                         TotalCount;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AcquiredCount;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECustomizationCategory                        Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECustomizationCategory                        Temp_byte_Variable_1;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_5;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_6;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_7;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered_1; // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00A8(0x0028)()
	class UTexture2D*                             K2Node_Select_Default_3;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered_2; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationCategoryButton_C_Refresh) == 0x000008, "Wrong alignment on CustomizationCategoryButton_C_Refresh");
static_assert(sizeof(CustomizationCategoryButton_C_Refresh) == 0x0000E0, "Wrong size on CustomizationCategoryButton_C_Refresh");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, TotalCount) == 0x000000, "Member 'CustomizationCategoryButton_C_Refresh::TotalCount' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, AcquiredCount) == 0x000004, "Member 'CustomizationCategoryButton_C_Refresh::AcquiredCount' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_byte_Variable) == 0x000008, "Member 'CustomizationCategoryButton_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_object_Variable) == 0x000010, "Member 'CustomizationCategoryButton_C_Refresh::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_object_Variable_1) == 0x000018, "Member 'CustomizationCategoryButton_C_Refresh::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_object_Variable_2) == 0x000020, "Member 'CustomizationCategoryButton_C_Refresh::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_object_Variable_3) == 0x000028, "Member 'CustomizationCategoryButton_C_Refresh::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_bool_Variable) == 0x000030, "Member 'CustomizationCategoryButton_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_byte_Variable_1) == 0x000031, "Member 'CustomizationCategoryButton_C_Refresh::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_object_Variable_4) == 0x000038, "Member 'CustomizationCategoryButton_C_Refresh::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_object_Variable_5) == 0x000040, "Member 'CustomizationCategoryButton_C_Refresh::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_object_Variable_6) == 0x000048, "Member 'CustomizationCategoryButton_C_Refresh::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_object_Variable_7) == 0x000050, "Member 'CustomizationCategoryButton_C_Refresh::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_bool_Variable_1) == 0x000058, "Member 'CustomizationCategoryButton_C_Refresh::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_struct_Variable) == 0x00005C, "Member 'CustomizationCategoryButton_C_Refresh::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_struct_Variable_1) == 0x00006C, "Member 'CustomizationCategoryButton_C_Refresh::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_bool_Variable_2) == 0x00007C, "Member 'CustomizationCategoryButton_C_Refresh::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_byte_Variable_2) == 0x00007D, "Member 'CustomizationCategoryButton_C_Refresh::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, Temp_byte_Variable_3) == 0x00007E, "Member 'CustomizationCategoryButton_C_Refresh::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, K2Node_Select_Default) == 0x000080, "Member 'CustomizationCategoryButton_C_Refresh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, K2Node_Select_Default_1) == 0x000088, "Member 'CustomizationCategoryButton_C_Refresh::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000090, "Member 'CustomizationCategoryButton_C_Refresh::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, CallFunc_BooleanOR_ReturnValue) == 0x000091, "Member 'CustomizationCategoryButton_C_Refresh::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, CallFunc_IsConsideredHovered_bConsideredHovered_1) == 0x000092, "Member 'CustomizationCategoryButton_C_Refresh::CallFunc_IsConsideredHovered_bConsideredHovered_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, CallFunc_BooleanOR_ReturnValue_1) == 0x000093, "Member 'CustomizationCategoryButton_C_Refresh::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, K2Node_Select_Default_2) == 0x000094, "Member 'CustomizationCategoryButton_C_Refresh::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, K2Node_MakeStruct_SlateColor) == 0x0000A8, "Member 'CustomizationCategoryButton_C_Refresh::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, K2Node_Select_Default_3) == 0x0000D0, "Member 'CustomizationCategoryButton_C_Refresh::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, CallFunc_IsConsideredHovered_bConsideredHovered_2) == 0x0000D8, "Member 'CustomizationCategoryButton_C_Refresh::CallFunc_IsConsideredHovered_bConsideredHovered_2' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Refresh, K2Node_Select_Default_4) == 0x0000D9, "Member 'CustomizationCategoryButton_C_Refresh::K2Node_Select_Default_4' has a wrong offset!");

// Function CustomizationCategoryButton.CustomizationCategoryButton_C.SetHovered
// 0x0001 (0x0001 - 0x0000)
struct CustomizationCategoryButton_C_SetHovered final
{
public:
	bool                                          IsHovered_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationCategoryButton_C_SetHovered) == 0x000001, "Wrong alignment on CustomizationCategoryButton_C_SetHovered");
static_assert(sizeof(CustomizationCategoryButton_C_SetHovered) == 0x000001, "Wrong size on CustomizationCategoryButton_C_SetHovered");
static_assert(offsetof(CustomizationCategoryButton_C_SetHovered, IsHovered_0) == 0x000000, "Member 'CustomizationCategoryButton_C_SetHovered::IsHovered_0' has a wrong offset!");

// Function CustomizationCategoryButton.CustomizationCategoryButton_C.SetFocused
// 0x0001 (0x0001 - 0x0000)
struct CustomizationCategoryButton_C_SetFocused final
{
public:
	bool                                          bInFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationCategoryButton_C_SetFocused) == 0x000001, "Wrong alignment on CustomizationCategoryButton_C_SetFocused");
static_assert(sizeof(CustomizationCategoryButton_C_SetFocused) == 0x000001, "Wrong size on CustomizationCategoryButton_C_SetFocused");
static_assert(offsetof(CustomizationCategoryButton_C_SetFocused, bInFocused) == 0x000000, "Member 'CustomizationCategoryButton_C_SetFocused::bInFocused' has a wrong offset!");

// Function CustomizationCategoryButton.CustomizationCategoryButton_C.OnFocusReceived
// 0x01D0 (0x01D0 - 0x0000)
struct CustomizationCategoryButton_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00F8(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0118(0x00B8)()
};
static_assert(alignof(CustomizationCategoryButton_C_OnFocusReceived) == 0x000008, "Wrong alignment on CustomizationCategoryButton_C_OnFocusReceived");
static_assert(sizeof(CustomizationCategoryButton_C_OnFocusReceived) == 0x0001D0, "Wrong size on CustomizationCategoryButton_C_OnFocusReceived");
static_assert(offsetof(CustomizationCategoryButton_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'CustomizationCategoryButton_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'CustomizationCategoryButton_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'CustomizationCategoryButton_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_OnFocusReceived, CallFunc_MakeLiteralText_ReturnValue) == 0x0000F8, "Member 'CustomizationCategoryButton_C_OnFocusReceived::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_OnFocusReceived, CallFunc_MakeLiteralName_ReturnValue) == 0x000110, "Member 'CustomizationCategoryButton_C_OnFocusReceived::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000118, "Member 'CustomizationCategoryButton_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function CustomizationCategoryButton.CustomizationCategoryButton_C.IsConsideredHovered
// 0x0018 (0x0018 - 0x0000)
struct CustomizationCategoryButton_C_IsConsideredHovered final
{
public:
	bool                                          bConsideredHovered;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationCategoryButton_C_IsConsideredHovered) == 0x000008, "Wrong alignment on CustomizationCategoryButton_C_IsConsideredHovered");
static_assert(sizeof(CustomizationCategoryButton_C_IsConsideredHovered) == 0x000018, "Wrong size on CustomizationCategoryButton_C_IsConsideredHovered");
static_assert(offsetof(CustomizationCategoryButton_C_IsConsideredHovered, bConsideredHovered) == 0x000000, "Member 'CustomizationCategoryButton_C_IsConsideredHovered::bConsideredHovered' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_IsConsideredHovered, CallFunc_GetMenuManager_ReturnValue) == 0x000008, "Member 'CustomizationCategoryButton_C_IsConsideredHovered::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_IsConsideredHovered, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000010, "Member 'CustomizationCategoryButton_C_IsConsideredHovered::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");

// Function CustomizationCategoryButton.CustomizationCategoryButton_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct CustomizationCategoryButton_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CustomizationCategoryButton_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on CustomizationCategoryButton_C_OnRemovedFromFocusPath");
static_assert(sizeof(CustomizationCategoryButton_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on CustomizationCategoryButton_C_OnRemovedFromFocusPath");
static_assert(offsetof(CustomizationCategoryButton_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'CustomizationCategoryButton_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function CustomizationCategoryButton.CustomizationCategoryButton_C.Update Is New
// 0x0018 (0x0018 - 0x0000)
struct CustomizationCategoryButton_C_Update_Is_New final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_HasNewPlayerCustoItems_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationCategoryButton_C_Update_Is_New) == 0x000008, "Wrong alignment on CustomizationCategoryButton_C_Update_Is_New");
static_assert(sizeof(CustomizationCategoryButton_C_Update_Is_New) == 0x000018, "Wrong size on CustomizationCategoryButton_C_Update_Is_New");
static_assert(offsetof(CustomizationCategoryButton_C_Update_Is_New, Count) == 0x000000, "Member 'CustomizationCategoryButton_C_Update_Is_New::Count' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Update_Is_New, Temp_bool_Variable) == 0x000004, "Member 'CustomizationCategoryButton_C_Update_Is_New::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationCategoryButton_C_Update_Is_New, Temp_byte_Variable) == 0x000005, "Member 'CustomizationCategoryButton_C_Update_Is_New::Temp_byte_Variable' has a wrong offset!");
