#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationLibrary

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CustomizationLibrary.CustomizationLibrary_C.UpdateSkinAlbedo
// 0x00C0 (0x00C0 - 0x0000)
struct CustomizationLibrary_C_UpdateSkinAlbedo final
{
public:
	class USkeletalMeshComponent*                 Head;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         OtherBodyParts;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               SkinColor;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0050(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetMaterialSlotNames_ReturnValue;         // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceConstant*              K2Node_DynamicCast_AsMaterial_Instance_Constant;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0xC];                                       // 0x00A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               K2Node_MakeStruct_Vector4;                         // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationLibrary_C_UpdateSkinAlbedo) == 0x000010, "Wrong alignment on CustomizationLibrary_C_UpdateSkinAlbedo");
static_assert(sizeof(CustomizationLibrary_C_UpdateSkinAlbedo) == 0x0000C0, "Wrong size on CustomizationLibrary_C_UpdateSkinAlbedo");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, Head) == 0x000000, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::Head' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, OtherBodyParts) == 0x000008, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::OtherBodyParts' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, __WorldContext) == 0x000018, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::__WorldContext' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, SkinColor) == 0x000020, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::SkinColor' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, Temp_int_Array_Index_Variable) == 0x000034, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, CallFunc_Array_Get_Item) == 0x000040, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, Temp_name_Variable) == 0x000050, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000058, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, CallFunc_GetMaterialSlotNames_ReturnValue) == 0x000060, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::CallFunc_GetMaterialSlotNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, CallFunc_Array_Find_ReturnValue) == 0x000070, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, CallFunc_GetMaterial_ReturnValue) == 0x000078, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000080, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, K2Node_DynamicCast_AsMaterial_Instance_Constant) == 0x000088, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::K2Node_DynamicCast_AsMaterial_Instance_Constant' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x000094, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_UpdateSkinAlbedo, K2Node_MakeStruct_Vector4) == 0x0000B0, "Member 'CustomizationLibrary_C_UpdateSkinAlbedo::K2Node_MakeStruct_Vector4' has a wrong offset!");

// Function CustomizationLibrary.CustomizationLibrary_C.AssignCustomAnimBPOrSetMasterPose
// 0x0048 (0x0048 - 0x0000)
struct CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose final
{
public:
	class USkeletalMeshComponent*                 Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          Mesh;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MasterPoseFallback;                                // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetParentComponents_Parents;              // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose) == 0x000008, "Wrong alignment on CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose");
static_assert(sizeof(CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose) == 0x000048, "Wrong size on CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose");
static_assert(offsetof(CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose, Component) == 0x000000, "Member 'CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose::Component' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose, Mesh) == 0x000008, "Member 'CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose::Mesh' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose, MasterPoseFallback) == 0x000010, "Member 'CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose::MasterPoseFallback' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose, __WorldContext) == 0x000018, "Member 'CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose::__WorldContext' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose, CallFunc_GetParentComponents_Parents) == 0x000020, "Member 'CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose::CallFunc_GetParentComponents_Parents' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose, CallFunc_Array_Get_Item) == 0x000030, "Member 'CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000038, "Member 'CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose, CallFunc_IsValidClass_ReturnValue) == 0x000041, "Member 'CustomizationLibrary_C_AssignCustomAnimBPOrSetMasterPose::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function CustomizationLibrary.CustomizationLibrary_C.HandleGamepadCharacterRotationInput
// 0x02F8 (0x02F8 - 0x0000)
struct CustomizationLibrary_C_HandleGamepadCharacterRotationInput final
{
public:
	struct FAnalogInputEvent                      Analog_Input;                                      // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            ReturnValue;                                       // 0x0048(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
	float                                         CallFunc_GetAnalogValue_ReturnValue;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue; // 0x01C0(0x0038)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x01F8(0x00B8)()
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x02B0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuWidget*                          CallFunc_BP_GetCurrentPage_ReturnValue;            // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationMenu_C*                   K2Node_DynamicCast_AsCustomization_Menu;           // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput) == 0x000008, "Wrong alignment on CustomizationLibrary_C_HandleGamepadCharacterRotationInput");
static_assert(sizeof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput) == 0x0002F8, "Wrong size on CustomizationLibrary_C_HandleGamepadCharacterRotationInput");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, Analog_Input) == 0x000000, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::Analog_Input' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, __WorldContext) == 0x000040, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::__WorldContext' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, ReturnValue) == 0x000048, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, CallFunc_GetAnalogValue_ReturnValue) == 0x0001B8, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::CallFunc_GetAnalogValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue) == 0x0001C0, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::CallFunc_GetKeyEventFromAnalogInputEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, CallFunc_Unhandled_ReturnValue) == 0x0001F8, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, CallFunc_GetKey_ReturnValue) == 0x0002B0, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x0002C8, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x0002C9, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, CallFunc_GetMenuManager_ReturnValue) == 0x0002D0, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, CallFunc_BP_GetCurrentPage_ReturnValue) == 0x0002D8, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::CallFunc_BP_GetCurrentPage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, CallFunc_BooleanOR_ReturnValue) == 0x0002E0, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, K2Node_DynamicCast_AsCustomization_Menu) == 0x0002E8, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::K2Node_DynamicCast_AsCustomization_Menu' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_HandleGamepadCharacterRotationInput, K2Node_DynamicCast_bSuccess) == 0x0002F0, "Member 'CustomizationLibrary_C_HandleGamepadCharacterRotationInput::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CustomizationLibrary.CustomizationLibrary_C.GetClosestMenuCharacter
// 0x0090 (0x0090 - 0x0000)
struct CustomizationLibrary_C_GetClosestMenuCharacter final
{
public:
	struct FVector                                ActorLocation;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMenuCharacter_C*                       MenuCharacter;                                     // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 Distances;                                         // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class AMenuCharacter_C*>               Viewers;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AMenuCharacter_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMenuCharacter_C*                       CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MinOfFloatArray_IndexOfMinValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MinOfFloatArray_MinValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMenuCharacter_C*                       CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationLibrary_C_GetClosestMenuCharacter) == 0x000008, "Wrong alignment on CustomizationLibrary_C_GetClosestMenuCharacter");
static_assert(sizeof(CustomizationLibrary_C_GetClosestMenuCharacter) == 0x000090, "Wrong size on CustomizationLibrary_C_GetClosestMenuCharacter");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, ActorLocation) == 0x000000, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::ActorLocation' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, __WorldContext) == 0x000010, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::__WorldContext' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, MenuCharacter) == 0x000018, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::MenuCharacter' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, Distances) == 0x000020, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::Distances' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, Viewers) == 0x000030, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::Viewers' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, CallFunc_GetAllActorsOfClass_OutActors) == 0x000040, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, Temp_int_Array_Index_Variable) == 0x000050, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, CallFunc_Array_Get_Item) == 0x000058, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000064, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, CallFunc_Vector_Distance_ReturnValue) == 0x000078, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, CallFunc_MinOfFloatArray_IndexOfMinValue) == 0x00007C, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::CallFunc_MinOfFloatArray_IndexOfMinValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, CallFunc_MinOfFloatArray_MinValue) == 0x000080, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::CallFunc_MinOfFloatArray_MinValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, CallFunc_Array_Add_ReturnValue) == 0x000084, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationLibrary_C_GetClosestMenuCharacter, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'CustomizationLibrary_C_GetClosestMenuCharacter::CallFunc_Array_Get_Item_1' has a wrong offset!");

}

