#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationInteractionWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CustomizationInteractionWidget.CustomizationInteractionWidget_C.ExecuteUbergraph_CustomizationInteractionWidget
// 0x0008 (0x0008 - 0x0000)
struct CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget) == 0x000004, "Wrong alignment on CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget");
static_assert(sizeof(CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget) == 0x000008, "Wrong size on CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget");
static_assert(offsetof(CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget, EntryPoint) == 0x000000, "Member 'CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'CustomizationInteractionWidget_C_ExecuteUbergraph_CustomizationInteractionWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function CustomizationInteractionWidget.CustomizationInteractionWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CustomizationInteractionWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomizationInteractionWidget_C_PreConstruct) == 0x000001, "Wrong alignment on CustomizationInteractionWidget_C_PreConstruct");
static_assert(sizeof(CustomizationInteractionWidget_C_PreConstruct) == 0x000001, "Wrong size on CustomizationInteractionWidget_C_PreConstruct");
static_assert(offsetof(CustomizationInteractionWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CustomizationInteractionWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CustomizationInteractionWidget.CustomizationInteractionWidget_C.InitWithOption
// 0x0010 (0x0010 - 0x0000)
struct CustomizationInteractionWidget_C_InitWithOption final
{
public:
	class URBPlayerCustomizationOption*           Option;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECustomizationInteractionType                 InteractionType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationInteractionWidget_C_InitWithOption) == 0x000008, "Wrong alignment on CustomizationInteractionWidget_C_InitWithOption");
static_assert(sizeof(CustomizationInteractionWidget_C_InitWithOption) == 0x000010, "Wrong size on CustomizationInteractionWidget_C_InitWithOption");
static_assert(offsetof(CustomizationInteractionWidget_C_InitWithOption, Option) == 0x000000, "Member 'CustomizationInteractionWidget_C_InitWithOption::Option' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_InitWithOption, InteractionType) == 0x000008, "Member 'CustomizationInteractionWidget_C_InitWithOption::InteractionType' has a wrong offset!");

// Function CustomizationInteractionWidget.CustomizationInteractionWidget_C.UpdateInteractionType
// 0x00C0 (0x00C0 - 0x0000)
struct CustomizationInteractionWidget_C_UpdateInteractionType final
{
public:
	ECustomizationInteractionType                 InteractionType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasHoldAction;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DisplayNegativeFeedback;                           // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RestrictionText;                                   // 0x0008(0x0018)(Edit, BlueprintVisible)
	bool                                          HasAction;                                         // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ActionText;                                        // 0x0028(0x0018)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0048(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0070(0x0028)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0098(0x0028)()
};
static_assert(alignof(CustomizationInteractionWidget_C_UpdateInteractionType) == 0x000008, "Wrong alignment on CustomizationInteractionWidget_C_UpdateInteractionType");
static_assert(sizeof(CustomizationInteractionWidget_C_UpdateInteractionType) == 0x0000C0, "Wrong size on CustomizationInteractionWidget_C_UpdateInteractionType");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, InteractionType) == 0x000000, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::InteractionType' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, HasHoldAction) == 0x000001, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::HasHoldAction' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, DisplayNegativeFeedback) == 0x000002, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::DisplayNegativeFeedback' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, RestrictionText) == 0x000008, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::RestrictionText' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, HasAction) == 0x000020, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::HasAction' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, ActionText) == 0x000028, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::ActionText' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, Temp_bool_Variable) == 0x000040, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, K2Node_SwitchEnum_CmpSuccess) == 0x000041, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, CallFunc_TextIsEmpty_ReturnValue) == 0x000042, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, K2Node_MakeStruct_SlateColor) == 0x000048, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, K2Node_MakeStruct_SlateColor_1) == 0x000070, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateInteractionType, K2Node_Select_Default) == 0x000098, "Member 'CustomizationInteractionWidget_C_UpdateInteractionType::K2Node_Select_Default' has a wrong offset!");

// Function CustomizationInteractionWidget.CustomizationInteractionWidget_C.Initialize
// 0x0060 (0x0060 - 0x0000)
struct CustomizationInteractionWidget_C_Initialize final
{
public:
	struct FUICustomizationItem                   Item;                                              // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class URBCustomizationOption*                 CallFunc_GetValidCustomizationOption_ReturnValue;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomizationInteractionWidget_C_Initialize) == 0x000008, "Wrong alignment on CustomizationInteractionWidget_C_Initialize");
static_assert(sizeof(CustomizationInteractionWidget_C_Initialize) == 0x000060, "Wrong size on CustomizationInteractionWidget_C_Initialize");
static_assert(offsetof(CustomizationInteractionWidget_C_Initialize, Item) == 0x000000, "Member 'CustomizationInteractionWidget_C_Initialize::Item' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_Initialize, CallFunc_GetValidCustomizationOption_ReturnValue) == 0x000058, "Member 'CustomizationInteractionWidget_C_Initialize::CallFunc_GetValidCustomizationOption_ReturnValue' has a wrong offset!");

// Function CustomizationInteractionWidget.CustomizationInteractionWidget_C.UpdateDevText
// 0x0338 (0x0338 - 0x0000)
struct CustomizationInteractionWidget_C_UpdateDevText final
{
public:
	class URBCustomizationOption*                 Option;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0088(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0040)(HasGetValueTypeHash)
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBItemProgressionData                 CallFunc_GetItemProgressionData_ReturnValue;       // 0x00E8(0x0170)(ConstParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0258(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0270(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0288(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x02C8(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_CheckFeatureSwitch_ReturnValue;           // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0310(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0320(0x0018)()
};
static_assert(alignof(CustomizationInteractionWidget_C_UpdateDevText) == 0x000008, "Wrong alignment on CustomizationInteractionWidget_C_UpdateDevText");
static_assert(sizeof(CustomizationInteractionWidget_C_UpdateDevText) == 0x000338, "Wrong size on CustomizationInteractionWidget_C_UpdateDevText");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, Option) == 0x000000, "Member 'CustomizationInteractionWidget_C_UpdateDevText::Option' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_GetPathName_ReturnValue) == 0x000010, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'CustomizationInteractionWidget_C_UpdateDevText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000088, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'CustomizationInteractionWidget_C_UpdateDevText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x0000E0, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_GetItemProgressionData_ReturnValue) == 0x0000E8, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_GetItemProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000258, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000270, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, K2Node_MakeStruct_FormatArgumentData_2) == 0x000288, "Member 'CustomizationInteractionWidget_C_UpdateDevText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, K2Node_MakeStruct_FormatArgumentData_3) == 0x0002C8, "Member 'CustomizationInteractionWidget_C_UpdateDevText::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_CheckFeatureSwitch_ReturnValue) == 0x000308, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_CheckFeatureSwitch_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, K2Node_MakeArray_Array) == 0x000310, "Member 'CustomizationInteractionWidget_C_UpdateDevText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CustomizationInteractionWidget_C_UpdateDevText, CallFunc_Format_ReturnValue) == 0x000320, "Member 'CustomizationInteractionWidget_C_UpdateDevText::CallFunc_Format_ReturnValue' has a wrong offset!");

}

