#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizationMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CustomizationMenu.CustomizationMenu_C
// 0x0100 (0x0410 - 0x0310)
class UCustomizationMenu_C final : public URBCharacterCustomizationMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CellTitle;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CharacterTitle;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CustoDescription;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CustoDetails;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CustomizationCategoriesButtons;                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryButton_C*         CustomizationCategoryButton_Appearance;            // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryButton_C*         CustomizationCategoryButton_Behaviour;             // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationCategoryButton_C*         CustomizationCategoryButton_Identification;        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizationColorPalette_C*           CustomizationColorPalette;                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CustomizationContentVBox;                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         CustoName;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CustoRarity;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             EmptyText;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBMenuButton_C*                        ExitButton;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InputBlocker;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULocalPlayerInfo_v2_C*                  LocalPlayerInfo_v2;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PageSpecificButtonContainer;                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Rotate_Button;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScanlinesBackground;                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TutorialFocusAnchor;                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TutorialPopupAnchor;                               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TutorialText;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AMenuCharacter_C*                       MenuCharacter;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCellCustomization;                              // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPendingTutorialRequest;                           // 0x03D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2[0x6];                                      // 0x03D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACellCustomizationCameraActor_C*        CellCustomizationActor;                            // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USimpleActionTooltip_C*                 RotateToolTip;                                     // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotateFactorX;                                     // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotateFactorY;                                     // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           GamepadNav_RotateTimerHandle;                      // 0x03F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCustomizationOptionThumbnail_C*        HairHovered;                                       // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTutorial;                                       // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsRelease;                                        // 0x0401(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShownReleaseTutorial;                             // 0x0402(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPreviewingPlayerIcon;                             // 0x0403(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPreviewingPlayerIconBorder;                       // 0x0404(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ECustomizationCategory                        DesiredCustomizationCategory;                      // 0x0405(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_406[0x2];                                      // 0x0406(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizationContentWidget_V2_C*       Customization_Content_Widget_V2;                   // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CustomizationMenu(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__CustomizationMenu_CustomizationCategoryButton_Identification_K2Node_ComponentBoundEvent_10_OnCustomizationCategoryClicked__DelegateSignature(ECustomizationCategory Category);
	void BndEvt__CustomizationMenu_CustomizationCategoryButton_Behaviour_K2Node_ComponentBoundEvent_9_OnCustomizationCategoryClicked__DelegateSignature(ECustomizationCategory Category);
	void BndEvt__CustomizationMenu_CustomizationCategoryButton_Appearance_K2Node_ComponentBoundEvent_7_OnCustomizationCategoryClicked__DelegateSignature(ECustomizationCategory Category);
	void Event_OnPop();
	void SetGamepadRotateY(float FactorY);
	void SetGamepadRotateX(float FactorX);
	void BndEvt__CustomizationMenu_CustomizationContent_K2Node_ComponentBoundEvent_1_OnItemsAdded__DelegateSignature(int32 Amount);
	void SetupPostRelease();
	void Event_MenuCancel_Pressed();
	void Event_SetupPostRelease();
	void Event_OnMenuTutorialSeen();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__CustomizationMenu_CustomizationContent_K2Node_ComponentBoundEvent_8_OnItemEquippedEvent__DelegateSignature(const struct FUICustomizationItem& Item);
	void Event_InputSourceChanged(bool bIsGamepad);
	void GamepadNav_ToggleHairPalette();
	void OnCategoryChangeRequested();
	void GamepadNav_StopRotation();
	void GamepadNav_StartRotation();
	void GamepadNav_RotateCharacter();
	void BndEvt__CustomizationMenu_Rotate_Button_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__CustomizationMenu_Rotate_Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void OnHairColorHovered(const struct FRBHairColorOption& HoveredHairColor);
	void HairColorClicked(const struct FRBHairColorOption& NewHairColor);
	void UpdatePaletteDisplay(bool ShouldShowPalette);
	void OnStoppedPreview(class URBPlayerIconCustomizationOption* CustoItem);
	void OnItemPreviewed(const struct FUICustomizationItem& CustoItem);
	void Construct();
	void Destruct();
	void Initialize(bool IsTutorial, bool bIsCellCusto, class AMenuCharacter_C* MenuCharacter_0, class ACellCustomizationCameraActor_C* CellCustomization);
	void BndEvt__Rotate_Button_K2Node_ComponentBoundEvent_3_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__Rotate_Button_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ExitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class URBMenuButton_C* Button);
	void Finished_8F8B738F47CD503F2D73DF9B0F551F7F();
	void UpdateNavigation(bool CanExitMenu);
	void SetupForTutorial();
	void SetupForCellCustomization(bool bNewIsCellCustomization);
	void UpdateCustoDetails(const struct FUICustomizationItem& Custo_Item);
	void PreviewCosts(const struct FUICustomizationItem& Custo_Item);
	void CreateRotateTooltip();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void TransmitFocusToCustoContent();
	void GamepadNav_TryToggleHairPalette();
	void UpdatePageSpecificButtons();
	void UpdateListScrollBehaviour(bool Index_0);
	void UpdateFTUESpecificElements();
	void TryStartNextMenuTutorial();
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void StopPreview(class URBPlayerIconCustomizationOption* EquippedPlayerIcon);
	void GetCustomizationContentWidget(class UCustomizationContentWidget_V2_C** CustomizationContent_0);
	void TransmitFocusToCategoriesButtons();
	void UpdateNavigationText();
	bool CanRotate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomizationMenu_C">();
	}
	static class UCustomizationMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizationMenu_C>();
	}
};
static_assert(alignof(UCustomizationMenu_C) == 0x000008, "Wrong alignment on UCustomizationMenu_C");
static_assert(sizeof(UCustomizationMenu_C) == 0x000410, "Wrong size on UCustomizationMenu_C");
static_assert(offsetof(UCustomizationMenu_C, UberGraphFrame) == 0x000310, "Member 'UCustomizationMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CellTitle) == 0x000318, "Member 'UCustomizationMenu_C::CellTitle' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CharacterTitle) == 0x000320, "Member 'UCustomizationMenu_C::CharacterTitle' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustoDescription) == 0x000328, "Member 'UCustomizationMenu_C::CustoDescription' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustoDetails) == 0x000330, "Member 'UCustomizationMenu_C::CustoDetails' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustomizationCategoriesButtons) == 0x000338, "Member 'UCustomizationMenu_C::CustomizationCategoriesButtons' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustomizationCategoryButton_Appearance) == 0x000340, "Member 'UCustomizationMenu_C::CustomizationCategoryButton_Appearance' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustomizationCategoryButton_Behaviour) == 0x000348, "Member 'UCustomizationMenu_C::CustomizationCategoryButton_Behaviour' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustomizationCategoryButton_Identification) == 0x000350, "Member 'UCustomizationMenu_C::CustomizationCategoryButton_Identification' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustomizationColorPalette) == 0x000358, "Member 'UCustomizationMenu_C::CustomizationColorPalette' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustomizationContentVBox) == 0x000360, "Member 'UCustomizationMenu_C::CustomizationContentVBox' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustoName) == 0x000368, "Member 'UCustomizationMenu_C::CustoName' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CustoRarity) == 0x000370, "Member 'UCustomizationMenu_C::CustoRarity' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, EmptyText) == 0x000378, "Member 'UCustomizationMenu_C::EmptyText' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, ExitButton) == 0x000380, "Member 'UCustomizationMenu_C::ExitButton' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, InputBlocker) == 0x000388, "Member 'UCustomizationMenu_C::InputBlocker' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, LocalPlayerInfo_v2) == 0x000390, "Member 'UCustomizationMenu_C::LocalPlayerInfo_v2' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, PageSpecificButtonContainer) == 0x000398, "Member 'UCustomizationMenu_C::PageSpecificButtonContainer' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, Rotate_Button) == 0x0003A0, "Member 'UCustomizationMenu_C::Rotate_Button' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, ScanlinesBackground) == 0x0003A8, "Member 'UCustomizationMenu_C::ScanlinesBackground' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, TutorialFocusAnchor) == 0x0003B0, "Member 'UCustomizationMenu_C::TutorialFocusAnchor' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, TutorialPopupAnchor) == 0x0003B8, "Member 'UCustomizationMenu_C::TutorialPopupAnchor' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, TutorialText) == 0x0003C0, "Member 'UCustomizationMenu_C::TutorialText' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, MenuCharacter) == 0x0003C8, "Member 'UCustomizationMenu_C::MenuCharacter' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, bIsCellCustomization) == 0x0003D0, "Member 'UCustomizationMenu_C::bIsCellCustomization' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, bPendingTutorialRequest) == 0x0003D1, "Member 'UCustomizationMenu_C::bPendingTutorialRequest' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, CellCustomizationActor) == 0x0003D8, "Member 'UCustomizationMenu_C::CellCustomizationActor' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, RotateToolTip) == 0x0003E0, "Member 'UCustomizationMenu_C::RotateToolTip' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, RotateFactorX) == 0x0003E8, "Member 'UCustomizationMenu_C::RotateFactorX' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, RotateFactorY) == 0x0003EC, "Member 'UCustomizationMenu_C::RotateFactorY' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, GamepadNav_RotateTimerHandle) == 0x0003F0, "Member 'UCustomizationMenu_C::GamepadNav_RotateTimerHandle' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, HairHovered) == 0x0003F8, "Member 'UCustomizationMenu_C::HairHovered' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, bIsTutorial) == 0x000400, "Member 'UCustomizationMenu_C::bIsTutorial' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, bIsRelease) == 0x000401, "Member 'UCustomizationMenu_C::bIsRelease' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, bShownReleaseTutorial) == 0x000402, "Member 'UCustomizationMenu_C::bShownReleaseTutorial' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, bPreviewingPlayerIcon) == 0x000403, "Member 'UCustomizationMenu_C::bPreviewingPlayerIcon' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, bPreviewingPlayerIconBorder) == 0x000404, "Member 'UCustomizationMenu_C::bPreviewingPlayerIconBorder' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, DesiredCustomizationCategory) == 0x000405, "Member 'UCustomizationMenu_C::DesiredCustomizationCategory' has a wrong offset!");
static_assert(offsetof(UCustomizationMenu_C, Customization_Content_Widget_V2) == 0x000408, "Member 'UCustomizationMenu_C::Customization_Content_Widget_V2' has a wrong offset!");

}

