#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadBody_KneelingMinus02

#include "Basic.hpp"

#include "DeadBodyBase_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DeadBody_Kneeling-02.DeadBody_Kneeling-02_C
// 0x0020 (0x0530 - 0x0510)
class ADeadBody_KneelingMinus02_C final : public ADeadBodyBase_BP_C
{
public:
	class UStaticMeshComponent*                   HandCuffsMinus02;                                  // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HandCuffsMinus04;                                  // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HandCuffsMinus01;                                  // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DeadBody_Kneeling-02_C">();
	}
	static class ADeadBody_KneelingMinus02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADeadBody_KneelingMinus02_C>();
	}
};
static_assert(alignof(ADeadBody_KneelingMinus02_C) == 0x000010, "Wrong alignment on ADeadBody_KneelingMinus02_C");
static_assert(sizeof(ADeadBody_KneelingMinus02_C) == 0x000530, "Wrong size on ADeadBody_KneelingMinus02_C");
static_assert(offsetof(ADeadBody_KneelingMinus02_C, HandCuffsMinus02) == 0x000510, "Member 'ADeadBody_KneelingMinus02_C::HandCuffsMinus02' has a wrong offset!");
static_assert(offsetof(ADeadBody_KneelingMinus02_C, HandCuffsMinus04) == 0x000518, "Member 'ADeadBody_KneelingMinus02_C::HandCuffsMinus04' has a wrong offset!");
static_assert(offsetof(ADeadBody_KneelingMinus02_C, HandCuffsMinus01) == 0x000520, "Member 'ADeadBody_KneelingMinus02_C::HandCuffsMinus01' has a wrong offset!");

}

