#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadBody_ImpaleMinus03_BP

#include "Basic.hpp"

#include "DeadBodyBase_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DeadBody_Impale-03_BP.DeadBody_Impale-03_BP_C
// 0x0050 (0x0560 - 0x0510)
class ADeadBody_ImpaleMinus03_BP_C final : public ADeadBodyBase_BP_C
{
public:
	class UDecalComponent*                        Decal3;                                            // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal2;                                            // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal1;                                            // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TorsoSkin_02;                                      // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Scaffolding200Minus01;                             // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BonesPelvise_low;                                  // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   OrganesMinus01;                                    // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RibsMinus01;                                       // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Deadbody_Explosed_TorsoMinus02;                    // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DeadBody_Impale-03_BP_C">();
	}
	static class ADeadBody_ImpaleMinus03_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADeadBody_ImpaleMinus03_BP_C>();
	}
};
static_assert(alignof(ADeadBody_ImpaleMinus03_BP_C) == 0x000010, "Wrong alignment on ADeadBody_ImpaleMinus03_BP_C");
static_assert(sizeof(ADeadBody_ImpaleMinus03_BP_C) == 0x000560, "Wrong size on ADeadBody_ImpaleMinus03_BP_C");
static_assert(offsetof(ADeadBody_ImpaleMinus03_BP_C, Decal3) == 0x000510, "Member 'ADeadBody_ImpaleMinus03_BP_C::Decal3' has a wrong offset!");
static_assert(offsetof(ADeadBody_ImpaleMinus03_BP_C, Decal2) == 0x000518, "Member 'ADeadBody_ImpaleMinus03_BP_C::Decal2' has a wrong offset!");
static_assert(offsetof(ADeadBody_ImpaleMinus03_BP_C, Decal1) == 0x000520, "Member 'ADeadBody_ImpaleMinus03_BP_C::Decal1' has a wrong offset!");
static_assert(offsetof(ADeadBody_ImpaleMinus03_BP_C, Decal) == 0x000528, "Member 'ADeadBody_ImpaleMinus03_BP_C::Decal' has a wrong offset!");
static_assert(offsetof(ADeadBody_ImpaleMinus03_BP_C, TorsoSkin_02) == 0x000530, "Member 'ADeadBody_ImpaleMinus03_BP_C::TorsoSkin_02' has a wrong offset!");
static_assert(offsetof(ADeadBody_ImpaleMinus03_BP_C, Scaffolding200Minus01) == 0x000538, "Member 'ADeadBody_ImpaleMinus03_BP_C::Scaffolding200Minus01' has a wrong offset!");
static_assert(offsetof(ADeadBody_ImpaleMinus03_BP_C, BonesPelvise_low) == 0x000540, "Member 'ADeadBody_ImpaleMinus03_BP_C::BonesPelvise_low' has a wrong offset!");
static_assert(offsetof(ADeadBody_ImpaleMinus03_BP_C, OrganesMinus01) == 0x000548, "Member 'ADeadBody_ImpaleMinus03_BP_C::OrganesMinus01' has a wrong offset!");
static_assert(offsetof(ADeadBody_ImpaleMinus03_BP_C, RibsMinus01) == 0x000550, "Member 'ADeadBody_ImpaleMinus03_BP_C::RibsMinus01' has a wrong offset!");
static_assert(offsetof(ADeadBody_ImpaleMinus03_BP_C, Deadbody_Explosed_TorsoMinus02) == 0x000558, "Member 'ADeadBody_ImpaleMinus03_BP_C::Deadbody_Explosed_TorsoMinus02' has a wrong offset!");

}

