#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadBody_SuspendedMinus02

#include "Basic.hpp"

#include "DeadBodyBase_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DeadBody_Suspended-02.DeadBody_Suspended-02_C
// 0x0050 (0x0560 - 0x0510)
class ADeadBody_SuspendedMinus02_C final : public ADeadBodyBase_BP_C
{
public:
	class UBoxComponent*                          CustomCollisionsBox1;                              // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HandCuffsMinus07;                                  // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HandCuffsMinus06;                                  // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HandCuffsMinus08;                                  // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HandCuffsMinus05;                                  // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HandCuffsMinus03;                                  // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HandCuffsMinus02;                                  // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HandCuffsMinus04;                                  // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HandCuffsMinus01;                                  // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DeadBody_Suspended-02_C">();
	}
	static class ADeadBody_SuspendedMinus02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADeadBody_SuspendedMinus02_C>();
	}
};
static_assert(alignof(ADeadBody_SuspendedMinus02_C) == 0x000010, "Wrong alignment on ADeadBody_SuspendedMinus02_C");
static_assert(sizeof(ADeadBody_SuspendedMinus02_C) == 0x000560, "Wrong size on ADeadBody_SuspendedMinus02_C");
static_assert(offsetof(ADeadBody_SuspendedMinus02_C, CustomCollisionsBox1) == 0x000510, "Member 'ADeadBody_SuspendedMinus02_C::CustomCollisionsBox1' has a wrong offset!");
static_assert(offsetof(ADeadBody_SuspendedMinus02_C, HandCuffsMinus07) == 0x000518, "Member 'ADeadBody_SuspendedMinus02_C::HandCuffsMinus07' has a wrong offset!");
static_assert(offsetof(ADeadBody_SuspendedMinus02_C, HandCuffsMinus06) == 0x000520, "Member 'ADeadBody_SuspendedMinus02_C::HandCuffsMinus06' has a wrong offset!");
static_assert(offsetof(ADeadBody_SuspendedMinus02_C, HandCuffsMinus08) == 0x000528, "Member 'ADeadBody_SuspendedMinus02_C::HandCuffsMinus08' has a wrong offset!");
static_assert(offsetof(ADeadBody_SuspendedMinus02_C, HandCuffsMinus05) == 0x000530, "Member 'ADeadBody_SuspendedMinus02_C::HandCuffsMinus05' has a wrong offset!");
static_assert(offsetof(ADeadBody_SuspendedMinus02_C, HandCuffsMinus03) == 0x000538, "Member 'ADeadBody_SuspendedMinus02_C::HandCuffsMinus03' has a wrong offset!");
static_assert(offsetof(ADeadBody_SuspendedMinus02_C, HandCuffsMinus02) == 0x000540, "Member 'ADeadBody_SuspendedMinus02_C::HandCuffsMinus02' has a wrong offset!");
static_assert(offsetof(ADeadBody_SuspendedMinus02_C, HandCuffsMinus04) == 0x000548, "Member 'ADeadBody_SuspendedMinus02_C::HandCuffsMinus04' has a wrong offset!");
static_assert(offsetof(ADeadBody_SuspendedMinus02_C, HandCuffsMinus01) == 0x000550, "Member 'ADeadBody_SuspendedMinus02_C::HandCuffsMinus01' has a wrong offset!");

}

