#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadBodyBase_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DeadBodyBase_BP.DeadBodyBase_BP_C
// 0x00F0 (0x0510 - 0x0420)
class ADeadBodyBase_BP_C : public ARBTriggerable
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          CustomCollisionsBox;                               // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CollisionSceneRoot;                                // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Legs_L;                                            // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Legs_R;                                            // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 LowerBody;                                         // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Arms_L;                                            // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Arms_R;                                            // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 UpperBody;                                         // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head;                                              // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Hair;                                              // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Sequence;                                          // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset;                                            // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasHair;                                          // 0x0494(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bForceBakeShadows;                                 // 0x0495(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_496[0x2];                                      // 0x0496(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 FullBody_Config;                                   // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 HeadConfig;                                        // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 HairConfig;                                        // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 UpperBodyConfig;                                   // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LowerBodyConfig;                                   // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LegsConfig;                                        // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ArmsConfig;                                        // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         BodyParts;                                         // 0x04D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          bCollisionsEnabled;                                // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SkinColor;                                         // 0x04E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           BodyPartNames;                                     // 0x04F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bAutoActivate;                                     // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool OnWorldPopulateFinishedTimeSliced();
	bool FixUp();
	void ApplySkinColorOverride();
	void Dress();
	void SetupCollisions();
	void SetCommonParameters(TArray<class USkeletalMeshComponent*>& Skelmeshes);
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void TickSelected();
	void PostEditMove(bool bFinished);
	void PostEditChange(const class FName& PropertyName);
	void PostDuplicated(class AActor* DuplicationParent);
	void PostAddedToLevel();
	void OnWorldFullyLoaded();
	void OnWorldPopulateFinished();
	void OnEditorPostLoad();
	void OnPostActorsPasted(const TArray<class AActor*>& PastedActors);
	void ExecuteUbergraph_DeadBodyBase_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DeadBodyBase_BP_C">();
	}
	static class ADeadBodyBase_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADeadBodyBase_BP_C>();
	}
};
static_assert(alignof(ADeadBodyBase_BP_C) == 0x000010, "Wrong alignment on ADeadBodyBase_BP_C");
static_assert(sizeof(ADeadBodyBase_BP_C) == 0x000510, "Wrong size on ADeadBodyBase_BP_C");
static_assert(offsetof(ADeadBodyBase_BP_C, UberGraphFrame) == 0x000420, "Member 'ADeadBodyBase_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, CustomCollisionsBox) == 0x000428, "Member 'ADeadBodyBase_BP_C::CustomCollisionsBox' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, CollisionSceneRoot) == 0x000430, "Member 'ADeadBodyBase_BP_C::CollisionSceneRoot' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, Legs_L) == 0x000438, "Member 'ADeadBodyBase_BP_C::Legs_L' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, Legs_R) == 0x000440, "Member 'ADeadBodyBase_BP_C::Legs_R' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, LowerBody) == 0x000448, "Member 'ADeadBodyBase_BP_C::LowerBody' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, Arms_L) == 0x000450, "Member 'ADeadBodyBase_BP_C::Arms_L' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, Arms_R) == 0x000458, "Member 'ADeadBodyBase_BP_C::Arms_R' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, UpperBody) == 0x000460, "Member 'ADeadBodyBase_BP_C::UpperBody' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, Head) == 0x000468, "Member 'ADeadBodyBase_BP_C::Head' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, Hair) == 0x000470, "Member 'ADeadBodyBase_BP_C::Hair' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, Mesh) == 0x000478, "Member 'ADeadBodyBase_BP_C::Mesh' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, DefaultSceneRoot) == 0x000480, "Member 'ADeadBodyBase_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, Sequence) == 0x000488, "Member 'ADeadBodyBase_BP_C::Sequence' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, Offset) == 0x000490, "Member 'ADeadBodyBase_BP_C::Offset' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, bHasHair) == 0x000494, "Member 'ADeadBodyBase_BP_C::bHasHair' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, bForceBakeShadows) == 0x000495, "Member 'ADeadBodyBase_BP_C::bForceBakeShadows' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, FullBody_Config) == 0x000498, "Member 'ADeadBodyBase_BP_C::FullBody_Config' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, HeadConfig) == 0x0004A0, "Member 'ADeadBodyBase_BP_C::HeadConfig' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, HairConfig) == 0x0004A8, "Member 'ADeadBodyBase_BP_C::HairConfig' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, UpperBodyConfig) == 0x0004B0, "Member 'ADeadBodyBase_BP_C::UpperBodyConfig' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, LowerBodyConfig) == 0x0004B8, "Member 'ADeadBodyBase_BP_C::LowerBodyConfig' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, LegsConfig) == 0x0004C0, "Member 'ADeadBodyBase_BP_C::LegsConfig' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, ArmsConfig) == 0x0004C8, "Member 'ADeadBodyBase_BP_C::ArmsConfig' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, BodyParts) == 0x0004D0, "Member 'ADeadBodyBase_BP_C::BodyParts' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, bCollisionsEnabled) == 0x0004E0, "Member 'ADeadBodyBase_BP_C::bCollisionsEnabled' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, SkinColor) == 0x0004E4, "Member 'ADeadBodyBase_BP_C::SkinColor' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, BodyPartNames) == 0x0004F8, "Member 'ADeadBodyBase_BP_C::BodyPartNames' has a wrong offset!");
static_assert(offsetof(ADeadBodyBase_BP_C, bAutoActivate) == 0x000508, "Member 'ADeadBodyBase_BP_C::bAutoActivate' has a wrong offset!");

}

