#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DebugMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DebugMenu.DebugMenu_C
// 0x0150 (0x0458 - 0x0308)
class UDebugMenu_C final : public URBMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxString*                        ActiveSkillsCombo;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BackBtn;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CustomizationBTN;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_99;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MatchSettingsMenuBTN;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MetaMenuBTN;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ReleaseMenuBtn;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                StoreMenuBtn;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<EActiveSkillType>                      ValidSkills;                                       // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             Text;                                              // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   DebugMetaMenu;                                     // 0x0368(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Customization_Menu;                                // 0x0390(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   ReleaseMenu;                                       // 0x03B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Matchmaking_Menu;                                  // 0x03E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   PartyFindMenu;                                     // 0x0408(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   StoreMenu;                                         // 0x0430(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DebugMenu(int32 EntryPoint);
	void BndEvt__DebugMenu_StoreMenuBtn_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__DebugMenu_CustomizationBTN_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void LoadAndPushMenu(TSoftClassPtr<class UClass> MenuClass);
	void BndEvt__ReleaseMenuBtn_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MatchSettingsMenuBTN_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UpgradeMenuBTN_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ActiveSkillsCombo_K2Node_ComponentBoundEvent_1_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void InitActiveSkillBox();
	ECheckBoxState CheckUseMinimalInventory();
	ESlateVisibility GetLobbyVisibility();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DebugMenu_C">();
	}
	static class UDebugMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDebugMenu_C>();
	}
};
static_assert(alignof(UDebugMenu_C) == 0x000008, "Wrong alignment on UDebugMenu_C");
static_assert(sizeof(UDebugMenu_C) == 0x000458, "Wrong size on UDebugMenu_C");
static_assert(offsetof(UDebugMenu_C, UberGraphFrame) == 0x000308, "Member 'UDebugMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, ActiveSkillsCombo) == 0x000310, "Member 'UDebugMenu_C::ActiveSkillsCombo' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, BackBtn) == 0x000318, "Member 'UDebugMenu_C::BackBtn' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, CustomizationBTN) == 0x000320, "Member 'UDebugMenu_C::CustomizationBTN' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, Image_99) == 0x000328, "Member 'UDebugMenu_C::Image_99' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, MatchSettingsMenuBTN) == 0x000330, "Member 'UDebugMenu_C::MatchSettingsMenuBTN' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, MetaMenuBTN) == 0x000338, "Member 'UDebugMenu_C::MetaMenuBTN' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, ReleaseMenuBtn) == 0x000340, "Member 'UDebugMenu_C::ReleaseMenuBtn' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, StoreMenuBtn) == 0x000348, "Member 'UDebugMenu_C::StoreMenuBtn' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, ValidSkills) == 0x000350, "Member 'UDebugMenu_C::ValidSkills' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, Text) == 0x000360, "Member 'UDebugMenu_C::Text' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, DebugMetaMenu) == 0x000368, "Member 'UDebugMenu_C::DebugMetaMenu' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, Customization_Menu) == 0x000390, "Member 'UDebugMenu_C::Customization_Menu' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, ReleaseMenu) == 0x0003B8, "Member 'UDebugMenu_C::ReleaseMenu' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, Matchmaking_Menu) == 0x0003E0, "Member 'UDebugMenu_C::Matchmaking_Menu' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, PartyFindMenu) == 0x000408, "Member 'UDebugMenu_C::PartyFindMenu' has a wrong offset!");
static_assert(offsetof(UDebugMenu_C, StoreMenu) == 0x000430, "Member 'UDebugMenu_C::StoreMenu' has a wrong offset!");

}

