#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Default_NightVision_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Default_NightVision_AnimBP.Default_NightVision_AnimBP_C.ExecuteUbergraph_Default_NightVision_AnimBP
// 0x0038 (0x0038 - 0x0000)
struct Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer_BP_C*                         K2Node_DynamicCast_AsRB_Player_BP;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsNVOn_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP) == 0x000008, "Wrong alignment on Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP");
static_assert(sizeof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP) == 0x000038, "Wrong size on Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP");
static_assert(offsetof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP, EntryPoint) == 0x000000, "Member 'Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP, K2Node_DynamicCast_AsRB_Player_BP) == 0x000010, "Member 'Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP::K2Node_DynamicCast_AsRB_Player_BP' has a wrong offset!");
static_assert(offsetof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP, CallFunc_BP_IsNVOn_ReturnValue) == 0x00001A, "Member 'Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP::CallFunc_BP_IsNVOn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x00001B, "Member 'Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00001C, "Member 'Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000020, "Member 'Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP, CallFunc_FInterpTo_ReturnValue) == 0x000024, "Member 'Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000028, "Member 'Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP, K2Node_Event_DeltaTimeX) == 0x00002C, "Member 'Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP, CallFunc_FInterpTo_ReturnValue_1) == 0x000030, "Member 'Default_NightVision_AnimBP_C_ExecuteUbergraph_Default_NightVision_AnimBP::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");

// Function Default_NightVision_AnimBP.Default_NightVision_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Default_NightVision_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Default_NightVision_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Default_NightVision_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Default_NightVision_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Default_NightVision_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Default_NightVision_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Default_NightVision_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Default_NightVision_AnimBP.Default_NightVision_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Default_NightVision_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Default_NightVision_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Default_NightVision_AnimBP_C_AnimGraph");
static_assert(sizeof(Default_NightVision_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Default_NightVision_AnimBP_C_AnimGraph");
static_assert(offsetof(Default_NightVision_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Default_NightVision_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

