#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Destructible_DoorBase_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Destructible_DoorBase_BP.Destructible_DoorBase_BP_C.ExecuteUbergraph_Destructible_DoorBase_BP
// 0x0020 (0x0020 - 0x0000)
struct Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBActorPrevisComponent*                K2Node_ComponentBoundEvent_actorPrevis;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_runtimeChildActor;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bToggleEnabled;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP) == 0x000008, "Wrong alignment on Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP");
static_assert(sizeof(Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP) == 0x000020, "Wrong size on Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP");
static_assert(offsetof(Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP, EntryPoint) == 0x000000, "Member 'Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP, K2Node_ComponentBoundEvent_actorPrevis) == 0x000008, "Member 'Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP::K2Node_ComponentBoundEvent_actorPrevis' has a wrong offset!");
static_assert(offsetof(Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP, K2Node_ComponentBoundEvent_runtimeChildActor) == 0x000010, "Member 'Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP::K2Node_ComponentBoundEvent_runtimeChildActor' has a wrong offset!");
static_assert(offsetof(Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP, K2Node_Event_bToggleEnabled) == 0x000018, "Member 'Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP::K2Node_Event_bToggleEnabled' has a wrong offset!");
static_assert(offsetof(Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'Destructible_DoorBase_BP_C_ExecuteUbergraph_Destructible_DoorBase_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Destructible_DoorBase_BP.Destructible_DoorBase_BP_C.BndEvt__DestructibleDoor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Destructible_DoorBase_BP_C_BndEvt__DestructibleDoor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature final
{
public:
	class URBActorPrevisComponent*                ActorPrevis;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 RuntimeChildActor;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Destructible_DoorBase_BP_C_BndEvt__DestructibleDoor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature) == 0x000008, "Wrong alignment on Destructible_DoorBase_BP_C_BndEvt__DestructibleDoor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature");
static_assert(sizeof(Destructible_DoorBase_BP_C_BndEvt__DestructibleDoor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature) == 0x000010, "Wrong size on Destructible_DoorBase_BP_C_BndEvt__DestructibleDoor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature");
static_assert(offsetof(Destructible_DoorBase_BP_C_BndEvt__DestructibleDoor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature, ActorPrevis) == 0x000000, "Member 'Destructible_DoorBase_BP_C_BndEvt__DestructibleDoor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature::ActorPrevis' has a wrong offset!");
static_assert(offsetof(Destructible_DoorBase_BP_C_BndEvt__DestructibleDoor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature, RuntimeChildActor) == 0x000008, "Member 'Destructible_DoorBase_BP_C_BndEvt__DestructibleDoor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature::RuntimeChildActor' has a wrong offset!");

// Function Destructible_DoorBase_BP.Destructible_DoorBase_BP_C.ApplyDoorCollisionTypeToDestructible
// 0x0018 (0x0018 - 0x0000)
struct Destructible_DoorBase_BP_C_ApplyDoorCollisionTypeToDestructible final
{
public:
	class AActor*                                 Destructible;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Destructible_DoorBase_BP_C_ApplyDoorCollisionTypeToDestructible) == 0x000008, "Wrong alignment on Destructible_DoorBase_BP_C_ApplyDoorCollisionTypeToDestructible");
static_assert(sizeof(Destructible_DoorBase_BP_C_ApplyDoorCollisionTypeToDestructible) == 0x000018, "Wrong size on Destructible_DoorBase_BP_C_ApplyDoorCollisionTypeToDestructible");
static_assert(offsetof(Destructible_DoorBase_BP_C_ApplyDoorCollisionTypeToDestructible, Destructible) == 0x000000, "Member 'Destructible_DoorBase_BP_C_ApplyDoorCollisionTypeToDestructible::Destructible' has a wrong offset!");
static_assert(offsetof(Destructible_DoorBase_BP_C_ApplyDoorCollisionTypeToDestructible, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'Destructible_DoorBase_BP_C_ApplyDoorCollisionTypeToDestructible::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destructible_DoorBase_BP_C_ApplyDoorCollisionTypeToDestructible, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'Destructible_DoorBase_BP_C_ApplyDoorCollisionTypeToDestructible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destructible_DoorBase_BP_C_ApplyDoorCollisionTypeToDestructible, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'Destructible_DoorBase_BP_C_ApplyDoorCollisionTypeToDestructible::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Destructible_DoorBase_BP.Destructible_DoorBase_BP_C.PostToggled
// 0x0001 (0x0001 - 0x0000)
struct Destructible_DoorBase_BP_C_PostToggled final
{
public:
	bool                                          bToggleEnabled;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Destructible_DoorBase_BP_C_PostToggled) == 0x000001, "Wrong alignment on Destructible_DoorBase_BP_C_PostToggled");
static_assert(sizeof(Destructible_DoorBase_BP_C_PostToggled) == 0x000001, "Wrong size on Destructible_DoorBase_BP_C_PostToggled");
static_assert(offsetof(Destructible_DoorBase_BP_C_PostToggled, bToggleEnabled) == 0x000000, "Member 'Destructible_DoorBase_BP_C_PostToggled::bToggleEnabled' has a wrong offset!");

// Function Destructible_DoorBase_BP.Destructible_DoorBase_BP_C.HasDestructibleDoor
// 0x0001 (0x0001 - 0x0000)
struct Destructible_DoorBase_BP_C_HasDestructibleDoor final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Destructible_DoorBase_BP_C_HasDestructibleDoor) == 0x000001, "Wrong alignment on Destructible_DoorBase_BP_C_HasDestructibleDoor");
static_assert(sizeof(Destructible_DoorBase_BP_C_HasDestructibleDoor) == 0x000001, "Wrong size on Destructible_DoorBase_BP_C_HasDestructibleDoor");
static_assert(offsetof(Destructible_DoorBase_BP_C_HasDestructibleDoor, NewParam) == 0x000000, "Member 'Destructible_DoorBase_BP_C_HasDestructibleDoor::NewParam' has a wrong offset!");

}

