#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Destructible_DoorBase_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DoorBase_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Destructible_DoorBase_BP.Destructible_DoorBase_BP_C
// 0x0010 (0x1120 - 0x1110)
class ADestructible_DoorBase_BP_C : public ADoorBase_BP_C
{
public:
	uint8                                         Pad_1104[0x4];                                     // 0x1104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Destructible_DoorBase_BP_C;         // 0x1108(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBActorPrevisComponent*                DestructibleDoor;                                  // 0x1110(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsToggledOff;                                     // 0x1118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Destructible_DoorBase_BP(int32 EntryPoint);
	void BndEvt__DestructibleDoor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature(class URBActorPrevisComponent* ActorPrevis, class AActor* RuntimeChildActor);
	void ApplyDoorCollisionTypeToDestructible(class AActor* Destructible);
	void PostToggled(bool bToggleEnabled);
	void Event_OnResetStage();
	void HasDestructibleDoor(bool* NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Destructible_DoorBase_BP_C">();
	}
	static class ADestructible_DoorBase_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADestructible_DoorBase_BP_C>();
	}
};
static_assert(alignof(ADestructible_DoorBase_BP_C) == 0x000010, "Wrong alignment on ADestructible_DoorBase_BP_C");
static_assert(sizeof(ADestructible_DoorBase_BP_C) == 0x001120, "Wrong size on ADestructible_DoorBase_BP_C");
static_assert(offsetof(ADestructible_DoorBase_BP_C, UberGraphFrame_Destructible_DoorBase_BP_C) == 0x001108, "Member 'ADestructible_DoorBase_BP_C::UberGraphFrame_Destructible_DoorBase_BP_C' has a wrong offset!");
static_assert(offsetof(ADestructible_DoorBase_BP_C, DestructibleDoor) == 0x001110, "Member 'ADestructible_DoorBase_BP_C::DestructibleDoor' has a wrong offset!");
static_assert(offsetof(ADestructible_DoorBase_BP_C, bIsToggledOff) == 0x001118, "Member 'ADestructible_DoorBase_BP_C::bIsToggledOff' has a wrong offset!");

}

