#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DestructibleWoodenDoorMinus01_BP

#include "Basic.hpp"

#include "Parent_DestructibleDoor_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DestructibleWoodenDoor-01_BP.DestructibleWoodenDoor-01_BP_C
// 0x0040 (0x05A0 - 0x0560)
class ADestructibleWoodenDoorMinus01_BP_C final : public AParent_DestructibleDoor_BP_C
{
public:
	float                                         HoleRadius_0;                                      // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnWoodenDoorStrike_0;                              // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bFirstStrike_0;                                    // 0x0578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnWoodenDoorDestroyed_0;                           // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          DestroyPlanks;                                     // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnWoodenDoorDestroyed_0__DelegateSignature();
	void OnWoodenDoorStrike_0__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DestructibleWoodenDoor-01_BP_C">();
	}
	static class ADestructibleWoodenDoorMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADestructibleWoodenDoorMinus01_BP_C>();
	}
};
static_assert(alignof(ADestructibleWoodenDoorMinus01_BP_C) == 0x000010, "Wrong alignment on ADestructibleWoodenDoorMinus01_BP_C");
static_assert(sizeof(ADestructibleWoodenDoorMinus01_BP_C) == 0x0005A0, "Wrong size on ADestructibleWoodenDoorMinus01_BP_C");
static_assert(offsetof(ADestructibleWoodenDoorMinus01_BP_C, HoleRadius_0) == 0x000560, "Member 'ADestructibleWoodenDoorMinus01_BP_C::HoleRadius_0' has a wrong offset!");
static_assert(offsetof(ADestructibleWoodenDoorMinus01_BP_C, OnWoodenDoorStrike_0) == 0x000568, "Member 'ADestructibleWoodenDoorMinus01_BP_C::OnWoodenDoorStrike_0' has a wrong offset!");
static_assert(offsetof(ADestructibleWoodenDoorMinus01_BP_C, bFirstStrike_0) == 0x000578, "Member 'ADestructibleWoodenDoorMinus01_BP_C::bFirstStrike_0' has a wrong offset!");
static_assert(offsetof(ADestructibleWoodenDoorMinus01_BP_C, OnWoodenDoorDestroyed_0) == 0x000580, "Member 'ADestructibleWoodenDoorMinus01_BP_C::OnWoodenDoorDestroyed_0' has a wrong offset!");
static_assert(offsetof(ADestructibleWoodenDoorMinus01_BP_C, DestroyPlanks) == 0x000590, "Member 'ADestructibleWoodenDoorMinus01_BP_C::DestroyPlanks' has a wrong offset!");

}

