#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DoorMetalWindowMinusPadlocked_BP

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DoorMetalWindow-Padlocked_BP.DoorMetalWindow-Padlocked_BP_C.PlayLockDropSFX
// 0x0028 (0x0028 - 0x0000)
struct DoorMetalWindowMinusPadlocked_BP_C_PlayLockDropSFX final
{
public:
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorMetalWindowMinusPadlocked_BP_C_PlayLockDropSFX) == 0x000008, "Wrong alignment on DoorMetalWindowMinusPadlocked_BP_C_PlayLockDropSFX");
static_assert(sizeof(DoorMetalWindowMinusPadlocked_BP_C_PlayLockDropSFX) == 0x000028, "Wrong size on DoorMetalWindowMinusPadlocked_BP_C_PlayLockDropSFX");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_PlayLockDropSFX, Temp_struct_Variable) == 0x000000, "Member 'DoorMetalWindowMinusPadlocked_BP_C_PlayLockDropSFX::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_PlayLockDropSFX, Temp_delegate_Variable) == 0x000010, "Member 'DoorMetalWindowMinusPadlocked_BP_C_PlayLockDropSFX::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_PlayLockDropSFX, CallFunc_PostAkEvent_ReturnValue) == 0x000020, "Member 'DoorMetalWindowMinusPadlocked_BP_C_PlayLockDropSFX::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function DoorMetalWindow-Padlocked_BP.DoorMetalWindow-Padlocked_BP_C.RefreshLockBracketPosition
// 0x0148 (0x0148 - 0x0000)
struct DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0034(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00BC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition) == 0x000004, "Wrong alignment on DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition");
static_assert(sizeof(DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition) == 0x000148, "Wrong size on DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition, CallFunc_BreakVector_X) == 0x000004, "Member 'DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition, CallFunc_BreakVector_Y) == 0x000008, "Member 'DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition, CallFunc_BreakVector_Z) == 0x00000C, "Member 'DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition, CallFunc_BreakVector_X_1) == 0x000010, "Member 'DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition, CallFunc_BreakVector_Y_1) == 0x000014, "Member 'DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition, CallFunc_BreakVector_Z_1) == 0x000018, "Member 'DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition, CallFunc_MakeVector_ReturnValue) == 0x00001C, "Member 'DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition, CallFunc_MakeVector_ReturnValue_1) == 0x000028, "Member 'DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000034, "Member 'DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0000BC, "Member 'DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition, CallFunc_IsValid_ReturnValue) == 0x000144, "Member 'DoorMetalWindowMinusPadlocked_BP_C_RefreshLockBracketPosition::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function DoorMetalWindow-Padlocked_BP.DoorMetalWindow-Padlocked_BP_C.RefreshPhysicsState
// 0x0001 (0x0001 - 0x0000)
struct DoorMetalWindowMinusPadlocked_BP_C_RefreshPhysicsState final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorMetalWindowMinusPadlocked_BP_C_RefreshPhysicsState) == 0x000001, "Wrong alignment on DoorMetalWindowMinusPadlocked_BP_C_RefreshPhysicsState");
static_assert(sizeof(DoorMetalWindowMinusPadlocked_BP_C_RefreshPhysicsState) == 0x000001, "Wrong size on DoorMetalWindowMinusPadlocked_BP_C_RefreshPhysicsState");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_RefreshPhysicsState, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'DoorMetalWindowMinusPadlocked_BP_C_RefreshPhysicsState::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function DoorMetalWindow-Padlocked_BP.DoorMetalWindow-Padlocked_BP_C.BP_OnDoorInteract
// 0x0008 (0x0008 - 0x0000)
struct DoorMetalWindowMinusPadlocked_BP_C_BP_OnDoorInteract final
{
public:
	class ARBPawn*                                Interactor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorMetalWindowMinusPadlocked_BP_C_BP_OnDoorInteract) == 0x000008, "Wrong alignment on DoorMetalWindowMinusPadlocked_BP_C_BP_OnDoorInteract");
static_assert(sizeof(DoorMetalWindowMinusPadlocked_BP_C_BP_OnDoorInteract) == 0x000008, "Wrong size on DoorMetalWindowMinusPadlocked_BP_C_BP_OnDoorInteract");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_BP_OnDoorInteract, Interactor) == 0x000000, "Member 'DoorMetalWindowMinusPadlocked_BP_C_BP_OnDoorInteract::Interactor' has a wrong offset!");

// Function DoorMetalWindow-Padlocked_BP.DoorMetalWindow-Padlocked_BP_C.BP_OnLockPanelUnlocked
// 0x0010 (0x0010 - 0x0000)
struct DoorMetalWindowMinusPadlocked_BP_C_BP_OnLockPanelUnlocked final
{
public:
	class URBInteractiblePanelComponent*          LockPanel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                Pawn;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorMetalWindowMinusPadlocked_BP_C_BP_OnLockPanelUnlocked) == 0x000008, "Wrong alignment on DoorMetalWindowMinusPadlocked_BP_C_BP_OnLockPanelUnlocked");
static_assert(sizeof(DoorMetalWindowMinusPadlocked_BP_C_BP_OnLockPanelUnlocked) == 0x000010, "Wrong size on DoorMetalWindowMinusPadlocked_BP_C_BP_OnLockPanelUnlocked");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_BP_OnLockPanelUnlocked, LockPanel) == 0x000000, "Member 'DoorMetalWindowMinusPadlocked_BP_C_BP_OnLockPanelUnlocked::LockPanel' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_BP_OnLockPanelUnlocked, Pawn) == 0x000008, "Member 'DoorMetalWindowMinusPadlocked_BP_C_BP_OnLockPanelUnlocked::Pawn' has a wrong offset!");

// Function DoorMetalWindow-Padlocked_BP.DoorMetalWindow-Padlocked_BP_C.BndEvt__DoorMetalWindow-Padlocked_BP_DamageableComponent_K2Node_ComponentBoundEvent_1_OnDamageableEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DoorMetalWindowMinusPadlocked_BP_C_BndEvt__DoorMetalWindowMinusPadlocked_BP_DamageableComponent_K2Node_ComponentBoundEvent_1_OnDamageableEvent__DelegateSignature final
{
public:
	class URBDamageableComponent*                 DamageableComponent_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorMetalWindowMinusPadlocked_BP_C_BndEvt__DoorMetalWindowMinusPadlocked_BP_DamageableComponent_K2Node_ComponentBoundEvent_1_OnDamageableEvent__DelegateSignature) == 0x000008, "Wrong alignment on DoorMetalWindowMinusPadlocked_BP_C_BndEvt__DoorMetalWindowMinusPadlocked_BP_DamageableComponent_K2Node_ComponentBoundEvent_1_OnDamageableEvent__DelegateSignature");
static_assert(sizeof(DoorMetalWindowMinusPadlocked_BP_C_BndEvt__DoorMetalWindowMinusPadlocked_BP_DamageableComponent_K2Node_ComponentBoundEvent_1_OnDamageableEvent__DelegateSignature) == 0x000008, "Wrong size on DoorMetalWindowMinusPadlocked_BP_C_BndEvt__DoorMetalWindowMinusPadlocked_BP_DamageableComponent_K2Node_ComponentBoundEvent_1_OnDamageableEvent__DelegateSignature");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_BndEvt__DoorMetalWindowMinusPadlocked_BP_DamageableComponent_K2Node_ComponentBoundEvent_1_OnDamageableEvent__DelegateSignature, DamageableComponent_0) == 0x000000, "Member 'DoorMetalWindowMinusPadlocked_BP_C_BndEvt__DoorMetalWindowMinusPadlocked_BP_DamageableComponent_K2Node_ComponentBoundEvent_1_OnDamageableEvent__DelegateSignature::DamageableComponent_0' has a wrong offset!");

// Function DoorMetalWindow-Padlocked_BP.DoorMetalWindow-Padlocked_BP_C.ExecuteUbergraph_DoorMetalWindow-Padlocked_BP
// 0x0050 (0x0050 - 0x0000)
struct DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_Event_interactor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBInteractiblePanelComponent*          K2Node_Event_lockPanel;                            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_Event_pawn;                                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentValue_ScheduledFloat_ReturnValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBHackableComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHackState                                    CallFunc_GetCurrentHackState_ReturnValue;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBDamageableComponent*                 K2Node_ComponentBoundEvent_DamageableComponent;    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP) == 0x000008, "Wrong alignment on DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP");
static_assert(sizeof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP) == 0x000050, "Wrong size on DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP, EntryPoint) == 0x000000, "Member 'DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP, K2Node_Event_interactor) == 0x000008, "Member 'DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP::K2Node_Event_interactor' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP, K2Node_Event_lockPanel) == 0x000010, "Member 'DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP::K2Node_Event_lockPanel' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP, K2Node_Event_pawn) == 0x000018, "Member 'DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP::K2Node_Event_pawn' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP, CallFunc_GetCurrentValue_ScheduledFloat_ReturnValue) == 0x000020, "Member 'DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP::CallFunc_GetCurrentValue_ScheduledFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP, CallFunc_GetCurrentHackState_ReturnValue) == 0x000042, "Member 'DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP::CallFunc_GetCurrentHackState_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000043, "Member 'DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP, K2Node_ComponentBoundEvent_DamageableComponent) == 0x000048, "Member 'DoorMetalWindowMinusPadlocked_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadlocked_BP::K2Node_ComponentBoundEvent_DamageableComponent' has a wrong offset!");

// Function DoorMetalWindow-Padlocked_BP.DoorMetalWindow-Padlocked_BP_C.DoorInteracted__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct DoorMetalWindowMinusPadlocked_BP_C_DoorInteracted__DelegateSignature final
{
public:
	bool                                          bOpen_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorMetalWindowMinusPadlocked_BP_C_DoorInteracted__DelegateSignature) == 0x000001, "Wrong alignment on DoorMetalWindowMinusPadlocked_BP_C_DoorInteracted__DelegateSignature");
static_assert(sizeof(DoorMetalWindowMinusPadlocked_BP_C_DoorInteracted__DelegateSignature) == 0x000001, "Wrong size on DoorMetalWindowMinusPadlocked_BP_C_DoorInteracted__DelegateSignature");
static_assert(offsetof(DoorMetalWindowMinusPadlocked_BP_C_DoorInteracted__DelegateSignature, bOpen_0) == 0x000000, "Member 'DoorMetalWindowMinusPadlocked_BP_C_DoorInteracted__DelegateSignature::bOpen_0' has a wrong offset!");

}

