#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DoorTrap_GhostAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function DoorTrap_GhostAnimBP.DoorTrap_GhostAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct DoorTrap_GhostAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(DoorTrap_GhostAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on DoorTrap_GhostAnimBP_C_AnimGraph");
static_assert(sizeof(DoorTrap_GhostAnimBP_C_AnimGraph) == 0x000010, "Wrong size on DoorTrap_GhostAnimBP_C_AnimGraph");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'DoorTrap_GhostAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function DoorTrap_GhostAnimBP.DoorTrap_GhostAnimBP_C.FinishGhost
// 0x000C (0x000C - 0x0000)
struct DoorTrap_GhostAnimBP_C_FinishGhost final
{
public:
	EGhostFinishReason                            FinishReason;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GhostFinishCustomReason;                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorTrap_GhostAnimBP_C_FinishGhost) == 0x000004, "Wrong alignment on DoorTrap_GhostAnimBP_C_FinishGhost");
static_assert(sizeof(DoorTrap_GhostAnimBP_C_FinishGhost) == 0x00000C, "Wrong size on DoorTrap_GhostAnimBP_C_FinishGhost");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_FinishGhost, FinishReason) == 0x000000, "Member 'DoorTrap_GhostAnimBP_C_FinishGhost::FinishReason' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_FinishGhost, GhostFinishCustomReason) == 0x000004, "Member 'DoorTrap_GhostAnimBP_C_FinishGhost::GhostFinishCustomReason' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_FinishGhost, ReturnValue) == 0x000008, "Member 'DoorTrap_GhostAnimBP_C_FinishGhost::ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_FinishGhost, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'DoorTrap_GhostAnimBP_C_FinishGhost::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_FinishGhost, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'DoorTrap_GhostAnimBP_C_FinishGhost::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function DoorTrap_GhostAnimBP.DoorTrap_GhostAnimBP_C.ExecuteUbergraph_DoorTrap_GhostAnimBP
// 0x0040 (0x0040 - 0x0000)
struct DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GhostAnimTransition_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentValue_ScheduledUObject_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GhostAnimTransition_ReturnValue_1;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATriggerTrap_BatteryPowered_Right_BP_C* K2Node_DynamicCast_AsTrigger_Trap_Battery_Powered_Right_BP; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP) == 0x000008, "Wrong alignment on DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP");
static_assert(sizeof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP) == 0x000040, "Wrong size on DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, EntryPoint) == 0x000000, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_GhostAnimTransition_ReturnValue) == 0x000004, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_GhostAnimTransition_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x000007, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000008, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_BooleanAND_ReturnValue_2) == 0x000009, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_Not_PreBool_ReturnValue_2) == 0x00000A, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_BooleanAND_ReturnValue_3) == 0x00000B, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_BooleanAND_ReturnValue_4) == 0x00000C, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000010, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x000014, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000018, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000019, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_GetCurrentValue_ScheduledUObject_ReturnValue) == 0x000020, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_GetCurrentValue_ScheduledUObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_GhostAnimTransition_ReturnValue_1) == 0x000028, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_GhostAnimTransition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, K2Node_DynamicCast_AsTrigger_Trap_Battery_Powered_Right_BP) == 0x000030, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::K2Node_DynamicCast_AsTrigger_Trap_Battery_Powered_Right_BP' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'DoorTrap_GhostAnimBP_C_ExecuteUbergraph_DoorTrap_GhostAnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

