#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DoorMetalWindowMinusPadLockedMinusSecondDoor_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function DoorMetalWindow-PadLocked-SecondDoor_BP.DoorMetalWindow-PadLocked-SecondDoor_BP_C.BP_OnDoorInteract
// 0x0008 (0x0008 - 0x0000)
struct DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_BP_OnDoorInteract final
{
public:
	class ARBPawn*                                Interactor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_BP_OnDoorInteract) == 0x000008, "Wrong alignment on DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_BP_OnDoorInteract");
static_assert(sizeof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_BP_OnDoorInteract) == 0x000008, "Wrong size on DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_BP_OnDoorInteract");
static_assert(offsetof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_BP_OnDoorInteract, Interactor) == 0x000000, "Member 'DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_BP_OnDoorInteract::Interactor' has a wrong offset!");

// Function DoorMetalWindow-PadLocked-SecondDoor_BP.DoorMetalWindow-PadLocked-SecondDoor_BP_C.BndEvt__DoorMetalWindow-PadLocked-SecondDoor_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_BndEvt__DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableEvent__DelegateSignature final
{
public:
	class URBDamageableComponent*                 DamageableComponent_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_BndEvt__DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableEvent__DelegateSignature) == 0x000008, "Wrong alignment on DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_BndEvt__DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableEvent__DelegateSignature");
static_assert(sizeof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_BndEvt__DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableEvent__DelegateSignature) == 0x000008, "Wrong size on DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_BndEvt__DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableEvent__DelegateSignature");
static_assert(offsetof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_BndEvt__DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableEvent__DelegateSignature, DamageableComponent_0) == 0x000000, "Member 'DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_BndEvt__DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableEvent__DelegateSignature::DamageableComponent_0' has a wrong offset!");

// Function DoorMetalWindow-PadLocked-SecondDoor_BP.DoorMetalWindow-PadLocked-SecondDoor_BP_C.ExecuteUbergraph_DoorMetalWindow-PadLocked-SecondDoor_BP
// 0x0020 (0x0020 - 0x0000)
struct DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBDamageableComponent*                 K2Node_ComponentBoundEvent_DamageableComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_Event_interactor;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentValue_ScheduledFloat_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP) == 0x000008, "Wrong alignment on DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP");
static_assert(sizeof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP) == 0x000020, "Wrong size on DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP");
static_assert(offsetof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP, EntryPoint) == 0x000000, "Member 'DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP, K2Node_ComponentBoundEvent_DamageableComponent) == 0x000008, "Member 'DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP::K2Node_ComponentBoundEvent_DamageableComponent' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP, K2Node_Event_interactor) == 0x000010, "Member 'DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP::K2Node_Event_interactor' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP, CallFunc_GetCurrentValue_ScheduledFloat_ReturnValue) == 0x000018, "Member 'DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP::CallFunc_GetCurrentValue_ScheduledFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00001C, "Member 'DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_ExecuteUbergraph_DoorMetalWindowMinusPadLockedMinusSecondDoor_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function DoorMetalWindow-PadLocked-SecondDoor_BP.DoorMetalWindow-PadLocked-SecondDoor_BP_C.DoorInteracted__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_DoorInteracted__DelegateSignature final
{
public:
	bool                                          bOpen_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_DoorInteracted__DelegateSignature) == 0x000001, "Wrong alignment on DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_DoorInteracted__DelegateSignature");
static_assert(sizeof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_DoorInteracted__DelegateSignature) == 0x000001, "Wrong size on DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_DoorInteracted__DelegateSignature");
static_assert(offsetof(DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_DoorInteracted__DelegateSignature, bOpen_0) == 0x000000, "Member 'DoorMetalWindowMinusPadLockedMinusSecondDoor_BP_C_DoorInteracted__DelegateSignature::bOpen_0' has a wrong offset!");

}

