#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DoorBase_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DoorBase_BP.DoorBase_BP_C.ExecuteUbergraph_DoorBase_BP
// 0x0170 (0x0170 - 0x0000)
struct DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x002C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0040(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0054(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_Event_pawn_1;                               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSuccess;                             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bApplyVisualDoorDamage;               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBashDoorType                                 K2Node_Event_bashType;                             // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0078(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bLocking;                             // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_Event_pawn;                                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_actor;                                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bTrapped;                             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFromFront;                           // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_Map_Values_Values;                        // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetChildComponentByTag_outComponent;      // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsLinkedTrapTriggered_ReturnValue;     // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsLinkedTrapArmed_ReturnValue;         // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsLinkedTrapTriggered_ReturnValue_1;   // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0107(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UPointLightComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0108(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPointLightComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bToggleEnabled;                       // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_1;           // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_2;           // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_3;           // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AParent_DestructibleDoor_BP_C*          K2Node_DynamicCast_AsParent_Destructible_Door_BP;  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP) == 0x000008, "Wrong alignment on DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP");
static_assert(sizeof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP) == 0x000170, "Wrong size on DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, EntryPoint) == 0x000000, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, Temp_int_Array_Index_Variable) == 0x000004, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, Temp_delegate_Variable) == 0x000010, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, Temp_delegate_Variable_1) == 0x00002C, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_HasAuthority_ReturnValue) == 0x00003C, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, Temp_delegate_Variable_2) == 0x000040, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000050, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, Temp_delegate_Variable_3) == 0x000054, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000064, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, K2Node_Event_pawn_1) == 0x000068, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::K2Node_Event_pawn_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, K2Node_Event_bSuccess) == 0x000070, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::K2Node_Event_bSuccess' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, K2Node_Event_bApplyVisualDoorDamage) == 0x000071, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::K2Node_Event_bApplyVisualDoorDamage' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, K2Node_Event_bashType) == 0x000072, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::K2Node_Event_bashType' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_GetAttachedActors_OutActors) == 0x000078, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, Temp_int_Loop_Counter_Variable_2) == 0x000088, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Add_IntInt_ReturnValue_2) == 0x000090, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, K2Node_Event_bLocking) == 0x000095, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::K2Node_Event_bLocking' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, K2Node_Event_pawn) == 0x000098, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::K2Node_Event_pawn' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, K2Node_Event_actor) == 0x0000A0, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::K2Node_Event_actor' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, K2Node_Event_bTrapped) == 0x0000A8, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::K2Node_Event_bTrapped' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, K2Node_Event_bFromFront) == 0x0000A9, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::K2Node_Event_bFromFront' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Map_Values_Values) == 0x0000B0, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Array_Length_ReturnValue_1) == 0x0000C8, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_GetChildComponentByTag_outComponent) == 0x0000D0, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_GetChildComponentByTag_outComponent' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D8, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, K2Node_DynamicCast_AsStatic_Mesh_Component) == 0x0000E0, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::K2Node_DynamicCast_AsStatic_Mesh_Component' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_GetRightVector_ReturnValue) == 0x0000EC, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F8, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_BP_IsLinkedTrapTriggered_ReturnValue) == 0x000104, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_BP_IsLinkedTrapTriggered_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_BP_IsLinkedTrapArmed_ReturnValue) == 0x000105, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_BP_IsLinkedTrapArmed_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_BP_IsLinkedTrapTriggered_ReturnValue_1) == 0x000106, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_BP_IsLinkedTrapTriggered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000107, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000108, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_BooleanOR_ReturnValue) == 0x000118, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Array_Get_Item_1) == 0x000120, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_ComponentHasTag_ReturnValue) == 0x000128, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Array_Length_ReturnValue_2) == 0x00012C, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Less_IntInt_ReturnValue_2) == 0x000130, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, K2Node_Event_bToggleEnabled) == 0x000131, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::K2Node_Event_bToggleEnabled' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_PostEventOnActor_ReturnValue) == 0x000134, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_PostEventOnActor_ReturnValue_1) == 0x000138, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_PostEventOnActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_PostEventOnActor_ReturnValue_2) == 0x00013C, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_PostEventOnActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_PostEventOnActor_ReturnValue_3) == 0x000140, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_PostEventOnActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, Temp_int_Variable) == 0x000144, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000148, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Add_IntInt_ReturnValue_3) == 0x00014C, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, Temp_int_Array_Index_Variable_2) == 0x000150, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, CallFunc_Array_Get_Item_2) == 0x000158, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, K2Node_DynamicCast_AsParent_Destructible_Door_BP) == 0x000160, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::K2Node_DynamicCast_AsParent_Destructible_Door_BP' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP, K2Node_DynamicCast_bSuccess_1) == 0x000168, "Member 'DoorBase_BP_C_ExecuteUbergraph_DoorBase_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function DoorBase_BP.DoorBase_BP_C.PostToggled
// 0x0001 (0x0001 - 0x0000)
struct DoorBase_BP_C_PostToggled final
{
public:
	bool                                          bToggleEnabled;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorBase_BP_C_PostToggled) == 0x000001, "Wrong alignment on DoorBase_BP_C_PostToggled");
static_assert(sizeof(DoorBase_BP_C_PostToggled) == 0x000001, "Wrong size on DoorBase_BP_C_PostToggled");
static_assert(offsetof(DoorBase_BP_C_PostToggled, bToggleEnabled) == 0x000000, "Member 'DoorBase_BP_C_PostToggled::bToggleEnabled' has a wrong offset!");

// Function DoorBase_BP.DoorBase_BP_C.BP_OnDoorTrappedStateChanged
// 0x0002 (0x0002 - 0x0000)
struct DoorBase_BP_C_BP_OnDoorTrappedStateChanged final
{
public:
	bool                                          bTrapped;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFromFront;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorBase_BP_C_BP_OnDoorTrappedStateChanged) == 0x000001, "Wrong alignment on DoorBase_BP_C_BP_OnDoorTrappedStateChanged");
static_assert(sizeof(DoorBase_BP_C_BP_OnDoorTrappedStateChanged) == 0x000002, "Wrong size on DoorBase_BP_C_BP_OnDoorTrappedStateChanged");
static_assert(offsetof(DoorBase_BP_C_BP_OnDoorTrappedStateChanged, bTrapped) == 0x000000, "Member 'DoorBase_BP_C_BP_OnDoorTrappedStateChanged::bTrapped' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_BP_OnDoorTrappedStateChanged, bFromFront) == 0x000001, "Member 'DoorBase_BP_C_BP_OnDoorTrappedStateChanged::bFromFront' has a wrong offset!");

// Function DoorBase_BP.DoorBase_BP_C.BP_OnActorAttachedToDoor
// 0x0008 (0x0008 - 0x0000)
struct DoorBase_BP_C_BP_OnActorAttachedToDoor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorBase_BP_C_BP_OnActorAttachedToDoor) == 0x000008, "Wrong alignment on DoorBase_BP_C_BP_OnActorAttachedToDoor");
static_assert(sizeof(DoorBase_BP_C_BP_OnActorAttachedToDoor) == 0x000008, "Wrong size on DoorBase_BP_C_BP_OnActorAttachedToDoor");
static_assert(offsetof(DoorBase_BP_C_BP_OnActorAttachedToDoor, Actor) == 0x000000, "Member 'DoorBase_BP_C_BP_OnActorAttachedToDoor::Actor' has a wrong offset!");

// Function DoorBase_BP.DoorBase_BP_C.BP_OnDoorUnhingeEvent
// 0x0008 (0x0008 - 0x0000)
struct DoorBase_BP_C_BP_OnDoorUnhingeEvent final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorBase_BP_C_BP_OnDoorUnhingeEvent) == 0x000008, "Wrong alignment on DoorBase_BP_C_BP_OnDoorUnhingeEvent");
static_assert(sizeof(DoorBase_BP_C_BP_OnDoorUnhingeEvent) == 0x000008, "Wrong size on DoorBase_BP_C_BP_OnDoorUnhingeEvent");
static_assert(offsetof(DoorBase_BP_C_BP_OnDoorUnhingeEvent, Pawn) == 0x000000, "Member 'DoorBase_BP_C_BP_OnDoorUnhingeEvent::Pawn' has a wrong offset!");

// Function DoorBase_BP.DoorBase_BP_C.BP_OnDoorBarsLockingEvent
// 0x0001 (0x0001 - 0x0000)
struct DoorBase_BP_C_BP_OnDoorBarsLockingEvent final
{
public:
	bool                                          bLocking;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorBase_BP_C_BP_OnDoorBarsLockingEvent) == 0x000001, "Wrong alignment on DoorBase_BP_C_BP_OnDoorBarsLockingEvent");
static_assert(sizeof(DoorBase_BP_C_BP_OnDoorBarsLockingEvent) == 0x000001, "Wrong size on DoorBase_BP_C_BP_OnDoorBarsLockingEvent");
static_assert(offsetof(DoorBase_BP_C_BP_OnDoorBarsLockingEvent, bLocking) == 0x000000, "Member 'DoorBase_BP_C_BP_OnDoorBarsLockingEvent::bLocking' has a wrong offset!");

// Function DoorBase_BP.DoorBase_BP_C.BP_OnDoorBashEvent
// 0x0010 (0x0010 - 0x0000)
struct DoorBase_BP_C_BP_OnDoorBashEvent final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bApplyVisualDoorDamage;                            // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EBashDoorType                                 bashType;                                          // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorBase_BP_C_BP_OnDoorBashEvent) == 0x000008, "Wrong alignment on DoorBase_BP_C_BP_OnDoorBashEvent");
static_assert(sizeof(DoorBase_BP_C_BP_OnDoorBashEvent) == 0x000010, "Wrong size on DoorBase_BP_C_BP_OnDoorBashEvent");
static_assert(offsetof(DoorBase_BP_C_BP_OnDoorBashEvent, Pawn) == 0x000000, "Member 'DoorBase_BP_C_BP_OnDoorBashEvent::Pawn' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_BP_OnDoorBashEvent, bSuccess) == 0x000008, "Member 'DoorBase_BP_C_BP_OnDoorBashEvent::bSuccess' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_BP_OnDoorBashEvent, bApplyVisualDoorDamage) == 0x000009, "Member 'DoorBase_BP_C_BP_OnDoorBashEvent::bApplyVisualDoorDamage' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_BP_OnDoorBashEvent, bashType) == 0x00000A, "Member 'DoorBase_BP_C_BP_OnDoorBashEvent::bashType' has a wrong offset!");

// Function DoorBase_BP.DoorBase_BP_C.DisableDestructibleDoorCollision
// 0x0040 (0x0040 - 0x0000)
struct DoorBase_BP_C_DisableDestructibleDoorCollision final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetChildComponent_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumChildrenComponents_ReturnValue;     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   K2Node_DynamicCast_AsChild_Actor_Component;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AParent_DestructibleDoor_BP_C*          K2Node_DynamicCast_AsParent_Destructible_Door_BP;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorBase_BP_C_DisableDestructibleDoorCollision) == 0x000008, "Wrong alignment on DoorBase_BP_C_DisableDestructibleDoorCollision");
static_assert(sizeof(DoorBase_BP_C_DisableDestructibleDoorCollision) == 0x000040, "Wrong size on DoorBase_BP_C_DisableDestructibleDoorCollision");
static_assert(offsetof(DoorBase_BP_C_DisableDestructibleDoorCollision, Temp_int_Variable) == 0x000000, "Member 'DoorBase_BP_C_DisableDestructibleDoorCollision::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_DisableDestructibleDoorCollision, CallFunc_GetChildComponent_ReturnValue) == 0x000008, "Member 'DoorBase_BP_C_DisableDestructibleDoorCollision::CallFunc_GetChildComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_DisableDestructibleDoorCollision, CallFunc_GetNumChildrenComponents_ReturnValue) == 0x000010, "Member 'DoorBase_BP_C_DisableDestructibleDoorCollision::CallFunc_GetNumChildrenComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_DisableDestructibleDoorCollision, K2Node_DynamicCast_AsChild_Actor_Component) == 0x000018, "Member 'DoorBase_BP_C_DisableDestructibleDoorCollision::K2Node_DynamicCast_AsChild_Actor_Component' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_DisableDestructibleDoorCollision, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'DoorBase_BP_C_DisableDestructibleDoorCollision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_DisableDestructibleDoorCollision, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'DoorBase_BP_C_DisableDestructibleDoorCollision::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_DisableDestructibleDoorCollision, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'DoorBase_BP_C_DisableDestructibleDoorCollision::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_DisableDestructibleDoorCollision, K2Node_DynamicCast_AsParent_Destructible_Door_BP) == 0x000030, "Member 'DoorBase_BP_C_DisableDestructibleDoorCollision::K2Node_DynamicCast_AsParent_Destructible_Door_BP' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_DisableDestructibleDoorCollision, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'DoorBase_BP_C_DisableDestructibleDoorCollision::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_DisableDestructibleDoorCollision, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'DoorBase_BP_C_DisableDestructibleDoorCollision::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function DoorBase_BP.DoorBase_BP_C.SetLockBarsVisibility
// 0x0040 (0x0040 - 0x0000)
struct DoorBase_BP_C_SetLockBarsVisibility final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorBase_BP_C_SetLockBarsVisibility) == 0x000008, "Wrong alignment on DoorBase_BP_C_SetLockBarsVisibility");
static_assert(sizeof(DoorBase_BP_C_SetLockBarsVisibility) == 0x000040, "Wrong size on DoorBase_BP_C_SetLockBarsVisibility");
static_assert(offsetof(DoorBase_BP_C_SetLockBarsVisibility, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'DoorBase_BP_C_SetLockBarsVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_SetLockBarsVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'DoorBase_BP_C_SetLockBarsVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_SetLockBarsVisibility, Temp_int_Array_Index_Variable) == 0x000008, "Member 'DoorBase_BP_C_SetLockBarsVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_SetLockBarsVisibility, Temp_name_Variable) == 0x00000C, "Member 'DoorBase_BP_C_SetLockBarsVisibility::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_SetLockBarsVisibility, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'DoorBase_BP_C_SetLockBarsVisibility::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_SetLockBarsVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'DoorBase_BP_C_SetLockBarsVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_SetLockBarsVisibility, CallFunc_Array_Get_Item) == 0x000030, "Member 'DoorBase_BP_C_SetLockBarsVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_SetLockBarsVisibility, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'DoorBase_BP_C_SetLockBarsVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_SetLockBarsVisibility, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'DoorBase_BP_C_SetLockBarsVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_SetLockBarsVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x00003D, "Member 'DoorBase_BP_C_SetLockBarsVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_SetLockBarsVisibility, CallFunc_Array_Contains_ReturnValue) == 0x00003E, "Member 'DoorBase_BP_C_SetLockBarsVisibility::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function DoorBase_BP.DoorBase_BP_C.InitializeSettings
// 0x00C0 (0x00C0 - 0x0000)
struct DoorBase_BP_C_InitializeSettings final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0008(0x0010)(ReferenceParm)
	TArray<class UChildActorComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue_2;    // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_2;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AllowDecals_bAllowDecals;                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_3;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AllowDecals_bAllowDecals_1;               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB[0x1];                                       // 0x00BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorBase_BP_C_InitializeSettings) == 0x000008, "Wrong alignment on DoorBase_BP_C_InitializeSettings");
static_assert(sizeof(DoorBase_BP_C_InitializeSettings) == 0x0000C0, "Wrong size on DoorBase_BP_C_InitializeSettings");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, Actor) == 0x000000, "Member 'DoorBase_BP_C_InitializeSettings::Actor' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_GetAttachedActors_OutActors) == 0x000008, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Array_Length_ReturnValue_1) == 0x00002C, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000030, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_K2_GetComponentsByClass_ReturnValue_2) == 0x000040, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_K2_GetComponentsByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Array_Length_ReturnValue_2) == 0x000050, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Array_Length_ReturnValue_3) == 0x000054, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, Temp_int_Array_Index_Variable) == 0x000058, "Member 'DoorBase_BP_C_InitializeSettings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, Temp_int_Array_Index_Variable_1) == 0x00005C, "Member 'DoorBase_BP_C_InitializeSettings::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Array_Get_Item) == 0x000060, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, Temp_int_Loop_Counter_Variable) == 0x000074, "Member 'DoorBase_BP_C_InitializeSettings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, Temp_int_Array_Index_Variable_2) == 0x000080, "Member 'DoorBase_BP_C_InitializeSettings::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, Temp_int_Loop_Counter_Variable_1) == 0x000084, "Member 'DoorBase_BP_C_InitializeSettings::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Array_Get_Item_2) == 0x000088, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_IsValid_ReturnValue_2) == 0x000090, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_AllowDecals_bAllowDecals) == 0x000091, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_AllowDecals_bAllowDecals' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Less_IntInt_ReturnValue_1) == 0x000092, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, Temp_int_Loop_Counter_Variable_2) == 0x000098, "Member 'DoorBase_BP_C_InitializeSettings::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Less_IntInt_ReturnValue_2) == 0x00009C, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A0, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, Temp_int_Array_Index_Variable_3) == 0x0000A4, "Member 'DoorBase_BP_C_InitializeSettings::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, Temp_int_Loop_Counter_Variable_3) == 0x0000A8, "Member 'DoorBase_BP_C_InitializeSettings::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Array_Get_Item_3) == 0x0000B0, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_IsValid_ReturnValue_3) == 0x0000B8, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_AllowDecals_bAllowDecals_1) == 0x0000B9, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_AllowDecals_bAllowDecals_1' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000BA, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DoorBase_BP_C_InitializeSettings, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000BC, "Member 'DoorBase_BP_C_InitializeSettings::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");

// Function DoorBase_BP.DoorBase_BP_C.GetRandomTrapIndicator
// 0x0140 (0x0140 - 0x0000)
struct DoorBase_BP_C_GetRandomTrapIndicator final
{
public:
	int32                                         TellIndex;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Mesh;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RelativeTransform;                                 // 0x0010(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	int32                                         Retries;                                           // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomTellIndex;                                   // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTrapTellMaxIndex_TrapTellMaxIndex;     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
