#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DoorWayDestructibleWallMinus02_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DoorWayDestructibleWall-02_BP.DoorWayDestructibleWall-02_BP_C.AllowSlidingLockInteraction
// 0x0010 (0x0010 - 0x0000)
struct DoorWayDestructibleWallMinus02_BP_C_AllowSlidingLockInteraction final
{
public:
	const class ARBSlidingLock*                   SlidingLock;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DoorWayDestructibleWallMinus02_BP_C_AllowSlidingLockInteraction) == 0x000008, "Wrong alignment on DoorWayDestructibleWallMinus02_BP_C_AllowSlidingLockInteraction");
static_assert(sizeof(DoorWayDestructibleWallMinus02_BP_C_AllowSlidingLockInteraction) == 0x000010, "Wrong size on DoorWayDestructibleWallMinus02_BP_C_AllowSlidingLockInteraction");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_AllowSlidingLockInteraction, SlidingLock) == 0x000000, "Member 'DoorWayDestructibleWallMinus02_BP_C_AllowSlidingLockInteraction::SlidingLock' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_AllowSlidingLockInteraction, ReturnValue) == 0x000008, "Member 'DoorWayDestructibleWallMinus02_BP_C_AllowSlidingLockInteraction::ReturnValue' has a wrong offset!");

// Function DoorWayDestructibleWall-02_BP.DoorWayDestructibleWall-02_BP_C.AttachDoorBlockerSkillItem
// 0x0008 (0x0008 - 0x0000)
struct DoorWayDestructibleWallMinus02_BP_C_AttachDoorBlockerSkillItem final
{
public:
	class ARBDoorBlockerSkillItem*                DoorBlocker;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorWayDestructibleWallMinus02_BP_C_AttachDoorBlockerSkillItem) == 0x000008, "Wrong alignment on DoorWayDestructibleWallMinus02_BP_C_AttachDoorBlockerSkillItem");
static_assert(sizeof(DoorWayDestructibleWallMinus02_BP_C_AttachDoorBlockerSkillItem) == 0x000008, "Wrong size on DoorWayDestructibleWallMinus02_BP_C_AttachDoorBlockerSkillItem");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_AttachDoorBlockerSkillItem, DoorBlocker) == 0x000000, "Member 'DoorWayDestructibleWallMinus02_BP_C_AttachDoorBlockerSkillItem::DoorBlocker' has a wrong offset!");

// Function DoorWayDestructibleWall-02_BP.DoorWayDestructibleWall-02_BP_C.OnBashCompleted
// 0x0008 (0x0008 - 0x0000)
struct DoorWayDestructibleWallMinus02_BP_C_OnBashCompleted final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorWayDestructibleWallMinus02_BP_C_OnBashCompleted) == 0x000008, "Wrong alignment on DoorWayDestructibleWallMinus02_BP_C_OnBashCompleted");
static_assert(sizeof(DoorWayDestructibleWallMinus02_BP_C_OnBashCompleted) == 0x000008, "Wrong size on DoorWayDestructibleWallMinus02_BP_C_OnBashCompleted");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_OnBashCompleted, Pawn) == 0x000000, "Member 'DoorWayDestructibleWallMinus02_BP_C_OnBashCompleted::Pawn' has a wrong offset!");

// Function DoorWayDestructibleWall-02_BP.DoorWayDestructibleWall-02_BP_C.OnBashDoAction
// 0x0008 (0x0008 - 0x0000)
struct DoorWayDestructibleWallMinus02_BP_C_OnBashDoAction final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorWayDestructibleWallMinus02_BP_C_OnBashDoAction) == 0x000008, "Wrong alignment on DoorWayDestructibleWallMinus02_BP_C_OnBashDoAction");
static_assert(sizeof(DoorWayDestructibleWallMinus02_BP_C_OnBashDoAction) == 0x000008, "Wrong size on DoorWayDestructibleWallMinus02_BP_C_OnBashDoAction");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_OnBashDoAction, Pawn) == 0x000000, "Member 'DoorWayDestructibleWallMinus02_BP_C_OnBashDoAction::Pawn' has a wrong offset!");

// Function DoorWayDestructibleWall-02_BP.DoorWayDestructibleWall-02_BP_C.OnBashStarting
// 0x0008 (0x0008 - 0x0000)
struct DoorWayDestructibleWallMinus02_BP_C_OnBashStarting final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorWayDestructibleWallMinus02_BP_C_OnBashStarting) == 0x000008, "Wrong alignment on DoorWayDestructibleWallMinus02_BP_C_OnBashStarting");
static_assert(sizeof(DoorWayDestructibleWallMinus02_BP_C_OnBashStarting) == 0x000008, "Wrong size on DoorWayDestructibleWallMinus02_BP_C_OnBashStarting");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_OnBashStarting, Pawn) == 0x000000, "Member 'DoorWayDestructibleWallMinus02_BP_C_OnBashStarting::Pawn' has a wrong offset!");

// Function DoorWayDestructibleWall-02_BP.DoorWayDestructibleWall-02_BP_C.SetDoorBlockableOwner
// 0x0008 (0x0008 - 0x0000)
struct DoorWayDestructibleWallMinus02_BP_C_SetDoorBlockableOwner final
{
public:
	class ARBPawn*                                Owner_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorWayDestructibleWallMinus02_BP_C_SetDoorBlockableOwner) == 0x000008, "Wrong alignment on DoorWayDestructibleWallMinus02_BP_C_SetDoorBlockableOwner");
static_assert(sizeof(DoorWayDestructibleWallMinus02_BP_C_SetDoorBlockableOwner) == 0x000008, "Wrong size on DoorWayDestructibleWallMinus02_BP_C_SetDoorBlockableOwner");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_SetDoorBlockableOwner, Owner_0) == 0x000000, "Member 'DoorWayDestructibleWallMinus02_BP_C_SetDoorBlockableOwner::Owner_0' has a wrong offset!");

// Function DoorWayDestructibleWall-02_BP.DoorWayDestructibleWall-02_BP_C.BndEvt__DoorWayDestructibleWall-02_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DoorWayDestructibleWallMinus02_BP_C_BndEvt__DoorWayDestructibleWallMinus02_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature final
{
public:
	class URBDamageableComponent*                 DamageableComponent_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorWayDestructibleWallMinus02_BP_C_BndEvt__DoorWayDestructibleWallMinus02_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature) == 0x000008, "Wrong alignment on DoorWayDestructibleWallMinus02_BP_C_BndEvt__DoorWayDestructibleWallMinus02_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature");
static_assert(sizeof(DoorWayDestructibleWallMinus02_BP_C_BndEvt__DoorWayDestructibleWallMinus02_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature) == 0x000008, "Wrong size on DoorWayDestructibleWallMinus02_BP_C_BndEvt__DoorWayDestructibleWallMinus02_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_BndEvt__DoorWayDestructibleWallMinus02_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature, DamageableComponent_0) == 0x000000, "Member 'DoorWayDestructibleWallMinus02_BP_C_BndEvt__DoorWayDestructibleWallMinus02_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDestroyed__DelegateSignature::DamageableComponent_0' has a wrong offset!");

// Function DoorWayDestructibleWall-02_BP.DoorWayDestructibleWall-02_BP_C.SetBlockedActor
// 0x0008 (0x0008 - 0x0000)
struct DoorWayDestructibleWallMinus02_BP_C_SetBlockedActor final
{
public:
	class AActor*                                 blockedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorWayDestructibleWallMinus02_BP_C_SetBlockedActor) == 0x000008, "Wrong alignment on DoorWayDestructibleWallMinus02_BP_C_SetBlockedActor");
static_assert(sizeof(DoorWayDestructibleWallMinus02_BP_C_SetBlockedActor) == 0x000008, "Wrong size on DoorWayDestructibleWallMinus02_BP_C_SetBlockedActor");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_SetBlockedActor, blockedActor) == 0x000000, "Member 'DoorWayDestructibleWallMinus02_BP_C_SetBlockedActor::blockedActor' has a wrong offset!");

// Function DoorWayDestructibleWall-02_BP.DoorWayDestructibleWall-02_BP_C.ExecuteUbergraph_DoorWayDestructibleWall-02_BP
// 0x00B0 (0x00B0 - 0x0000)
struct DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevel*                                 CallFunc_GetTransientLevel_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBDoorBlockerSkillItem*                K2Node_Event_doorBlocker;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_Event_pawn_2;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_Event_pawn_1;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_Event_pawn;                                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_Event_owner;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBDamageableComponent*                 K2Node_ComponentBoundEvent_DamageableComponent;    // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0050(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_blockedActor;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBDoor*                                K2Node_DynamicCast_AsRB_Door;                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADoorBlocker_Placement_BP_C*            CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP) == 0x000010, "Wrong alignment on DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP");
static_assert(sizeof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP) == 0x0000B0, "Wrong size on DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, EntryPoint) == 0x000000, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, CallFunc_GetTransientLevel_ReturnValue) == 0x000008, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::CallFunc_GetTransientLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, K2Node_Event_doorBlocker) == 0x000018, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::K2Node_Event_doorBlocker' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, K2Node_Event_pawn_2) == 0x000020, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::K2Node_Event_pawn_2' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, K2Node_Event_pawn_1) == 0x000028, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::K2Node_Event_pawn_1' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, K2Node_Event_pawn) == 0x000030, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::K2Node_Event_pawn' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, K2Node_Event_owner) == 0x000038, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::K2Node_Event_owner' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, K2Node_ComponentBoundEvent_DamageableComponent) == 0x000040, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::K2Node_ComponentBoundEvent_DamageableComponent' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, CallFunc_GetTransform_ReturnValue) == 0x000050, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, K2Node_Event_blockedActor) == 0x000080, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::K2Node_Event_blockedActor' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000088, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, K2Node_DynamicCast_AsRB_Door) == 0x000090, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::K2Node_DynamicCast_AsRB_Door' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A0, "Member 'DoorWayDestructibleWallMinus02_BP_C_ExecuteUbergraph_DoorWayDestructibleWallMinus02_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function DoorWayDestructibleWall-02_BP.DoorWayDestructibleWall-02_BP_C.GetBlockedActor
// 0x0008 (0x0008 - 0x0000)
struct DoorWayDestructibleWallMinus02_BP_C_GetBlockedActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorWayDestructibleWallMinus02_BP_C_GetBlockedActor) == 0x000008, "Wrong alignment on DoorWayDestructibleWallMinus02_BP_C_GetBlockedActor");
static_assert(sizeof(DoorWayDestructibleWallMinus02_BP_C_GetBlockedActor) == 0x000008, "Wrong size on DoorWayDestructibleWallMinus02_BP_C_GetBlockedActor");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_GetBlockedActor, ReturnValue) == 0x000000, "Member 'DoorWayDestructibleWallMinus02_BP_C_GetBlockedActor::ReturnValue' has a wrong offset!");

// Function DoorWayDestructibleWall-02_BP.DoorWayDestructibleWall-02_BP_C.ModulateBashDamage
// 0x0010 (0x0010 - 0x0000)
struct DoorWayDestructibleWallMinus02_BP_C_ModulateBashDamage final
{
public:
	const class ARBPawn*                          Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         In_damage;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Out_damage;                                        // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DoorWayDestructibleWallMinus02_BP_C_ModulateBashDamage) == 0x000008, "Wrong alignment on DoorWayDestructibleWallMinus02_BP_C_ModulateBashDamage");
static_assert(sizeof(DoorWayDestructibleWallMinus02_BP_C_ModulateBashDamage) == 0x000010, "Wrong size on DoorWayDestructibleWallMinus02_BP_C_ModulateBashDamage");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ModulateBashDamage, Pawn) == 0x000000, "Member 'DoorWayDestructibleWallMinus02_BP_C_ModulateBashDamage::Pawn' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ModulateBashDamage, In_damage) == 0x000008, "Member 'DoorWayDestructibleWallMinus02_BP_C_ModulateBashDamage::In_damage' has a wrong offset!");
static_assert(offsetof(DoorWayDestructibleWallMinus02_BP_C_ModulateBashDamage, Out_damage) == 0x00000C, "Member 'DoorWayDestructibleWallMinus02_BP_C_ModulateBashDamage::Out_damage' has a wrong offset!");

}

