#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DrugPasscodeBox_Base_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.PrepareState
// 0x0010 (0x0010 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_PrepareState final
{
public:
	bool                                          bStateA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RandomOwner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_PrepareState) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_PrepareState");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_PrepareState) == 0x000010, "Wrong size on DrugPasscodeBox_Base_BP_C_PrepareState");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_PrepareState, bStateA) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_PrepareState::bStateA' has a wrong offset!");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_PrepareState, RandomOwner) == 0x000008, "Member 'DrugPasscodeBox_Base_BP_C_PrepareState::RandomOwner' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.OnPostActorsPasted
// 0x0010 (0x0010 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_OnPostActorsPasted final
{
public:
	TArray<class AActor*>                         PastedActors;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_OnPostActorsPasted) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_OnPostActorsPasted");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_OnPostActorsPasted) == 0x000010, "Wrong size on DrugPasscodeBox_Base_BP_C_OnPostActorsPasted");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_OnPostActorsPasted, PastedActors) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_OnPostActorsPasted::PastedActors' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.PostDuplicated
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_PostDuplicated final
{
public:
	class AActor*                                 DuplicationParent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_PostDuplicated) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_PostDuplicated");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_PostDuplicated) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_PostDuplicated");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_PostDuplicated, DuplicationParent) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_PostDuplicated::DuplicationParent' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.PostEditChange
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_PostEditChange final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_PostEditChange) == 0x000004, "Wrong alignment on DrugPasscodeBox_Base_BP_C_PostEditChange");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_PostEditChange) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_PostEditChange");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_PostEditChange, PropertyName) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_PostEditChange::PropertyName' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.PostEditMove
// 0x0001 (0x0001 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_PostEditMove final
{
public:
	bool                                          bFinished;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_PostEditMove) == 0x000001, "Wrong alignment on DrugPasscodeBox_Base_BP_C_PostEditMove");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_PostEditMove) == 0x000001, "Wrong size on DrugPasscodeBox_Base_BP_C_PostEditMove");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_PostEditMove, bFinished) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_PostEditMove::bFinished' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.SetShouldBeIgnoredForLots
// 0x0001 (0x0001 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_SetShouldBeIgnoredForLots final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_SetShouldBeIgnoredForLots) == 0x000001, "Wrong alignment on DrugPasscodeBox_Base_BP_C_SetShouldBeIgnoredForLots");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_SetShouldBeIgnoredForLots) == 0x000001, "Wrong size on DrugPasscodeBox_Base_BP_C_SetShouldBeIgnoredForLots");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_SetShouldBeIgnoredForLots, bValue) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_SetShouldBeIgnoredForLots::bValue' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.SetState
// 0x0001 (0x0001 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_SetState final
{
public:
	bool                                          bStateA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_SetState) == 0x000001, "Wrong alignment on DrugPasscodeBox_Base_BP_C_SetState");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_SetState) == 0x000001, "Wrong size on DrugPasscodeBox_Base_BP_C_SetState");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_SetState, bStateA) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_SetState::bStateA' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 7_K2Node_ComponentBoundEvent_43_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_43_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_43_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_43_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_43_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_43_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_43_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_43_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 7_K2Node_ComponentBoundEvent_44_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_44_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_44_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_44_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_44_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_44_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_44_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_44_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 6_K2Node_ComponentBoundEvent_45_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_6_K2Node_ComponentBoundEvent_45_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_6_K2Node_ComponentBoundEvent_45_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_6_K2Node_ComponentBoundEvent_45_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_6_K2Node_ComponentBoundEvent_45_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_6_K2Node_ComponentBoundEvent_45_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_6_K2Node_ComponentBoundEvent_45_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_6_K2Node_ComponentBoundEvent_45_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 6_K2Node_ComponentBoundEvent_46_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_6_K2Node_ComponentBoundEvent_46_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_6_K2Node_ComponentBoundEvent_46_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_6_K2Node_ComponentBoundEvent_46_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_6_K2Node_ComponentBoundEvent_46_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_6_K2Node_ComponentBoundEvent_46_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_6_K2Node_ComponentBoundEvent_46_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_6_K2Node_ComponentBoundEvent_46_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 5_K2Node_ComponentBoundEvent_47_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_5_K2Node_ComponentBoundEvent_47_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_5_K2Node_ComponentBoundEvent_47_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_5_K2Node_ComponentBoundEvent_47_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_5_K2Node_ComponentBoundEvent_47_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_5_K2Node_ComponentBoundEvent_47_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_5_K2Node_ComponentBoundEvent_47_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_5_K2Node_ComponentBoundEvent_47_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 5_K2Node_ComponentBoundEvent_48_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_5_K2Node_ComponentBoundEvent_48_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_5_K2Node_ComponentBoundEvent_48_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_5_K2Node_ComponentBoundEvent_48_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_5_K2Node_ComponentBoundEvent_48_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_5_K2Node_ComponentBoundEvent_48_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_5_K2Node_ComponentBoundEvent_48_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_5_K2Node_ComponentBoundEvent_48_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 4_K2Node_ComponentBoundEvent_49_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_4_K2Node_ComponentBoundEvent_49_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_4_K2Node_ComponentBoundEvent_49_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_4_K2Node_ComponentBoundEvent_49_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_4_K2Node_ComponentBoundEvent_49_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_4_K2Node_ComponentBoundEvent_49_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_4_K2Node_ComponentBoundEvent_49_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_4_K2Node_ComponentBoundEvent_49_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 4_K2Node_ComponentBoundEvent_50_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_4_K2Node_ComponentBoundEvent_50_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_4_K2Node_ComponentBoundEvent_50_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_4_K2Node_ComponentBoundEvent_50_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_4_K2Node_ComponentBoundEvent_50_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_4_K2Node_ComponentBoundEvent_50_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_4_K2Node_ComponentBoundEvent_50_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_4_K2Node_ComponentBoundEvent_50_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 2_K2Node_ComponentBoundEvent_51_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_2_K2Node_ComponentBoundEvent_51_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_2_K2Node_ComponentBoundEvent_51_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_2_K2Node_ComponentBoundEvent_51_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_2_K2Node_ComponentBoundEvent_51_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_2_K2Node_ComponentBoundEvent_51_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_2_K2Node_ComponentBoundEvent_51_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_2_K2Node_ComponentBoundEvent_51_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 2_K2Node_ComponentBoundEvent_52_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_2_K2Node_ComponentBoundEvent_52_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_2_K2Node_ComponentBoundEvent_52_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_2_K2Node_ComponentBoundEvent_52_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_2_K2Node_ComponentBoundEvent_52_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_2_K2Node_ComponentBoundEvent_52_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_2_K2Node_ComponentBoundEvent_52_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_2_K2Node_ComponentBoundEvent_52_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_53_OnSimplePasscodePadValidation__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_53_OnSimplePasscodePadValidation__DelegateSignature final
{
public:
	class URBSimplePasscodePadComponent*          Pad;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bValid;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_53_OnSimplePasscodePadValidation__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_53_OnSimplePasscodePadValidation__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_53_OnSimplePasscodePadValidation__DelegateSignature) == 0x000010, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_53_OnSimplePasscodePadValidation__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_53_OnSimplePasscodePadValidation__DelegateSignature, Pad) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_53_OnSimplePasscodePadValidation__DelegateSignature::Pad' has a wrong offset!");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_53_OnSimplePasscodePadValidation__DelegateSignature, bValid) == 0x000008, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_53_OnSimplePasscodePadValidation__DelegateSignature::bValid' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_54_OnPanelEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_54_OnPanelEvent__DelegateSignature final
{
public:
	class URBInteractiblePanelComponent*          Panel;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                PawnInteracting;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_54_OnPanelEvent__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_54_OnPanelEvent__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_54_OnPanelEvent__DelegateSignature) == 0x000010, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_54_OnPanelEvent__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_54_OnPanelEvent__DelegateSignature, Panel) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_54_OnPanelEvent__DelegateSignature::Panel' has a wrong offset!");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_54_OnPanelEvent__DelegateSignature, PawnInteracting) == 0x000008, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_54_OnPanelEvent__DelegateSignature::PawnInteracting' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_55_OnSimplePasscodeEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_55_OnSimplePasscodeEvent__DelegateSignature final
{
public:
	class URBSimplePasscodePadComponent*          Pad;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_55_OnSimplePasscodeEvent__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_55_OnSimplePasscodeEvent__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_55_OnSimplePasscodeEvent__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_55_OnSimplePasscodeEvent__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_55_OnSimplePasscodeEvent__DelegateSignature, Pad) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_55_OnSimplePasscodeEvent__DelegateSignature::Pad' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.SetClue
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_SetClue final
{
public:
	struct FClueData                              ClueData;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_SetClue) == 0x000004, "Wrong alignment on DrugPasscodeBox_Base_BP_C_SetClue");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_SetClue) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_SetClue");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_SetClue, ClueData) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_SetClue::ClueData' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature final
{
public:
	class URBInteractionZoneComponent*            Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature) == 0x000008, "Wrong alignment on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature");
static_assert(sizeof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature) == 0x000008, "Wrong size on DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature");
static_assert(offsetof(DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature, Component) == 0x000000, "Member 'DrugPasscodeBox_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_SimplePasscodePad_InteractionComponent_BP_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature::Component' has a wrong offset!");

// Function DrugPasscodeBox_Base_BP.DrugPasscodeBox_Base_BP_C.ExecuteUbergraph_DrugPasscodeBox_Base_BP
// 0x0448 (0x0448 - 0x0000)
struct DrugPasscodeBox_Base_BP_C_ExecuteUbergraph_DrugPasscodeBox_Base_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue_1;                      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x002C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x003C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x004C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x005C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x006C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue_2;                      // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue_3;                      // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStateA_1;                            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_randomOwner;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_Event_pastedActors;                         // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 K2Node_Event_duplicationParent;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_propertyName;                         // 0x00B8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFinished;                            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x014C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bValue;                               // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStateA;                              // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
