#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElectricTrap_Container_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ElectricTrap_Container_BP.ElectricTrap_Container_BP_C
// 0x0020 (0x0358 - 0x0338)
class AElectricTrap_Container_BP_C final : public ARBContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   BatteryVisualizer;                                 // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     RBContainerSpawnLocation;                          // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBOutlineComponent*                    NULLL;                                             // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnSpawnedItemInfosChanged();
	void RefreshOutline();
	void ExecuteUbergraph_ElectricTrap_Container_BP(int32 EntryPoint);

	bool IsOpen() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ElectricTrap_Container_BP_C">();
	}
	static class AElectricTrap_Container_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AElectricTrap_Container_BP_C>();
	}
};
static_assert(alignof(AElectricTrap_Container_BP_C) == 0x000008, "Wrong alignment on AElectricTrap_Container_BP_C");
static_assert(sizeof(AElectricTrap_Container_BP_C) == 0x000358, "Wrong size on AElectricTrap_Container_BP_C");
static_assert(offsetof(AElectricTrap_Container_BP_C, UberGraphFrame) == 0x000338, "Member 'AElectricTrap_Container_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AElectricTrap_Container_BP_C, BatteryVisualizer) == 0x000340, "Member 'AElectricTrap_Container_BP_C::BatteryVisualizer' has a wrong offset!");
static_assert(offsetof(AElectricTrap_Container_BP_C, RBContainerSpawnLocation) == 0x000348, "Member 'AElectricTrap_Container_BP_C::RBContainerSpawnLocation' has a wrong offset!");
static_assert(offsetof(AElectricTrap_Container_BP_C, NULLL) == 0x000350, "Member 'AElectricTrap_Container_BP_C::NULLL' has a wrong offset!");

}

