#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ElectrifiedDoorTrapMinusRight_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function ElectrifiedDoorTrap-Right_BP.ElectrifiedDoorTrap-Right_BP_C.SpawnTrapDart
// 0x0050 (0x0050 - 0x0000)
struct ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0xE];                                        // 0x0002(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrapDart_BP_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart) == 0x000010, "Wrong alignment on ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart");
static_assert(sizeof(ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart) == 0x000050, "Wrong size on ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_SpawnTrapDart::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function ElectrifiedDoorTrap-Right_BP.ElectrifiedDoorTrap-Right_BP_C.OnRep_TrapProjectile
// 0x0001 (0x0001 - 0x0000)
struct ElectrifiedDoorTrapMinusRight_BP_C_OnRep_TrapProjectile final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ElectrifiedDoorTrapMinusRight_BP_C_OnRep_TrapProjectile) == 0x000001, "Wrong alignment on ElectrifiedDoorTrapMinusRight_BP_C_OnRep_TrapProjectile");
static_assert(sizeof(ElectrifiedDoorTrapMinusRight_BP_C_OnRep_TrapProjectile) == 0x000001, "Wrong size on ElectrifiedDoorTrapMinusRight_BP_C_OnRep_TrapProjectile");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_OnRep_TrapProjectile, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_OnRep_TrapProjectile::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ElectrifiedDoorTrap-Right_BP.ElectrifiedDoorTrap-Right_BP_C.BP_LinkTriggerTrap
// 0x0008 (0x0008 - 0x0000)
struct ElectrifiedDoorTrapMinusRight_BP_C_BP_LinkTriggerTrap final
{
public:
	class ARBWireTriggerTrap*                     TriggerTrap;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectrifiedDoorTrapMinusRight_BP_C_BP_LinkTriggerTrap) == 0x000008, "Wrong alignment on ElectrifiedDoorTrapMinusRight_BP_C_BP_LinkTriggerTrap");
static_assert(sizeof(ElectrifiedDoorTrapMinusRight_BP_C_BP_LinkTriggerTrap) == 0x000008, "Wrong size on ElectrifiedDoorTrapMinusRight_BP_C_BP_LinkTriggerTrap");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_BP_LinkTriggerTrap, TriggerTrap) == 0x000000, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_BP_LinkTriggerTrap::TriggerTrap' has a wrong offset!");

// Function ElectrifiedDoorTrap-Right_BP.ElectrifiedDoorTrap-Right_BP_C.OnDoorRepulsionScheduled
// 0x0008 (0x0008 - 0x0000)
struct ElectrifiedDoorTrapMinusRight_BP_C_OnDoorRepulsionScheduled final
{
public:
	class ARBDoor*                                Door;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectrifiedDoorTrapMinusRight_BP_C_OnDoorRepulsionScheduled) == 0x000008, "Wrong alignment on ElectrifiedDoorTrapMinusRight_BP_C_OnDoorRepulsionScheduled");
static_assert(sizeof(ElectrifiedDoorTrapMinusRight_BP_C_OnDoorRepulsionScheduled) == 0x000008, "Wrong size on ElectrifiedDoorTrapMinusRight_BP_C_OnDoorRepulsionScheduled");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_OnDoorRepulsionScheduled, Door) == 0x000000, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_OnDoorRepulsionScheduled::Door' has a wrong offset!");

// Function ElectrifiedDoorTrap-Right_BP.ElectrifiedDoorTrap-Right_BP_C.ExecuteUbergraph_ElectrifiedDoorTrap-Right_BP
// 0x00A0 (0x00A0 - 0x0000)
struct ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ARBDoor* Door)>          K2Node_CreateDelegate_OutputDelegate;              // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBWireTriggerTrap*                     K2Node_Event_triggerTrap;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBDoor*                                K2Node_CustomEvent_door;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldTriggerRepulsion_bWillTrigger;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                CallFunc_BP_IsTriggererOnWrongSide_outTriggerer;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsTriggererOnWrongSide_outIsOnWrongSide; // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP) == 0x000008, "Wrong alignment on ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP");
static_assert(sizeof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP) == 0x0000A0, "Wrong size on ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, EntryPoint) == 0x000000, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, Temp_delegate_Variable) == 0x000008, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, Temp_struct_Variable) == 0x000018, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, Temp_delegate_Variable_1) == 0x000028, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, Temp_struct_Variable_1) == 0x000038, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, CallFunc_GetActorForwardVector_ReturnValue) == 0x00004C, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, K2Node_CreateDelegate_OutputDelegate) == 0x00005C, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, K2Node_Event_triggerTrap) == 0x000070, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::K2Node_Event_triggerTrap' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, K2Node_CustomEvent_door) == 0x000078, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::K2Node_CustomEvent_door' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, CallFunc_ShouldTriggerRepulsion_bWillTrigger) == 0x000080, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::CallFunc_ShouldTriggerRepulsion_bWillTrigger' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, CallFunc_BooleanAND_ReturnValue) == 0x000081, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, CallFunc_PostAkEvent_ReturnValue) == 0x000084, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, CallFunc_BP_IsTriggererOnWrongSide_outTriggerer) == 0x000088, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::CallFunc_BP_IsTriggererOnWrongSide_outTriggerer' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, CallFunc_BP_IsTriggererOnWrongSide_outIsOnWrongSide) == 0x000090, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::CallFunc_BP_IsTriggererOnWrongSide_outIsOnWrongSide' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, CallFunc_PostAkEvent_ReturnValue_1) == 0x000094, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP, CallFunc_IsValid_ReturnValue_3) == 0x000098, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ExecuteUbergraph_ElectrifiedDoorTrapMinusRight_BP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function ElectrifiedDoorTrap-Right_BP.ElectrifiedDoorTrap-Right_BP_C.CanBeActivedInSpectra
// 0x0028 (0x0028 - 0x0000)
struct ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra final
{
public:
	const class ARBSpectraSkill*                  SpectraOwner;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRBSpectraSkillTarget> CallFunc_CanBeActivedInSpectra_self_CastInput;     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanBeActivedInSpectra_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra) == 0x000008, "Wrong alignment on ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra");
static_assert(sizeof(ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra) == 0x000028, "Wrong size on ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra, SpectraOwner) == 0x000000, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra::SpectraOwner' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra, ReturnValue) == 0x000008, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra::ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra, CallFunc_CanBeActivedInSpectra_self_CastInput) == 0x000010, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra::CallFunc_CanBeActivedInSpectra_self_CastInput' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra, CallFunc_CanBeActivedInSpectra_ReturnValue) == 0x000020, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra::CallFunc_CanBeActivedInSpectra_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_CanBeActivedInSpectra::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ElectrifiedDoorTrap-Right_BP.ElectrifiedDoorTrap-Right_BP_C.ShouldTriggerRepulsion
// 0x0048 (0x0048 - 0x0000)
struct ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion final
{
public:
	class ARBDoor*                                Door;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWillTrigger;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARBPawn*>                        CallFunc_BP_GetInteractorPawns_ReturnValue;        // 0x0010(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_DynamicCast_AsRB_Player;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WillPawnDisarmTrap_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WillPawnTriggerTrap_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion) == 0x000008, "Wrong alignment on ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion");
static_assert(sizeof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion) == 0x000048, "Wrong size on ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion, Door) == 0x000000, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion::Door' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion, bWillTrigger) == 0x000008, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion::bWillTrigger' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion, CallFunc_BP_GetInteractorPawns_ReturnValue) == 0x000010, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion::CallFunc_BP_GetInteractorPawns_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion, Temp_int_Array_Index_Variable) == 0x000020, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion, CallFunc_Array_Get_Item) == 0x000028, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion, K2Node_DynamicCast_AsRB_Player) == 0x000030, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion::K2Node_DynamicCast_AsRB_Player' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion, CallFunc_WillPawnDisarmTrap_ReturnValue) == 0x000040, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion::CallFunc_WillPawnDisarmTrap_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion, CallFunc_WillPawnTriggerTrap_ReturnValue) == 0x000041, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion::CallFunc_WillPawnTriggerTrap_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion, CallFunc_Less_IntInt_ReturnValue) == 0x000042, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_ShouldTriggerRepulsion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function ElectrifiedDoorTrap-Right_BP.ElectrifiedDoorTrap-Right_BP_C.IsCurrentlyTriggering
// 0x0001 (0x0001 - 0x0000)
struct ElectrifiedDoorTrapMinusRight_BP_C_IsCurrentlyTriggering final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ElectrifiedDoorTrapMinusRight_BP_C_IsCurrentlyTriggering) == 0x000001, "Wrong alignment on ElectrifiedDoorTrapMinusRight_BP_C_IsCurrentlyTriggering");
static_assert(sizeof(ElectrifiedDoorTrapMinusRight_BP_C_IsCurrentlyTriggering) == 0x000001, "Wrong size on ElectrifiedDoorTrapMinusRight_BP_C_IsCurrentlyTriggering");
static_assert(offsetof(ElectrifiedDoorTrapMinusRight_BP_C_IsCurrentlyTriggering, ReturnValue) == 0x000000, "Member 'ElectrifiedDoorTrapMinusRight_BP_C_IsCurrentlyTriggering::ReturnValue' has a wrong offset!");

}

