#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Enemy_Face_Scripted_Notify

#include "Basic.hpp"


namespace SDK::Params
{

// Function Enemy_Face_Scripted_Notify.Enemy_Face_Scripted_Notify_C.GetNotifyName
// 0x0010 (0x0010 - 0x0000)
struct Enemy_Face_Scripted_Notify_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Enemy_Face_Scripted_Notify_C_GetNotifyName) == 0x000008, "Wrong alignment on Enemy_Face_Scripted_Notify_C_GetNotifyName");
static_assert(sizeof(Enemy_Face_Scripted_Notify_C_GetNotifyName) == 0x000010, "Wrong size on Enemy_Face_Scripted_Notify_C_GetNotifyName");
static_assert(offsetof(Enemy_Face_Scripted_Notify_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'Enemy_Face_Scripted_Notify_C_GetNotifyName::ReturnValue' has a wrong offset!");

// Function Enemy_Face_Scripted_Notify.Enemy_Face_Scripted_Notify_C.Received_Notify
// 0x0018 (0x0018 - 0x0000)
struct Enemy_Face_Scripted_Notify_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FacialAnim_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Enemy_Face_Scripted_Notify_C_Received_Notify) == 0x000008, "Wrong alignment on Enemy_Face_Scripted_Notify_C_Received_Notify");
static_assert(sizeof(Enemy_Face_Scripted_Notify_C_Received_Notify) == 0x000018, "Wrong size on Enemy_Face_Scripted_Notify_C_Received_Notify");
static_assert(offsetof(Enemy_Face_Scripted_Notify_C_Received_Notify, MeshComp) == 0x000000, "Member 'Enemy_Face_Scripted_Notify_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Scripted_Notify_C_Received_Notify, Animation) == 0x000008, "Member 'Enemy_Face_Scripted_Notify_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Scripted_Notify_C_Received_Notify, ReturnValue) == 0x000010, "Member 'Enemy_Face_Scripted_Notify_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Scripted_Notify_C_Received_Notify, CallFunc_FacialAnim_ReturnValue) == 0x000011, "Member 'Enemy_Face_Scripted_Notify_C_Received_Notify::CallFunc_FacialAnim_ReturnValue' has a wrong offset!");

// Function Enemy_Face_Scripted_Notify.Enemy_Face_Scripted_Notify_C.FacialAnim
// 0x0040 (0x0040 - 0x0000)
struct Enemy_Face_Scripted_Notify_C_FacialAnim final
{
public:
	class USkeletalMeshComponent*                 Mesh_Comp;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNPC_BP_C*                            K2Node_DynamicCast_AsRB_NPC_BP;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnemyFace_AnimBlueprint_C*             CallFunc_GetFaceAnimBP_EnemyFaceAnimBP;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Enemy_Face_Scripted_Notify_C_FacialAnim) == 0x000008, "Wrong alignment on Enemy_Face_Scripted_Notify_C_FacialAnim");
static_assert(sizeof(Enemy_Face_Scripted_Notify_C_FacialAnim) == 0x000040, "Wrong size on Enemy_Face_Scripted_Notify_C_FacialAnim");
static_assert(offsetof(Enemy_Face_Scripted_Notify_C_FacialAnim, Mesh_Comp) == 0x000000, "Member 'Enemy_Face_Scripted_Notify_C_FacialAnim::Mesh_Comp' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Scripted_Notify_C_FacialAnim, ReturnValue) == 0x000008, "Member 'Enemy_Face_Scripted_Notify_C_FacialAnim::ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Scripted_Notify_C_FacialAnim, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'Enemy_Face_Scripted_Notify_C_FacialAnim::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Scripted_Notify_C_FacialAnim, K2Node_DynamicCast_AsRB_NPC_BP) == 0x000018, "Member 'Enemy_Face_Scripted_Notify_C_FacialAnim::K2Node_DynamicCast_AsRB_NPC_BP' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Scripted_Notify_C_FacialAnim, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Enemy_Face_Scripted_Notify_C_FacialAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Scripted_Notify_C_FacialAnim, CallFunc_GetFaceAnimBP_EnemyFaceAnimBP) == 0x000028, "Member 'Enemy_Face_Scripted_Notify_C_FacialAnim::CallFunc_GetFaceAnimBP_EnemyFaceAnimBP' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Scripted_Notify_C_FacialAnim, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue) == 0x000030, "Member 'Enemy_Face_Scripted_Notify_C_FacialAnim::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Face_Scripted_Notify_C_FacialAnim, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'Enemy_Face_Scripted_Notify_C_FacialAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

