#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExitStage_ObjCoord_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ExitStage_ObjCoord_BP.ExitStage_ObjCoord_BP_C.ExecuteUbergraph_ExitStage_ObjCoord_BP
// 0x0148 (0x0148 - 0x0000)
struct ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCompleted_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x000C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0040(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_1;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectiveCoordinatorState                    K2Node_Event_oldState;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectiveCoordinatorState                    K2Node_Event_newState;                             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExitStageObjectiveState                      K2Node_Event_objectiveState;                       // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetServerTime_ReturnValue;                // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetServerTime_ReturnValue_1;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_1;                      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBSAS*                                 CallFunc_GetCurrentSAS_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x00A8(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventGlobal_ReturnValue_2;            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x00C0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class ARBSASTransitionZone*                   CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_3;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue_1;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ARBNarrativeScreen>      CallFunc_Array_Get_Item_1;                         // 0x0100(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBNarrativeScreen*                     K2Node_DynamicCast_AsRB_Narrative_Screen;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP) == 0x000008, "Wrong alignment on ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP");
static_assert(sizeof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP) == 0x000148, "Wrong size on ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, EntryPoint) == 0x000000, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_IsCompleted_ReturnValue) == 0x000004, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_IsCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, Temp_delegate_Variable) == 0x00000C, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, Temp_delegate_Variable_1) == 0x000020, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_PostEventGlobal_ReturnValue) == 0x000034, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, Temp_delegate_Variable_2) == 0x000040, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_PostEventGlobal_ReturnValue_1) == 0x000050, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_PostEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, Temp_int_Array_Index_Variable_1) == 0x000054, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, K2Node_Event_oldState) == 0x000058, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::K2Node_Event_oldState' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, K2Node_Event_newState) == 0x000059, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::K2Node_Event_newState' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, K2Node_Event_EndPlayReason) == 0x00005A, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00005B, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00005C, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, K2Node_Event_objectiveState) == 0x00005D, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::K2Node_Event_objectiveState' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, K2Node_SwitchEnum_CmpSuccess) == 0x00005E, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, K2Node_Event_DeltaSeconds) == 0x000060, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_GetRBGameState_ReturnValue) == 0x000068, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_GetRBGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, K2Node_SwitchEnum_CmpSuccess_1) == 0x000070, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_GetServerTime_ReturnValue) == 0x000074, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_GetServerTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000078, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00007C, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_FCeil_ReturnValue) == 0x000080, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000084, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_GetServerTime_ReturnValue_1) == 0x000088, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_GetServerTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x00008C, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000090, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_FMax_ReturnValue) == 0x000094, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_FCeil_ReturnValue_1) == 0x000098, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_FCeil_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x00009C, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_GetCurrentSAS_ReturnValue) == 0x0000A0, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_GetCurrentSAS_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, Temp_delegate_Variable_3) == 0x0000A8, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_PostEventGlobal_ReturnValue_2) == 0x0000BC, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_PostEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, Temp_delegate_Variable_4) == 0x0000C0, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_PostEventGlobal_ReturnValue_3) == 0x0000D8, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_PostEventGlobal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_IsValid_ReturnValue_1) == 0x0000DC, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_PostEventOnActor_ReturnValue) == 0x0000E0, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_GetRBGameState_ReturnValue_1) == 0x0000F0, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_GetRBGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_IsValid_ReturnValue_2) == 0x0000F8, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_Array_Get_Item_1) == 0x000100, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000128, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_Array_Length_ReturnValue_1) == 0x000130, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, K2Node_DynamicCast_AsRB_Narrative_Screen) == 0x000138, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::K2Node_DynamicCast_AsRB_Narrative_Screen' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000141, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP, CallFunc_IsValid_ReturnValue_3) == 0x000142, "Member 'ExitStage_ObjCoord_BP_C_ExecuteUbergraph_ExitStage_ObjCoord_BP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function ExitStage_ObjCoord_BP.ExitStage_ObjCoord_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ExitStage_ObjCoord_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExitStage_ObjCoord_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on ExitStage_ObjCoord_BP_C_ReceiveTick");
static_assert(sizeof(ExitStage_ObjCoord_BP_C_ReceiveTick) == 0x000004, "Wrong size on ExitStage_ObjCoord_BP_C_ReceiveTick");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ExitStage_ObjCoord_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ExitStage_ObjCoord_BP.ExitStage_ObjCoord_BP_C.Event_OnExitStageObjectiveStateChanged
// 0x0001 (0x0001 - 0x0000)
struct ExitStage_ObjCoord_BP_C_Event_OnExitStageObjectiveStateChanged final
{
public:
	EExitStageObjectiveState                      ObjectiveState_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExitStage_ObjCoord_BP_C_Event_OnExitStageObjectiveStateChanged) == 0x000001, "Wrong alignment on ExitStage_ObjCoord_BP_C_Event_OnExitStageObjectiveStateChanged");
static_assert(sizeof(ExitStage_ObjCoord_BP_C_Event_OnExitStageObjectiveStateChanged) == 0x000001, "Wrong size on ExitStage_ObjCoord_BP_C_Event_OnExitStageObjectiveStateChanged");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_Event_OnExitStageObjectiveStateChanged, ObjectiveState_0) == 0x000000, "Member 'ExitStage_ObjCoord_BP_C_Event_OnExitStageObjectiveStateChanged::ObjectiveState_0' has a wrong offset!");

// Function ExitStage_ObjCoord_BP.ExitStage_ObjCoord_BP_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct ExitStage_ObjCoord_BP_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExitStage_ObjCoord_BP_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on ExitStage_ObjCoord_BP_C_ReceiveEndPlay");
static_assert(sizeof(ExitStage_ObjCoord_BP_C_ReceiveEndPlay) == 0x000001, "Wrong size on ExitStage_ObjCoord_BP_C_ReceiveEndPlay");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'ExitStage_ObjCoord_BP_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function ExitStage_ObjCoord_BP.ExitStage_ObjCoord_BP_C.Event_OnCoordinatorStateChanged
// 0x0002 (0x0002 - 0x0000)
struct ExitStage_ObjCoord_BP_C_Event_OnCoordinatorStateChanged final
{
public:
	EObjectiveCoordinatorState                    OldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EObjectiveCoordinatorState                    NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExitStage_ObjCoord_BP_C_Event_OnCoordinatorStateChanged) == 0x000001, "Wrong alignment on ExitStage_ObjCoord_BP_C_Event_OnCoordinatorStateChanged");
static_assert(sizeof(ExitStage_ObjCoord_BP_C_Event_OnCoordinatorStateChanged) == 0x000002, "Wrong size on ExitStage_ObjCoord_BP_C_Event_OnCoordinatorStateChanged");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_Event_OnCoordinatorStateChanged, OldState) == 0x000000, "Member 'ExitStage_ObjCoord_BP_C_Event_OnCoordinatorStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_Event_OnCoordinatorStateChanged, NewState) == 0x000001, "Member 'ExitStage_ObjCoord_BP_C_Event_OnCoordinatorStateChanged::NewState' has a wrong offset!");

// Function ExitStage_ObjCoord_BP.ExitStage_ObjCoord_BP_C.SetCountdownTime
// 0x0048 (0x0048 - 0x0000)
struct ExitStage_ObjCoord_BP_C_SetCountdownTime final
{
public:
	int32                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATvChannel_BP_C*                        K2Node_DynamicCast_AsTv_Channel_BP;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ConvertIntToTimeFormat_ReturnValue;       // 0x0028(0x0018)()
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExitStage_ObjCoord_BP_C_SetCountdownTime) == 0x000008, "Wrong alignment on ExitStage_ObjCoord_BP_C_SetCountdownTime");
static_assert(sizeof(ExitStage_ObjCoord_BP_C_SetCountdownTime) == 0x000048, "Wrong size on ExitStage_ObjCoord_BP_C_SetCountdownTime");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetCountdownTime, Time) == 0x000000, "Member 'ExitStage_ObjCoord_BP_C_SetCountdownTime::Time' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetCountdownTime, CallFunc_GetRBGameState_ReturnValue) == 0x000008, "Member 'ExitStage_ObjCoord_BP_C_SetCountdownTime::CallFunc_GetRBGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetCountdownTime, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ExitStage_ObjCoord_BP_C_SetCountdownTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetCountdownTime, CallFunc_Greater_IntInt_ReturnValue) == 0x000011, "Member 'ExitStage_ObjCoord_BP_C_SetCountdownTime::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetCountdownTime, K2Node_DynamicCast_AsTv_Channel_BP) == 0x000018, "Member 'ExitStage_ObjCoord_BP_C_SetCountdownTime::K2Node_DynamicCast_AsTv_Channel_BP' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetCountdownTime, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ExitStage_ObjCoord_BP_C_SetCountdownTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetCountdownTime, CallFunc_ConvertIntToTimeFormat_ReturnValue) == 0x000028, "Member 'ExitStage_ObjCoord_BP_C_SetCountdownTime::CallFunc_ConvertIntToTimeFormat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetCountdownTime, CallFunc_SelectFloat_ReturnValue) == 0x000040, "Member 'ExitStage_ObjCoord_BP_C_SetCountdownTime::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetCountdownTime, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000044, "Member 'ExitStage_ObjCoord_BP_C_SetCountdownTime::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function ExitStage_ObjCoord_BP.ExitStage_ObjCoord_BP_C.SetTrainArrivalTime
// 0x0020 (0x0020 - 0x0000)
struct ExitStage_ObjCoord_BP_C_SetTrainArrivalTime final
{
public:
	int32                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStageEnd_Button_BP_C*                  K2Node_DynamicCast_AsStage_End_Button_BP;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExitStage_ObjCoord_BP_C_SetTrainArrivalTime) == 0x000008, "Wrong alignment on ExitStage_ObjCoord_BP_C_SetTrainArrivalTime");
static_assert(sizeof(ExitStage_ObjCoord_BP_C_SetTrainArrivalTime) == 0x000020, "Wrong size on ExitStage_ObjCoord_BP_C_SetTrainArrivalTime");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetTrainArrivalTime, Time) == 0x000000, "Member 'ExitStage_ObjCoord_BP_C_SetTrainArrivalTime::Time' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetTrainArrivalTime, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'ExitStage_ObjCoord_BP_C_SetTrainArrivalTime::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetTrainArrivalTime, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'ExitStage_ObjCoord_BP_C_SetTrainArrivalTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetTrainArrivalTime, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000006, "Member 'ExitStage_ObjCoord_BP_C_SetTrainArrivalTime::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetTrainArrivalTime, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'ExitStage_ObjCoord_BP_C_SetTrainArrivalTime::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetTrainArrivalTime, K2Node_DynamicCast_AsStage_End_Button_BP) == 0x000010, "Member 'ExitStage_ObjCoord_BP_C_SetTrainArrivalTime::K2Node_DynamicCast_AsStage_End_Button_BP' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_SetTrainArrivalTime, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ExitStage_ObjCoord_BP_C_SetTrainArrivalTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ExitStage_ObjCoord_BP.ExitStage_ObjCoord_BP_C.PlayCountdownVO
// 0x0010 (0x0010 - 0x0000)
struct ExitStage_ObjCoord_BP_C_PlayCountdownVO final
{
public:
	class AActor*                                 CallFunc_GetNarrator_ClientOnly_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExitStage_ObjCoord_BP_C_PlayCountdownVO) == 0x000008, "Wrong alignment on ExitStage_ObjCoord_BP_C_PlayCountdownVO");
static_assert(sizeof(ExitStage_ObjCoord_BP_C_PlayCountdownVO) == 0x000010, "Wrong size on ExitStage_ObjCoord_BP_C_PlayCountdownVO");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_PlayCountdownVO, CallFunc_GetNarrator_ClientOnly_ReturnValue) == 0x000000, "Member 'ExitStage_ObjCoord_BP_C_PlayCountdownVO::CallFunc_GetNarrator_ClientOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExitStage_ObjCoord_BP_C_PlayCountdownVO, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'ExitStage_ObjCoord_BP_C_PlayCountdownVO::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
