#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExplosiveWireTrap_Base_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "ExplosiveWireTrap_AttachTypeEnum_structs.hpp"


namespace SDK::Params
{

// Function ExplosiveWireTrap_Base_BP.ExplosiveWireTrap_Base_BP_C.FixUp
// 0x0010 (0x0010 - 0x0000)
struct ExplosiveWireTrap_Base_BP_C_FixUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          bSomethingChanged;                                 // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue;      // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionResponse                            CallFunc_GetCollisionResponseToChannel_ReturnValue; // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ExplosiveWireTrap_Base_BP_C_FixUp) == 0x000004, "Wrong alignment on ExplosiveWireTrap_Base_BP_C_FixUp");
static_assert(sizeof(ExplosiveWireTrap_Base_BP_C_FixUp) == 0x000010, "Wrong size on ExplosiveWireTrap_Base_BP_C_FixUp");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_FixUp, ReturnValue) == 0x000000, "Member 'ExplosiveWireTrap_Base_BP_C_FixUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_FixUp, bSomethingChanged) == 0x000001, "Member 'ExplosiveWireTrap_Base_BP_C_FixUp::bSomethingChanged' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_FixUp, CallFunc_GetCollisionProfileName_ReturnValue) == 0x000004, "Member 'ExplosiveWireTrap_Base_BP_C_FixUp::CallFunc_GetCollisionProfileName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_FixUp, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000C, "Member 'ExplosiveWireTrap_Base_BP_C_FixUp::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_FixUp, CallFunc_GetCollisionResponseToChannel_ReturnValue) == 0x00000D, "Member 'ExplosiveWireTrap_Base_BP_C_FixUp::CallFunc_GetCollisionResponseToChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_FixUp, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00000E, "Member 'ExplosiveWireTrap_Base_BP_C_FixUp::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function ExplosiveWireTrap_Base_BP.ExplosiveWireTrap_Base_BP_C.RefreshEyesMaterial
// 0x0048 (0x0048 - 0x0000)
struct ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHackState                                    CallFunc_GetCurrentHackState_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial) == 0x000008, "Wrong alignment on ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial");
static_assert(sizeof(ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial) == 0x000048, "Wrong size on ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial, Temp_bool_Variable) == 0x000000, "Member 'ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial, Temp_object_Variable) == 0x000008, "Member 'ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial, Temp_object_Variable_1) == 0x000010, "Member 'ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial, K2Node_MakeStruct_LinearColor) == 0x000018, "Member 'ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial, CallFunc_GetCurrentHackState_ReturnValue) == 0x000028, "Member 'ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial::CallFunc_GetCurrentHackState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002A, "Member 'ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial, CallFunc_SelectFloat_ReturnValue) == 0x00002C, "Member 'ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial, K2Node_Select_Default) == 0x000030, "Member 'ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial, K2Node_MakeStruct_LinearColor_1) == 0x000038, "Member 'ExplosiveWireTrap_Base_BP_C_RefreshEyesMaterial::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");

// Function ExplosiveWireTrap_Base_BP.ExplosiveWireTrap_Base_BP_C.SetVisibilityIfExists
// 0x0030 (0x0030 - 0x0000)
struct ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists final
{
public:
	TArray<class USceneComponent*>                SceneComponent;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          bNewVisibility;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists) == 0x000008, "Wrong alignment on ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists");
static_assert(sizeof(ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists) == 0x000030, "Wrong size on ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists, SceneComponent) == 0x000000, "Member 'ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists::SceneComponent' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists, bNewVisibility) == 0x000010, "Member 'ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists::bNewVisibility' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists, Temp_int_Array_Index_Variable) == 0x000018, "Member 'ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists, CallFunc_Array_Get_Item) == 0x000020, "Member 'ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists, CallFunc_Less_IntInt_ReturnValue) == 0x000029, "Member 'ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'ExplosiveWireTrap_Base_BP_C_SetVisibilityIfExists::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function ExplosiveWireTrap_Base_BP.ExplosiveWireTrap_Base_BP_C.ConstructExplosionDecals
// 0x0734 (0x0734 - 0x0000)
struct ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals final
{
public:
	bool                                          OnGround;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue_1;               // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_2;           // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue_1;                // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00F4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_3;           // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue_1;              // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue_1;             // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x01DC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0264(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x02EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_4;           // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_5;           // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue_2;               // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue_3;               // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue_2;             // 0x03A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue_3;             // 0x03B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_5;       // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_6;       // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue_4;               // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x03EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_7;       // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x0414(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue_5;               // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0460(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x046C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_6;           // 0x0478(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0484(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x04A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x04B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_7;           // 0x04CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_2;     // 0x04E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x056C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0578(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_2;     // 0x0584(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X_5;                          // 0x060C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_5;                          // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_5;                          // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_5;                 // 0x0618(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_3;     // 0x0624(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_3;     // 0x06AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals) == 0x000004, "Wrong alignment on ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals");
static_assert(sizeof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals) == 0x000734, "Wrong size on ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, OnGround) == 0x000000, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::OnGround' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeVector_ReturnValue_1) == 0x000010, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_GetForwardVector_ReturnValue) == 0x00001C, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_GetForwardVector_ReturnValue_1) == 0x000028, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeRotFromX_ReturnValue) == 0x000034, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeRotFromX_ReturnValue_1) == 0x000040, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeRotFromX_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakRotator_Roll) == 0x00004C, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakRotator_Pitch) == 0x000050, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakRotator_Yaw) == 0x000054, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakRotator_Roll_1) == 0x000058, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakRotator_Pitch_1) == 0x00005C, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakRotator_Yaw_1) == 0x000060, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeRotator_ReturnValue) == 0x000064, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeRotator_ReturnValue_1) == 0x000070, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_GetUpVector_ReturnValue) == 0x00007C, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_GetForwardVector_ReturnValue_2) == 0x000088, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_GetForwardVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000094, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeRotFromXZ_ReturnValue) == 0x0000A0, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeRotFromXZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000AC, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_GetRightVector_ReturnValue) == 0x0000B8, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C4, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000D0, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000DC, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_GetUpVector_ReturnValue_1) == 0x0000E8, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_GetUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000F4, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x00017C, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_GetForwardVector_ReturnValue_3) == 0x000188, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_GetForwardVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000194, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeRotFromXZ_ReturnValue_1) == 0x0001A0, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeRotFromXZ_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0001AC, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_GetRightVector_ReturnValue_1) == 0x0001B8, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_GetRightVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x0001C4, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Add_VectorVector_ReturnValue_3) == 0x0001D0, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0001DC, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x000264, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x0002EC, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_GetForwardVector_ReturnValue_4) == 0x000374, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_GetForwardVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_GetForwardVector_ReturnValue_5) == 0x000380, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_GetForwardVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeRotFromX_ReturnValue_2) == 0x00038C, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeRotFromX_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeRotFromX_ReturnValue_3) == 0x000398, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeRotFromX_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_GetRightVector_ReturnValue_2) == 0x0003A4, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_GetRightVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_GetRightVector_ReturnValue_3) == 0x0003B0, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_GetRightVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x0003BC, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Multiply_VectorFloat_ReturnValue_5) == 0x0003C8, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Multiply_VectorFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Multiply_VectorFloat_ReturnValue_6) == 0x0003D4, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Multiply_VectorFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeRotFromX_ReturnValue_4) == 0x0003E0, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeRotFromX_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Add_VectorVector_ReturnValue_4) == 0x0003EC, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakRotator_Roll_2) == 0x0003F8, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakRotator_Pitch_2) == 0x0003FC, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakRotator_Yaw_2) == 0x000400, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Multiply_VectorFloat_ReturnValue_7) == 0x000404, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Multiply_VectorFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Add_FloatFloat_ReturnValue) == 0x000410, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Add_VectorVector_ReturnValue_5) == 0x000414, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Add_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeRotator_ReturnValue_2) == 0x000420, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeRotFromX_ReturnValue_5) == 0x00042C, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeRotFromX_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000438, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakRotator_Roll_3) == 0x000444, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakRotator_Pitch_3) == 0x000448, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakRotator_Yaw_3) == 0x00044C, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_X) == 0x000450, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_Y) == 0x000454, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_Z) == 0x000458, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00045C, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeVector_ReturnValue_2) == 0x000460, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeRotator_ReturnValue_3) == 0x00046C, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Add_VectorVector_ReturnValue_6) == 0x000478, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Add_VectorVector_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_K2_GetComponentLocation_ReturnValue_3) == 0x000484, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_K2_GetComponentLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_X_1) == 0x000490, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_Y_1) == 0x000494, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_Z_1) == 0x000498, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_X_2) == 0x00049C, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_Y_2) == 0x0004A0, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_Z_2) == 0x0004A4, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0004A8, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeVector_ReturnValue_3) == 0x0004B4, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_X_3) == 0x0004C0, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_Y_3) == 0x0004C4, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_Z_3) == 0x0004C8, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_Add_VectorVector_ReturnValue_7) == 0x0004CC, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_Add_VectorVector_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_X_4) == 0x0004D8, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_Y_4) == 0x0004DC, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_Z_4) == 0x0004E0, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_K2_SetWorldRotation_SweepHitResult_2) == 0x0004E4, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_K2_SetWorldRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeVector_ReturnValue_4) == 0x00056C, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000578, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_K2_SetWorldLocation_SweepHitResult_2) == 0x000584, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_K2_SetWorldLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_X_5) == 0x00060C, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_X_5' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_Y_5) == 0x000610, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_Y_5' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_BreakVector_Z_5) == 0x000614, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_BreakVector_Z_5' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_MakeVector_ReturnValue_5) == 0x000618, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_MakeVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_K2_SetWorldRotation_SweepHitResult_3) == 0x000624, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_K2_SetWorldRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals, CallFunc_K2_SetWorldLocation_SweepHitResult_3) == 0x0006AC, "Member 'ExplosiveWireTrap_Base_BP_C_ConstructExplosionDecals::CallFunc_K2_SetWorldLocation_SweepHitResult_3' has a wrong offset!");

// Function ExplosiveWireTrap_Base_BP.ExplosiveWireTrap_Base_BP_C.SnapSideBToGround
// 0x02C0 (0x02C0 - 0x0000)
struct ExplosiveWireTrap_Base_BP_C_SnapSideBToGround final
{
public:
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0000(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_GetOffsetFromGroundBasedOnBracket_Offset; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0050(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0144(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CF[0x1];                                      // 0x01CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
