#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExplosiveWireTrap_CrouchHeight_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ExplosiveWireTrap_CrouchHeight_BP.ExplosiveWireTrap_CrouchHeight_BP_C.ConstructCrouchUnderClearance
// 0x0180 (0x0180 - 0x0000)
struct ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance final
{
public:
	float                                         CrouchUnderTopOffset;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CrouchUnderClearanceHalfHeight;                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue;           // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance) == 0x000010, "Wrong alignment on ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance");
static_assert(sizeof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance) == 0x000180, "Wrong size on ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CrouchUnderTopOffset) == 0x000000, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CrouchUnderTopOffset' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CrouchUnderClearanceHalfHeight) == 0x000004, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CrouchUnderClearanceHalfHeight' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_BreakVector_X) == 0x000040, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_BreakVector_Y) == 0x000044, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_BreakVector_Z) == 0x000048, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_BreakTransform_Location) == 0x00004C, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_BreakTransform_Rotation) == 0x000058, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_BreakTransform_Scale) == 0x000064, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000070, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_BreakVector_X_1) == 0x000074, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_BreakVector_Y_1) == 0x000078, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_BreakVector_Z_1) == 0x00007C, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_MakeVector_ReturnValue) == 0x000080, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_GetScaledBoxExtent_ReturnValue) == 0x00008C, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_GetScaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_BreakVector_X_2) == 0x000098, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_BreakVector_Y_2) == 0x00009C, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_BreakVector_Z_2) == 0x0000A0, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000A4, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000A8, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x0000AC, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_MakeVector_ReturnValue_1) == 0x0000B0, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0000F0, "Member 'ExplosiveWireTrap_CrouchHeight_BP_C_ConstructCrouchUnderClearance::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

}

