#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExtraRewardWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ExtraRewardWidget.ExtraRewardWidget_C.PlayNewRewardAnimation
// 0x0008 (0x0008 - 0x0000)
struct ExtraRewardWidget_C_PlayNewRewardAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ExtraRewardWidget_C_PlayNewRewardAnimation) == 0x000008, "Wrong alignment on ExtraRewardWidget_C_PlayNewRewardAnimation");
static_assert(sizeof(ExtraRewardWidget_C_PlayNewRewardAnimation) == 0x000008, "Wrong size on ExtraRewardWidget_C_PlayNewRewardAnimation");
static_assert(offsetof(ExtraRewardWidget_C_PlayNewRewardAnimation, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'ExtraRewardWidget_C_PlayNewRewardAnimation::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function ExtraRewardWidget.ExtraRewardWidget_C.Setup
// 0x0088 (0x0088 - 0x0000)
struct ExtraRewardWidget_C_Setup final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0018)()
};
static_assert(alignof(ExtraRewardWidget_C_Setup) == 0x000008, "Wrong alignment on ExtraRewardWidget_C_Setup");
static_assert(sizeof(ExtraRewardWidget_C_Setup) == 0x000088, "Wrong size on ExtraRewardWidget_C_Setup");
static_assert(offsetof(ExtraRewardWidget_C_Setup, Amount) == 0x000000, "Member 'ExtraRewardWidget_C_Setup::Amount' has a wrong offset!");
static_assert(offsetof(ExtraRewardWidget_C_Setup, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'ExtraRewardWidget_C_Setup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ExtraRewardWidget_C_Setup, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'ExtraRewardWidget_C_Setup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ExtraRewardWidget_C_Setup, K2Node_MakeArray_Array) == 0x000060, "Member 'ExtraRewardWidget_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ExtraRewardWidget_C_Setup, CallFunc_Format_ReturnValue) == 0x000070, "Member 'ExtraRewardWidget_C_Setup::CallFunc_Format_ReturnValue' has a wrong offset!");

}

