#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Face_Emote_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Face_Emote_AnimBP.Face_Emote_AnimBP_C.ExecuteUbergraph_Face_Emote_AnimBP
// 0x0098 (0x0098 - 0x0000)
struct Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_DynamicCast_AsAnim_Sequence;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMenuCharacter_C*                       K2Node_DynamicCast_AsMenu_Character;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPoseAsset*                             CallFunc_GetFacePoseAsset_FacePoseAsset;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AnimStyle;                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBEmoteCustomizationOption*            K2Node_CustomEvent_EmoteCustomizationOption;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPreview;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_TerminalAnimOffset;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PodiumAnimDelay;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP) == 0x000008, "Wrong alignment on Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP");
static_assert(sizeof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP) == 0x000098, "Wrong size on Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, EntryPoint) == 0x000000, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, Temp_float_Variable) == 0x000004, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, Temp_bool_Variable) == 0x000008, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, Temp_object_Variable) == 0x000010, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, K2Node_CustomEvent_Loaded) == 0x000018, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, K2Node_DynamicCast_AsAnim_Sequence) == 0x000020, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::K2Node_DynamicCast_AsAnim_Sequence' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000029, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, K2Node_Event_DeltaTimeX) == 0x00003C, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, CallFunc_GetOwningActor_ReturnValue) == 0x000040, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, K2Node_DynamicCast_AsMenu_Character) == 0x000050, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::K2Node_DynamicCast_AsMenu_Character' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, CallFunc_GetFacePoseAsset_FacePoseAsset) == 0x000060, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::CallFunc_GetFacePoseAsset_FacePoseAsset' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, K2Node_CustomEvent_AnimStyle) == 0x000068, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::K2Node_CustomEvent_AnimStyle' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, K2Node_CustomEvent_EmoteCustomizationOption) == 0x000070, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::K2Node_CustomEvent_EmoteCustomizationOption' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, K2Node_CustomEvent_bIsPreview) == 0x000078, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::K2Node_CustomEvent_bIsPreview' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, K2Node_CustomEvent_TerminalAnimOffset) == 0x00007C, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::K2Node_CustomEvent_TerminalAnimOffset' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, K2Node_CustomEvent_PodiumAnimDelay) == 0x000080, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::K2Node_CustomEvent_PodiumAnimDelay' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, K2Node_Select_Default) == 0x000084, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, CallFunc_IsValid_ReturnValue_1) == 0x000088, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000089, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00008A, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, CallFunc_IsValid_ReturnValue_2) == 0x00008B, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, Temp_bool_Variable_1) == 0x00008C, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x00008D, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, Temp_float_Variable_1) == 0x000090, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP, K2Node_Select_Default_1) == 0x000094, "Member 'Face_Emote_AnimBP_C_ExecuteUbergraph_Face_Emote_AnimBP::K2Node_Select_Default_1' has a wrong offset!");

// Function Face_Emote_AnimBP.Face_Emote_AnimBP_C.Update Emote
// 0x0020 (0x0020 - 0x0000)
struct Face_Emote_AnimBP_C_Update_Emote final
{
public:
	int32                                         AnimStyle;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBEmoteCustomizationOption*            EmoteCustomizationOption;                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPreview_0;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TerminalAnimOffset_0;                              // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PodiumAnimDelay_0;                                 // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Face_Emote_AnimBP_C_Update_Emote) == 0x000008, "Wrong alignment on Face_Emote_AnimBP_C_Update_Emote");
static_assert(sizeof(Face_Emote_AnimBP_C_Update_Emote) == 0x000020, "Wrong size on Face_Emote_AnimBP_C_Update_Emote");
static_assert(offsetof(Face_Emote_AnimBP_C_Update_Emote, AnimStyle) == 0x000000, "Member 'Face_Emote_AnimBP_C_Update_Emote::AnimStyle' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_Update_Emote, EmoteCustomizationOption) == 0x000008, "Member 'Face_Emote_AnimBP_C_Update_Emote::EmoteCustomizationOption' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_Update_Emote, bIsPreview_0) == 0x000010, "Member 'Face_Emote_AnimBP_C_Update_Emote::bIsPreview_0' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_Update_Emote, TerminalAnimOffset_0) == 0x000014, "Member 'Face_Emote_AnimBP_C_Update_Emote::TerminalAnimOffset_0' has a wrong offset!");
static_assert(offsetof(Face_Emote_AnimBP_C_Update_Emote, PodiumAnimDelay_0) == 0x000018, "Member 'Face_Emote_AnimBP_C_Update_Emote::PodiumAnimDelay_0' has a wrong offset!");

// Function Face_Emote_AnimBP.Face_Emote_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Face_Emote_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Face_Emote_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Face_Emote_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(Face_Emote_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Face_Emote_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(Face_Emote_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Face_Emote_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Face_Emote_AnimBP.Face_Emote_AnimBP_C.OnLoaded_44DF0A4E49029115DE354787555967A8
// 0x0008 (0x0008 - 0x0000)
struct Face_Emote_AnimBP_C_OnLoaded_44DF0A4E49029115DE354787555967A8 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Face_Emote_AnimBP_C_OnLoaded_44DF0A4E49029115DE354787555967A8) == 0x000008, "Wrong alignment on Face_Emote_AnimBP_C_OnLoaded_44DF0A4E49029115DE354787555967A8");
static_assert(sizeof(Face_Emote_AnimBP_C_OnLoaded_44DF0A4E49029115DE354787555967A8) == 0x000008, "Wrong size on Face_Emote_AnimBP_C_OnLoaded_44DF0A4E49029115DE354787555967A8");
static_assert(offsetof(Face_Emote_AnimBP_C_OnLoaded_44DF0A4E49029115DE354787555967A8, Loaded) == 0x000000, "Member 'Face_Emote_AnimBP_C_OnLoaded_44DF0A4E49029115DE354787555967A8::Loaded' has a wrong offset!");

// Function Face_Emote_AnimBP.Face_Emote_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Face_Emote_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Face_Emote_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on Face_Emote_AnimBP_C_AnimGraph");
static_assert(sizeof(Face_Emote_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on Face_Emote_AnimBP_C_AnimGraph");
static_assert(offsetof(Face_Emote_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Face_Emote_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

