#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FluorescentLightSwitcherBaseMinus01

#include "Basic.hpp"


namespace SDK::Params
{

// Function FluorescentLightSwitcherBase-01.FluorescentLightSwitcherBase-01_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct FluorescentLightSwitcherBaseMinus01_C_UserConstructionScript final
{
public:
	int32                                         NumTubes;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewLumens;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewLength;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            NewStaticMesh;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FluorescentLightSwitcherBaseMinus01_C_UserConstructionScript) == 0x000008, "Wrong alignment on FluorescentLightSwitcherBaseMinus01_C_UserConstructionScript");
static_assert(sizeof(FluorescentLightSwitcherBaseMinus01_C_UserConstructionScript) == 0x000018, "Wrong size on FluorescentLightSwitcherBaseMinus01_C_UserConstructionScript");
static_assert(offsetof(FluorescentLightSwitcherBaseMinus01_C_UserConstructionScript, NumTubes) == 0x000000, "Member 'FluorescentLightSwitcherBaseMinus01_C_UserConstructionScript::NumTubes' has a wrong offset!");
static_assert(offsetof(FluorescentLightSwitcherBaseMinus01_C_UserConstructionScript, NewLumens) == 0x000004, "Member 'FluorescentLightSwitcherBaseMinus01_C_UserConstructionScript::NewLumens' has a wrong offset!");
static_assert(offsetof(FluorescentLightSwitcherBaseMinus01_C_UserConstructionScript, NewLength) == 0x000008, "Member 'FluorescentLightSwitcherBaseMinus01_C_UserConstructionScript::NewLength' has a wrong offset!");
static_assert(offsetof(FluorescentLightSwitcherBaseMinus01_C_UserConstructionScript, NewStaticMesh) == 0x000010, "Member 'FluorescentLightSwitcherBaseMinus01_C_UserConstructionScript::NewStaticMesh' has a wrong offset!");

}

