#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendlyDeviceIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FriendlyDeviceIcon.FriendlyDeviceIcon_C
// 0x0018 (0x0350 - 0x0338)
class UFriendlyDeviceIcon_C final : public URBHUDFriendlyDeviceIconWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FriendlyDeviceIcon(int32 EntryPoint);
	void Event_Show();
	void Event_Hide();
	void Event_DrawHudUpdate(const struct FRBWorldIconUpdateContext& UpdateContext);

	bool ShouldShow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FriendlyDeviceIcon_C">();
	}
	static class UFriendlyDeviceIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFriendlyDeviceIcon_C>();
	}
};
static_assert(alignof(UFriendlyDeviceIcon_C) == 0x000008, "Wrong alignment on UFriendlyDeviceIcon_C");
static_assert(sizeof(UFriendlyDeviceIcon_C) == 0x000350, "Wrong size on UFriendlyDeviceIcon_C");
static_assert(offsetof(UFriendlyDeviceIcon_C, UberGraphFrame) == 0x000338, "Member 'UFriendlyDeviceIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFriendlyDeviceIcon_C, FadeIn) == 0x000340, "Member 'UFriendlyDeviceIcon_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UFriendlyDeviceIcon_C, Icon) == 0x000348, "Member 'UFriendlyDeviceIcon_C::Icon' has a wrong offset!");

}

