#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FuttermanOwner_Interface_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function FuttermanOwner_Interface_BP.FuttermanOwner_Interface_BP_C.SetFuttermanDrillValue
// 0x0003 (0x0003 - 0x0000)
struct FuttermanOwner_Interface_BP_C_SetFuttermanDrillValue final
{
public:
	bool                                          DrillValue;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DrillManual;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Success;                                           // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FuttermanOwner_Interface_BP_C_SetFuttermanDrillValue) == 0x000001, "Wrong alignment on FuttermanOwner_Interface_BP_C_SetFuttermanDrillValue");
static_assert(sizeof(FuttermanOwner_Interface_BP_C_SetFuttermanDrillValue) == 0x000003, "Wrong size on FuttermanOwner_Interface_BP_C_SetFuttermanDrillValue");
static_assert(offsetof(FuttermanOwner_Interface_BP_C_SetFuttermanDrillValue, DrillValue) == 0x000000, "Member 'FuttermanOwner_Interface_BP_C_SetFuttermanDrillValue::DrillValue' has a wrong offset!");
static_assert(offsetof(FuttermanOwner_Interface_BP_C_SetFuttermanDrillValue, DrillManual) == 0x000001, "Member 'FuttermanOwner_Interface_BP_C_SetFuttermanDrillValue::DrillManual' has a wrong offset!");
static_assert(offsetof(FuttermanOwner_Interface_BP_C_SetFuttermanDrillValue, Success) == 0x000002, "Member 'FuttermanOwner_Interface_BP_C_SetFuttermanDrillValue::Success' has a wrong offset!");

}

