#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GlobalFunctions

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function GlobalFunctions.GlobalFunctions_C.GetActorsDistance2D
// 0x0048 (0x0048 - 0x0000)
struct GlobalFunctions_C_GetActorsDistance2D final
{
public:
	class AActor*                                 Actor1;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor2;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeXY_ReturnValue;                      // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GlobalFunctions_C_GetActorsDistance2D) == 0x000008, "Wrong alignment on GlobalFunctions_C_GetActorsDistance2D");
static_assert(sizeof(GlobalFunctions_C_GetActorsDistance2D) == 0x000048, "Wrong size on GlobalFunctions_C_GetActorsDistance2D");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance2D, Actor1) == 0x000000, "Member 'GlobalFunctions_C_GetActorsDistance2D::Actor1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance2D, Actor2) == 0x000008, "Member 'GlobalFunctions_C_GetActorsDistance2D::Actor2' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance2D, __WorldContext) == 0x000010, "Member 'GlobalFunctions_C_GetActorsDistance2D::__WorldContext' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance2D, Distance) == 0x000018, "Member 'GlobalFunctions_C_GetActorsDistance2D::Distance' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance2D, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'GlobalFunctions_C_GetActorsDistance2D::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance2D, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'GlobalFunctions_C_GetActorsDistance2D::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance2D, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000034, "Member 'GlobalFunctions_C_GetActorsDistance2D::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance2D, CallFunc_VSizeXY_ReturnValue) == 0x000040, "Member 'GlobalFunctions_C_GetActorsDistance2D::CallFunc_VSizeXY_ReturnValue' has a wrong offset!");

// Function GlobalFunctions.GlobalFunctions_C.GetActorsWithinConeAngle
// 0x00B8 (0x00B8 - 0x0000)
struct GlobalFunctions_C_GetActorsWithinConeAngle final
{
public:
	TArray<class AActor*>                         Targets;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AActor*                                 Source;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Actors;                                            // 0x0028(0x0010)(Parm, OutParm)
	TArray<class AActor*>                         ActorsWithinConeAngle;                             // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GlobalFunctions_C_GetActorsWithinConeAngle) == 0x000008, "Wrong alignment on GlobalFunctions_C_GetActorsWithinConeAngle");
static_assert(sizeof(GlobalFunctions_C_GetActorsWithinConeAngle) == 0x0000B8, "Wrong size on GlobalFunctions_C_GetActorsWithinConeAngle");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, Targets) == 0x000000, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::Targets' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, Source) == 0x000010, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::Source' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, Angle) == 0x000018, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::Angle' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, __WorldContext) == 0x000020, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::__WorldContext' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, Actors) == 0x000028, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::Actors' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, ActorsWithinConeAngle) == 0x000038, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::ActorsWithinConeAngle' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, CallFunc_GetActorForwardVector_ReturnValue) == 0x000048, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000054, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, Temp_int_Array_Index_Variable) == 0x000064, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, CallFunc_Array_Get_Item) == 0x000070, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000078, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000088, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, CallFunc_Normal_ReturnValue) == 0x000094, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000A4, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, CallFunc_MapRangeClamped_ReturnValue) == 0x0000A8, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000AC, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinConeAngle, CallFunc_Array_Add_ReturnValue) == 0x0000B0, "Member 'GlobalFunctions_C_GetActorsWithinConeAngle::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function GlobalFunctions.GlobalFunctions_C.GetActorsWithinRadius
// 0x0098 (0x0098 - 0x0000)
struct GlobalFunctions_C_GetActorsWithinRadius final
{
public:
	TArray<class AActor*>                         Targets;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AActor*                                 Source;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Actors;                                            // 0x0028(0x0010)(Parm, OutParm)
	TArray<class AActor*>                         WithinRangeActor;                                  // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GlobalFunctions_C_GetActorsWithinRadius) == 0x000008, "Wrong alignment on GlobalFunctions_C_GetActorsWithinRadius");
static_assert(sizeof(GlobalFunctions_C_GetActorsWithinRadius) == 0x000098, "Wrong size on GlobalFunctions_C_GetActorsWithinRadius");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, Targets) == 0x000000, "Member 'GlobalFunctions_C_GetActorsWithinRadius::Targets' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, Source) == 0x000010, "Member 'GlobalFunctions_C_GetActorsWithinRadius::Source' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, Radius) == 0x000018, "Member 'GlobalFunctions_C_GetActorsWithinRadius::Radius' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, __WorldContext) == 0x000020, "Member 'GlobalFunctions_C_GetActorsWithinRadius::__WorldContext' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, Actors) == 0x000028, "Member 'GlobalFunctions_C_GetActorsWithinRadius::Actors' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, WithinRangeActor) == 0x000038, "Member 'GlobalFunctions_C_GetActorsWithinRadius::WithinRangeActor' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'GlobalFunctions_C_GetActorsWithinRadius::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'GlobalFunctions_C_GetActorsWithinRadius::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, Temp_int_Array_Index_Variable) == 0x000058, "Member 'GlobalFunctions_C_GetActorsWithinRadius::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'GlobalFunctions_C_GetActorsWithinRadius::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, CallFunc_Array_Get_Item) == 0x000060, "Member 'GlobalFunctions_C_GetActorsWithinRadius::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'GlobalFunctions_C_GetActorsWithinRadius::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'GlobalFunctions_C_GetActorsWithinRadius::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000078, "Member 'GlobalFunctions_C_GetActorsWithinRadius::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, CallFunc_VSize_ReturnValue) == 0x000084, "Member 'GlobalFunctions_C_GetActorsWithinRadius::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, CallFunc_Add_IntInt_ReturnValue) == 0x000088, "Member 'GlobalFunctions_C_GetActorsWithinRadius::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00008C, "Member 'GlobalFunctions_C_GetActorsWithinRadius::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsWithinRadius, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'GlobalFunctions_C_GetActorsWithinRadius::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function GlobalFunctions.GlobalFunctions_C.GetClosestActor
// 0x0060 (0x0060 - 0x0000)
struct GlobalFunctions_C_GetClosestActor final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         TargetActors;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bFarthest;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ClosestActor;                                      // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CurrentClosestActor;                               // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentDistance;                                   // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActorsDistance3D_Distance;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GlobalFunctions_C_GetClosestActor) == 0x000008, "Wrong alignment on GlobalFunctions_C_GetClosestActor");
static_assert(sizeof(GlobalFunctions_C_GetClosestActor) == 0x000060, "Wrong size on GlobalFunctions_C_GetClosestActor");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, SourceActor) == 0x000000, "Member 'GlobalFunctions_C_GetClosestActor::SourceActor' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, TargetActors) == 0x000008, "Member 'GlobalFunctions_C_GetClosestActor::TargetActors' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, bFarthest) == 0x000018, "Member 'GlobalFunctions_C_GetClosestActor::bFarthest' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, __WorldContext) == 0x000020, "Member 'GlobalFunctions_C_GetClosestActor::__WorldContext' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, ClosestActor) == 0x000028, "Member 'GlobalFunctions_C_GetClosestActor::ClosestActor' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, CurrentClosestActor) == 0x000030, "Member 'GlobalFunctions_C_GetClosestActor::CurrentClosestActor' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, CurrentDistance) == 0x000038, "Member 'GlobalFunctions_C_GetClosestActor::CurrentDistance' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'GlobalFunctions_C_GetClosestActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, Temp_int_Array_Index_Variable) == 0x000040, "Member 'GlobalFunctions_C_GetClosestActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'GlobalFunctions_C_GetClosestActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, CallFunc_Array_Get_Item) == 0x000048, "Member 'GlobalFunctions_C_GetClosestActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, CallFunc_GetActorsDistance3D_Distance) == 0x000050, "Member 'GlobalFunctions_C_GetClosestActor::CallFunc_GetActorsDistance3D_Distance' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'GlobalFunctions_C_GetClosestActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'GlobalFunctions_C_GetClosestActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00005C, "Member 'GlobalFunctions_C_GetClosestActor::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetClosestActor, CallFunc_Less_FloatFloat_ReturnValue) == 0x00005D, "Member 'GlobalFunctions_C_GetClosestActor::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function GlobalFunctions.GlobalFunctions_C.GetActorsDistance3D
// 0x0048 (0x0048 - 0x0000)
struct GlobalFunctions_C_GetActorsDistance3D final
{
public:
	class AActor*                                 Actor1;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor2;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GlobalFunctions_C_GetActorsDistance3D) == 0x000008, "Wrong alignment on GlobalFunctions_C_GetActorsDistance3D");
static_assert(sizeof(GlobalFunctions_C_GetActorsDistance3D) == 0x000048, "Wrong size on GlobalFunctions_C_GetActorsDistance3D");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance3D, Actor1) == 0x000000, "Member 'GlobalFunctions_C_GetActorsDistance3D::Actor1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance3D, Actor2) == 0x000008, "Member 'GlobalFunctions_C_GetActorsDistance3D::Actor2' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance3D, __WorldContext) == 0x000010, "Member 'GlobalFunctions_C_GetActorsDistance3D::__WorldContext' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance3D, Distance) == 0x000018, "Member 'GlobalFunctions_C_GetActorsDistance3D::Distance' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance3D, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'GlobalFunctions_C_GetActorsDistance3D::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance3D, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'GlobalFunctions_C_GetActorsDistance3D::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance3D, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000034, "Member 'GlobalFunctions_C_GetActorsDistance3D::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetActorsDistance3D, CallFunc_VSize_ReturnValue) == 0x000040, "Member 'GlobalFunctions_C_GetActorsDistance3D::CallFunc_VSize_ReturnValue' has a wrong offset!");

// Function GlobalFunctions.GlobalFunctions_C.GiveSeparateIntFromTime
// 0x0038 (0x0038 - 0x0000)
struct GlobalFunctions_C_GiveSeparateIntFromTime final
{
public:
	int32                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number1;                                           // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number2;                                           // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number3;                                           // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Number4;                                           // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_2;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GlobalFunctions_C_GiveSeparateIntFromTime) == 0x000008, "Wrong alignment on GlobalFunctions_C_GiveSeparateIntFromTime");
static_assert(sizeof(GlobalFunctions_C_GiveSeparateIntFromTime) == 0x000038, "Wrong size on GlobalFunctions_C_GiveSeparateIntFromTime");
static_assert(offsetof(GlobalFunctions_C_GiveSeparateIntFromTime, Time) == 0x000000, "Member 'GlobalFunctions_C_GiveSeparateIntFromTime::Time' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GiveSeparateIntFromTime, __WorldContext) == 0x000008, "Member 'GlobalFunctions_C_GiveSeparateIntFromTime::__WorldContext' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GiveSeparateIntFromTime, Number1) == 0x000010, "Member 'GlobalFunctions_C_GiveSeparateIntFromTime::Number1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GiveSeparateIntFromTime, Number2) == 0x000014, "Member 'GlobalFunctions_C_GiveSeparateIntFromTime::Number2' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GiveSeparateIntFromTime, Number3) == 0x000018, "Member 'GlobalFunctions_C_GiveSeparateIntFromTime::Number3' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GiveSeparateIntFromTime, Number4) == 0x00001C, "Member 'GlobalFunctions_C_GiveSeparateIntFromTime::Number4' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GiveSeparateIntFromTime, CallFunc_Divide_IntInt_ReturnValue) == 0x000020, "Member 'GlobalFunctions_C_GiveSeparateIntFromTime::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GiveSeparateIntFromTime, CallFunc_Percent_IntInt_ReturnValue) == 0x000024, "Member 'GlobalFunctions_C_GiveSeparateIntFromTime::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GiveSeparateIntFromTime, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000028, "Member 'GlobalFunctions_C_GiveSeparateIntFromTime::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GiveSeparateIntFromTime, CallFunc_Divide_IntInt_ReturnValue_1) == 0x00002C, "Member 'GlobalFunctions_C_GiveSeparateIntFromTime::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GiveSeparateIntFromTime, CallFunc_Percent_IntInt_ReturnValue_2) == 0x000030, "Member 'GlobalFunctions_C_GiveSeparateIntFromTime::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GiveSeparateIntFromTime, CallFunc_Divide_IntInt_ReturnValue_2) == 0x000034, "Member 'GlobalFunctions_C_GiveSeparateIntFromTime::CallFunc_Divide_IntInt_ReturnValue_2' has a wrong offset!");

// Function GlobalFunctions.GlobalFunctions_C.SetInteractiveReferenceMeshMaterials
// 0x00F0 (0x00F0 - 0x0000)
struct GlobalFunctions_C_SetInteractiveReferenceMeshMaterials final
{
public:
	class UStaticMeshComponent*                   NewStaticmeshComponent;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   RefStaticMeshComponent;                            // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GlobalFunctions_C_SetInteractiveReferenceMeshMaterials) == 0x000010, "Wrong alignment on GlobalFunctions_C_SetInteractiveReferenceMeshMaterials");
static_assert(sizeof(GlobalFunctions_C_SetInteractiveReferenceMeshMaterials) == 0x0000F0, "Wrong size on GlobalFunctions_C_SetInteractiveReferenceMeshMaterials");
static_assert(offsetof(GlobalFunctions_C_SetInteractiveReferenceMeshMaterials, NewStaticmeshComponent) == 0x000000, "Member 'GlobalFunctions_C_SetInteractiveReferenceMeshMaterials::NewStaticmeshComponent' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_SetInteractiveReferenceMeshMaterials, Transform) == 0x000010, "Member 'GlobalFunctions_C_SetInteractiveReferenceMeshMaterials::Transform' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_SetInteractiveReferenceMeshMaterials, RefStaticMeshComponent) == 0x000040, "Member 'GlobalFunctions_C_SetInteractiveReferenceMeshMaterials::RefStaticMeshComponent' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_SetInteractiveReferenceMeshMaterials, __WorldContext) == 0x000048, "Member 'GlobalFunctions_C_SetInteractiveReferenceMeshMaterials::__WorldContext' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_SetInteractiveReferenceMeshMaterials, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000050, "Member 'GlobalFunctions_C_SetInteractiveReferenceMeshMaterials::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_SetInteractiveReferenceMeshMaterials, CallFunc_SetStaticMesh_ReturnValue) == 0x0000D8, "Member 'GlobalFunctions_C_SetInteractiveReferenceMeshMaterials::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_SetInteractiveReferenceMeshMaterials, CallFunc_GetNumMaterials_ReturnValue) == 0x0000DC, "Member 'GlobalFunctions_C_SetInteractiveReferenceMeshMaterials::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_SetInteractiveReferenceMeshMaterials, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000E0, "Member 'GlobalFunctions_C_SetInteractiveReferenceMeshMaterials::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_SetInteractiveReferenceMeshMaterials, Temp_int_Variable) == 0x0000E4, "Member 'GlobalFunctions_C_SetInteractiveReferenceMeshMaterials::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_SetInteractiveReferenceMeshMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x0000E8, "Member 'GlobalFunctions_C_SetInteractiveReferenceMeshMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_SetInteractiveReferenceMeshMaterials, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000EC, "Member 'GlobalFunctions_C_SetInteractiveReferenceMeshMaterials::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function GlobalFunctions.GlobalFunctions_C.CanWeaponApplyDamageType
// 0x0020 (0x0020 - 0x0000)
struct GlobalFunctions_C_CanWeaponApplyDamageType final
{
public:
	bool                                          bDamageByFists;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageBySlash;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageByChop;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageByLightBlunt;                               // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDamageByHeavyBlunt;                               // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EWeaponType                                   WeaponType;                                        // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GlobalFunctions_C_CanWeaponApplyDamageType) == 0x000008, "Wrong alignment on GlobalFunctions_C_CanWeaponApplyDamageType");
static_assert(sizeof(GlobalFunctions_C_CanWeaponApplyDamageType) == 0x000020, "Wrong size on GlobalFunctions_C_CanWeaponApplyDamageType");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, bDamageByFists) == 0x000000, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::bDamageByFists' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, bDamageBySlash) == 0x000001, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::bDamageBySlash' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, bDamageByChop) == 0x000002, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::bDamageByChop' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, bDamageByLightBlunt) == 0x000003, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::bDamageByLightBlunt' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, bDamageByHeavyBlunt) == 0x000004, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::bDamageByHeavyBlunt' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, WeaponType) == 0x000005, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::WeaponType' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, __WorldContext) == 0x000008, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::__WorldContext' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, IsValid) == 0x000010, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::IsValid' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000012, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, CallFunc_BooleanAND_ReturnValue_1) == 0x000014, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000015, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000016, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, CallFunc_BooleanAND_ReturnValue_2) == 0x000017, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, CallFunc_BooleanAND_ReturnValue_3) == 0x000018, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000019, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, CallFunc_BooleanAND_ReturnValue_4) == 0x00001A, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, CallFunc_BooleanOR_ReturnValue_1) == 0x00001C, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, CallFunc_BooleanOR_ReturnValue_2) == 0x00001D, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_CanWeaponApplyDamageType, CallFunc_BooleanOR_ReturnValue_3) == 0x00001E, "Member 'GlobalFunctions_C_CanWeaponApplyDamageType::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");

// Function GlobalFunctions.GlobalFunctions_C.GetRandomReward
// 0x0040 (0x0040 - 0x0000)
struct GlobalFunctions_C_GetRandomReward final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Reward;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 Rewards;                                           // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<uint8>                                 K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GlobalFunctions_C_GetRandomReward) == 0x000008, "Wrong alignment on GlobalFunctions_C_GetRandomReward");
static_assert(sizeof(GlobalFunctions_C_GetRandomReward) == 0x000040, "Wrong size on GlobalFunctions_C_GetRandomReward");
static_assert(offsetof(GlobalFunctions_C_GetRandomReward, __WorldContext) == 0x000000, "Member 'GlobalFunctions_C_GetRandomReward::__WorldContext' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomReward, Reward) == 0x000008, "Member 'GlobalFunctions_C_GetRandomReward::Reward' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomReward, Rewards) == 0x000010, "Member 'GlobalFunctions_C_GetRandomReward::Rewards' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomReward, K2Node_MakeArray_Array) == 0x000020, "Member 'GlobalFunctions_C_GetRandomReward::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomReward, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'GlobalFunctions_C_GetRandomReward::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomReward, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'GlobalFunctions_C_GetRandomReward::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomReward, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000038, "Member 'GlobalFunctions_C_GetRandomReward::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");

// Function GlobalFunctions.GlobalFunctions_C.ConvertIntToTimeFormat
// 0x01D8 (0x01D8 - 0x0000)
struct GlobalFunctions_C_ConvertIntToTimeFormat final
{
public:
	int32                                         Int;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C8(0x0018)()
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
