#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GlobalOverlayGroupStatusEntryWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GlobalOverlayGroupStatusEntryWidget.GlobalOverlayGroupStatusEntryWidget_C
// 0x0028 (0x02E0 - 0x02B8)
class UGlobalOverlayGroupStatusEntryWidget_C final : public URBGroupStatusEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              BackgroundScale;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpeakerIcon;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         MaxNameLength;                                     // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GlobalOverlayGroupStatusEntryWidget(int32 EntryPoint);
	void Event_Refresh();
	void Event_Refresh_Audio();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GlobalOverlayGroupStatusEntryWidget_C">();
	}
	static class UGlobalOverlayGroupStatusEntryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGlobalOverlayGroupStatusEntryWidget_C>();
	}
};
static_assert(alignof(UGlobalOverlayGroupStatusEntryWidget_C) == 0x000008, "Wrong alignment on UGlobalOverlayGroupStatusEntryWidget_C");
static_assert(sizeof(UGlobalOverlayGroupStatusEntryWidget_C) == 0x0002E0, "Wrong size on UGlobalOverlayGroupStatusEntryWidget_C");
static_assert(offsetof(UGlobalOverlayGroupStatusEntryWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UGlobalOverlayGroupStatusEntryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGlobalOverlayGroupStatusEntryWidget_C, BackgroundScale) == 0x0002C0, "Member 'UGlobalOverlayGroupStatusEntryWidget_C::BackgroundScale' has a wrong offset!");
static_assert(offsetof(UGlobalOverlayGroupStatusEntryWidget_C, PlayerName) == 0x0002C8, "Member 'UGlobalOverlayGroupStatusEntryWidget_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UGlobalOverlayGroupStatusEntryWidget_C, SpeakerIcon) == 0x0002D0, "Member 'UGlobalOverlayGroupStatusEntryWidget_C::SpeakerIcon' has a wrong offset!");
static_assert(offsetof(UGlobalOverlayGroupStatusEntryWidget_C, MaxNameLength) == 0x0002D8, "Member 'UGlobalOverlayGroupStatusEntryWidget_C::MaxNameLength' has a wrong offset!");

}

