#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GroupStatusEntryWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GroupStatusEntryWidget.GroupStatusEntryWidget_C
// 0x0290 (0x0548 - 0x02B8)
class UGroupStatusEntryWidget_C final : public URBGroupStatusEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              BackgroundScale;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ClassIcon;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ClassIconSizeBox;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               HealthContainer;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateHealthBar_C*                       MateHealthBar;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ObjectiveItemsBox;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyLeaderIcon;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpeakerIcon;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StatusIcon;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               StatusSize;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            SpeakingBrush;                                     // 0x0318(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            GloballyMutedBrush;                                // 0x03A0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            MutedBrush;                                        // 0x0428(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            NotSpeakingBrush;                                  // 0x04B0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               IconMaterial;                                      // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxNameLength;                                     // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GroupStatusEntryWidget(int32 EntryPoint);
	void Event_Refresh_MaxHealth(float NewMaxHealth);
	void Event_Refresh_ObjectiveItemsCount();
	void Event_Refresh_Health(float NewHealth, bool SkipAnim);
	void Event_Refresh_Audio();
	void PreConstruct(bool IsDesignTime);
	void Event_PlayerStatusUpdated();
	void Construct();
	void Event_MaxDisplayNameLengthUpdated();
	void Event_Refresh();
	void SetupCharacterClass();
	void SetupStatus();
	void SetupMaterial();
	void UpdateStatusVisibility(ESlateVisibility NewVisibility);
	void UpdateHealthVisibility();
	void ForceHealthRefresh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GroupStatusEntryWidget_C">();
	}
	static class UGroupStatusEntryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroupStatusEntryWidget_C>();
	}
};
static_assert(alignof(UGroupStatusEntryWidget_C) == 0x000008, "Wrong alignment on UGroupStatusEntryWidget_C");
static_assert(sizeof(UGroupStatusEntryWidget_C) == 0x000548, "Wrong size on UGroupStatusEntryWidget_C");
static_assert(offsetof(UGroupStatusEntryWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UGroupStatusEntryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, BackgroundScale) == 0x0002C0, "Member 'UGroupStatusEntryWidget_C::BackgroundScale' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, ClassIcon) == 0x0002C8, "Member 'UGroupStatusEntryWidget_C::ClassIcon' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, ClassIconSizeBox) == 0x0002D0, "Member 'UGroupStatusEntryWidget_C::ClassIconSizeBox' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, HealthContainer) == 0x0002D8, "Member 'UGroupStatusEntryWidget_C::HealthContainer' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, MateHealthBar) == 0x0002E0, "Member 'UGroupStatusEntryWidget_C::MateHealthBar' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, ObjectiveItemsBox) == 0x0002E8, "Member 'UGroupStatusEntryWidget_C::ObjectiveItemsBox' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, PartyLeaderIcon) == 0x0002F0, "Member 'UGroupStatusEntryWidget_C::PartyLeaderIcon' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, PlayerName) == 0x0002F8, "Member 'UGroupStatusEntryWidget_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, SpeakerIcon) == 0x000300, "Member 'UGroupStatusEntryWidget_C::SpeakerIcon' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, StatusIcon) == 0x000308, "Member 'UGroupStatusEntryWidget_C::StatusIcon' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, StatusSize) == 0x000310, "Member 'UGroupStatusEntryWidget_C::StatusSize' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, SpeakingBrush) == 0x000318, "Member 'UGroupStatusEntryWidget_C::SpeakingBrush' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, GloballyMutedBrush) == 0x0003A0, "Member 'UGroupStatusEntryWidget_C::GloballyMutedBrush' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, MutedBrush) == 0x000428, "Member 'UGroupStatusEntryWidget_C::MutedBrush' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, NotSpeakingBrush) == 0x0004B0, "Member 'UGroupStatusEntryWidget_C::NotSpeakingBrush' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, IconMaterial) == 0x000538, "Member 'UGroupStatusEntryWidget_C::IconMaterial' has a wrong offset!");
static_assert(offsetof(UGroupStatusEntryWidget_C, MaxNameLength) == 0x000540, "Member 'UGroupStatusEntryWidget_C::MaxNameLength' has a wrong offset!");

}

