#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HangarMinus01_StructureMinus02c

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Hangar-01_Structure-02c.Hangar-01_Structure-02c_C
// 0x0090 (0x02C0 - 0x0230)
class AHangarMinus01_StructureMinus02c_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FakeColumnMinus01;                                 // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HangarWindowMinus01;                               // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent011;                            // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent010;                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent03;                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent02;                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent01;                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Hangar-01_Structure-02c_C">();
	}
	static class AHangarMinus01_StructureMinus02c_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHangarMinus01_StructureMinus02c_C>();
	}
};
static_assert(alignof(AHangarMinus01_StructureMinus02c_C) == 0x000008, "Wrong alignment on AHangarMinus01_StructureMinus02c_C");
static_assert(sizeof(AHangarMinus01_StructureMinus02c_C) == 0x0002C0, "Wrong size on AHangarMinus01_StructureMinus02c_C");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMesh7) == 0x000230, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMesh8) == 0x000238, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMesh6) == 0x000240, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMesh6' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMesh5) == 0x000248, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMesh5' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMesh4) == 0x000250, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMesh3) == 0x000258, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMesh2) == 0x000260, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, FakeColumnMinus01) == 0x000268, "Member 'AHangarMinus01_StructureMinus02c_C::FakeColumnMinus01' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, HangarWindowMinus01) == 0x000270, "Member 'AHangarMinus01_StructureMinus02c_C::HangarWindowMinus01' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMesh1) == 0x000278, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMesh) == 0x000280, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, Scene) == 0x000288, "Member 'AHangarMinus01_StructureMinus02c_C::Scene' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMeshComponent011) == 0x000290, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMeshComponent011' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMeshComponent010) == 0x000298, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMeshComponent010' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMeshComponent03) == 0x0002A0, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMeshComponent03' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMeshComponent02) == 0x0002A8, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMeshComponent02' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMeshComponent01) == 0x0002B0, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMeshComponent01' has a wrong offset!");
static_assert(offsetof(AHangarMinus01_StructureMinus02c_C, StaticMeshComponent0) == 0x0002B8, "Member 'AHangarMinus01_StructureMinus02c_C::StaticMeshComponent0' has a wrong offset!");

}

