#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealthBoostMinusConsumable_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SimpleMesh_Pickup_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HealthBoost-Consumable_BP.HealthBoost-Consumable_BP_C
// 0x0020 (0x0AA0 - 0x0A80)
class AHealthBoostMinusConsumable_BP_C final : public ASimpleMesh_Pickup_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_HealthBoostMinusConsumable_BP_C;    // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 ItemHandMesh;                                      // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldPlayFX;                                     // 0x0A90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_HealthBoostMinusConsumable_BP(int32 EntryPoint);
	void OnConsumeItemNotify(class ARBPawn* Pawn);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HealthBoost-Consumable_BP_C">();
	}
	static class AHealthBoostMinusConsumable_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHealthBoostMinusConsumable_BP_C>();
	}
};
static_assert(alignof(AHealthBoostMinusConsumable_BP_C) == 0x000010, "Wrong alignment on AHealthBoostMinusConsumable_BP_C");
static_assert(sizeof(AHealthBoostMinusConsumable_BP_C) == 0x000AA0, "Wrong size on AHealthBoostMinusConsumable_BP_C");
static_assert(offsetof(AHealthBoostMinusConsumable_BP_C, UberGraphFrame_HealthBoostMinusConsumable_BP_C) == 0x000A80, "Member 'AHealthBoostMinusConsumable_BP_C::UberGraphFrame_HealthBoostMinusConsumable_BP_C' has a wrong offset!");
static_assert(offsetof(AHealthBoostMinusConsumable_BP_C, ItemHandMesh) == 0x000A88, "Member 'AHealthBoostMinusConsumable_BP_C::ItemHandMesh' has a wrong offset!");
static_assert(offsetof(AHealthBoostMinusConsumable_BP_C, bShouldPlayFX) == 0x000A90, "Member 'AHealthBoostMinusConsumable_BP_C::bShouldPlayFX' has a wrong offset!");

}

