#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealthGainMinusConsumable_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HealthGain-Consumable_BP.HealthGain-Consumable_BP_C.OnConsumeItemNotify
// 0x0008 (0x0008 - 0x0000)
struct HealthGainMinusConsumable_BP_C_OnConsumeItemNotify final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealthGainMinusConsumable_BP_C_OnConsumeItemNotify) == 0x000008, "Wrong alignment on HealthGainMinusConsumable_BP_C_OnConsumeItemNotify");
static_assert(sizeof(HealthGainMinusConsumable_BP_C_OnConsumeItemNotify) == 0x000008, "Wrong size on HealthGainMinusConsumable_BP_C_OnConsumeItemNotify");
static_assert(offsetof(HealthGainMinusConsumable_BP_C_OnConsumeItemNotify, Pawn) == 0x000000, "Member 'HealthGainMinusConsumable_BP_C_OnConsumeItemNotify::Pawn' has a wrong offset!");

// Function HealthGain-Consumable_BP.HealthGain-Consumable_BP_C.ExecuteUbergraph_HealthGain-Consumable_BP
// 0x0070 (0x0070 - 0x0000)
struct HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_Event_pawn;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ARBPlayer_BP_C*                         K2Node_DynamicCast_AsRB_Player_BP;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsInFirstPerson_ReturnValue;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FX_ItemConsume_Heal_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP) == 0x000010, "Wrong alignment on HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP");
static_assert(sizeof(HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP) == 0x000070, "Wrong size on HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP");
static_assert(offsetof(HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP, EntryPoint) == 0x000000, "Member 'HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP, K2Node_Event_pawn) == 0x000008, "Member 'HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP::K2Node_Event_pawn' has a wrong offset!");
static_assert(offsetof(HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP, K2Node_DynamicCast_AsRB_Player_BP) == 0x000040, "Member 'HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP::K2Node_DynamicCast_AsRB_Player_BP' has a wrong offset!");
static_assert(offsetof(HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP, CallFunc_BP_IsInFirstPerson_ReturnValue) == 0x000058, "Member 'HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP::CallFunc_BP_IsInFirstPerson_ReturnValue' has a wrong offset!");
static_assert(offsetof(HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x000060, "Member 'HealthGainMinusConsumable_BP_C_ExecuteUbergraph_HealthGainMinusConsumable_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

