#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroinPackage_GhostAnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HeroinPackage_GhostAnimBP.HeroinPackage_GhostAnimBP_C
// 0x0FD0 (0x1330 - 0x0360)
class UHeroinPackage_GhostAnimBP_C final : public URBLargeObjectGhostAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0398(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x03C0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0440(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x04C0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0540(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x05C0(0x00A8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x0668(0x00A8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x0710(0x00A8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x07B8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x07E8(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x08D0(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x09B8(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0AA0(0x00E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0B88(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0C08(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0C88(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0D08(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x0D88(0x00A8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0E30(0x00A8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0ED8(0x00A8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0F80(0x00A8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1028(0x00A8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x10D0(0x00A8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x1178(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1230(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1260(0x00B0)()
	bool                                          IsFirstPerson;                                     // 0x1310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1311[0x3];                                     // 0x1311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InteractHeight;                                    // 0x1314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  Special_Move;                                      // 0x1318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1319[0x7];                                     // 0x1319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Pickupobject;                                      // 0x1320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HeroinPackage_GhostAnimBP_AnimGraphNode_BlendListByBool_6A57C19440AD7FD2F13201B0B7EDA8DA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HeroinPackage_GhostAnimBP_AnimGraphNode_BlendListByBool_A5D4956540626A06FCE4049E958A9425();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HeroinPackage_GhostAnimBP_AnimGraphNode_BlendListByBool_3DCBAC39418DDD64A83999B334FCAF41();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HeroinPackage_GhostAnimBP_AnimGraphNode_BlendListByBool_BCDD30254947BE6509EBE0875F5DAE1F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HeroinPackage_GhostAnimBP_AnimGraphNode_BlendListByBool_B32270F74B2763868A5FEA881E5CCD6D();
	void BlueprintInitializeAnimation();
	void AnimNotify_DoneAction();
	void AnimNotify_IdleEntry();
	void ExecuteUbergraph_HeroinPackage_GhostAnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeroinPackage_GhostAnimBP_C">();
	}
	static class UHeroinPackage_GhostAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeroinPackage_GhostAnimBP_C>();
	}
};
static_assert(alignof(UHeroinPackage_GhostAnimBP_C) == 0x000010, "Wrong alignment on UHeroinPackage_GhostAnimBP_C");
static_assert(sizeof(UHeroinPackage_GhostAnimBP_C) == 0x001330, "Wrong size on UHeroinPackage_GhostAnimBP_C");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, UberGraphFrame) == 0x000360, "Member 'UHeroinPackage_GhostAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_Root) == 0x000368, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_TransitionResult) == 0x000398, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_SequencePlayer_7) == 0x0003C0, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x000440, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x0004C0, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000540, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_BlendListByBool_8) == 0x0005C0, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_BlendListByBool_8' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_BlendListByBool_7) == 0x000668, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_BlendListByBool_7' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_BlendListByBool_6) == 0x000710, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_BlendListByBool_6' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_StateResult_1) == 0x0007B8, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_BlendSpacePlayer_3) == 0x0007E8, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_BlendSpacePlayer_3' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_BlendSpacePlayer_2) == 0x0008D0, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_BlendSpacePlayer_1) == 0x0009B8, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_BlendSpacePlayer) == 0x000AA0, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000B88, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000C08, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000C88, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_SequencePlayer) == 0x000D08, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_BlendListByBool_5) == 0x000D88, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_BlendListByBool_4) == 0x000E30, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_BlendListByBool_3) == 0x000ED8, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x000F80, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x001028, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_BlendListByBool) == 0x0010D0, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_BlendListByEnum) == 0x001178, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_StateResult) == 0x001230, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, AnimGraphNode_StateMachine) == 0x001260, "Member 'UHeroinPackage_GhostAnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, IsFirstPerson) == 0x001310, "Member 'UHeroinPackage_GhostAnimBP_C::IsFirstPerson' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, InteractHeight) == 0x001314, "Member 'UHeroinPackage_GhostAnimBP_C::InteractHeight' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, Special_Move) == 0x001318, "Member 'UHeroinPackage_GhostAnimBP_C::Special_Move' has a wrong offset!");
static_assert(offsetof(UHeroinPackage_GhostAnimBP_C, Pickupobject) == 0x001320, "Member 'UHeroinPackage_GhostAnimBP_C::Pickupobject' has a wrong offset!");

}

