#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HiddenSpectre_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HiddenSpectre_BP.HiddenSpectre_BP_C
// 0x00A8 (0x02F0 - 0x0248)
class AHiddenSpectre_BP_C final : public ARBHiddenSpectre
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hairs_02;                                          // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Body_02;                                           // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head_02;                                           // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hairs_01;                                          // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Body_01;                                           // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head_01;                                           // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SpectrePsychosis_02;                               // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SpectrePsychosis_01;                               // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_Spectre_HeadSmoke;                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hair;                                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Body;                                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Spectre;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Timeline_0_NewTrack_0_5DDDE6774A8C9D5D7E2DA28193A51B9E; // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Light_5DDDE6774A8C9D5D7E2DA28193A51B9E; // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_EyeIntensity_5DDDE6774A8C9D5D7E2DA28193A51B9E; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_5DDDE6774A8C9D5D7E2DA28193A51B9E; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  Spook_PostProcess;                                 // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetVisibility(bool Spectre_00, bool Spectre_01, bool Spectre_02);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void ReceiveTick(float DeltaSeconds);
	void MotionBlurByBones(const TArray<class FName>& ListOfBones, const TArray<class USkeletalMeshComponent*>& Array, const struct FVector& Rotation);
	void MotionBlurSwap(float blurIntensity, bool IsUsing3Anims);
	void OnAnimationStart(bool bIsUsing3Anims, float EffectDelay);
	void ExecuteUbergraph_HiddenSpectre_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HiddenSpectre_BP_C">();
	}
	static class AHiddenSpectre_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHiddenSpectre_BP_C>();
	}
};
static_assert(alignof(AHiddenSpectre_BP_C) == 0x000008, "Wrong alignment on AHiddenSpectre_BP_C");
static_assert(sizeof(AHiddenSpectre_BP_C) == 0x0002F0, "Wrong size on AHiddenSpectre_BP_C");
static_assert(offsetof(AHiddenSpectre_BP_C, UberGraphFrame) == 0x000248, "Member 'AHiddenSpectre_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, PointLight) == 0x000250, "Member 'AHiddenSpectre_BP_C::PointLight' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Hairs_02) == 0x000258, "Member 'AHiddenSpectre_BP_C::Hairs_02' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Body_02) == 0x000260, "Member 'AHiddenSpectre_BP_C::Body_02' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Head_02) == 0x000268, "Member 'AHiddenSpectre_BP_C::Head_02' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Hairs_01) == 0x000270, "Member 'AHiddenSpectre_BP_C::Hairs_01' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Body_01) == 0x000278, "Member 'AHiddenSpectre_BP_C::Body_01' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Head_01) == 0x000280, "Member 'AHiddenSpectre_BP_C::Head_01' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, SpectrePsychosis_02) == 0x000288, "Member 'AHiddenSpectre_BP_C::SpectrePsychosis_02' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, SpectrePsychosis_01) == 0x000290, "Member 'AHiddenSpectre_BP_C::SpectrePsychosis_01' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Ngr_Spectre_HeadSmoke) == 0x000298, "Member 'AHiddenSpectre_BP_C::Ngr_Spectre_HeadSmoke' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Hair) == 0x0002A0, "Member 'AHiddenSpectre_BP_C::Hair' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Head) == 0x0002A8, "Member 'AHiddenSpectre_BP_C::Head' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Body) == 0x0002B0, "Member 'AHiddenSpectre_BP_C::Body' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Spectre) == 0x0002B8, "Member 'AHiddenSpectre_BP_C::Spectre' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, DefaultSceneRoot) == 0x0002C0, "Member 'AHiddenSpectre_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Timeline_0_NewTrack_0_5DDDE6774A8C9D5D7E2DA28193A51B9E) == 0x0002C8, "Member 'AHiddenSpectre_BP_C::Timeline_0_NewTrack_0_5DDDE6774A8C9D5D7E2DA28193A51B9E' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Timeline_0_Light_5DDDE6774A8C9D5D7E2DA28193A51B9E) == 0x0002D4, "Member 'AHiddenSpectre_BP_C::Timeline_0_Light_5DDDE6774A8C9D5D7E2DA28193A51B9E' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Timeline_0_EyeIntensity_5DDDE6774A8C9D5D7E2DA28193A51B9E) == 0x0002D8, "Member 'AHiddenSpectre_BP_C::Timeline_0_EyeIntensity_5DDDE6774A8C9D5D7E2DA28193A51B9E' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Timeline_0__Direction_5DDDE6774A8C9D5D7E2DA28193A51B9E) == 0x0002DC, "Member 'AHiddenSpectre_BP_C::Timeline_0__Direction_5DDDE6774A8C9D5D7E2DA28193A51B9E' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Timeline_0) == 0x0002E0, "Member 'AHiddenSpectre_BP_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AHiddenSpectre_BP_C, Spook_PostProcess) == 0x0002E8, "Member 'AHiddenSpectre_BP_C::Spook_PostProcess' has a wrong offset!");

}

