#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hidespot_LockerMinusPhoneBoothMinus02_BP

#include "Basic.hpp"

#include "Hidespot_LockerMinusPhoneBooth_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Hidespot_Locker-PhoneBooth-02_BP.Hidespot_Locker-PhoneBooth-02_BP_C
// 0x0018 (0x0798 - 0x0780)
class AHidespot_LockerMinusPhoneBoothMinus02_BP_C final : public AHidespot_LockerMinusPhoneBooth_BP_C
{
public:
	class UBoxComponent*                          CollisionMinus04_0;                                // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionMinus03_0;                                // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionMinus05c;                                 // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Hidespot_Locker-PhoneBooth-02_BP_C">();
	}
	static class AHidespot_LockerMinusPhoneBoothMinus02_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHidespot_LockerMinusPhoneBoothMinus02_BP_C>();
	}
};
static_assert(alignof(AHidespot_LockerMinusPhoneBoothMinus02_BP_C) == 0x000008, "Wrong alignment on AHidespot_LockerMinusPhoneBoothMinus02_BP_C");
static_assert(sizeof(AHidespot_LockerMinusPhoneBoothMinus02_BP_C) == 0x000798, "Wrong size on AHidespot_LockerMinusPhoneBoothMinus02_BP_C");
static_assert(offsetof(AHidespot_LockerMinusPhoneBoothMinus02_BP_C, CollisionMinus04_0) == 0x000780, "Member 'AHidespot_LockerMinusPhoneBoothMinus02_BP_C::CollisionMinus04_0' has a wrong offset!");
static_assert(offsetof(AHidespot_LockerMinusPhoneBoothMinus02_BP_C, CollisionMinus03_0) == 0x000788, "Member 'AHidespot_LockerMinusPhoneBoothMinus02_BP_C::CollisionMinus03_0' has a wrong offset!");
static_assert(offsetof(AHidespot_LockerMinusPhoneBoothMinus02_BP_C, CollisionMinus05c) == 0x000790, "Member 'AHidespot_LockerMinusPhoneBoothMinus02_BP_C::CollisionMinus05c' has a wrong offset!");

}

