#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hidespot_Wardrobe_Base_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Hidespot_Wardrobe_Base_BP.Hidespot_Wardrobe_Base_BP_C.Editor_RefreshDisabledMeshesVisibility
// 0x0002 (0x0002 - 0x0000)
struct Hidespot_Wardrobe_Base_BP_C_Editor_RefreshDisabledMeshesVisibility final
{
public:
	bool                                          bShowDisabledVisuals_0;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Editor_RefreshDisabledMeshesVisibility_bShowDisabledVisuals; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_Wardrobe_Base_BP_C_Editor_RefreshDisabledMeshesVisibility) == 0x000001, "Wrong alignment on Hidespot_Wardrobe_Base_BP_C_Editor_RefreshDisabledMeshesVisibility");
static_assert(sizeof(Hidespot_Wardrobe_Base_BP_C_Editor_RefreshDisabledMeshesVisibility) == 0x000002, "Wrong size on Hidespot_Wardrobe_Base_BP_C_Editor_RefreshDisabledMeshesVisibility");
static_assert(offsetof(Hidespot_Wardrobe_Base_BP_C_Editor_RefreshDisabledMeshesVisibility, bShowDisabledVisuals_0) == 0x000000, "Member 'Hidespot_Wardrobe_Base_BP_C_Editor_RefreshDisabledMeshesVisibility::bShowDisabledVisuals_0' has a wrong offset!");
static_assert(offsetof(Hidespot_Wardrobe_Base_BP_C_Editor_RefreshDisabledMeshesVisibility, CallFunc_Editor_RefreshDisabledMeshesVisibility_bShowDisabledVisuals) == 0x000001, "Member 'Hidespot_Wardrobe_Base_BP_C_Editor_RefreshDisabledMeshesVisibility::CallFunc_Editor_RefreshDisabledMeshesVisibility_bShowDisabledVisuals' has a wrong offset!");

// Function Hidespot_Wardrobe_Base_BP.Hidespot_Wardrobe_Base_BP_C.SetDisabledMeshesState
// 0x0018 (0x0018 - 0x0000)
struct Hidespot_Wardrobe_Base_BP_C_SetDisabledMeshesState final
{
public:
	bool                                          bDisabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        RandomizationRootOverride;                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_Wardrobe_Base_BP_C_SetDisabledMeshesState) == 0x000008, "Wrong alignment on Hidespot_Wardrobe_Base_BP_C_SetDisabledMeshesState");
static_assert(sizeof(Hidespot_Wardrobe_Base_BP_C_SetDisabledMeshesState) == 0x000018, "Wrong size on Hidespot_Wardrobe_Base_BP_C_SetDisabledMeshesState");
static_assert(offsetof(Hidespot_Wardrobe_Base_BP_C_SetDisabledMeshesState, bDisabled) == 0x000000, "Member 'Hidespot_Wardrobe_Base_BP_C_SetDisabledMeshesState::bDisabled' has a wrong offset!");
static_assert(offsetof(Hidespot_Wardrobe_Base_BP_C_SetDisabledMeshesState, RandomizationRootOverride) == 0x000008, "Member 'Hidespot_Wardrobe_Base_BP_C_SetDisabledMeshesState::RandomizationRootOverride' has a wrong offset!");
static_assert(offsetof(Hidespot_Wardrobe_Base_BP_C_SetDisabledMeshesState, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'Hidespot_Wardrobe_Base_BP_C_SetDisabledMeshesState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Hidespot_Wardrobe_Base_BP.Hidespot_Wardrobe_Base_BP_C.BndEvt__RBHidespot_R_K2Node_ComponentBoundEvent_2_OnHidespotDisabledChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_R_K2Node_ComponentBoundEvent_2_OnHidespotDisabledChangedEvent__DelegateSignature final
{
public:
	class URBHidespotComponent*                   Hidespot;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisabled;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_R_K2Node_ComponentBoundEvent_2_OnHidespotDisabledChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_R_K2Node_ComponentBoundEvent_2_OnHidespotDisabledChangedEvent__DelegateSignature");
static_assert(sizeof(Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_R_K2Node_ComponentBoundEvent_2_OnHidespotDisabledChangedEvent__DelegateSignature) == 0x000010, "Wrong size on Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_R_K2Node_ComponentBoundEvent_2_OnHidespotDisabledChangedEvent__DelegateSignature");
static_assert(offsetof(Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_R_K2Node_ComponentBoundEvent_2_OnHidespotDisabledChangedEvent__DelegateSignature, Hidespot) == 0x000000, "Member 'Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_R_K2Node_ComponentBoundEvent_2_OnHidespotDisabledChangedEvent__DelegateSignature::Hidespot' has a wrong offset!");
static_assert(offsetof(Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_R_K2Node_ComponentBoundEvent_2_OnHidespotDisabledChangedEvent__DelegateSignature, bDisabled) == 0x000008, "Member 'Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_R_K2Node_ComponentBoundEvent_2_OnHidespotDisabledChangedEvent__DelegateSignature::bDisabled' has a wrong offset!");

// Function Hidespot_Wardrobe_Base_BP.Hidespot_Wardrobe_Base_BP_C.BndEvt__RBHidespot_L_K2Node_ComponentBoundEvent_3_OnHidespotDisabledChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_L_K2Node_ComponentBoundEvent_3_OnHidespotDisabledChangedEvent__DelegateSignature final
{
public:
	class URBHidespotComponent*                   Hidespot;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisabled;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_L_K2Node_ComponentBoundEvent_3_OnHidespotDisabledChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_L_K2Node_ComponentBoundEvent_3_OnHidespotDisabledChangedEvent__DelegateSignature");
static_assert(sizeof(Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_L_K2Node_ComponentBoundEvent_3_OnHidespotDisabledChangedEvent__DelegateSignature) == 0x000010, "Wrong size on Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_L_K2Node_ComponentBoundEvent_3_OnHidespotDisabledChangedEvent__DelegateSignature");
static_assert(offsetof(Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_L_K2Node_ComponentBoundEvent_3_OnHidespotDisabledChangedEvent__DelegateSignature, Hidespot) == 0x000000, "Member 'Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_L_K2Node_ComponentBoundEvent_3_OnHidespotDisabledChangedEvent__DelegateSignature::Hidespot' has a wrong offset!");
static_assert(offsetof(Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_L_K2Node_ComponentBoundEvent_3_OnHidespotDisabledChangedEvent__DelegateSignature, bDisabled) == 0x000008, "Member 'Hidespot_Wardrobe_Base_BP_C_BndEvt__RBHidespot_L_K2Node_ComponentBoundEvent_3_OnHidespotDisabledChangedEvent__DelegateSignature::bDisabled' has a wrong offset!");

// Function Hidespot_Wardrobe_Base_BP.Hidespot_Wardrobe_Base_BP_C.ExecuteUbergraph_Hidespot_Wardrobe_Base_BP
// 0x0028 (0x0028 - 0x0000)
struct Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBHidespotComponent*                   K2Node_ComponentBoundEvent_hidespot_1;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bDisabled_1;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBHidespotComponent*                   K2Node_ComponentBoundEvent_hidespot;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bDisabled;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP) == 0x000008, "Wrong alignment on Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP");
static_assert(sizeof(Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP) == 0x000028, "Wrong size on Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP");
static_assert(offsetof(Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP, EntryPoint) == 0x000000, "Member 'Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP, K2Node_ComponentBoundEvent_hidespot_1) == 0x000008, "Member 'Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP::K2Node_ComponentBoundEvent_hidespot_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP, K2Node_ComponentBoundEvent_bDisabled_1) == 0x000010, "Member 'Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP::K2Node_ComponentBoundEvent_bDisabled_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP, K2Node_ComponentBoundEvent_hidespot) == 0x000018, "Member 'Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP::K2Node_ComponentBoundEvent_hidespot' has a wrong offset!");
static_assert(offsetof(Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP, K2Node_ComponentBoundEvent_bDisabled) == 0x000020, "Member 'Hidespot_Wardrobe_Base_BP_C_ExecuteUbergraph_Hidespot_Wardrobe_Base_BP::K2Node_ComponentBoundEvent_bDisabled' has a wrong offset!");

}

