#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hidespot_DeskWoodMinus02_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Hidespot_DeskWood-02_BP.Hidespot_DeskWood-02_BP_C.RandomizeDrawer
// 0x0010 (0x0010 - 0x0000)
struct Hidespot_DeskWoodMinus02_BP_C_RandomizeDrawer final
{
public:
	class USceneComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Seed;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Hidespot_DeskWoodMinus02_BP_C_RandomizeDrawer) == 0x000008, "Wrong alignment on Hidespot_DeskWoodMinus02_BP_C_RandomizeDrawer");
static_assert(sizeof(Hidespot_DeskWoodMinus02_BP_C_RandomizeDrawer) == 0x000010, "Wrong size on Hidespot_DeskWoodMinus02_BP_C_RandomizeDrawer");
static_assert(offsetof(Hidespot_DeskWoodMinus02_BP_C_RandomizeDrawer, Component) == 0x000000, "Member 'Hidespot_DeskWoodMinus02_BP_C_RandomizeDrawer::Component' has a wrong offset!");
static_assert(offsetof(Hidespot_DeskWoodMinus02_BP_C_RandomizeDrawer, Seed) == 0x000008, "Member 'Hidespot_DeskWoodMinus02_BP_C_RandomizeDrawer::Seed' has a wrong offset!");
static_assert(offsetof(Hidespot_DeskWoodMinus02_BP_C_RandomizeDrawer, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Hidespot_DeskWoodMinus02_BP_C_RandomizeDrawer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

