#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hidespot_Locker_Base_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Hidespot_Locker_Base_BP.Hidespot_Locker_Base_BP_C.RandomizeEnabledMeshes
// 0x0138 (0x0138 - 0x0000)
struct Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes final
{
public:
	class USceneComponent*                        RandomizationRoot;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomSeedOffset;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                AvailableEnabledSetupRoots;                        // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class USceneComponent*>                ComponentToDestroy;                                // 0x0020(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class USceneComponent*>                HidespotBases;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	TArray<class USceneComponent*>                CallFunc_GatherAvailableRandomizationSceneComp_Availables; // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USceneComponent*>                CallFunc_GatherAvailableRandomizationSceneComp_Discarded; // 0x00A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                K2Node_MakeArray_Array_1;                          // 0x00C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x00D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_2;                         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes) == 0x000008, "Wrong alignment on Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes");
static_assert(sizeof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes) == 0x000138, "Wrong size on Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, RandomizationRoot) == 0x000000, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::RandomizationRoot' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, RandomSeedOffset) == 0x000008, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::RandomSeedOffset' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, AvailableEnabledSetupRoots) == 0x000010, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::AvailableEnabledSetupRoots' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, ComponentToDestroy) == 0x000020, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::ComponentToDestroy' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, HidespotBases) == 0x000030, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::HidespotBases' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, Temp_int_Array_Index_Variable) == 0x000040, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, Temp_int_Variable) == 0x000044, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Conv_IntToString_ReturnValue) == 0x000048, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_MakeLiteralString_ReturnValue) == 0x000060, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Conv_StringToName_ReturnValue) == 0x000080, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, K2Node_MakeArray_Array) == 0x000088, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_GatherAvailableRandomizationSceneComp_Availables) == 0x000098, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_GatherAvailableRandomizationSceneComp_Availables' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_GatherAvailableRandomizationSceneComp_Discarded) == 0x0000A8, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_GatherAvailableRandomizationSceneComp_Discarded' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, Temp_int_Loop_Counter_Variable) == 0x0000B8, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000BC, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, K2Node_MakeArray_Array_1) == 0x0000C0, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_GetChildrenComponents_Children) == 0x0000D0, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_GetObjectName_ReturnValue) == 0x0000F0, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, K2Node_SwitchString_CmpSuccess) == 0x000100, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Array_Length_ReturnValue_1) == 0x000104, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Array_Get_Item_1) == 0x000110, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Add_IntInt_ReturnValue_2) == 0x000118, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Subtract_IntInt_ReturnValue) == 0x00011C, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Percent_IntInt_ReturnValue) == 0x000120, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000124, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Array_Get_Item_2) == 0x000128, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000130, "Member 'Hidespot_Locker_Base_BP_C_RandomizeEnabledMeshes::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function Hidespot_Locker_Base_BP.Hidespot_Locker_Base_BP_C.Editor_RefreshEnabledMeshesVisibility
// 0x0004 (0x0004 - 0x0000)
struct Hidespot_Locker_Base_BP_C_Editor_RefreshEnabledMeshesVisibility final
{
public:
	bool                                          bShowEnabledVisuals_0;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Editor_RefreshEnabledMeshesVisibility_bShowEnabledVisuals; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_Locker_Base_BP_C_Editor_RefreshEnabledMeshesVisibility) == 0x000001, "Wrong alignment on Hidespot_Locker_Base_BP_C_Editor_RefreshEnabledMeshesVisibility");
static_assert(sizeof(Hidespot_Locker_Base_BP_C_Editor_RefreshEnabledMeshesVisibility) == 0x000004, "Wrong size on Hidespot_Locker_Base_BP_C_Editor_RefreshEnabledMeshesVisibility");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_Editor_RefreshEnabledMeshesVisibility, bShowEnabledVisuals_0) == 0x000000, "Member 'Hidespot_Locker_Base_BP_C_Editor_RefreshEnabledMeshesVisibility::bShowEnabledVisuals_0' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_Editor_RefreshEnabledMeshesVisibility, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Hidespot_Locker_Base_BP_C_Editor_RefreshEnabledMeshesVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_Editor_RefreshEnabledMeshesVisibility, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'Hidespot_Locker_Base_BP_C_Editor_RefreshEnabledMeshesVisibility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_Editor_RefreshEnabledMeshesVisibility, CallFunc_Editor_RefreshEnabledMeshesVisibility_bShowEnabledVisuals) == 0x000003, "Member 'Hidespot_Locker_Base_BP_C_Editor_RefreshEnabledMeshesVisibility::CallFunc_Editor_RefreshEnabledMeshesVisibility_bShowEnabledVisuals' has a wrong offset!");

// Function Hidespot_Locker_Base_BP.Hidespot_Locker_Base_BP_C.Editor_RefreshDisabledMeshesVisibility
// 0x0002 (0x0002 - 0x0000)
struct Hidespot_Locker_Base_BP_C_Editor_RefreshDisabledMeshesVisibility final
{
public:
	bool                                          bShowDisabledVisuals_0;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Editor_RefreshDisabledMeshesVisibility_bShowDisabledVisuals; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_Locker_Base_BP_C_Editor_RefreshDisabledMeshesVisibility) == 0x000001, "Wrong alignment on Hidespot_Locker_Base_BP_C_Editor_RefreshDisabledMeshesVisibility");
static_assert(sizeof(Hidespot_Locker_Base_BP_C_Editor_RefreshDisabledMeshesVisibility) == 0x000002, "Wrong size on Hidespot_Locker_Base_BP_C_Editor_RefreshDisabledMeshesVisibility");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_Editor_RefreshDisabledMeshesVisibility, bShowDisabledVisuals_0) == 0x000000, "Member 'Hidespot_Locker_Base_BP_C_Editor_RefreshDisabledMeshesVisibility::bShowDisabledVisuals_0' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_Editor_RefreshDisabledMeshesVisibility, CallFunc_Editor_RefreshDisabledMeshesVisibility_bShowDisabledVisuals) == 0x000001, "Member 'Hidespot_Locker_Base_BP_C_Editor_RefreshDisabledMeshesVisibility::CallFunc_Editor_RefreshDisabledMeshesVisibility_bShowDisabledVisuals' has a wrong offset!");

// Function Hidespot_Locker_Base_BP.Hidespot_Locker_Base_BP_C.SetDisabledMeshesState
// 0x0010 (0x0010 - 0x0000)
struct Hidespot_Locker_Base_BP_C_SetDisabledMeshesState final
{
public:
	bool                                          bDisabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        RandomizationRootOverride;                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Hidespot_Locker_Base_BP_C_SetDisabledMeshesState) == 0x000008, "Wrong alignment on Hidespot_Locker_Base_BP_C_SetDisabledMeshesState");
static_assert(sizeof(Hidespot_Locker_Base_BP_C_SetDisabledMeshesState) == 0x000010, "Wrong size on Hidespot_Locker_Base_BP_C_SetDisabledMeshesState");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_SetDisabledMeshesState, bDisabled) == 0x000000, "Member 'Hidespot_Locker_Base_BP_C_SetDisabledMeshesState::bDisabled' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_SetDisabledMeshesState, RandomizationRootOverride) == 0x000008, "Member 'Hidespot_Locker_Base_BP_C_SetDisabledMeshesState::RandomizationRootOverride' has a wrong offset!");

// Function Hidespot_Locker_Base_BP.Hidespot_Locker_Base_BP_C.RandomizeDisabledMeshes
// 0x0080 (0x0080 - 0x0000)
struct Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes final
{
public:
	class USceneComponent*                        RandomizationRoot;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomSeedOffset;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                HidespotBases;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetChildComponent_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumChildrenComponents_ReturnValue;     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_GetNumChildrenComponents_ReturnValue_1;   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetChildComponent_ReturnValue_1;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes) == 0x000008, "Wrong alignment on Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes");
static_assert(sizeof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes) == 0x000080, "Wrong size on Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, RandomizationRoot) == 0x000000, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::RandomizationRoot' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, RandomSeedOffset) == 0x000008, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::RandomSeedOffset' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, HidespotBases) == 0x000010, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::HidespotBases' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, Temp_int_Variable) == 0x000020, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, CallFunc_GetChildComponent_ReturnValue) == 0x000028, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::CallFunc_GetChildComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, CallFunc_GetNumChildrenComponents_ReturnValue) == 0x000034, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::CallFunc_GetNumChildrenComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, CallFunc_Array_Get_Item) == 0x000040, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, K2Node_MakeArray_Array) == 0x000048, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, CallFunc_GetNumChildrenComponents_ReturnValue_1) == 0x000058, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::CallFunc_GetNumChildrenComponents_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, CallFunc_Percent_IntInt_ReturnValue) == 0x000064, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000068, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, CallFunc_GetChildComponent_ReturnValue_1) == 0x000070, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::CallFunc_GetChildComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000078, "Member 'Hidespot_Locker_Base_BP_C_RandomizeDisabledMeshes::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function Hidespot_Locker_Base_BP.Hidespot_Locker_Base_BP_C.UserConstructionScript
// 0x01A0 (0x01A0 - 0x0000)
struct Hidespot_Locker_Base_BP_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class URBHidespotComponent*>           K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class URBHidespotComponent*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item_2;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item_3;                         // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class URBAnimAnchorComponent*>         K2Node_MakeArray_Array_1;                          // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class URBAnimAnchorComponent*                 CallFunc_Array_Get_Item_4;                         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0114(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Hidespot_Locker_Base_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on Hidespot_Locker_Base_BP_C_UserConstructionScript");
static_assert(sizeof(Hidespot_Locker_Base_BP_C_UserConstructionScript) == 0x0001A0, "Wrong size on Hidespot_Locker_Base_BP_C_UserConstructionScript");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, Temp_int_Variable) == 0x00000C, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000018, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000028, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000035, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000036, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x00003C, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_Array_Get_Item_2) == 0x000048, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000050, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x0000D8, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000DC, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E0, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_Array_Get_Item_3) == 0x0000E4, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, K2Node_MakeArray_Array_1) == 0x0000F0, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_Array_Get_Item_4) == 0x000100, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000114, "Member 'Hidespot_Locker_Base_BP_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");

// Function Hidespot_Locker_Base_BP.Hidespot_Locker_Base_BP_C.SetExitCameraLimits
// 0x0030 (0x0030 - 0x0000)
struct Hidespot_Locker_Base_BP_C_SetExitCameraLimits final
{
public:
	class URBHidespotComponent*                   HidespotComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHidespotCameraParams                  K2Node_MakeStruct_HidespotCameraParams;            // 0x001C(0x0010)(NoDestructor)
};
static_assert(alignof(Hidespot_Locker_Base_BP_C_SetExitCameraLimits) == 0x000008, "Wrong alignment on Hidespot_Locker_Base_BP_C_SetExitCameraLimits");
static_assert(sizeof(Hidespot_Locker_Base_BP_C_SetExitCameraLimits) == 0x000030, "Wrong size on Hidespot_Locker_Base_BP_C_SetExitCameraLimits");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_SetExitCameraLimits, HidespotComponent) == 0x000000, "Member 'Hidespot_Locker_Base_BP_C_SetExitCameraLimits::HidespotComponent' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_SetExitCameraLimits, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'Hidespot_Locker_Base_BP_C_SetExitCameraLimits::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_SetExitCameraLimits, CallFunc_BreakVector2D_X) == 0x00000C, "Member 'Hidespot_Locker_Base_BP_C_SetExitCameraLimits::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_SetExitCameraLimits, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'Hidespot_Locker_Base_BP_C_SetExitCameraLimits::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_SetExitCameraLimits, CallFunc_MakeVector2D_ReturnValue) == 0x000014, "Member 'Hidespot_Locker_Base_BP_C_SetExitCameraLimits::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_SetExitCameraLimits, K2Node_MakeStruct_HidespotCameraParams) == 0x00001C, "Member 'Hidespot_Locker_Base_BP_C_SetExitCameraLimits::K2Node_MakeStruct_HidespotCameraParams' has a wrong offset!");

// Function Hidespot_Locker_Base_BP.Hidespot_Locker_Base_BP_C.FixUpDoors
// 0x0038 (0x0038 - 0x0000)
struct Hidespot_Locker_Base_BP_C_FixUpDoors final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_Locker_Base_BP_C_FixUpDoors) == 0x000008, "Wrong alignment on Hidespot_Locker_Base_BP_C_FixUpDoors");
static_assert(sizeof(Hidespot_Locker_Base_BP_C_FixUpDoors) == 0x000038, "Wrong size on Hidespot_Locker_Base_BP_C_FixUpDoors");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_FixUpDoors, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Hidespot_Locker_Base_BP_C_FixUpDoors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_FixUpDoors, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Hidespot_Locker_Base_BP_C_FixUpDoors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_FixUpDoors, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Hidespot_Locker_Base_BP_C_FixUpDoors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_FixUpDoors, K2Node_MakeArray_Array) == 0x000010, "Member 'Hidespot_Locker_Base_BP_C_FixUpDoors::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_FixUpDoors, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Hidespot_Locker_Base_BP_C_FixUpDoors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_FixUpDoors, CallFunc_Array_Get_Item) == 0x000028, "Member 'Hidespot_Locker_Base_BP_C_FixUpDoors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_FixUpDoors, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Hidespot_Locker_Base_BP_C_FixUpDoors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_FixUpDoors, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'Hidespot_Locker_Base_BP_C_FixUpDoors::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Hidespot_Locker_Base_BP.Hidespot_Locker_Base_BP_C.UpdateEnabledMeshForFlip
// 0x02B0 (0x02B0 - 0x0000)
struct Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip final
{
public:
	struct FVector                                Temp_struct_Variable;                              // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_1;                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationAsset*                        Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimationAsset*                        Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_2;                            // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_3;                            // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationAsset*                        Temp_object_Variable_2;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimationAsset*                        Temp_object_Variable_3;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0xF];                                       // 0x0061(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Select_Default;                             // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationAsset*                        K2Node_Select_Default_1;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSingleAnimationPlayData               K2Node_MakeStruct_SingleAnimationPlayData;         // 0x0148(0x0018)(NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0160(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_Select_Default_2;                           // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationAsset*                        K2Node_Select_Default_3;                           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSingleAnimationPlayData               K2Node_MakeStruct_SingleAnimationPlayData_1;       // 0x0200(0x0018)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x021C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip) == 0x000010, "Wrong alignment on Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip");
static_assert(sizeof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip) == 0x0002B0, "Wrong size on Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, Temp_struct_Variable) == 0x000000, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, Temp_struct_Variable_1) == 0x00000C, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, Temp_bool_Variable) == 0x000018, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, Temp_object_Variable) == 0x000020, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, Temp_object_Variable_1) == 0x000028, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, Temp_bool_Variable_1) == 0x000030, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, Temp_struct_Variable_2) == 0x000034, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, Temp_struct_Variable_3) == 0x000040, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, Temp_bool_Variable_2) == 0x00004C, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, Temp_object_Variable_2) == 0x000050, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, Temp_object_Variable_3) == 0x000058, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, Temp_bool_Variable_3) == 0x000060, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000070, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0000A0, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, K2Node_Select_Default) == 0x000128, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, K2Node_Select_Default_1) == 0x000138, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, K2Node_MakeStruct_SingleAnimationPlayData) == 0x000148, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::K2Node_MakeStruct_SingleAnimationPlayData' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000160, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, K2Node_Select_Default_2) == 0x0001E8, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, K2Node_Select_Default_3) == 0x0001F8, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, K2Node_MakeStruct_SingleAnimationPlayData_1) == 0x000200, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::K2Node_MakeStruct_SingleAnimationPlayData_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, CallFunc_IsValid_ReturnValue_1) == 0x000218, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x00021C, "Member 'Hidespot_Locker_Base_BP_C_UpdateEnabledMeshForFlip::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");

// Function Hidespot_Locker_Base_BP.Hidespot_Locker_Base_BP_C.OnDisabledChanged
// 0x00C0 (0x00C0 - 0x0000)
struct Hidespot_Locker_Base_BP_C_OnDisabledChanged final
{
public:
	class USceneComponent*                        DisabledMeshRoot;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disabled;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   LockerDoor;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Right_ReturnValue;                        // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
