#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hidespot_HorizontalContainer_Base_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Hidespot_HorizontalContainer_Base_BP.Hidespot_HorizontalContainer_Base_BP_C.Editor_RefreshEnabledMeshesVisibility
// 0x0004 (0x0004 - 0x0000)
struct Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshEnabledMeshesVisibility final
{
public:
	bool                                          bShowEnabledVisuals_0;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Editor_RefreshEnabledMeshesVisibility_bShowEnabledVisuals; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshEnabledMeshesVisibility) == 0x000001, "Wrong alignment on Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshEnabledMeshesVisibility");
static_assert(sizeof(Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshEnabledMeshesVisibility) == 0x000004, "Wrong size on Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshEnabledMeshesVisibility");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshEnabledMeshesVisibility, bShowEnabledVisuals_0) == 0x000000, "Member 'Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshEnabledMeshesVisibility::bShowEnabledVisuals_0' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshEnabledMeshesVisibility, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshEnabledMeshesVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshEnabledMeshesVisibility, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshEnabledMeshesVisibility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshEnabledMeshesVisibility, CallFunc_Editor_RefreshEnabledMeshesVisibility_bShowEnabledVisuals) == 0x000003, "Member 'Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshEnabledMeshesVisibility::CallFunc_Editor_RefreshEnabledMeshesVisibility_bShowEnabledVisuals' has a wrong offset!");

// Function Hidespot_HorizontalContainer_Base_BP.Hidespot_HorizontalContainer_Base_BP_C.Editor_RefreshDisabledMeshesVisibility
// 0x0002 (0x0002 - 0x0000)
struct Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshDisabledMeshesVisibility final
{
public:
	bool                                          bShowDisabledVisuals_0;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Editor_RefreshDisabledMeshesVisibility_bShowDisabledVisuals; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshDisabledMeshesVisibility) == 0x000001, "Wrong alignment on Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshDisabledMeshesVisibility");
static_assert(sizeof(Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshDisabledMeshesVisibility) == 0x000002, "Wrong size on Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshDisabledMeshesVisibility");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshDisabledMeshesVisibility, bShowDisabledVisuals_0) == 0x000000, "Member 'Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshDisabledMeshesVisibility::bShowDisabledVisuals_0' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshDisabledMeshesVisibility, CallFunc_Editor_RefreshDisabledMeshesVisibility_bShowDisabledVisuals) == 0x000001, "Member 'Hidespot_HorizontalContainer_Base_BP_C_Editor_RefreshDisabledMeshesVisibility::CallFunc_Editor_RefreshDisabledMeshesVisibility_bShowDisabledVisuals' has a wrong offset!");

// Function Hidespot_HorizontalContainer_Base_BP.Hidespot_HorizontalContainer_Base_BP_C.SetDisabledMeshesState
// 0x0018 (0x0018 - 0x0000)
struct Hidespot_HorizontalContainer_Base_BP_C_SetDisabledMeshesState final
{
public:
	bool                                          bDisabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        RandomizationRootOverride;                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_HorizontalContainer_Base_BP_C_SetDisabledMeshesState) == 0x000008, "Wrong alignment on Hidespot_HorizontalContainer_Base_BP_C_SetDisabledMeshesState");
static_assert(sizeof(Hidespot_HorizontalContainer_Base_BP_C_SetDisabledMeshesState) == 0x000018, "Wrong size on Hidespot_HorizontalContainer_Base_BP_C_SetDisabledMeshesState");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_SetDisabledMeshesState, bDisabled) == 0x000000, "Member 'Hidespot_HorizontalContainer_Base_BP_C_SetDisabledMeshesState::bDisabled' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_SetDisabledMeshesState, RandomizationRootOverride) == 0x000008, "Member 'Hidespot_HorizontalContainer_Base_BP_C_SetDisabledMeshesState::RandomizationRootOverride' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_SetDisabledMeshesState, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'Hidespot_HorizontalContainer_Base_BP_C_SetDisabledMeshesState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Hidespot_HorizontalContainer_Base_BP.Hidespot_HorizontalContainer_Base_BP_C.UserConstructionScript
// 0x0120 (0x0120 - 0x0000)
struct Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript) == 0x000010, "Wrong alignment on Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript");
static_assert(sizeof(Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript) == 0x000120, "Wrong size on Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript, CallFunc_BreakTransform_Location) == 0x000030, "Member 'Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript, CallFunc_BreakTransform_Rotation) == 0x00003C, "Member 'Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript, CallFunc_BreakTransform_Scale) == 0x000048, "Member 'Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x000054, "Member 'Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000090, "Member 'Hidespot_HorizontalContainer_Base_BP_C_UserConstructionScript::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function Hidespot_HorizontalContainer_Base_BP.Hidespot_HorizontalContainer_Base_BP_C.BndEvt__RBHidespot_K2Node_ComponentBoundEvent_1_OnHidespotDisabledChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Hidespot_HorizontalContainer_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_1_OnHidespotDisabledChangedEvent__DelegateSignature final
{
public:
	class URBHidespotComponent*                   Hidespot;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisabled;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_HorizontalContainer_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_1_OnHidespotDisabledChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Hidespot_HorizontalContainer_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_1_OnHidespotDisabledChangedEvent__DelegateSignature");
static_assert(sizeof(Hidespot_HorizontalContainer_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_1_OnHidespotDisabledChangedEvent__DelegateSignature) == 0x000010, "Wrong size on Hidespot_HorizontalContainer_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_1_OnHidespotDisabledChangedEvent__DelegateSignature");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_1_OnHidespotDisabledChangedEvent__DelegateSignature, Hidespot) == 0x000000, "Member 'Hidespot_HorizontalContainer_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_1_OnHidespotDisabledChangedEvent__DelegateSignature::Hidespot' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_1_OnHidespotDisabledChangedEvent__DelegateSignature, bDisabled) == 0x000008, "Member 'Hidespot_HorizontalContainer_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_1_OnHidespotDisabledChangedEvent__DelegateSignature::bDisabled' has a wrong offset!");

// Function Hidespot_HorizontalContainer_Base_BP.Hidespot_HorizontalContainer_Base_BP_C.ExecuteUbergraph_Hidespot_HorizontalContainer_Base_BP
// 0x0018 (0x0018 - 0x0000)
struct Hidespot_HorizontalContainer_Base_BP_C_ExecuteUbergraph_Hidespot_HorizontalContainer_Base_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBHidespotComponent*                   K2Node_ComponentBoundEvent_hidespot;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bDisabled;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_HorizontalContainer_Base_BP_C_ExecuteUbergraph_Hidespot_HorizontalContainer_Base_BP) == 0x000008, "Wrong alignment on Hidespot_HorizontalContainer_Base_BP_C_ExecuteUbergraph_Hidespot_HorizontalContainer_Base_BP");
static_assert(sizeof(Hidespot_HorizontalContainer_Base_BP_C_ExecuteUbergraph_Hidespot_HorizontalContainer_Base_BP) == 0x000018, "Wrong size on Hidespot_HorizontalContainer_Base_BP_C_ExecuteUbergraph_Hidespot_HorizontalContainer_Base_BP");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_ExecuteUbergraph_Hidespot_HorizontalContainer_Base_BP, EntryPoint) == 0x000000, "Member 'Hidespot_HorizontalContainer_Base_BP_C_ExecuteUbergraph_Hidespot_HorizontalContainer_Base_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_ExecuteUbergraph_Hidespot_HorizontalContainer_Base_BP, K2Node_ComponentBoundEvent_hidespot) == 0x000008, "Member 'Hidespot_HorizontalContainer_Base_BP_C_ExecuteUbergraph_Hidespot_HorizontalContainer_Base_BP::K2Node_ComponentBoundEvent_hidespot' has a wrong offset!");
static_assert(offsetof(Hidespot_HorizontalContainer_Base_BP_C_ExecuteUbergraph_Hidespot_HorizontalContainer_Base_BP, K2Node_ComponentBoundEvent_bDisabled) == 0x000010, "Member 'Hidespot_HorizontalContainer_Base_BP_C_ExecuteUbergraph_Hidespot_HorizontalContainer_Base_BP::K2Node_ComponentBoundEvent_bDisabled' has a wrong offset!");

}

