#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hidespot_LargeDesk_Base_BP

#include "Basic.hpp"

#include "Hidespot_Desk_Base_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Hidespot_LargeDesk_Base_BP.Hidespot_LargeDesk_Base_BP_C
// 0x0100 (0x07E8 - 0x06E8)
class AHidespot_LargeDesk_Base_BP_C : public AHidespot_Desk_Base_BP_C
{
public:
	class UStaticMeshComponent*                   PoliceEvidenceMinusB;                              // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PoliceEvidenceBoxMinusC;                           // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PoliceEvidenceBoxMinusA1;                          // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PoliceEvidenceBoxMinusA;                           // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PoliceEvidenceBoxMinusB;                           // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BucketPaintMinus03;                                // 0x0710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BucketPaintMinus01;                                // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BucketPaintMinus02;                                // 0x0720(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BoxClosedMinus07_0;                                // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BoxClosedMinus08;                                  // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CanisterMinus02;                                   // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FooxBoxMinus01;                                    // 0x0740(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RootMinusI;                                        // 0x0748(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RootMinusH;                                        // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GarbageBagMinus01;                                 // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RootMinusG;                                        // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CleaningBucketMinus01;                             // 0x0768(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RootMinusF;                                        // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RootMinusE;                                        // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RootMinusD;                                        // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CanisterMinus09;                                   // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BucketMinus01;                                     // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ToyBoxMinus02;                                     // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ToyBoxMinus05;                                     // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RootMinusC;                                        // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Basket;                                            // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BoxClosedMinus05_0;                                // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BoxClosedMinus04_0;                                // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BoxClosedMinus02_0;                                // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BoxClosedMinus01_0;                                // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RootMinusA;                                        // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RootMinusB;                                        // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Hidespot_LargeDesk_Base_BP_C">();
	}
	static class AHidespot_LargeDesk_Base_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHidespot_LargeDesk_Base_BP_C>();
	}
};
static_assert(alignof(AHidespot_LargeDesk_Base_BP_C) == 0x000008, "Wrong alignment on AHidespot_LargeDesk_Base_BP_C");
static_assert(sizeof(AHidespot_LargeDesk_Base_BP_C) == 0x0007E8, "Wrong size on AHidespot_LargeDesk_Base_BP_C");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, PoliceEvidenceMinusB) == 0x0006E8, "Member 'AHidespot_LargeDesk_Base_BP_C::PoliceEvidenceMinusB' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, PoliceEvidenceBoxMinusC) == 0x0006F0, "Member 'AHidespot_LargeDesk_Base_BP_C::PoliceEvidenceBoxMinusC' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, PoliceEvidenceBoxMinusA1) == 0x0006F8, "Member 'AHidespot_LargeDesk_Base_BP_C::PoliceEvidenceBoxMinusA1' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, PoliceEvidenceBoxMinusA) == 0x000700, "Member 'AHidespot_LargeDesk_Base_BP_C::PoliceEvidenceBoxMinusA' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, PoliceEvidenceBoxMinusB) == 0x000708, "Member 'AHidespot_LargeDesk_Base_BP_C::PoliceEvidenceBoxMinusB' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, BucketPaintMinus03) == 0x000710, "Member 'AHidespot_LargeDesk_Base_BP_C::BucketPaintMinus03' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, BucketPaintMinus01) == 0x000718, "Member 'AHidespot_LargeDesk_Base_BP_C::BucketPaintMinus01' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, BucketPaintMinus02) == 0x000720, "Member 'AHidespot_LargeDesk_Base_BP_C::BucketPaintMinus02' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, BoxClosedMinus07_0) == 0x000728, "Member 'AHidespot_LargeDesk_Base_BP_C::BoxClosedMinus07_0' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, BoxClosedMinus08) == 0x000730, "Member 'AHidespot_LargeDesk_Base_BP_C::BoxClosedMinus08' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, CanisterMinus02) == 0x000738, "Member 'AHidespot_LargeDesk_Base_BP_C::CanisterMinus02' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, FooxBoxMinus01) == 0x000740, "Member 'AHidespot_LargeDesk_Base_BP_C::FooxBoxMinus01' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, RootMinusI) == 0x000748, "Member 'AHidespot_LargeDesk_Base_BP_C::RootMinusI' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, RootMinusH) == 0x000750, "Member 'AHidespot_LargeDesk_Base_BP_C::RootMinusH' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, GarbageBagMinus01) == 0x000758, "Member 'AHidespot_LargeDesk_Base_BP_C::GarbageBagMinus01' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, RootMinusG) == 0x000760, "Member 'AHidespot_LargeDesk_Base_BP_C::RootMinusG' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, CleaningBucketMinus01) == 0x000768, "Member 'AHidespot_LargeDesk_Base_BP_C::CleaningBucketMinus01' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, RootMinusF) == 0x000770, "Member 'AHidespot_LargeDesk_Base_BP_C::RootMinusF' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, RootMinusE) == 0x000778, "Member 'AHidespot_LargeDesk_Base_BP_C::RootMinusE' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, RootMinusD) == 0x000780, "Member 'AHidespot_LargeDesk_Base_BP_C::RootMinusD' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, CanisterMinus09) == 0x000788, "Member 'AHidespot_LargeDesk_Base_BP_C::CanisterMinus09' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, BucketMinus01) == 0x000790, "Member 'AHidespot_LargeDesk_Base_BP_C::BucketMinus01' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, ToyBoxMinus02) == 0x000798, "Member 'AHidespot_LargeDesk_Base_BP_C::ToyBoxMinus02' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, ToyBoxMinus05) == 0x0007A0, "Member 'AHidespot_LargeDesk_Base_BP_C::ToyBoxMinus05' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, RootMinusC) == 0x0007A8, "Member 'AHidespot_LargeDesk_Base_BP_C::RootMinusC' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, Basket) == 0x0007B0, "Member 'AHidespot_LargeDesk_Base_BP_C::Basket' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, BoxClosedMinus05_0) == 0x0007B8, "Member 'AHidespot_LargeDesk_Base_BP_C::BoxClosedMinus05_0' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, BoxClosedMinus04_0) == 0x0007C0, "Member 'AHidespot_LargeDesk_Base_BP_C::BoxClosedMinus04_0' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, BoxClosedMinus02_0) == 0x0007C8, "Member 'AHidespot_LargeDesk_Base_BP_C::BoxClosedMinus02_0' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, BoxClosedMinus01_0) == 0x0007D0, "Member 'AHidespot_LargeDesk_Base_BP_C::BoxClosedMinus01_0' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, RootMinusA) == 0x0007D8, "Member 'AHidespot_LargeDesk_Base_BP_C::RootMinusA' has a wrong offset!");
static_assert(offsetof(AHidespot_LargeDesk_Base_BP_C, RootMinusB) == 0x0007E0, "Member 'AHidespot_LargeDesk_Base_BP_C::RootMinusB' has a wrong offset!");

}

