#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hidespot_Barrel_Base_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Hidespot_Barrel_Base_BP.Hidespot_Barrel_Base_BP_C.RandomizeEnabledMeshes
// 0x00B0 (0x00B0 - 0x0000)
struct Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes final
{
public:
	class USceneComponent*                        RandomizationRoot;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomSeedOffset;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0024(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes) == 0x000008, "Wrong alignment on Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes");
static_assert(sizeof(Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes) == 0x0000B0, "Wrong size on Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes, RandomizationRoot) == 0x000000, "Member 'Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes::RandomizationRoot' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes, RandomSeedOffset) == 0x000008, "Member 'Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes::RandomSeedOffset' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000014, "Member 'Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000024, "Member 'Hidespot_Barrel_Base_BP_C_RandomizeEnabledMeshes::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function Hidespot_Barrel_Base_BP.Hidespot_Barrel_Base_BP_C.Editor_RefreshDisabledMeshesVisibility
// 0x0002 (0x0002 - 0x0000)
struct Hidespot_Barrel_Base_BP_C_Editor_RefreshDisabledMeshesVisibility final
{
public:
	bool                                          bShowDisabledVisuals_0;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Editor_RefreshDisabledMeshesVisibility_bShowDisabledVisuals; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_Barrel_Base_BP_C_Editor_RefreshDisabledMeshesVisibility) == 0x000001, "Wrong alignment on Hidespot_Barrel_Base_BP_C_Editor_RefreshDisabledMeshesVisibility");
static_assert(sizeof(Hidespot_Barrel_Base_BP_C_Editor_RefreshDisabledMeshesVisibility) == 0x000002, "Wrong size on Hidespot_Barrel_Base_BP_C_Editor_RefreshDisabledMeshesVisibility");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_Editor_RefreshDisabledMeshesVisibility, bShowDisabledVisuals_0) == 0x000000, "Member 'Hidespot_Barrel_Base_BP_C_Editor_RefreshDisabledMeshesVisibility::bShowDisabledVisuals_0' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_Editor_RefreshDisabledMeshesVisibility, CallFunc_Editor_RefreshDisabledMeshesVisibility_bShowDisabledVisuals) == 0x000001, "Member 'Hidespot_Barrel_Base_BP_C_Editor_RefreshDisabledMeshesVisibility::CallFunc_Editor_RefreshDisabledMeshesVisibility_bShowDisabledVisuals' has a wrong offset!");

// Function Hidespot_Barrel_Base_BP.Hidespot_Barrel_Base_BP_C.SetDisabledMeshesState
// 0x0018 (0x0018 - 0x0000)
struct Hidespot_Barrel_Base_BP_C_SetDisabledMeshesState final
{
public:
	bool                                          bDisabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        RandomizationRootOverride;                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_Barrel_Base_BP_C_SetDisabledMeshesState) == 0x000008, "Wrong alignment on Hidespot_Barrel_Base_BP_C_SetDisabledMeshesState");
static_assert(sizeof(Hidespot_Barrel_Base_BP_C_SetDisabledMeshesState) == 0x000018, "Wrong size on Hidespot_Barrel_Base_BP_C_SetDisabledMeshesState");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_SetDisabledMeshesState, bDisabled) == 0x000000, "Member 'Hidespot_Barrel_Base_BP_C_SetDisabledMeshesState::bDisabled' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_SetDisabledMeshesState, RandomizationRootOverride) == 0x000008, "Member 'Hidespot_Barrel_Base_BP_C_SetDisabledMeshesState::RandomizationRootOverride' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_SetDisabledMeshesState, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'Hidespot_Barrel_Base_BP_C_SetDisabledMeshesState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Hidespot_Barrel_Base_BP.Hidespot_Barrel_Base_BP_C.UserConstructionScript
// 0x00A0 (0x00A0 - 0x0000)
struct Hidespot_Barrel_Base_BP_C_UserConstructionScript final
{
public:
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0018(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Hidespot_Barrel_Base_BP_C_UserConstructionScript) == 0x000004, "Wrong alignment on Hidespot_Barrel_Base_BP_C_UserConstructionScript");
static_assert(sizeof(Hidespot_Barrel_Base_BP_C_UserConstructionScript) == 0x0000A0, "Wrong size on Hidespot_Barrel_Base_BP_C_UserConstructionScript");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_UserConstructionScript, CallFunc_Conv_IntToByte_ReturnValue) == 0x000000, "Member 'Hidespot_Barrel_Base_BP_C_UserConstructionScript::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_UserConstructionScript, CallFunc_Percent_IntInt_ReturnValue) == 0x000004, "Member 'Hidespot_Barrel_Base_BP_C_UserConstructionScript::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'Hidespot_Barrel_Base_BP_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x00000C, "Member 'Hidespot_Barrel_Base_BP_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000018, "Member 'Hidespot_Barrel_Base_BP_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");

// Function Hidespot_Barrel_Base_BP.Hidespot_Barrel_Base_BP_C.BndEvt__RBHidespot_K2Node_ComponentBoundEvent_0_OnHidespotDisabledChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Hidespot_Barrel_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_0_OnHidespotDisabledChangedEvent__DelegateSignature final
{
public:
	class URBHidespotComponent*                   Hidespot;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisabled;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_Barrel_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_0_OnHidespotDisabledChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Hidespot_Barrel_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_0_OnHidespotDisabledChangedEvent__DelegateSignature");
static_assert(sizeof(Hidespot_Barrel_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_0_OnHidespotDisabledChangedEvent__DelegateSignature) == 0x000010, "Wrong size on Hidespot_Barrel_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_0_OnHidespotDisabledChangedEvent__DelegateSignature");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_0_OnHidespotDisabledChangedEvent__DelegateSignature, Hidespot) == 0x000000, "Member 'Hidespot_Barrel_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_0_OnHidespotDisabledChangedEvent__DelegateSignature::Hidespot' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_0_OnHidespotDisabledChangedEvent__DelegateSignature, bDisabled) == 0x000008, "Member 'Hidespot_Barrel_Base_BP_C_BndEvt__RBHidespot_K2Node_ComponentBoundEvent_0_OnHidespotDisabledChangedEvent__DelegateSignature::bDisabled' has a wrong offset!");

// Function Hidespot_Barrel_Base_BP.Hidespot_Barrel_Base_BP_C.ExecuteUbergraph_Hidespot_Barrel_Base_BP
// 0x0018 (0x0018 - 0x0000)
struct Hidespot_Barrel_Base_BP_C_ExecuteUbergraph_Hidespot_Barrel_Base_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBHidespotComponent*                   K2Node_ComponentBoundEvent_hidespot;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bDisabled;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Hidespot_Barrel_Base_BP_C_ExecuteUbergraph_Hidespot_Barrel_Base_BP) == 0x000008, "Wrong alignment on Hidespot_Barrel_Base_BP_C_ExecuteUbergraph_Hidespot_Barrel_Base_BP");
static_assert(sizeof(Hidespot_Barrel_Base_BP_C_ExecuteUbergraph_Hidespot_Barrel_Base_BP) == 0x000018, "Wrong size on Hidespot_Barrel_Base_BP_C_ExecuteUbergraph_Hidespot_Barrel_Base_BP");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_ExecuteUbergraph_Hidespot_Barrel_Base_BP, EntryPoint) == 0x000000, "Member 'Hidespot_Barrel_Base_BP_C_ExecuteUbergraph_Hidespot_Barrel_Base_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_ExecuteUbergraph_Hidespot_Barrel_Base_BP, K2Node_ComponentBoundEvent_hidespot) == 0x000008, "Member 'Hidespot_Barrel_Base_BP_C_ExecuteUbergraph_Hidespot_Barrel_Base_BP::K2Node_ComponentBoundEvent_hidespot' has a wrong offset!");
static_assert(offsetof(Hidespot_Barrel_Base_BP_C_ExecuteUbergraph_Hidespot_Barrel_Base_BP, K2Node_ComponentBoundEvent_bDisabled) == 0x000010, "Member 'Hidespot_Barrel_Base_BP_C_ExecuteUbergraph_Hidespot_Barrel_Base_BP::K2Node_ComponentBoundEvent_bDisabled' has a wrong offset!");

}

