#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HumanSpectral_SkillController_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function HumanSpectral_SkillController_BP.HumanSpectral_SkillController_BP_C.ExecuteUbergraph_HumanSpectral_SkillController_BP
// 0x0008 (0x0008 - 0x0000)
struct HumanSpectral_SkillController_BP_C_ExecuteUbergraph_HumanSpectral_SkillController_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsInZone;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HumanSpectral_SkillController_BP_C_ExecuteUbergraph_HumanSpectral_SkillController_BP) == 0x000004, "Wrong alignment on HumanSpectral_SkillController_BP_C_ExecuteUbergraph_HumanSpectral_SkillController_BP");
static_assert(sizeof(HumanSpectral_SkillController_BP_C_ExecuteUbergraph_HumanSpectral_SkillController_BP) == 0x000008, "Wrong size on HumanSpectral_SkillController_BP_C_ExecuteUbergraph_HumanSpectral_SkillController_BP");
static_assert(offsetof(HumanSpectral_SkillController_BP_C_ExecuteUbergraph_HumanSpectral_SkillController_BP, EntryPoint) == 0x000000, "Member 'HumanSpectral_SkillController_BP_C_ExecuteUbergraph_HumanSpectral_SkillController_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(HumanSpectral_SkillController_BP_C_ExecuteUbergraph_HumanSpectral_SkillController_BP, K2Node_CustomEvent_IsInZone) == 0x000004, "Member 'HumanSpectral_SkillController_BP_C_ExecuteUbergraph_HumanSpectral_SkillController_BP::K2Node_CustomEvent_IsInZone' has a wrong offset!");

// Function HumanSpectral_SkillController_BP.HumanSpectral_SkillController_BP_C.On Skill Deactivate FX
// 0x0001 (0x0001 - 0x0000)
struct HumanSpectral_SkillController_BP_C_On_Skill_Deactivate_FX final
{
public:
	bool                                          IsInZone;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HumanSpectral_SkillController_BP_C_On_Skill_Deactivate_FX) == 0x000001, "Wrong alignment on HumanSpectral_SkillController_BP_C_On_Skill_Deactivate_FX");
static_assert(sizeof(HumanSpectral_SkillController_BP_C_On_Skill_Deactivate_FX) == 0x000001, "Wrong size on HumanSpectral_SkillController_BP_C_On_Skill_Deactivate_FX");
static_assert(offsetof(HumanSpectral_SkillController_BP_C_On_Skill_Deactivate_FX, IsInZone) == 0x000000, "Member 'HumanSpectral_SkillController_BP_C_On_Skill_Deactivate_FX::IsInZone' has a wrong offset!");

}

