#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IndustrialFanMinus03_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function IndustrialFan-03_BP.IndustrialFan-03_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct IndustrialFanMinus03_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndustrialFanMinus03_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on IndustrialFanMinus03_BP_C_ReceiveTick");
static_assert(sizeof(IndustrialFanMinus03_BP_C_ReceiveTick) == 0x000004, "Wrong size on IndustrialFanMinus03_BP_C_ReceiveTick");
static_assert(offsetof(IndustrialFanMinus03_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'IndustrialFanMinus03_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function IndustrialFan-03_BP.IndustrialFan-03_BP_C.ExecuteUbergraph_IndustrialFan-03_BP
// 0x00B0 (0x00B0 - 0x0000)
struct IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_PlayLoopingSound_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x0024(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_PlayLoopingSound_ReturnValue_1;           // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP) == 0x000004, "Wrong alignment on IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP");
static_assert(sizeof(IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP) == 0x0000B0, "Wrong size on IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP");
static_assert(offsetof(IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP, EntryPoint) == 0x000000, "Member 'IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP, CallFunc_Abs_ReturnValue) == 0x000004, "Member 'IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP, CallFunc_MakeRotator_ReturnValue) == 0x000014, "Member 'IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP, CallFunc_PlayLoopingSound_ReturnValue) == 0x000020, "Member 'IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP::CallFunc_PlayLoopingSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x000024, "Member 'IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP, CallFunc_PlayLoopingSound_ReturnValue_1) == 0x0000AC, "Member 'IndustrialFanMinus03_BP_C_ExecuteUbergraph_IndustrialFanMinus03_BP::CallFunc_PlayLoopingSound_ReturnValue_1' has a wrong offset!");

}

