#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameMenuOptionWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InGameMenuOptionWidget.InGameMenuOptionWidget_C
// 0x0098 (0x02F8 - 0x0260)
class UInGameMenuOptionWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_0;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DevOptionsBTN;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            HoveredTextColor;                                  // 0x0280(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NormalTextColor;                                   // 0x02A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   TextValue;                                         // 0x02E0(0x0018)(Edit, BlueprintVisible)

public:
	void OnClicked__DelegateSignature();
	void ExecuteUbergraph_InGameMenuOptionWidget(int32 EntryPoint);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void BndEvt__DevOptionsBTN_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__DevOptionsBTN_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__DevOptionsBTN_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void UpdateHighlightState(bool Highlight);
	void RefreshText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InGameMenuOptionWidget_C">();
	}
	static class UInGameMenuOptionWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInGameMenuOptionWidget_C>();
	}
};
static_assert(alignof(UInGameMenuOptionWidget_C) == 0x000008, "Wrong alignment on UInGameMenuOptionWidget_C");
static_assert(sizeof(UInGameMenuOptionWidget_C) == 0x0002F8, "Wrong size on UInGameMenuOptionWidget_C");
static_assert(offsetof(UInGameMenuOptionWidget_C, UberGraphFrame) == 0x000260, "Member 'UInGameMenuOptionWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInGameMenuOptionWidget_C, Border_0) == 0x000268, "Member 'UInGameMenuOptionWidget_C::Border_0' has a wrong offset!");
static_assert(offsetof(UInGameMenuOptionWidget_C, DevOptionsBTN) == 0x000270, "Member 'UInGameMenuOptionWidget_C::DevOptionsBTN' has a wrong offset!");
static_assert(offsetof(UInGameMenuOptionWidget_C, Text) == 0x000278, "Member 'UInGameMenuOptionWidget_C::Text' has a wrong offset!");
static_assert(offsetof(UInGameMenuOptionWidget_C, HoveredTextColor) == 0x000280, "Member 'UInGameMenuOptionWidget_C::HoveredTextColor' has a wrong offset!");
static_assert(offsetof(UInGameMenuOptionWidget_C, NormalTextColor) == 0x0002A8, "Member 'UInGameMenuOptionWidget_C::NormalTextColor' has a wrong offset!");
static_assert(offsetof(UInGameMenuOptionWidget_C, OnClicked) == 0x0002D0, "Member 'UInGameMenuOptionWidget_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UInGameMenuOptionWidget_C, TextValue) == 0x0002E0, "Member 'UInGameMenuOptionWidget_C::TextValue' has a wrong offset!");

}

