#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JollyChimpMinus01_ABP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function JollyChimp-01_ABP.JollyChimp-01_ABP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct JollyChimpMinus01_ABP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(JollyChimpMinus01_ABP_C_AnimGraph) == 0x000008, "Wrong alignment on JollyChimpMinus01_ABP_C_AnimGraph");
static_assert(sizeof(JollyChimpMinus01_ABP_C_AnimGraph) == 0x000010, "Wrong size on JollyChimpMinus01_ABP_C_AnimGraph");
static_assert(offsetof(JollyChimpMinus01_ABP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'JollyChimpMinus01_ABP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function JollyChimp-01_ABP.JollyChimp-01_ABP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct JollyChimpMinus01_ABP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JollyChimpMinus01_ABP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on JollyChimpMinus01_ABP_C_BlueprintUpdateAnimation");
static_assert(sizeof(JollyChimpMinus01_ABP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on JollyChimpMinus01_ABP_C_BlueprintUpdateAnimation");
static_assert(offsetof(JollyChimpMinus01_ABP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'JollyChimpMinus01_ABP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function JollyChimp-01_ABP.JollyChimp-01_ABP_C.ExecuteUbergraph_JollyChimp-01_ABP
// 0x0050 (0x0050 - 0x0000)
struct JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_3;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_2;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_ReturnValue_3;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_4;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_5;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP) == 0x000004, "Wrong alignment on JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP");
static_assert(sizeof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP) == 0x000050, "Wrong size on JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, EntryPoint) == 0x000000, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::EntryPoint' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, Temp_bool_Variable) == 0x000004, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, Temp_float_Variable) == 0x000008, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, Temp_float_Variable_1) == 0x00000C, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, Temp_float_Variable_2) == 0x000010, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, Temp_bool_Variable_1) == 0x000014, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, Temp_float_Variable_3) == 0x000018, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, K2Node_Event_DeltaTimeX) == 0x000020, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, CallFunc_FInterpTo_ReturnValue) == 0x000024, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, K2Node_Select_Default) == 0x000028, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, K2Node_Select_Default_1) == 0x00002C, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, CallFunc_FInterpTo_ReturnValue_1) == 0x000030, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, CallFunc_FInterpTo_ReturnValue_2) == 0x000034, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, CallFunc_GetTimeSeconds_ReturnValue) == 0x000038, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00003C, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000041, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, CallFunc_FInterpTo_ReturnValue_3) == 0x000044, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::CallFunc_FInterpTo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, CallFunc_FInterpTo_ReturnValue_4) == 0x000048, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::CallFunc_FInterpTo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP, CallFunc_FInterpTo_ReturnValue_5) == 0x00004C, "Member 'JollyChimpMinus01_ABP_C_ExecuteUbergraph_JollyChimpMinus01_ABP::CallFunc_FInterpTo_ReturnValue_5' has a wrong offset!");

}

