#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LargePickup_GhostAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LargePickup_GhostAnimBP.LargePickup_GhostAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct LargePickup_GhostAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(LargePickup_GhostAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on LargePickup_GhostAnimBP_C_AnimGraph");
static_assert(sizeof(LargePickup_GhostAnimBP_C_AnimGraph) == 0x000010, "Wrong size on LargePickup_GhostAnimBP_C_AnimGraph");
static_assert(offsetof(LargePickup_GhostAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'LargePickup_GhostAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function LargePickup_GhostAnimBP.LargePickup_GhostAnimBP_C.SelectPickupBlendSpace
// 0x0040 (0x0040 - 0x0000)
struct LargePickup_GhostAnimBP_C_SelectPickupBlendSpace final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            K2Node_Select_Default_2;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            K2Node_Select_Default_3;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            K2Node_Select_Default_4;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            K2Node_Select_Default_5;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            K2Node_Select_Default_6;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace) == 0x000008, "Wrong alignment on LargePickup_GhostAnimBP_C_SelectPickupBlendSpace");
static_assert(sizeof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace) == 0x000040, "Wrong size on LargePickup_GhostAnimBP_C_SelectPickupBlendSpace");
static_assert(offsetof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace, Temp_bool_Variable) == 0x000000, "Member 'LargePickup_GhostAnimBP_C_SelectPickupBlendSpace::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace, Temp_bool_Variable_1) == 0x000001, "Member 'LargePickup_GhostAnimBP_C_SelectPickupBlendSpace::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace, Temp_bool_Variable_2) == 0x000002, "Member 'LargePickup_GhostAnimBP_C_SelectPickupBlendSpace::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace, Temp_bool_Variable_3) == 0x000003, "Member 'LargePickup_GhostAnimBP_C_SelectPickupBlendSpace::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace, Temp_bool_Variable_4) == 0x000004, "Member 'LargePickup_GhostAnimBP_C_SelectPickupBlendSpace::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace, Temp_bool_Variable_5) == 0x000005, "Member 'LargePickup_GhostAnimBP_C_SelectPickupBlendSpace::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace, Temp_bool_Variable_6) == 0x000006, "Member 'LargePickup_GhostAnimBP_C_SelectPickupBlendSpace::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace, K2Node_Select_Default) == 0x000008, "Member 'LargePickup_GhostAnimBP_C_SelectPickupBlendSpace::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace, K2Node_Select_Default_1) == 0x000010, "Member 'LargePickup_GhostAnimBP_C_SelectPickupBlendSpace::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace, K2Node_Select_Default_2) == 0x000018, "Member 'LargePickup_GhostAnimBP_C_SelectPickupBlendSpace::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace, K2Node_Select_Default_3) == 0x000020, "Member 'LargePickup_GhostAnimBP_C_SelectPickupBlendSpace::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace, K2Node_Select_Default_4) == 0x000028, "Member 'LargePickup_GhostAnimBP_C_SelectPickupBlendSpace::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace, K2Node_Select_Default_5) == 0x000030, "Member 'LargePickup_GhostAnimBP_C_SelectPickupBlendSpace::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_SelectPickupBlendSpace, K2Node_Select_Default_6) == 0x000038, "Member 'LargePickup_GhostAnimBP_C_SelectPickupBlendSpace::K2Node_Select_Default_6' has a wrong offset!");

// Function LargePickup_GhostAnimBP.LargePickup_GhostAnimBP_C.ExecuteUbergraph_LargePickup_GhostAnimBP
// 0x0070 (0x0070 - 0x0000)
struct LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELargeObjectPickupSubtype                     Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsInFirstPerson_ReturnValue;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_BP_GetSpecialMoveSubtype_ReturnValue;     // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  CallFunc_BP_GetSpecialMove_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GhostAnimTransition_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BP_GetPawnTargetLocation_ReturnValue;     // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BP_GetCurrentInteractibleActor_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLargePickup*                         K2Node_DynamicCast_AsRB_Large_Pickup;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP) == 0x000008, "Wrong alignment on LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP");
static_assert(sizeof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP) == 0x000070, "Wrong size on LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, EntryPoint) == 0x000000, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, Temp_byte_Variable) == 0x000004, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000008, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, Temp_bool_Variable) == 0x00000C, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_BP_IsInFirstPerson_ReturnValue) == 0x00000D, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_BP_IsInFirstPerson_ReturnValue' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_BP_GetSpecialMoveSubtype_ReturnValue) == 0x00000E, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_BP_GetSpecialMoveSubtype_ReturnValue' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_GetValidValue_ReturnValue) == 0x00000F, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_BP_GetSpecialMove_ReturnValue) == 0x000010, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_BP_GetSpecialMove_ReturnValue' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_GhostAnimTransition_ReturnValue) == 0x000011, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_GhostAnimTransition_ReturnValue' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, Temp_bool_Variable_1) == 0x000012, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_BP_GetPawnTargetLocation_ReturnValue) == 0x000014, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_BP_GetPawnTargetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_BreakVector_X) == 0x000020, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_BreakVector_Y) == 0x000024, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_BreakVector_Z) == 0x000028, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, K2Node_Select_Default) == 0x00002C, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_BP_GetCurrentInteractibleActor_ReturnValue) == 0x000030, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_BP_GetCurrentInteractibleActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, K2Node_DynamicCast_AsRB_Large_Pickup) == 0x000038, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::K2Node_DynamicCast_AsRB_Large_Pickup' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000048, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000054, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_BreakVector_X_1) == 0x000060, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_BreakVector_Y_1) == 0x000064, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_BreakVector_Z_1) == 0x000068, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00006C, "Member 'LargePickup_GhostAnimBP_C_ExecuteUbergraph_LargePickup_GhostAnimBP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function LargePickup_GhostAnimBP.LargePickup_GhostAnimBP_C.IsPickupCrouched
// 0x0002 (0x0002 - 0x0000)
struct LargePickup_GhostAnimBP_C_IsPickupCrouched final
{
public:
	bool                                          bCrouched_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LargePickup_GhostAnimBP_C_IsPickupCrouched) == 0x000001, "Wrong alignment on LargePickup_GhostAnimBP_C_IsPickupCrouched");
static_assert(sizeof(LargePickup_GhostAnimBP_C_IsPickupCrouched) == 0x000002, "Wrong size on LargePickup_GhostAnimBP_C_IsPickupCrouched");
static_assert(offsetof(LargePickup_GhostAnimBP_C_IsPickupCrouched, bCrouched_0) == 0x000000, "Member 'LargePickup_GhostAnimBP_C_IsPickupCrouched::bCrouched_0' has a wrong offset!");
static_assert(offsetof(LargePickup_GhostAnimBP_C_IsPickupCrouched, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'LargePickup_GhostAnimBP_C_IsPickupCrouched::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

