#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadoutSubTabs

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadoutSubTabs.LoadoutSubTabs_C
// 0x0038 (0x0298 - 0x0260)
class ULoadoutSubTabs_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UActionIconWidget_C*                    LeftTabButton;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UActionIconWidget_C*                    RightTabButton;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TabsBox;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnTabChangeRequested;                              // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	ELoadoutElementType                           CurrentLoadoutCategory;                            // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetSelectedCoreUpgradeTab(int32 NewTier);
	void SetSelectedPerkTab(EPerkCategory NewCategory);
	void Setup(ELoadoutElementType LoadoutCategory);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnTabButtonClicked(class ULoadoutSubTabsButton_C* TabButton);
	void ExecuteUbergraph_LoadoutSubTabs(int32 EntryPoint);
	void OnTabChangeRequested__DelegateSignature(class ULoadoutSubTabsButton_C* TabButton);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadoutSubTabs_C">();
	}
	static class ULoadoutSubTabs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadoutSubTabs_C>();
	}
};
static_assert(alignof(ULoadoutSubTabs_C) == 0x000008, "Wrong alignment on ULoadoutSubTabs_C");
static_assert(sizeof(ULoadoutSubTabs_C) == 0x000298, "Wrong size on ULoadoutSubTabs_C");
static_assert(offsetof(ULoadoutSubTabs_C, UberGraphFrame) == 0x000260, "Member 'ULoadoutSubTabs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoadoutSubTabs_C, LeftTabButton) == 0x000268, "Member 'ULoadoutSubTabs_C::LeftTabButton' has a wrong offset!");
static_assert(offsetof(ULoadoutSubTabs_C, RightTabButton) == 0x000270, "Member 'ULoadoutSubTabs_C::RightTabButton' has a wrong offset!");
static_assert(offsetof(ULoadoutSubTabs_C, TabsBox) == 0x000278, "Member 'ULoadoutSubTabs_C::TabsBox' has a wrong offset!");
static_assert(offsetof(ULoadoutSubTabs_C, OnTabChangeRequested) == 0x000280, "Member 'ULoadoutSubTabs_C::OnTabChangeRequested' has a wrong offset!");
static_assert(offsetof(ULoadoutSubTabs_C, CurrentLoadoutCategory) == 0x000290, "Member 'ULoadoutSubTabs_C::CurrentLoadoutCategory' has a wrong offset!");

}

