#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadoutSubTabs

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function LoadoutSubTabs.LoadoutSubTabs_C.SetSelectedCoreUpgradeTab
// 0x0048 (0x0048 - 0x0000)
struct LoadoutSubTabs_C_SetSelectedCoreUpgradeTab final
{
public:
	int32                                         NewTier;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadoutSubTabsButton_C*                K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoadoutSubTabs_C_SetSelectedCoreUpgradeTab) == 0x000008, "Wrong alignment on LoadoutSubTabs_C_SetSelectedCoreUpgradeTab");
static_assert(sizeof(LoadoutSubTabs_C_SetSelectedCoreUpgradeTab) == 0x000048, "Wrong size on LoadoutSubTabs_C_SetSelectedCoreUpgradeTab");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedCoreUpgradeTab, NewTier) == 0x000000, "Member 'LoadoutSubTabs_C_SetSelectedCoreUpgradeTab::NewTier' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedCoreUpgradeTab, Temp_int_Array_Index_Variable) == 0x000004, "Member 'LoadoutSubTabs_C_SetSelectedCoreUpgradeTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedCoreUpgradeTab, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'LoadoutSubTabs_C_SetSelectedCoreUpgradeTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedCoreUpgradeTab, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'LoadoutSubTabs_C_SetSelectedCoreUpgradeTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedCoreUpgradeTab, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'LoadoutSubTabs_C_SetSelectedCoreUpgradeTab::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedCoreUpgradeTab, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'LoadoutSubTabs_C_SetSelectedCoreUpgradeTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedCoreUpgradeTab, CallFunc_Array_Get_Item) == 0x000028, "Member 'LoadoutSubTabs_C_SetSelectedCoreUpgradeTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedCoreUpgradeTab, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'LoadoutSubTabs_C_SetSelectedCoreUpgradeTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedCoreUpgradeTab, K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button) == 0x000038, "Member 'LoadoutSubTabs_C_SetSelectedCoreUpgradeTab::K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedCoreUpgradeTab, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'LoadoutSubTabs_C_SetSelectedCoreUpgradeTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedCoreUpgradeTab, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000041, "Member 'LoadoutSubTabs_C_SetSelectedCoreUpgradeTab::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function LoadoutSubTabs.LoadoutSubTabs_C.SetSelectedPerkTab
// 0x0048 (0x0048 - 0x0000)
struct LoadoutSubTabs_C_SetSelectedPerkTab final
{
public:
	EPerkCategory                                 NewCategory;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadoutSubTabsButton_C*                K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoadoutSubTabs_C_SetSelectedPerkTab) == 0x000008, "Wrong alignment on LoadoutSubTabs_C_SetSelectedPerkTab");
static_assert(sizeof(LoadoutSubTabs_C_SetSelectedPerkTab) == 0x000048, "Wrong size on LoadoutSubTabs_C_SetSelectedPerkTab");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedPerkTab, NewCategory) == 0x000000, "Member 'LoadoutSubTabs_C_SetSelectedPerkTab::NewCategory' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedPerkTab, Temp_int_Array_Index_Variable) == 0x000004, "Member 'LoadoutSubTabs_C_SetSelectedPerkTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedPerkTab, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'LoadoutSubTabs_C_SetSelectedPerkTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedPerkTab, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'LoadoutSubTabs_C_SetSelectedPerkTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedPerkTab, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'LoadoutSubTabs_C_SetSelectedPerkTab::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedPerkTab, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'LoadoutSubTabs_C_SetSelectedPerkTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedPerkTab, CallFunc_Array_Get_Item) == 0x000028, "Member 'LoadoutSubTabs_C_SetSelectedPerkTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedPerkTab, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'LoadoutSubTabs_C_SetSelectedPerkTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedPerkTab, K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button) == 0x000038, "Member 'LoadoutSubTabs_C_SetSelectedPerkTab::K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedPerkTab, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'LoadoutSubTabs_C_SetSelectedPerkTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_SetSelectedPerkTab, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000041, "Member 'LoadoutSubTabs_C_SetSelectedPerkTab::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function LoadoutSubTabs.LoadoutSubTabs_C.Setup
// 0x0110 (0x0110 - 0x0000)
struct LoadoutSubTabs_C_Setup final
{
public:
	ELoadoutElementType                           LoadoutCategory;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadoutSubTabsButton_C*                CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x002C(0x0008)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_1;                // 0x0040(0x0008)(NoDestructor)
	class ULoadoutSubTabsButton_C*                CallFunc_Create_ReturnValue_1;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULoadoutSubTabsButton_C*                K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button;      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ULoadoutSubTabsButton_C* TabButton)> K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_2;                               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULoadoutSubTabsButton_C* TabButton)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadoutSubTabsButton_C*                K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button_1;    // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x1];                                       // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULoadoutSubTabsButton_C* TabButton)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class ULoadoutSubTabsButton_C*                K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button_2;    // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_1;    // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadoutSubTabs_C_Setup) == 0x000008, "Wrong alignment on LoadoutSubTabs_C_Setup");
static_assert(sizeof(LoadoutSubTabs_C_Setup) == 0x000110, "Wrong size on LoadoutSubTabs_C_Setup");
static_assert(offsetof(LoadoutSubTabs_C_Setup, LoadoutCategory) == 0x000000, "Member 'LoadoutSubTabs_C_Setup::LoadoutCategory' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_Create_ReturnValue) == 0x000008, "Member 'LoadoutSubTabs_C_Setup::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, Temp_int_Variable) == 0x000010, "Member 'LoadoutSubTabs_C_Setup::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, Temp_int_Variable_1) == 0x000014, "Member 'LoadoutSubTabs_C_Setup::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_Conv_IntToByte_ReturnValue) == 0x000018, "Member 'LoadoutSubTabs_C_Setup::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'LoadoutSubTabs_C_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_GetValidValue_ReturnValue) == 0x000020, "Member 'LoadoutSubTabs_C_Setup::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000021, "Member 'LoadoutSubTabs_C_Setup::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000022, "Member 'LoadoutSubTabs_C_Setup::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000023, "Member 'LoadoutSubTabs_C_Setup::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000024, "Member 'LoadoutSubTabs_C_Setup::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'LoadoutSubTabs_C_Setup::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, K2Node_MakeStruct_SlateChildSize) == 0x00002C, "Member 'LoadoutSubTabs_C_Setup::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'LoadoutSubTabs_C_Setup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'LoadoutSubTabs_C_Setup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'LoadoutSubTabs_C_Setup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, K2Node_MakeStruct_SlateChildSize_1) == 0x000040, "Member 'LoadoutSubTabs_C_Setup::K2Node_MakeStruct_SlateChildSize_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_Create_ReturnValue_1) == 0x000048, "Member 'LoadoutSubTabs_C_Setup::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_GetChildrenCount_ReturnValue) == 0x000050, "Member 'LoadoutSubTabs_C_Setup::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_Subtract_IntInt_ReturnValue) == 0x000054, "Member 'LoadoutSubTabs_C_Setup::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_GetChildAt_ReturnValue) == 0x000058, "Member 'LoadoutSubTabs_C_Setup::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button) == 0x000060, "Member 'LoadoutSubTabs_C_Setup::K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'LoadoutSubTabs_C_Setup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'LoadoutSubTabs_C_Setup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, Temp_int_Variable_2) == 0x00007C, "Member 'LoadoutSubTabs_C_Setup::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000080, "Member 'LoadoutSubTabs_C_Setup::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000088, "Member 'LoadoutSubTabs_C_Setup::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_Add_IntInt_ReturnValue_2) == 0x00008C, "Member 'LoadoutSubTabs_C_Setup::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, K2Node_CreateDelegate_OutputDelegate_1) == 0x000090, "Member 'LoadoutSubTabs_C_Setup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_MakeLiteralInt_ReturnValue) == 0x0000A0, "Member 'LoadoutSubTabs_C_Setup::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'LoadoutSubTabs_C_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_GetAllChildren_ReturnValue) == 0x0000A8, "Member 'LoadoutSubTabs_C_Setup::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'LoadoutSubTabs_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'LoadoutSubTabs_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button_1) == 0x0000C8, "Member 'LoadoutSubTabs_C_Setup::K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'LoadoutSubTabs_C_Setup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D1, "Member 'LoadoutSubTabs_C_Setup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000D2, "Member 'LoadoutSubTabs_C_Setup::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_GetChildrenCount_ReturnValue_1) == 0x0000D4, "Member 'LoadoutSubTabs_C_Setup::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000D8, "Member 'LoadoutSubTabs_C_Setup::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000DC, "Member 'LoadoutSubTabs_C_Setup::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_GetChildAt_ReturnValue_1) == 0x0000E0, "Member 'LoadoutSubTabs_C_Setup::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E8, "Member 'LoadoutSubTabs_C_Setup::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button_2) == 0x0000F8, "Member 'LoadoutSubTabs_C_Setup::K2Node_DynamicCast_AsLoadout_Sub_Tabs_Button_2' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'LoadoutSubTabs_C_Setup::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_Setup, CallFunc_AddChildToHorizontalBox_ReturnValue_1) == 0x000108, "Member 'LoadoutSubTabs_C_Setup::CallFunc_AddChildToHorizontalBox_ReturnValue_1' has a wrong offset!");

// Function LoadoutSubTabs.LoadoutSubTabs_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LoadoutSubTabs_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoadoutSubTabs_C_PreConstruct) == 0x000001, "Wrong alignment on LoadoutSubTabs_C_PreConstruct");
static_assert(sizeof(LoadoutSubTabs_C_PreConstruct) == 0x000001, "Wrong size on LoadoutSubTabs_C_PreConstruct");
static_assert(offsetof(LoadoutSubTabs_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LoadoutSubTabs_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LoadoutSubTabs.LoadoutSubTabs_C.OnTabButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct LoadoutSubTabs_C_OnTabButtonClicked final
{
public:
	class ULoadoutSubTabsButton_C*                TabButton;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadoutSubTabs_C_OnTabButtonClicked) == 0x000008, "Wrong alignment on LoadoutSubTabs_C_OnTabButtonClicked");
static_assert(sizeof(LoadoutSubTabs_C_OnTabButtonClicked) == 0x000008, "Wrong size on LoadoutSubTabs_C_OnTabButtonClicked");
static_assert(offsetof(LoadoutSubTabs_C_OnTabButtonClicked, TabButton) == 0x000000, "Member 'LoadoutSubTabs_C_OnTabButtonClicked::TabButton' has a wrong offset!");

// Function LoadoutSubTabs.LoadoutSubTabs_C.ExecuteUbergraph_LoadoutSubTabs
// 0x0010 (0x0010 - 0x0000)
struct LoadoutSubTabs_C_ExecuteUbergraph_LoadoutSubTabs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadoutSubTabsButton_C*                K2Node_CustomEvent_TabButton;                      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadoutSubTabs_C_ExecuteUbergraph_LoadoutSubTabs) == 0x000008, "Wrong alignment on LoadoutSubTabs_C_ExecuteUbergraph_LoadoutSubTabs");
static_assert(sizeof(LoadoutSubTabs_C_ExecuteUbergraph_LoadoutSubTabs) == 0x000010, "Wrong size on LoadoutSubTabs_C_ExecuteUbergraph_LoadoutSubTabs");
static_assert(offsetof(LoadoutSubTabs_C_ExecuteUbergraph_LoadoutSubTabs, EntryPoint) == 0x000000, "Member 'LoadoutSubTabs_C_ExecuteUbergraph_LoadoutSubTabs::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_ExecuteUbergraph_LoadoutSubTabs, K2Node_Event_IsDesignTime) == 0x000004, "Member 'LoadoutSubTabs_C_ExecuteUbergraph_LoadoutSubTabs::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabs_C_ExecuteUbergraph_LoadoutSubTabs, K2Node_CustomEvent_TabButton) == 0x000008, "Member 'LoadoutSubTabs_C_ExecuteUbergraph_LoadoutSubTabs::K2Node_CustomEvent_TabButton' has a wrong offset!");

// Function LoadoutSubTabs.LoadoutSubTabs_C.OnTabChangeRequested__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LoadoutSubTabs_C_OnTabChangeRequested__DelegateSignature final
{
public:
	class ULoadoutSubTabsButton_C*                TabButton;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadoutSubTabs_C_OnTabChangeRequested__DelegateSignature) == 0x000008, "Wrong alignment on LoadoutSubTabs_C_OnTabChangeRequested__DelegateSignature");
static_assert(sizeof(LoadoutSubTabs_C_OnTabChangeRequested__DelegateSignature) == 0x000008, "Wrong size on LoadoutSubTabs_C_OnTabChangeRequested__DelegateSignature");
static_assert(offsetof(LoadoutSubTabs_C_OnTabChangeRequested__DelegateSignature, TabButton) == 0x000000, "Member 'LoadoutSubTabs_C_OnTabChangeRequested__DelegateSignature::TabButton' has a wrong offset!");

}

