#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadoutSubTabsButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LoadoutSubTabsButton.LoadoutSubTabsButton_C.Refresh
// 0x0030 (0x0030 - 0x0000)
struct LoadoutSubTabsButton_C_Refresh final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0008(0x0028)()
};
static_assert(alignof(LoadoutSubTabsButton_C_Refresh) == 0x000008, "Wrong alignment on LoadoutSubTabsButton_C_Refresh");
static_assert(sizeof(LoadoutSubTabsButton_C_Refresh) == 0x000030, "Wrong size on LoadoutSubTabsButton_C_Refresh");
static_assert(offsetof(LoadoutSubTabsButton_C_Refresh, Temp_bool_Variable) == 0x000000, "Member 'LoadoutSubTabsButton_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Refresh, CallFunc_BooleanOR_ReturnValue) == 0x000001, "Member 'LoadoutSubTabsButton_C_Refresh::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Refresh, K2Node_Select_Default) == 0x000008, "Member 'LoadoutSubTabsButton_C_Refresh::K2Node_Select_Default' has a wrong offset!");

// Function LoadoutSubTabsButton.LoadoutSubTabsButton_C.SetHovered
// 0x0001 (0x0001 - 0x0000)
struct LoadoutSubTabsButton_C_SetHovered final
{
public:
	bool                                          Hovered;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoadoutSubTabsButton_C_SetHovered) == 0x000001, "Wrong alignment on LoadoutSubTabsButton_C_SetHovered");
static_assert(sizeof(LoadoutSubTabsButton_C_SetHovered) == 0x000001, "Wrong size on LoadoutSubTabsButton_C_SetHovered");
static_assert(offsetof(LoadoutSubTabsButton_C_SetHovered, Hovered) == 0x000000, "Member 'LoadoutSubTabsButton_C_SetHovered::Hovered' has a wrong offset!");

// Function LoadoutSubTabsButton.LoadoutSubTabsButton_C.SetSelected
// 0x0006 (0x0006 - 0x0000)
struct LoadoutSubTabsButton_C_SetSelected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoadoutSubTabsButton_C_SetSelected) == 0x000001, "Wrong alignment on LoadoutSubTabsButton_C_SetSelected");
static_assert(sizeof(LoadoutSubTabsButton_C_SetSelected) == 0x000006, "Wrong size on LoadoutSubTabsButton_C_SetSelected");
static_assert(offsetof(LoadoutSubTabsButton_C_SetSelected, Selected) == 0x000000, "Member 'LoadoutSubTabsButton_C_SetSelected::Selected' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'LoadoutSubTabsButton_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_SetSelected, Temp_byte_Variable) == 0x000002, "Member 'LoadoutSubTabsButton_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_SetSelected, Temp_byte_Variable_1) == 0x000003, "Member 'LoadoutSubTabsButton_C_SetSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_SetSelected, K2Node_Select_Default) == 0x000004, "Member 'LoadoutSubTabsButton_C_SetSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_SetSelected, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000005, "Member 'LoadoutSubTabsButton_C_SetSelected::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function LoadoutSubTabsButton.LoadoutSubTabsButton_C.Init
// 0x01D0 (0x01D0 - 0x0000)
struct LoadoutSubTabsButton_C_Init final
{
public:
	class FString                                 Temp_string_Variable;                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ELoadoutElementType                           Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELoadoutElementType                           Temp_byte_Variable_1;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0078(0x0018)()
	EPerkCategory                                 Temp_byte_Variable_2;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x00B0(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00C8(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00E0(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0110(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0128(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ReferenceParm)
	bool                                          K2Node_Select_Default_1;                           // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0188(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x01A0(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x01B8(0x0018)()
};
static_assert(alignof(LoadoutSubTabsButton_C_Init) == 0x000008, "Wrong alignment on LoadoutSubTabsButton_C_Init");
static_assert(sizeof(LoadoutSubTabsButton_C_Init) == 0x0001D0, "Wrong size on LoadoutSubTabsButton_C_Init");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_string_Variable) == 0x000000, "Member 'LoadoutSubTabsButton_C_Init::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_string_Variable_1) == 0x000010, "Member 'LoadoutSubTabsButton_C_Init::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_string_Variable_2) == 0x000020, "Member 'LoadoutSubTabsButton_C_Init::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_string_Variable_3) == 0x000030, "Member 'LoadoutSubTabsButton_C_Init::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_byte_Variable) == 0x000040, "Member 'LoadoutSubTabsButton_C_Init::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_bool_Variable) == 0x000041, "Member 'LoadoutSubTabsButton_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_bool_Variable_1) == 0x000042, "Member 'LoadoutSubTabsButton_C_Init::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_bool_Variable_2) == 0x000043, "Member 'LoadoutSubTabsButton_C_Init::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_byte_Variable_1) == 0x000044, "Member 'LoadoutSubTabsButton_C_Init::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_text_Variable) == 0x000048, "Member 'LoadoutSubTabsButton_C_Init::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_text_Variable_1) == 0x000060, "Member 'LoadoutSubTabsButton_C_Init::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_text_Variable_2) == 0x000078, "Member 'LoadoutSubTabsButton_C_Init::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_byte_Variable_2) == 0x000090, "Member 'LoadoutSubTabsButton_C_Init::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_text_Variable_3) == 0x000098, "Member 'LoadoutSubTabsButton_C_Init::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_text_Variable_4) == 0x0000B0, "Member 'LoadoutSubTabsButton_C_Init::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_text_Variable_5) == 0x0000C8, "Member 'LoadoutSubTabsButton_C_Init::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_text_Variable_6) == 0x0000E0, "Member 'LoadoutSubTabsButton_C_Init::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, Temp_int_Variable) == 0x0000F8, "Member 'LoadoutSubTabsButton_C_Init::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000FC, "Member 'LoadoutSubTabsButton_C_Init::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, K2Node_Select_Default) == 0x000100, "Member 'LoadoutSubTabsButton_C_Init::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, CallFunc_Conv_StringToText_ReturnValue) == 0x000110, "Member 'LoadoutSubTabsButton_C_Init::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, K2Node_MakeStruct_FormatArgumentData) == 0x000128, "Member 'LoadoutSubTabsButton_C_Init::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000168, "Member 'LoadoutSubTabsButton_C_Init::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, K2Node_MakeArray_Array) == 0x000170, "Member 'LoadoutSubTabsButton_C_Init::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, K2Node_Select_Default_1) == 0x000180, "Member 'LoadoutSubTabsButton_C_Init::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, CallFunc_Format_ReturnValue) == 0x000188, "Member 'LoadoutSubTabsButton_C_Init::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, K2Node_Select_Default_2) == 0x0001A0, "Member 'LoadoutSubTabsButton_C_Init::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_Init, K2Node_Select_Default_3) == 0x0001B8, "Member 'LoadoutSubTabsButton_C_Init::K2Node_Select_Default_3' has a wrong offset!");

// Function LoadoutSubTabsButton.LoadoutSubTabsButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LoadoutSubTabsButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoadoutSubTabsButton_C_PreConstruct) == 0x000001, "Wrong alignment on LoadoutSubTabsButton_C_PreConstruct");
static_assert(sizeof(LoadoutSubTabsButton_C_PreConstruct) == 0x000001, "Wrong size on LoadoutSubTabsButton_C_PreConstruct");
static_assert(offsetof(LoadoutSubTabsButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LoadoutSubTabsButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LoadoutSubTabsButton.LoadoutSubTabsButton_C.ExecuteUbergraph_LoadoutSubTabsButton
// 0x0008 (0x0008 - 0x0000)
struct LoadoutSubTabsButton_C_ExecuteUbergraph_LoadoutSubTabsButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoadoutSubTabsButton_C_ExecuteUbergraph_LoadoutSubTabsButton) == 0x000004, "Wrong alignment on LoadoutSubTabsButton_C_ExecuteUbergraph_LoadoutSubTabsButton");
static_assert(sizeof(LoadoutSubTabsButton_C_ExecuteUbergraph_LoadoutSubTabsButton) == 0x000008, "Wrong size on LoadoutSubTabsButton_C_ExecuteUbergraph_LoadoutSubTabsButton");
static_assert(offsetof(LoadoutSubTabsButton_C_ExecuteUbergraph_LoadoutSubTabsButton, EntryPoint) == 0x000000, "Member 'LoadoutSubTabsButton_C_ExecuteUbergraph_LoadoutSubTabsButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoadoutSubTabsButton_C_ExecuteUbergraph_LoadoutSubTabsButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'LoadoutSubTabsButton_C_ExecuteUbergraph_LoadoutSubTabsButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function LoadoutSubTabsButton.LoadoutSubTabsButton_C.OnTabButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LoadoutSubTabsButton_C_OnTabButtonClicked__DelegateSignature final
{
public:
	class ULoadoutSubTabsButton_C*                TabButton;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadoutSubTabsButton_C_OnTabButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on LoadoutSubTabsButton_C_OnTabButtonClicked__DelegateSignature");
static_assert(sizeof(LoadoutSubTabsButton_C_OnTabButtonClicked__DelegateSignature) == 0x000008, "Wrong size on LoadoutSubTabsButton_C_OnTabButtonClicked__DelegateSignature");
static_assert(offsetof(LoadoutSubTabsButton_C_OnTabButtonClicked__DelegateSignature, TabButton) == 0x000000, "Member 'LoadoutSubTabsButton_C_OnTabButtonClicked__DelegateSignature::TabButton' has a wrong offset!");

}

