#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadoutRecap

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function LoadoutRecap.LoadoutRecap_C.OnFocusReceived
// 0x01D0 (0x01D0 - 0x0000)
struct LoadoutRecap_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0110(0x00B8)()
	class UWidget*                                K2Node_Select_Default;                             // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadoutRecap_C_OnFocusReceived) == 0x000008, "Wrong alignment on LoadoutRecap_C_OnFocusReceived");
static_assert(sizeof(LoadoutRecap_C_OnFocusReceived) == 0x0001D0, "Wrong size on LoadoutRecap_C_OnFocusReceived");
static_assert(offsetof(LoadoutRecap_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'LoadoutRecap_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(LoadoutRecap_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'LoadoutRecap_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(LoadoutRecap_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'LoadoutRecap_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutRecap_C_OnFocusReceived, Temp_bool_Variable) == 0x0000F8, "Member 'LoadoutRecap_C_OnFocusReceived::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutRecap_C_OnFocusReceived, CallFunc_GetMenuManager_ReturnValue) == 0x000100, "Member 'LoadoutRecap_C_OnFocusReceived::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutRecap_C_OnFocusReceived, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000108, "Member 'LoadoutRecap_C_OnFocusReceived::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutRecap_C_OnFocusReceived, CallFunc_IsValid_ReturnValue) == 0x000109, "Member 'LoadoutRecap_C_OnFocusReceived::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutRecap_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000110, "Member 'LoadoutRecap_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutRecap_C_OnFocusReceived, K2Node_Select_Default) == 0x0001C8, "Member 'LoadoutRecap_C_OnFocusReceived::K2Node_Select_Default' has a wrong offset!");

// Function LoadoutRecap.LoadoutRecap_C.ExecuteUbergraph_LoadoutRecap
// 0x0020 (0x0020 - 0x0000)
struct LoadoutRecap_C_ExecuteUbergraph_LoadoutRecap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadoutRecap_C_ExecuteUbergraph_LoadoutRecap) == 0x000008, "Wrong alignment on LoadoutRecap_C_ExecuteUbergraph_LoadoutRecap");
static_assert(sizeof(LoadoutRecap_C_ExecuteUbergraph_LoadoutRecap) == 0x000020, "Wrong size on LoadoutRecap_C_ExecuteUbergraph_LoadoutRecap");
static_assert(offsetof(LoadoutRecap_C_ExecuteUbergraph_LoadoutRecap, EntryPoint) == 0x000000, "Member 'LoadoutRecap_C_ExecuteUbergraph_LoadoutRecap::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoadoutRecap_C_ExecuteUbergraph_LoadoutRecap, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'LoadoutRecap_C_ExecuteUbergraph_LoadoutRecap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LoadoutRecap_C_ExecuteUbergraph_LoadoutRecap, CallFunc_GetMenuManager_ReturnValue) == 0x000018, "Member 'LoadoutRecap_C_ExecuteUbergraph_LoadoutRecap::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");

// Function LoadoutRecap.LoadoutRecap_C.OnPerkSlotsButtonClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct LoadoutRecap_C_OnPerkSlotsButtonClicked__DelegateSignature final
{
public:
	EPerkCategory                                 PerkCategory;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadoutRecap_C_OnPerkSlotsButtonClicked__DelegateSignature) == 0x000001, "Wrong alignment on LoadoutRecap_C_OnPerkSlotsButtonClicked__DelegateSignature");
static_assert(sizeof(LoadoutRecap_C_OnPerkSlotsButtonClicked__DelegateSignature) == 0x000001, "Wrong size on LoadoutRecap_C_OnPerkSlotsButtonClicked__DelegateSignature");
static_assert(offsetof(LoadoutRecap_C_OnPerkSlotsButtonClicked__DelegateSignature, PerkCategory) == 0x000000, "Member 'LoadoutRecap_C_OnPerkSlotsButtonClicked__DelegateSignature::PerkCategory' has a wrong offset!");

}

