#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbySocialMenuScene_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LobbySocialMenuScene_BP.LobbySocialMenuScene_BP_C
// 0x0070 (0x0328 - 0x02B8)
class ALobbySocialMenuScene_BP_C final : public ARBSocialMenuSceneActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Ngr_MapSet_Lobby_CharHiResSmoke;                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight1;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight;                                       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Fourth;                                            // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Third;                                             // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Single;                                            // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Second;                                            // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   First;                                             // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       SocialMenuCamera;                                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         SkeletalMeshes;                                    // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ReceiveBeginPlay();
	void Event_Activate();
	void Event_Deactivate();
	void ExecuteUbergraph_LobbySocialMenuScene_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbySocialMenuScene_BP_C">();
	}
	static class ALobbySocialMenuScene_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALobbySocialMenuScene_BP_C>();
	}
};
static_assert(alignof(ALobbySocialMenuScene_BP_C) == 0x000008, "Wrong alignment on ALobbySocialMenuScene_BP_C");
static_assert(sizeof(ALobbySocialMenuScene_BP_C) == 0x000328, "Wrong size on ALobbySocialMenuScene_BP_C");
static_assert(offsetof(ALobbySocialMenuScene_BP_C, UberGraphFrame) == 0x0002B8, "Member 'ALobbySocialMenuScene_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALobbySocialMenuScene_BP_C, Ngr_MapSet_Lobby_CharHiResSmoke) == 0x0002C0, "Member 'ALobbySocialMenuScene_BP_C::Ngr_MapSet_Lobby_CharHiResSmoke' has a wrong offset!");
static_assert(offsetof(ALobbySocialMenuScene_BP_C, RBSpotLight1) == 0x0002C8, "Member 'ALobbySocialMenuScene_BP_C::RBSpotLight1' has a wrong offset!");
static_assert(offsetof(ALobbySocialMenuScene_BP_C, RBSpotLight) == 0x0002D0, "Member 'ALobbySocialMenuScene_BP_C::RBSpotLight' has a wrong offset!");
static_assert(offsetof(ALobbySocialMenuScene_BP_C, StaticMesh) == 0x0002D8, "Member 'ALobbySocialMenuScene_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ALobbySocialMenuScene_BP_C, Scene) == 0x0002E0, "Member 'ALobbySocialMenuScene_BP_C::Scene' has a wrong offset!");
static_assert(offsetof(ALobbySocialMenuScene_BP_C, Fourth) == 0x0002E8, "Member 'ALobbySocialMenuScene_BP_C::Fourth' has a wrong offset!");
static_assert(offsetof(ALobbySocialMenuScene_BP_C, Third) == 0x0002F0, "Member 'ALobbySocialMenuScene_BP_C::Third' has a wrong offset!");
static_assert(offsetof(ALobbySocialMenuScene_BP_C, Single) == 0x0002F8, "Member 'ALobbySocialMenuScene_BP_C::Single' has a wrong offset!");
static_assert(offsetof(ALobbySocialMenuScene_BP_C, Second) == 0x000300, "Member 'ALobbySocialMenuScene_BP_C::Second' has a wrong offset!");
static_assert(offsetof(ALobbySocialMenuScene_BP_C, First) == 0x000308, "Member 'ALobbySocialMenuScene_BP_C::First' has a wrong offset!");
static_assert(offsetof(ALobbySocialMenuScene_BP_C, SocialMenuCamera) == 0x000310, "Member 'ALobbySocialMenuScene_BP_C::SocialMenuCamera' has a wrong offset!");
static_assert(offsetof(ALobbySocialMenuScene_BP_C, SkeletalMeshes) == 0x000318, "Member 'ALobbySocialMenuScene_BP_C::SkeletalMeshes' has a wrong offset!");

}

