#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocalPlayerInfo_v2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LocalPlayerInfo_v2.LocalPlayerInfo_v2_C
// 0x0088 (0x02E8 - 0x0260)
class ULocalPlayerInfo_v2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULocalPlayerCurrencyHorizontal_C*       BPPTokenCurrencyWidget;                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULocalPlayerCurrencyHorizontal_C*       BPTokenCurrencyWidget;                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CurrenciesBox;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULocalPlayerCurrencyHorizontal_C*       EventTokenCurrencyWidget;                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_71;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerIcon;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerIconBackground;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerLevelText;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULocalPlayerCurrencyHorizontal_C*       ReleaseTokenCurrencyWidget;                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULocalPlayerCurrencyHorizontal_C*       VouchersCurrencyWidget;                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<ECurrencyType>                         DisabledCurrencyTypes;                             // 0x02C8(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	TArray<ECurrencyType>                         VisibleCurrencyFilter;                             // 0x02D8(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_LocalPlayerInfo_v2(int32 EntryPoint);
	void LoadAndApplyBorder(class URBPlayerIconCustomizationOption* PlayerIconBorder);
	void Destruct();
	void PreConstruct(bool IsDesignTime);
	void LoadAndApplyPlayerIcon(class URBPlayerIconCustomizationOption* PlayerIcon_0);
	void Construct();
	void OnLoaded_02B107EB4F34FDB187DD169F585AA211(class UObject* Loaded);
	void OnLoaded_20B346D14A61CABECF42C889D247854D(class UObject* Loaded);
	void SetText(const class FText& Text);
	void PreviewCost(const TMap<ECurrencyType, int32>& Costs);
	void PreviewSingleCost(int32 Cost, ECurrencyType CurrencyType);
	void StopPreviewingCosts();
	void UpdateCurrencies(const TMap<ECurrencyType, int32>& Currencies);
	void SetLevel(int32 Value);
	void FilterVisibleCurrencies(TArray<ECurrencyType>& Types);
	void RefreshVisibleCurrencies();
	void OnLocalPlayerLevelChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LocalPlayerInfo_v2_C">();
	}
	static class ULocalPlayerInfo_v2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalPlayerInfo_v2_C>();
	}
};
static_assert(alignof(ULocalPlayerInfo_v2_C) == 0x000008, "Wrong alignment on ULocalPlayerInfo_v2_C");
static_assert(sizeof(ULocalPlayerInfo_v2_C) == 0x0002E8, "Wrong size on ULocalPlayerInfo_v2_C");
static_assert(offsetof(ULocalPlayerInfo_v2_C, UberGraphFrame) == 0x000260, "Member 'ULocalPlayerInfo_v2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULocalPlayerInfo_v2_C, BPPTokenCurrencyWidget) == 0x000268, "Member 'ULocalPlayerInfo_v2_C::BPPTokenCurrencyWidget' has a wrong offset!");
static_assert(offsetof(ULocalPlayerInfo_v2_C, BPTokenCurrencyWidget) == 0x000270, "Member 'ULocalPlayerInfo_v2_C::BPTokenCurrencyWidget' has a wrong offset!");
static_assert(offsetof(ULocalPlayerInfo_v2_C, CurrenciesBox) == 0x000278, "Member 'ULocalPlayerInfo_v2_C::CurrenciesBox' has a wrong offset!");
static_assert(offsetof(ULocalPlayerInfo_v2_C, EventTokenCurrencyWidget) == 0x000280, "Member 'ULocalPlayerInfo_v2_C::EventTokenCurrencyWidget' has a wrong offset!");
static_assert(offsetof(ULocalPlayerInfo_v2_C, Image) == 0x000288, "Member 'ULocalPlayerInfo_v2_C::Image' has a wrong offset!");
static_assert(offsetof(ULocalPlayerInfo_v2_C, Image_71) == 0x000290, "Member 'ULocalPlayerInfo_v2_C::Image_71' has a wrong offset!");
static_assert(offsetof(ULocalPlayerInfo_v2_C, PlayerIcon) == 0x000298, "Member 'ULocalPlayerInfo_v2_C::PlayerIcon' has a wrong offset!");
static_assert(offsetof(ULocalPlayerInfo_v2_C, PlayerIconBackground) == 0x0002A0, "Member 'ULocalPlayerInfo_v2_C::PlayerIconBackground' has a wrong offset!");
static_assert(offsetof(ULocalPlayerInfo_v2_C, PlayerLevelText) == 0x0002A8, "Member 'ULocalPlayerInfo_v2_C::PlayerLevelText' has a wrong offset!");
static_assert(offsetof(ULocalPlayerInfo_v2_C, PlayerName) == 0x0002B0, "Member 'ULocalPlayerInfo_v2_C::PlayerName' has a wrong offset!");
static_assert(offsetof(ULocalPlayerInfo_v2_C, ReleaseTokenCurrencyWidget) == 0x0002B8, "Member 'ULocalPlayerInfo_v2_C::ReleaseTokenCurrencyWidget' has a wrong offset!");
static_assert(offsetof(ULocalPlayerInfo_v2_C, VouchersCurrencyWidget) == 0x0002C0, "Member 'ULocalPlayerInfo_v2_C::VouchersCurrencyWidget' has a wrong offset!");
static_assert(offsetof(ULocalPlayerInfo_v2_C, DisabledCurrencyTypes) == 0x0002C8, "Member 'ULocalPlayerInfo_v2_C::DisabledCurrencyTypes' has a wrong offset!");
static_assert(offsetof(ULocalPlayerInfo_v2_C, VisibleCurrencyFilter) == 0x0002D8, "Member 'ULocalPlayerInfo_v2_C::VisibleCurrencyFilter' has a wrong offset!");

}

