#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainObjectiveWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ObjectiveWidgetBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainObjectiveWidget.MainObjectiveWidget_C
// 0x00B0 (0x03E0 - 0x0330)
class UMainObjectiveWidget_C final : public UObjectiveWidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MainObjectiveWidget_C;              // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RemoveAnimation;                                   // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Completed;                                         // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Checkmark;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           CrossOut;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           IntermediateObjectivesContainer;                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIntermediateObjectiveTextWidget_C*     IntermediateObjectiveWidget;                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIntermediateObjectiveTextWidget_C*     IntermediateObjectiveWidget_98;                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIntermediateObjectiveTextWidget_C*     IntermediateObjectiveWidget_180;                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_MainObjectiveWidget;               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ObjectiveIcon;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         ObjectiveTextRich;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ProgressBarContainer;                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressGlow;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ProgressSizeBox;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsMakingPositiveProgress;                          // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProgressBarWidth;                                  // 0x03BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetProgress;                                    // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ObjectiveIconMaterial;                             // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           PositiveProgressTimerHandle;                       // 0x03D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         LastPositiveProgressTimestamp;                     // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainObjectiveWidget(int32 EntryPoint);
	void Event_ProgressChanged(class ARBBaseObjectiveCoordinator* Coordinator, float Progress, bool IsPositiveProgress, const class FText& ObjectiveText, bool bForceShow);
	void Event_Completed();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Event_IsMakingPositiveProgress(bool IsMakingPositiveProgress_0);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Finished_8A3EC16D4EBA343192A93F85CA6E35E3();
	void GetFadeInAnimation(class UWidgetAnimation** FadeInAnimation);
	void SetIsMakingPositiveProgress(bool IsMakingPositiveProgress_0);
	void SetProgressRatio(float Ratio);
	void Initialize(class ARBBaseObjectiveCoordinator* Coordinator);
	void UpdateIntermediateObjectives();
	void GetRemoveAnimation(class UWidgetAnimation** RemoveAnimation_0);

	bool ShouldShow() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainObjectiveWidget_C">();
	}
	static class UMainObjectiveWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainObjectiveWidget_C>();
	}
};
static_assert(alignof(UMainObjectiveWidget_C) == 0x000008, "Wrong alignment on UMainObjectiveWidget_C");
static_assert(sizeof(UMainObjectiveWidget_C) == 0x0003E0, "Wrong size on UMainObjectiveWidget_C");
static_assert(offsetof(UMainObjectiveWidget_C, UberGraphFrame_MainObjectiveWidget_C) == 0x000330, "Member 'UMainObjectiveWidget_C::UberGraphFrame_MainObjectiveWidget_C' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, RemoveAnimation) == 0x000338, "Member 'UMainObjectiveWidget_C::RemoveAnimation' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, FadeIn) == 0x000340, "Member 'UMainObjectiveWidget_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, Completed) == 0x000348, "Member 'UMainObjectiveWidget_C::Completed' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, Checkmark) == 0x000350, "Member 'UMainObjectiveWidget_C::Checkmark' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, CrossOut) == 0x000358, "Member 'UMainObjectiveWidget_C::CrossOut' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, IntermediateObjectivesContainer) == 0x000360, "Member 'UMainObjectiveWidget_C::IntermediateObjectivesContainer' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, IntermediateObjectiveWidget) == 0x000368, "Member 'UMainObjectiveWidget_C::IntermediateObjectiveWidget' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, IntermediateObjectiveWidget_98) == 0x000370, "Member 'UMainObjectiveWidget_C::IntermediateObjectiveWidget_98' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, IntermediateObjectiveWidget_180) == 0x000378, "Member 'UMainObjectiveWidget_C::IntermediateObjectiveWidget_180' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, InvalidationBox_MainObjectiveWidget) == 0x000380, "Member 'UMainObjectiveWidget_C::InvalidationBox_MainObjectiveWidget' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, ObjectiveIcon) == 0x000388, "Member 'UMainObjectiveWidget_C::ObjectiveIcon' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, ObjectiveTextRich) == 0x000390, "Member 'UMainObjectiveWidget_C::ObjectiveTextRich' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, ProgressBar) == 0x000398, "Member 'UMainObjectiveWidget_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, ProgressBarContainer) == 0x0003A0, "Member 'UMainObjectiveWidget_C::ProgressBarContainer' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, ProgressGlow) == 0x0003A8, "Member 'UMainObjectiveWidget_C::ProgressGlow' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, ProgressSizeBox) == 0x0003B0, "Member 'UMainObjectiveWidget_C::ProgressSizeBox' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, IsMakingPositiveProgress) == 0x0003B8, "Member 'UMainObjectiveWidget_C::IsMakingPositiveProgress' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, ProgressBarWidth) == 0x0003BC, "Member 'UMainObjectiveWidget_C::ProgressBarWidth' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, TargetProgress) == 0x0003C0, "Member 'UMainObjectiveWidget_C::TargetProgress' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, ObjectiveIconMaterial) == 0x0003C8, "Member 'UMainObjectiveWidget_C::ObjectiveIconMaterial' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, PositiveProgressTimerHandle) == 0x0003D0, "Member 'UMainObjectiveWidget_C::PositiveProgressTimerHandle' has a wrong offset!");
static_assert(offsetof(UMainObjectiveWidget_C, LastPositiveProgressTimestamp) == 0x0003D8, "Member 'UMainObjectiveWidget_C::LastPositiveProgressTimestamp' has a wrong offset!");

}

