#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mannequin_MHS_SlotMachine

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mannequin_MHS_SlotMachine.Mannequin_MHS_SlotMachine_C
// 0x0058 (0x0288 - 0x0230)
class AMannequin_MHS_SlotMachine_C final : public AActor
{
public:
	class URBPropOptimizerComponent*              RBPropOptimizer;                                   // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      SFX_Manq_Idle_lp;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      NavmeshCapsule;                                    // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SlotMachineMinus01_SKM;                            // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_M_Head;                                         // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_M_LeftHand;                                     // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_M_RightHand;                                    // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_M_Torso_Collar01;                               // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_M_Outfit_01;                                    // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mannequin;                                         // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mannequin_MHS_SlotMachine_C">();
	}
	static class AMannequin_MHS_SlotMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMannequin_MHS_SlotMachine_C>();
	}
};
static_assert(alignof(AMannequin_MHS_SlotMachine_C) == 0x000008, "Wrong alignment on AMannequin_MHS_SlotMachine_C");
static_assert(sizeof(AMannequin_MHS_SlotMachine_C) == 0x000288, "Wrong size on AMannequin_MHS_SlotMachine_C");
static_assert(offsetof(AMannequin_MHS_SlotMachine_C, RBPropOptimizer) == 0x000230, "Member 'AMannequin_MHS_SlotMachine_C::RBPropOptimizer' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_SlotMachine_C, SFX_Manq_Idle_lp) == 0x000238, "Member 'AMannequin_MHS_SlotMachine_C::SFX_Manq_Idle_lp' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_SlotMachine_C, NavmeshCapsule) == 0x000240, "Member 'AMannequin_MHS_SlotMachine_C::NavmeshCapsule' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_SlotMachine_C, SlotMachineMinus01_SKM) == 0x000248, "Member 'AMannequin_MHS_SlotMachine_C::SlotMachineMinus01_SKM' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_SlotMachine_C, Mq_M_Head) == 0x000250, "Member 'AMannequin_MHS_SlotMachine_C::Mq_M_Head' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_SlotMachine_C, Mq_M_LeftHand) == 0x000258, "Member 'AMannequin_MHS_SlotMachine_C::Mq_M_LeftHand' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_SlotMachine_C, Mq_M_RightHand) == 0x000260, "Member 'AMannequin_MHS_SlotMachine_C::Mq_M_RightHand' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_SlotMachine_C, Mq_M_Torso_Collar01) == 0x000268, "Member 'AMannequin_MHS_SlotMachine_C::Mq_M_Torso_Collar01' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_SlotMachine_C, Mq_M_Outfit_01) == 0x000270, "Member 'AMannequin_MHS_SlotMachine_C::Mq_M_Outfit_01' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_SlotMachine_C, Mannequin) == 0x000278, "Member 'AMannequin_MHS_SlotMachine_C::Mannequin' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_SlotMachine_C, DefaultSceneRoot) == 0x000280, "Member 'AMannequin_MHS_SlotMachine_C::DefaultSceneRoot' has a wrong offset!");

}

