#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MannequinBP_SimpleAnimation

#include "Basic.hpp"


namespace SDK::Params
{

// Function MannequinBP_SimpleAnimation.MannequinBP_SimpleAnimation_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct MannequinBP_SimpleAnimation_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MannequinBP_SimpleAnimation_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on MannequinBP_SimpleAnimation_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(MannequinBP_SimpleAnimation_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on MannequinBP_SimpleAnimation_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'MannequinBP_SimpleAnimation_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

// Function MannequinBP_SimpleAnimation.MannequinBP_SimpleAnimation_C.GetStateName
// 0x0028 (0x0028 - 0x0000)
struct MannequinBP_SimpleAnimation_C_GetStateName final
{
public:
	class FString                                 StateA;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StateB;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MannequinBP_SimpleAnimation_C_GetStateName) == 0x000008, "Wrong alignment on MannequinBP_SimpleAnimation_C_GetStateName");
static_assert(sizeof(MannequinBP_SimpleAnimation_C_GetStateName) == 0x000028, "Wrong size on MannequinBP_SimpleAnimation_C_GetStateName");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_GetStateName, StateA) == 0x000000, "Member 'MannequinBP_SimpleAnimation_C_GetStateName::StateA' has a wrong offset!");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_GetStateName, StateB) == 0x000010, "Member 'MannequinBP_SimpleAnimation_C_GetStateName::StateB' has a wrong offset!");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_GetStateName, ReturnValue) == 0x000020, "Member 'MannequinBP_SimpleAnimation_C_GetStateName::ReturnValue' has a wrong offset!");

// Function MannequinBP_SimpleAnimation.MannequinBP_SimpleAnimation_C.CheckIfShouldPlayIdleSound
// 0x0020 (0x0020 - 0x0000)
struct MannequinBP_SimpleAnimation_C_CheckIfShouldPlayIdleSound final
{
public:
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MannequinBP_SimpleAnimation_C_CheckIfShouldPlayIdleSound) == 0x000008, "Wrong alignment on MannequinBP_SimpleAnimation_C_CheckIfShouldPlayIdleSound");
static_assert(sizeof(MannequinBP_SimpleAnimation_C_CheckIfShouldPlayIdleSound) == 0x000020, "Wrong size on MannequinBP_SimpleAnimation_C_CheckIfShouldPlayIdleSound");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_CheckIfShouldPlayIdleSound, CallFunc_PlayLoopingSoundOnActor_ReturnValue) == 0x000000, "Member 'MannequinBP_SimpleAnimation_C_CheckIfShouldPlayIdleSound::CallFunc_PlayLoopingSoundOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_CheckIfShouldPlayIdleSound, CallFunc_GetDisplayName_ReturnValue) == 0x000008, "Member 'MannequinBP_SimpleAnimation_C_CheckIfShouldPlayIdleSound::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_CheckIfShouldPlayIdleSound, CallFunc_Contains_ReturnValue) == 0x000018, "Member 'MannequinBP_SimpleAnimation_C_CheckIfShouldPlayIdleSound::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_CheckIfShouldPlayIdleSound, CallFunc_BooleanOR_ReturnValue) == 0x000019, "Member 'MannequinBP_SimpleAnimation_C_CheckIfShouldPlayIdleSound::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function MannequinBP_SimpleAnimation.MannequinBP_SimpleAnimation_C.UpdateAnimActive
// 0x0001 (0x0001 - 0x0000)
struct MannequinBP_SimpleAnimation_C_UpdateAnimActive final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MannequinBP_SimpleAnimation_C_UpdateAnimActive) == 0x000001, "Wrong alignment on MannequinBP_SimpleAnimation_C_UpdateAnimActive");
static_assert(sizeof(MannequinBP_SimpleAnimation_C_UpdateAnimActive) == 0x000001, "Wrong size on MannequinBP_SimpleAnimation_C_UpdateAnimActive");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_UpdateAnimActive, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'MannequinBP_SimpleAnimation_C_UpdateAnimActive::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function MannequinBP_SimpleAnimation.MannequinBP_SimpleAnimation_C.PrepareState
// 0x0010 (0x0010 - 0x0000)
struct MannequinBP_SimpleAnimation_C_PrepareState final
{
public:
	bool                                          bStateA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RandomOwner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MannequinBP_SimpleAnimation_C_PrepareState) == 0x000008, "Wrong alignment on MannequinBP_SimpleAnimation_C_PrepareState");
static_assert(sizeof(MannequinBP_SimpleAnimation_C_PrepareState) == 0x000010, "Wrong size on MannequinBP_SimpleAnimation_C_PrepareState");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_PrepareState, bStateA) == 0x000000, "Member 'MannequinBP_SimpleAnimation_C_PrepareState::bStateA' has a wrong offset!");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_PrepareState, RandomOwner) == 0x000008, "Member 'MannequinBP_SimpleAnimation_C_PrepareState::RandomOwner' has a wrong offset!");

// Function MannequinBP_SimpleAnimation.MannequinBP_SimpleAnimation_C.PostEditMove
// 0x0001 (0x0001 - 0x0000)
struct MannequinBP_SimpleAnimation_C_PostEditMove final
{
public:
	bool                                          bFinished;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MannequinBP_SimpleAnimation_C_PostEditMove) == 0x000001, "Wrong alignment on MannequinBP_SimpleAnimation_C_PostEditMove");
static_assert(sizeof(MannequinBP_SimpleAnimation_C_PostEditMove) == 0x000001, "Wrong size on MannequinBP_SimpleAnimation_C_PostEditMove");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_PostEditMove, bFinished) == 0x000000, "Member 'MannequinBP_SimpleAnimation_C_PostEditMove::bFinished' has a wrong offset!");

// Function MannequinBP_SimpleAnimation.MannequinBP_SimpleAnimation_C.SetShouldBeIgnoredForLots
// 0x0001 (0x0001 - 0x0000)
struct MannequinBP_SimpleAnimation_C_SetShouldBeIgnoredForLots final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MannequinBP_SimpleAnimation_C_SetShouldBeIgnoredForLots) == 0x000001, "Wrong alignment on MannequinBP_SimpleAnimation_C_SetShouldBeIgnoredForLots");
static_assert(sizeof(MannequinBP_SimpleAnimation_C_SetShouldBeIgnoredForLots) == 0x000001, "Wrong size on MannequinBP_SimpleAnimation_C_SetShouldBeIgnoredForLots");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_SetShouldBeIgnoredForLots, bValue) == 0x000000, "Member 'MannequinBP_SimpleAnimation_C_SetShouldBeIgnoredForLots::bValue' has a wrong offset!");

// Function MannequinBP_SimpleAnimation.MannequinBP_SimpleAnimation_C.SetState
// 0x0001 (0x0001 - 0x0000)
struct MannequinBP_SimpleAnimation_C_SetState final
{
public:
	bool                                          bStateA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MannequinBP_SimpleAnimation_C_SetState) == 0x000001, "Wrong alignment on MannequinBP_SimpleAnimation_C_SetState");
static_assert(sizeof(MannequinBP_SimpleAnimation_C_SetState) == 0x000001, "Wrong size on MannequinBP_SimpleAnimation_C_SetState");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_SetState, bStateA) == 0x000000, "Member 'MannequinBP_SimpleAnimation_C_SetState::bStateA' has a wrong offset!");

// Function MannequinBP_SimpleAnimation.MannequinBP_SimpleAnimation_C.ExecuteUbergraph_MannequinBP_SimpleAnimation
// 0x0018 (0x0018 - 0x0000)
struct MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStateA_1;                            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_randomOwner;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFinished;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bValue;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStateA;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation) == 0x000008, "Wrong alignment on MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation");
static_assert(sizeof(MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation) == 0x000018, "Wrong size on MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation, EntryPoint) == 0x000000, "Member 'MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation::EntryPoint' has a wrong offset!");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation, K2Node_Event_bStateA_1) == 0x000005, "Member 'MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation::K2Node_Event_bStateA_1' has a wrong offset!");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation, K2Node_Event_randomOwner) == 0x000008, "Member 'MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation::K2Node_Event_randomOwner' has a wrong offset!");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation, K2Node_Event_bFinished) == 0x000010, "Member 'MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation::K2Node_Event_bFinished' has a wrong offset!");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation, K2Node_Event_bValue) == 0x000011, "Member 'MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation::K2Node_Event_bValue' has a wrong offset!");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation, K2Node_Event_bStateA) == 0x000012, "Member 'MannequinBP_SimpleAnimation_C_ExecuteUbergraph_MannequinBP_SimpleAnimation::K2Node_Event_bStateA' has a wrong offset!");

// Function MannequinBP_SimpleAnimation.MannequinBP_SimpleAnimation_C.IsRandomStateSet
// 0x0001 (0x0001 - 0x0000)
struct MannequinBP_SimpleAnimation_C_IsRandomStateSet final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MannequinBP_SimpleAnimation_C_IsRandomStateSet) == 0x000001, "Wrong alignment on MannequinBP_SimpleAnimation_C_IsRandomStateSet");
static_assert(sizeof(MannequinBP_SimpleAnimation_C_IsRandomStateSet) == 0x000001, "Wrong size on MannequinBP_SimpleAnimation_C_IsRandomStateSet");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_IsRandomStateSet, ReturnValue) == 0x000000, "Member 'MannequinBP_SimpleAnimation_C_IsRandomStateSet::ReturnValue' has a wrong offset!");

// Function MannequinBP_SimpleAnimation.MannequinBP_SimpleAnimation_C.IsStateA
// 0x0002 (0x0002 - 0x0000)
struct MannequinBP_SimpleAnimation_C_IsStateA final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsStateA_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MannequinBP_SimpleAnimation_C_IsStateA) == 0x000001, "Wrong alignment on MannequinBP_SimpleAnimation_C_IsStateA");
static_assert(sizeof(MannequinBP_SimpleAnimation_C_IsStateA) == 0x000002, "Wrong size on MannequinBP_SimpleAnimation_C_IsStateA");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_IsStateA, ReturnValue) == 0x000000, "Member 'MannequinBP_SimpleAnimation_C_IsStateA::ReturnValue' has a wrong offset!");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_IsStateA, CallFunc_BP_IsStateA_ReturnValue) == 0x000001, "Member 'MannequinBP_SimpleAnimation_C_IsStateA::CallFunc_BP_IsStateA_ReturnValue' has a wrong offset!");

// Function MannequinBP_SimpleAnimation.MannequinBP_SimpleAnimation_C.ShouldBeIgnoredForLots
// 0x0002 (0x0002 - 0x0000)
struct MannequinBP_SimpleAnimation_C_ShouldBeIgnoredForLots final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_ShouldBeIgnoredForLots_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MannequinBP_SimpleAnimation_C_ShouldBeIgnoredForLots) == 0x000001, "Wrong alignment on MannequinBP_SimpleAnimation_C_ShouldBeIgnoredForLots");
static_assert(sizeof(MannequinBP_SimpleAnimation_C_ShouldBeIgnoredForLots) == 0x000002, "Wrong size on MannequinBP_SimpleAnimation_C_ShouldBeIgnoredForLots");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_ShouldBeIgnoredForLots, ReturnValue) == 0x000000, "Member 'MannequinBP_SimpleAnimation_C_ShouldBeIgnoredForLots::ReturnValue' has a wrong offset!");
static_assert(offsetof(MannequinBP_SimpleAnimation_C_ShouldBeIgnoredForLots, CallFunc_BP_ShouldBeIgnoredForLots_ReturnValue) == 0x000001, "Member 'MannequinBP_SimpleAnimation_C_ShouldBeIgnoredForLots::CallFunc_BP_ShouldBeIgnoredForLots_ReturnValue' has a wrong offset!");

}

