#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MannequinStaticMeshAssetStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct MannequinStaticMeshAssetStruct.MannequinStaticMeshAssetStruct
// 0x0060 (0x0060 - 0x0000)
struct FMannequinStaticMeshAssetStruct final
{
public:
	class FName                                   SocketName_6_8A82A5E441EBFD58CB5E6CB9EF488125;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            StaticMesh_5_BD5281B64ADA269F0A5CA48453A8C78B;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class UMaterialInstance*>   Materials_11_C1E140E64BCA01DA84984D93459042E8;     // 0x0010(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FMannequinStaticMeshAssetStruct) == 0x000008, "Wrong alignment on FMannequinStaticMeshAssetStruct");
static_assert(sizeof(FMannequinStaticMeshAssetStruct) == 0x000060, "Wrong size on FMannequinStaticMeshAssetStruct");
static_assert(offsetof(FMannequinStaticMeshAssetStruct, SocketName_6_8A82A5E441EBFD58CB5E6CB9EF488125) == 0x000000, "Member 'FMannequinStaticMeshAssetStruct::SocketName_6_8A82A5E441EBFD58CB5E6CB9EF488125' has a wrong offset!");
static_assert(offsetof(FMannequinStaticMeshAssetStruct, StaticMesh_5_BD5281B64ADA269F0A5CA48453A8C78B) == 0x000008, "Member 'FMannequinStaticMeshAssetStruct::StaticMesh_5_BD5281B64ADA269F0A5CA48453A8C78B' has a wrong offset!");
static_assert(offsetof(FMannequinStaticMeshAssetStruct, Materials_11_C1E140E64BCA01DA84984D93459042E8) == 0x000010, "Member 'FMannequinStaticMeshAssetStruct::Materials_11_C1E140E64BCA01DA84984D93459042E8' has a wrong offset!");

}

