#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mannequin_MHS_DancersMinus01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mannequin_MHS_Dancers-01.Mannequin_MHS_Dancers-01_C
// 0x00A8 (0x02D8 - 0x0230)
class AMannequin_MHS_DancersMinus01_C final : public AActor
{
public:
	class URBPropOptimizerComponent*              RBPropOptimizer;                                   // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      RBSound;                                           // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      NavmeshCapsule;                                    // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_M_Outfit_01;                                    // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_M_Torso_Collar01;                               // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_M_RightHand;                                    // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_M_LeftHand;                                     // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_M_Head;                                         // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 MannequinMinus02;                                  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_F_Outfit_03_Shoes;                              // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_F_Outfit_05_B;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_F_Outfit_05;                                    // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_F_Torso_Collar01;                               // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_F_RightHand;                                    // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_F_RightArm_ForeArm01;                           // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_F_Legs;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_F_LeftHand;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_F_LeftArm_ForeArm01;                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mq_F_Head;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 MannequinMinus01;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mannequin_MHS_Dancers-01_C">();
	}
	static class AMannequin_MHS_DancersMinus01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMannequin_MHS_DancersMinus01_C>();
	}
};
static_assert(alignof(AMannequin_MHS_DancersMinus01_C) == 0x000008, "Wrong alignment on AMannequin_MHS_DancersMinus01_C");
static_assert(sizeof(AMannequin_MHS_DancersMinus01_C) == 0x0002D8, "Wrong size on AMannequin_MHS_DancersMinus01_C");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, RBPropOptimizer) == 0x000230, "Member 'AMannequin_MHS_DancersMinus01_C::RBPropOptimizer' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, RBSound) == 0x000238, "Member 'AMannequin_MHS_DancersMinus01_C::RBSound' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, NavmeshCapsule) == 0x000240, "Member 'AMannequin_MHS_DancersMinus01_C::NavmeshCapsule' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_M_Outfit_01) == 0x000248, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_M_Outfit_01' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_M_Torso_Collar01) == 0x000250, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_M_Torso_Collar01' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_M_RightHand) == 0x000258, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_M_RightHand' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_M_LeftHand) == 0x000260, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_M_LeftHand' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_M_Head) == 0x000268, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_M_Head' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, MannequinMinus02) == 0x000270, "Member 'AMannequin_MHS_DancersMinus01_C::MannequinMinus02' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_F_Outfit_03_Shoes) == 0x000278, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_F_Outfit_03_Shoes' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_F_Outfit_05_B) == 0x000280, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_F_Outfit_05_B' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_F_Outfit_05) == 0x000288, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_F_Outfit_05' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_F_Torso_Collar01) == 0x000290, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_F_Torso_Collar01' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_F_RightHand) == 0x000298, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_F_RightHand' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_F_RightArm_ForeArm01) == 0x0002A0, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_F_RightArm_ForeArm01' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_F_Legs) == 0x0002A8, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_F_Legs' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_F_LeftHand) == 0x0002B0, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_F_LeftHand' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_F_LeftArm_ForeArm01) == 0x0002B8, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_F_LeftArm_ForeArm01' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, Mq_F_Head) == 0x0002C0, "Member 'AMannequin_MHS_DancersMinus01_C::Mq_F_Head' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, MannequinMinus01) == 0x0002C8, "Member 'AMannequin_MHS_DancersMinus01_C::MannequinMinus01' has a wrong offset!");
static_assert(offsetof(AMannequin_MHS_DancersMinus01_C, DefaultSceneRoot) == 0x0002D0, "Member 'AMannequin_MHS_DancersMinus01_C::DefaultSceneRoot' has a wrong offset!");

}

