#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MansionWallBase

#include "Basic.hpp"

#include "ModuleMeshData_structs.hpp"


namespace SDK::Params
{

// Function MansionWallBase.MansionWallBase_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct MansionWallBase_C_UserConstructionScript final
{
public:
	TArray<struct FModuleMeshData>                Temp_struct_Variable;                              // 0x0000(0x0010)(ReferenceParm)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MansionWallBase_C_UserConstructionScript) == 0x000008, "Wrong alignment on MansionWallBase_C_UserConstructionScript");
static_assert(sizeof(MansionWallBase_C_UserConstructionScript) == 0x000018, "Wrong size on MansionWallBase_C_UserConstructionScript");
static_assert(offsetof(MansionWallBase_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'MansionWallBase_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(MansionWallBase_C_UserConstructionScript, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000010, "Member 'MansionWallBase_C_UserConstructionScript::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MansionWallBase_C_UserConstructionScript, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000011, "Member 'MansionWallBase_C_UserConstructionScript::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");

}

