#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MansionWallBase

#include "Basic.hpp"

#include "GrayBoxMat_ENU_structs.hpp"
#include "ModuleMeshData_structs.hpp"
#include "SimpleWallMinus01_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MansionWallBase.MansionWallBase_C
// 0x0038 (0x04A0 - 0x0468)
class AMansionWallBase_C : public ASimpleWallMinus01_BP_C
{
public:
	EGrayBoxMat_ENU                               Materials;                                         // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOverwriteMaterials;                             // 0x0469(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseAlternativeBottomMoldings;                      // 0x046A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B[0x5];                                      // 0x046B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModuleMeshData>                AlternativeMoldings;                               // 0x0470(0x0010)(Edit, BlueprintVisible)
	bool                                          UseAlternateBottomMoldings2;                       // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModuleMeshData>                AlternativeMoldings2;                              // 0x0488(0x0010)(Edit, BlueprintVisible)
	bool                                          UseWallEnuLegacy;                                  // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MansionWallBase_C">();
	}
	static class AMansionWallBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMansionWallBase_C>();
	}
};
static_assert(alignof(AMansionWallBase_C) == 0x000008, "Wrong alignment on AMansionWallBase_C");
static_assert(sizeof(AMansionWallBase_C) == 0x0004A0, "Wrong size on AMansionWallBase_C");
static_assert(offsetof(AMansionWallBase_C, Materials) == 0x000468, "Member 'AMansionWallBase_C::Materials' has a wrong offset!");
static_assert(offsetof(AMansionWallBase_C, UseOverwriteMaterials) == 0x000469, "Member 'AMansionWallBase_C::UseOverwriteMaterials' has a wrong offset!");
static_assert(offsetof(AMansionWallBase_C, UseAlternativeBottomMoldings) == 0x00046A, "Member 'AMansionWallBase_C::UseAlternativeBottomMoldings' has a wrong offset!");
static_assert(offsetof(AMansionWallBase_C, AlternativeMoldings) == 0x000470, "Member 'AMansionWallBase_C::AlternativeMoldings' has a wrong offset!");
static_assert(offsetof(AMansionWallBase_C, UseAlternateBottomMoldings2) == 0x000480, "Member 'AMansionWallBase_C::UseAlternateBottomMoldings2' has a wrong offset!");
static_assert(offsetof(AMansionWallBase_C, AlternativeMoldings2) == 0x000488, "Member 'AMansionWallBase_C::AlternativeMoldings2' has a wrong offset!");
static_assert(offsetof(AMansionWallBase_C, UseWallEnuLegacy) == 0x000498, "Member 'AMansionWallBase_C::UseWallEnuLegacy' has a wrong offset!");

}

