#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MaxStaminaBoost_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SimpleMesh_Pickup_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MaxStaminaBoost_BP.MaxStaminaBoost_BP_C
// 0x0020 (0x0AA0 - 0x0A80)
class AMaxStaminaBoost_BP_C final : public ASimpleMesh_Pickup_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MaxStaminaBoost_BP_C;               // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ConsumeTimeline_NewTrack_0_E36C6E9F4B838C52FC8F1D9D56902A7C; // 0x0A88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ConsumeTimeline__Direction_E36C6E9F4B838C52FC8F1D9D56902A7C; // 0x0A8C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8D[0x3];                                      // 0x0A8D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ConsumeTimeline;                                   // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ConsumeTimeline__FinishedFunc();
	void ConsumeTimeline__UpdateFunc();
	void OnConsumeItemNotify(class ARBPawn* Pawn);
	void OnConsumeItemCancelledNotify(class ARBPawn* Pawn);
	void ExecuteUbergraph_MaxStaminaBoost_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MaxStaminaBoost_BP_C">();
	}
	static class AMaxStaminaBoost_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMaxStaminaBoost_BP_C>();
	}
};
static_assert(alignof(AMaxStaminaBoost_BP_C) == 0x000010, "Wrong alignment on AMaxStaminaBoost_BP_C");
static_assert(sizeof(AMaxStaminaBoost_BP_C) == 0x000AA0, "Wrong size on AMaxStaminaBoost_BP_C");
static_assert(offsetof(AMaxStaminaBoost_BP_C, UberGraphFrame_MaxStaminaBoost_BP_C) == 0x000A80, "Member 'AMaxStaminaBoost_BP_C::UberGraphFrame_MaxStaminaBoost_BP_C' has a wrong offset!");
static_assert(offsetof(AMaxStaminaBoost_BP_C, ConsumeTimeline_NewTrack_0_E36C6E9F4B838C52FC8F1D9D56902A7C) == 0x000A88, "Member 'AMaxStaminaBoost_BP_C::ConsumeTimeline_NewTrack_0_E36C6E9F4B838C52FC8F1D9D56902A7C' has a wrong offset!");
static_assert(offsetof(AMaxStaminaBoost_BP_C, ConsumeTimeline__Direction_E36C6E9F4B838C52FC8F1D9D56902A7C) == 0x000A8C, "Member 'AMaxStaminaBoost_BP_C::ConsumeTimeline__Direction_E36C6E9F4B838C52FC8F1D9D56902A7C' has a wrong offset!");
static_assert(offsetof(AMaxStaminaBoost_BP_C, ConsumeTimeline) == 0x000A90, "Member 'AMaxStaminaBoost_BP_C::ConsumeTimeline' has a wrong offset!");

}

