#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuCharacter_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MenuCharacter_AnimBP.MenuCharacter_AnimBP_C.ExecuteUbergraph_MenuCharacter_AnimBP
// 0x00F8 (0x00F8 - 0x0000)
struct MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_DynamicCast_AsAnim_Sequence;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_DynamicCast_AsAnim_Sequence_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMenuCharacter_C*                       K2Node_DynamicCast_AsMenu_Character;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_AnimStyle;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBEmoteCustomizationOption*            K2Node_CustomEvent_EmoteCustomizationOption;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPreview;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_TerminalAnimOffset;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_PodiumAnimDelay;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_DynamicCast_AsAnim_Sequence_2;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_2; // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_2;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_3;      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP) == 0x000008, "Wrong alignment on MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP");
static_assert(sizeof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP) == 0x0000F8, "Wrong size on MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, EntryPoint) == 0x000000, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, Temp_object_Variable) == 0x000008, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_CustomEvent_Loaded_1) == 0x000010, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_DynamicCast_AsAnim_Sequence) == 0x000018, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_DynamicCast_AsAnim_Sequence' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, Temp_object_Variable_1) == 0x000028, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_CustomEvent_Loaded) == 0x000030, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_DynamicCast_AsAnim_Sequence_1) == 0x000038, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_DynamicCast_AsAnim_Sequence_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_CustomEvent_Loaded_2) == 0x000048, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_CreateDelegate_OutputDelegate_2) == 0x000070, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_GetOwningActor_ReturnValue) == 0x000080, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_DynamicCast_AsMenu_Character) == 0x000088, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_DynamicCast_AsMenu_Character' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_Event_DeltaTimeX) == 0x000094, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_RandomInteger_ReturnValue) == 0x000098, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_IsValid_ReturnValue) == 0x00009C, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_CustomEvent_AnimStyle) == 0x0000A0, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_CustomEvent_AnimStyle' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_CustomEvent_EmoteCustomizationOption) == 0x0000A8, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_CustomEvent_EmoteCustomizationOption' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_CustomEvent_bIsPreview) == 0x0000B0, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_CustomEvent_bIsPreview' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_CustomEvent_TerminalAnimOffset) == 0x0000B4, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_CustomEvent_TerminalAnimOffset' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_CustomEvent_PodiumAnimDelay) == 0x0000B8, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_CustomEvent_PodiumAnimDelay' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, Temp_object_Variable_2) == 0x0000C0, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_DynamicCast_AsAnim_Sequence_2) == 0x0000C8, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_DynamicCast_AsAnim_Sequence_2' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_DynamicCast_bSuccess_3) == 0x0000D0, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_IsValid_ReturnValue_1) == 0x0000D1, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000D2, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x0000D3, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_IsValidSoftObjectReference_ReturnValue_2) == 0x0000D4, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_IsValidSoftObjectReference_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, Temp_bool_Variable) == 0x0000D5, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0000D6, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x0000D7, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, Temp_float_Variable) == 0x0000D8, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_Select_Default) == 0x0000DC, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, Temp_bool_Variable_1) == 0x0000E1, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, Temp_float_Variable_1) == 0x0000E4, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000E8, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, K2Node_Select_Default_1) == 0x0000EC, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_NotEqual_ObjectObject_ReturnValue_2) == 0x0000F0, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_NotEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_NotEqual_ObjectObject_ReturnValue_3) == 0x0000F1, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_NotEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000F2, "Member 'MenuCharacter_AnimBP_C_ExecuteUbergraph_MenuCharacter_AnimBP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function MenuCharacter_AnimBP.MenuCharacter_AnimBP_C.Update Emote
// 0x0020 (0x0020 - 0x0000)
struct MenuCharacter_AnimBP_C_Update_Emote final
{
public:
	int32                                         AnimStyle;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBEmoteCustomizationOption*            EmoteCustomizationOption;                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPreview_0;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TerminalAnimOffset_0;                              // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PodiumAnimDelay_0;                                 // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_AnimBP_C_Update_Emote) == 0x000008, "Wrong alignment on MenuCharacter_AnimBP_C_Update_Emote");
static_assert(sizeof(MenuCharacter_AnimBP_C_Update_Emote) == 0x000020, "Wrong size on MenuCharacter_AnimBP_C_Update_Emote");
static_assert(offsetof(MenuCharacter_AnimBP_C_Update_Emote, AnimStyle) == 0x000000, "Member 'MenuCharacter_AnimBP_C_Update_Emote::AnimStyle' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_Update_Emote, EmoteCustomizationOption) == 0x000008, "Member 'MenuCharacter_AnimBP_C_Update_Emote::EmoteCustomizationOption' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_Update_Emote, bIsPreview_0) == 0x000010, "Member 'MenuCharacter_AnimBP_C_Update_Emote::bIsPreview_0' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_Update_Emote, TerminalAnimOffset_0) == 0x000014, "Member 'MenuCharacter_AnimBP_C_Update_Emote::TerminalAnimOffset_0' has a wrong offset!");
static_assert(offsetof(MenuCharacter_AnimBP_C_Update_Emote, PodiumAnimDelay_0) == 0x000018, "Member 'MenuCharacter_AnimBP_C_Update_Emote::PodiumAnimDelay_0' has a wrong offset!");

// Function MenuCharacter_AnimBP.MenuCharacter_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct MenuCharacter_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on MenuCharacter_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(MenuCharacter_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on MenuCharacter_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(MenuCharacter_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'MenuCharacter_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function MenuCharacter_AnimBP.MenuCharacter_AnimBP_C.OnLoaded_85E309BE415E2A414D16D3A74151BA86
// 0x0008 (0x0008 - 0x0000)
struct MenuCharacter_AnimBP_C_OnLoaded_85E309BE415E2A414D16D3A74151BA86 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_AnimBP_C_OnLoaded_85E309BE415E2A414D16D3A74151BA86) == 0x000008, "Wrong alignment on MenuCharacter_AnimBP_C_OnLoaded_85E309BE415E2A414D16D3A74151BA86");
static_assert(sizeof(MenuCharacter_AnimBP_C_OnLoaded_85E309BE415E2A414D16D3A74151BA86) == 0x000008, "Wrong size on MenuCharacter_AnimBP_C_OnLoaded_85E309BE415E2A414D16D3A74151BA86");
static_assert(offsetof(MenuCharacter_AnimBP_C_OnLoaded_85E309BE415E2A414D16D3A74151BA86, Loaded) == 0x000000, "Member 'MenuCharacter_AnimBP_C_OnLoaded_85E309BE415E2A414D16D3A74151BA86::Loaded' has a wrong offset!");

// Function MenuCharacter_AnimBP.MenuCharacter_AnimBP_C.OnLoaded_7752107C41CD4BF270485A89F7FFAF51
// 0x0008 (0x0008 - 0x0000)
struct MenuCharacter_AnimBP_C_OnLoaded_7752107C41CD4BF270485A89F7FFAF51 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_AnimBP_C_OnLoaded_7752107C41CD4BF270485A89F7FFAF51) == 0x000008, "Wrong alignment on MenuCharacter_AnimBP_C_OnLoaded_7752107C41CD4BF270485A89F7FFAF51");
static_assert(sizeof(MenuCharacter_AnimBP_C_OnLoaded_7752107C41CD4BF270485A89F7FFAF51) == 0x000008, "Wrong size on MenuCharacter_AnimBP_C_OnLoaded_7752107C41CD4BF270485A89F7FFAF51");
static_assert(offsetof(MenuCharacter_AnimBP_C_OnLoaded_7752107C41CD4BF270485A89F7FFAF51, Loaded) == 0x000000, "Member 'MenuCharacter_AnimBP_C_OnLoaded_7752107C41CD4BF270485A89F7FFAF51::Loaded' has a wrong offset!");

// Function MenuCharacter_AnimBP.MenuCharacter_AnimBP_C.OnLoaded_E30C2BAF458C1CC00689BF8A9B4CB90D
// 0x0008 (0x0008 - 0x0000)
struct MenuCharacter_AnimBP_C_OnLoaded_E30C2BAF458C1CC00689BF8A9B4CB90D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_AnimBP_C_OnLoaded_E30C2BAF458C1CC00689BF8A9B4CB90D) == 0x000008, "Wrong alignment on MenuCharacter_AnimBP_C_OnLoaded_E30C2BAF458C1CC00689BF8A9B4CB90D");
static_assert(sizeof(MenuCharacter_AnimBP_C_OnLoaded_E30C2BAF458C1CC00689BF8A9B4CB90D) == 0x000008, "Wrong size on MenuCharacter_AnimBP_C_OnLoaded_E30C2BAF458C1CC00689BF8A9B4CB90D");
static_assert(offsetof(MenuCharacter_AnimBP_C_OnLoaded_E30C2BAF458C1CC00689BF8A9B4CB90D, Loaded) == 0x000000, "Member 'MenuCharacter_AnimBP_C_OnLoaded_E30C2BAF458C1CC00689BF8A9B4CB90D::Loaded' has a wrong offset!");

// Function MenuCharacter_AnimBP.MenuCharacter_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct MenuCharacter_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(MenuCharacter_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on MenuCharacter_AnimBP_C_AnimGraph");
static_assert(sizeof(MenuCharacter_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on MenuCharacter_AnimBP_C_AnimGraph");
static_assert(offsetof(MenuCharacter_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'MenuCharacter_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

