#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuCharacter

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MenuCharacter.MenuCharacter_C.OncategoryClickedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MenuCharacter_C_OncategoryClickedEvent__DelegateSignature final
{
public:
	ECustomizationMenuCategory                    CustomizationMenuCategory;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_C_OncategoryClickedEvent__DelegateSignature) == 0x000001, "Wrong alignment on MenuCharacter_C_OncategoryClickedEvent__DelegateSignature");
static_assert(sizeof(MenuCharacter_C_OncategoryClickedEvent__DelegateSignature) == 0x000001, "Wrong size on MenuCharacter_C_OncategoryClickedEvent__DelegateSignature");
static_assert(offsetof(MenuCharacter_C_OncategoryClickedEvent__DelegateSignature, CustomizationMenuCategory) == 0x000000, "Member 'MenuCharacter_C_OncategoryClickedEvent__DelegateSignature::CustomizationMenuCategory' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.ExecuteUbergraph_MenuCharacter
// 0x0310 (0x0310 - 0x0000)
struct MenuCharacter_C_ExecuteUbergraph_MenuCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnableThumbnailEmoteMode;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* CustomizationOwner, int32 RequestID, EPawnCustomizationRequestType RequestType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECustomizationMenuCategory CustomizationMenuCategory)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Factor;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x005C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECustomizationMenuCategory                    K2Node_CustomEvent_CustomizationMenuCategory;      // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuCharacter_AnimBP_C*                K2Node_DynamicCast_AsMenu_Character_Anim_BP;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPawnCustomizationManager*            CallFunc_GetPawnCustomizationManager_ReturnValue;  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LoadPlayerCustomizationResources_ReturnValue; // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_Event_addedExtraMeshes;                     // 0x0110(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	EPlayerCustomizationSlot                      K2Node_Event_slot;                                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActiveSkillType                              K2Node_CustomEvent_SkillType;                      // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0140(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	class URBPawnCustomizationManager*            CallFunc_GetPawnCustomizationManager_ReturnValue_1; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_customizationOwner;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_requestID;                      // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPawnCustomizationRequestType                 K2Node_CustomEvent_requestType;                    // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_196[0x2];                                      // 0x0196(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ARBActiveSkill>             CallFunc_GetActiveSkillClass_ReturnValue;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x01C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x01E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsHidden;                            // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuCharacter_AnimBP_C*                K2Node_DynamicCast_AsMenu_Character_Anim_BP_1;     // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBPlayerCustomizationInfo             K2Node_Event_customizationInfo;                    // 0x02A8(0x0050)()
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFace_Emote_AnimBP_C*                   K2Node_DynamicCast_AsFace_Emote_Anim_BP;           // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter) == 0x000010, "Wrong alignment on MenuCharacter_C_ExecuteUbergraph_MenuCharacter");
static_assert(sizeof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter) == 0x000310, "Wrong size on MenuCharacter_C_ExecuteUbergraph_MenuCharacter");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, EntryPoint) == 0x000000, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_Event_bEnableThumbnailEmoteMode) == 0x000004, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_Event_bEnableThumbnailEmoteMode' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, Temp_int_Array_Index_Variable) == 0x000040, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, Temp_int_Array_Index_Variable_1) == 0x000044, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_CustomEvent_Factor) == 0x000048, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_CustomEvent_Factor' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_MakeRotator_ReturnValue) == 0x00004C, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_IsDedicatedServer_ReturnValue) == 0x000058, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x00005C, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_Event_EndPlayReason) == 0x0000E4, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_CustomEvent_CustomizationMenuCategory) == 0x0000E5, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_CustomEvent_CustomizationMenuCategory' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_GetAnimInstance_ReturnValue) == 0x0000E8, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_DynamicCast_AsMenu_Character_Anim_BP) == 0x0000F0, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_DynamicCast_AsMenu_Character_Anim_BP' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_GetPawnCustomizationManager_ReturnValue) == 0x000100, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_GetPawnCustomizationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_LoadPlayerCustomizationResources_ReturnValue) == 0x000108, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_LoadPlayerCustomizationResources_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_Event_addedExtraMeshes) == 0x000110, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_Event_addedExtraMeshes' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_Event_slot) == 0x000120, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_Event_slot' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_Array_Get_Item) == 0x000128, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_Array_Length_ReturnValue) == 0x000130, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_CustomEvent_SkillType) == 0x000134, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_CustomEvent_SkillType' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_Array_Add_ReturnValue) == 0x000138, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00013C, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_GetTransform_ReturnValue) == 0x000140, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_CreateDelegate_OutputDelegate_3) == 0x000170, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_GetPawnCustomizationManager_ReturnValue_1) == 0x000180, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_GetPawnCustomizationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_CustomEvent_customizationOwner) == 0x000188, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_CustomEvent_customizationOwner' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_CustomEvent_requestID) == 0x000190, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_CustomEvent_requestID' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_CustomEvent_requestType) == 0x000194, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_CustomEvent_requestType' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000195, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_GetActiveSkillClass_ReturnValue) == 0x000198, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_GetActiveSkillClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_ClassDynamicCast_AsActor) == 0x0001A0, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_ClassDynamicCast_bSuccess) == 0x0001A8, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001B0, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001B8, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x0001C0, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_Array_Get_Item_1) == 0x0001D0, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_Array_Length_ReturnValue_1) == 0x0001D8, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_Less_IntInt_ReturnValue) == 0x0001DC, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0001E0, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_IsValid_ReturnValue) == 0x000268, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_GetObjectClass_ReturnValue) == 0x000270, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_NotEqual_ClassClass_ReturnValue) == 0x000278, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_NotEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, Temp_int_Loop_Counter_Variable_1) == 0x00027C, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_Less_IntInt_ReturnValue_1) == 0x000280, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_Add_IntInt_ReturnValue_1) == 0x000284, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000288, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_Event_bIsHidden) == 0x000290, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_Event_bIsHidden' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_DynamicCast_AsMenu_Character_Anim_BP_1) == 0x000298, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_DynamicCast_AsMenu_Character_Anim_BP_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_DynamicCast_bSuccess_1) == 0x0002A0, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_Event_customizationInfo) == 0x0002A8, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_Event_customizationInfo' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, CallFunc_GetAnimInstance_ReturnValue_2) == 0x0002F8, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_DynamicCast_AsFace_Emote_Anim_BP) == 0x000300, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_DynamicCast_AsFace_Emote_Anim_BP' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ExecuteUbergraph_MenuCharacter, K2Node_DynamicCast_bSuccess_2) == 0x000308, "Member 'MenuCharacter_C_ExecuteUbergraph_MenuCharacter::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.Event_SetThumbnailEmoteMode
// 0x0001 (0x0001 - 0x0000)
struct MenuCharacter_C_Event_SetThumbnailEmoteMode final
{
public:
	bool                                          bEnableThumbnailEmoteMode;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_Event_SetThumbnailEmoteMode) == 0x000001, "Wrong alignment on MenuCharacter_C_Event_SetThumbnailEmoteMode");
static_assert(sizeof(MenuCharacter_C_Event_SetThumbnailEmoteMode) == 0x000001, "Wrong size on MenuCharacter_C_Event_SetThumbnailEmoteMode");
static_assert(offsetof(MenuCharacter_C_Event_SetThumbnailEmoteMode, bEnableThumbnailEmoteMode) == 0x000000, "Member 'MenuCharacter_C_Event_SetThumbnailEmoteMode::bEnableThumbnailEmoteMode' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.Event_SetCustomization
// 0x0050 (0x0050 - 0x0000)
struct MenuCharacter_C_Event_SetCustomization final
{
public:
	struct FRBPlayerCustomizationInfo             CustomizationInfo;                                 // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(MenuCharacter_C_Event_SetCustomization) == 0x000008, "Wrong alignment on MenuCharacter_C_Event_SetCustomization");
static_assert(sizeof(MenuCharacter_C_Event_SetCustomization) == 0x000050, "Wrong size on MenuCharacter_C_Event_SetCustomization");
static_assert(offsetof(MenuCharacter_C_Event_SetCustomization, CustomizationInfo) == 0x000000, "Member 'MenuCharacter_C_Event_SetCustomization::CustomizationInfo' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.Event_SetCharacterHidden
// 0x0001 (0x0001 - 0x0000)
struct MenuCharacter_C_Event_SetCharacterHidden final
{
public:
	bool                                          bIsHidden;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_Event_SetCharacterHidden) == 0x000001, "Wrong alignment on MenuCharacter_C_Event_SetCharacterHidden");
static_assert(sizeof(MenuCharacter_C_Event_SetCharacterHidden) == 0x000001, "Wrong size on MenuCharacter_C_Event_SetCharacterHidden");
static_assert(offsetof(MenuCharacter_C_Event_SetCharacterHidden, bIsHidden) == 0x000000, "Member 'MenuCharacter_C_Event_SetCharacterHidden::bIsHidden' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.OnPawnCustomizationCompleted
// 0x0010 (0x0010 - 0x0000)
struct MenuCharacter_C_OnPawnCustomizationCompleted final
{
public:
	class AActor*                                 CustomizationOwner;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequestID;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPawnCustomizationRequestType                 RequestType;                                       // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_C_OnPawnCustomizationCompleted) == 0x000008, "Wrong alignment on MenuCharacter_C_OnPawnCustomizationCompleted");
static_assert(sizeof(MenuCharacter_C_OnPawnCustomizationCompleted) == 0x000010, "Wrong size on MenuCharacter_C_OnPawnCustomizationCompleted");
static_assert(offsetof(MenuCharacter_C_OnPawnCustomizationCompleted, CustomizationOwner) == 0x000000, "Member 'MenuCharacter_C_OnPawnCustomizationCompleted::CustomizationOwner' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_OnPawnCustomizationCompleted, RequestID) == 0x000008, "Member 'MenuCharacter_C_OnPawnCustomizationCompleted::RequestID' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_OnPawnCustomizationCompleted, RequestType) == 0x00000C, "Member 'MenuCharacter_C_OnPawnCustomizationCompleted::RequestType' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.RequestSpawnRig
// 0x0001 (0x0001 - 0x0000)
struct MenuCharacter_C_RequestSpawnRig final
{
public:
	EActiveSkillType                              SkillType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_C_RequestSpawnRig) == 0x000001, "Wrong alignment on MenuCharacter_C_RequestSpawnRig");
static_assert(sizeof(MenuCharacter_C_RequestSpawnRig) == 0x000001, "Wrong size on MenuCharacter_C_RequestSpawnRig");
static_assert(offsetof(MenuCharacter_C_RequestSpawnRig, SkillType) == 0x000000, "Member 'MenuCharacter_C_RequestSpawnRig::SkillType' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.OnExtraCustomizationMeshesAddedForSlot
// 0x0018 (0x0018 - 0x0000)
struct MenuCharacter_C_OnExtraCustomizationMeshesAddedForSlot final
{
public:
	TArray<class USkeletalMeshComponent*>         AddedExtraMeshes;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EPlayerCustomizationSlot                      Slot;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_C_OnExtraCustomizationMeshesAddedForSlot) == 0x000008, "Wrong alignment on MenuCharacter_C_OnExtraCustomizationMeshesAddedForSlot");
static_assert(sizeof(MenuCharacter_C_OnExtraCustomizationMeshesAddedForSlot) == 0x000018, "Wrong size on MenuCharacter_C_OnExtraCustomizationMeshesAddedForSlot");
static_assert(offsetof(MenuCharacter_C_OnExtraCustomizationMeshesAddedForSlot, AddedExtraMeshes) == 0x000000, "Member 'MenuCharacter_C_OnExtraCustomizationMeshesAddedForSlot::AddedExtraMeshes' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_OnExtraCustomizationMeshesAddedForSlot, Slot) == 0x000010, "Member 'MenuCharacter_C_OnExtraCustomizationMeshesAddedForSlot::Slot' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.OnCatetoryClicked
// 0x0001 (0x0001 - 0x0000)
struct MenuCharacter_C_OnCatetoryClicked final
{
public:
	ECustomizationMenuCategory                    CustomizationMenuCategory;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_C_OnCatetoryClicked) == 0x000001, "Wrong alignment on MenuCharacter_C_OnCatetoryClicked");
static_assert(sizeof(MenuCharacter_C_OnCatetoryClicked) == 0x000001, "Wrong size on MenuCharacter_C_OnCatetoryClicked");
static_assert(offsetof(MenuCharacter_C_OnCatetoryClicked, CustomizationMenuCategory) == 0x000000, "Member 'MenuCharacter_C_OnCatetoryClicked::CustomizationMenuCategory' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct MenuCharacter_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on MenuCharacter_C_ReceiveEndPlay");
static_assert(sizeof(MenuCharacter_C_ReceiveEndPlay) == 0x000001, "Wrong size on MenuCharacter_C_ReceiveEndPlay");
static_assert(offsetof(MenuCharacter_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'MenuCharacter_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.AddCharacterRotation
// 0x0004 (0x0004 - 0x0000)
struct MenuCharacter_C_AddCharacterRotation final
{
public:
	float                                         Factor;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_C_AddCharacterRotation) == 0x000004, "Wrong alignment on MenuCharacter_C_AddCharacterRotation");
static_assert(sizeof(MenuCharacter_C_AddCharacterRotation) == 0x000004, "Wrong size on MenuCharacter_C_AddCharacterRotation");
static_assert(offsetof(MenuCharacter_C_AddCharacterRotation, Factor) == 0x000000, "Member 'MenuCharacter_C_AddCharacterRotation::Factor' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.ActivateViewer
// 0x0018 (0x0018 - 0x0000)
struct MenuCharacter_C_ActivateViewer final
{
public:
	class AActor*                                 CustomReturnViewTarget;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBFXManager*                           CallFunc_GetFXManager_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBController*                          CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_C_ActivateViewer) == 0x000008, "Wrong alignment on MenuCharacter_C_ActivateViewer");
static_assert(sizeof(MenuCharacter_C_ActivateViewer) == 0x000018, "Wrong size on MenuCharacter_C_ActivateViewer");
static_assert(offsetof(MenuCharacter_C_ActivateViewer, CustomReturnViewTarget) == 0x000000, "Member 'MenuCharacter_C_ActivateViewer::CustomReturnViewTarget' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ActivateViewer, CallFunc_GetFXManager_ReturnValue) == 0x000008, "Member 'MenuCharacter_C_ActivateViewer::CallFunc_GetFXManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ActivateViewer, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000010, "Member 'MenuCharacter_C_ActivateViewer::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.ChangeBodyType
// 0x0038 (0x0038 - 0x0000)
struct MenuCharacter_C_ChangeBodyType final
{
public:
	bool                                          IsFemale;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URBPlayerCustomizationOption*>   Options;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerCustomizationOption*           CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuCharacter_C_ChangeBodyType) == 0x000008, "Wrong alignment on MenuCharacter_C_ChangeBodyType");
static_assert(sizeof(MenuCharacter_C_ChangeBodyType) == 0x000038, "Wrong size on MenuCharacter_C_ChangeBodyType");
static_assert(offsetof(MenuCharacter_C_ChangeBodyType, IsFemale) == 0x000000, "Member 'MenuCharacter_C_ChangeBodyType::IsFemale' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ChangeBodyType, Options) == 0x000008, "Member 'MenuCharacter_C_ChangeBodyType::Options' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ChangeBodyType, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'MenuCharacter_C_ChangeBodyType::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ChangeBodyType, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'MenuCharacter_C_ChangeBodyType::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ChangeBodyType, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'MenuCharacter_C_ChangeBodyType::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ChangeBodyType, CallFunc_Array_Get_Item) == 0x000028, "Member 'MenuCharacter_C_ChangeBodyType::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ChangeBodyType, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'MenuCharacter_C_ChangeBodyType::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_ChangeBodyType, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'MenuCharacter_C_ChangeBodyType::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.CleanSpawnedRigs
// 0x0002 (0x0002 - 0x0000)
struct MenuCharacter_C_CleanSpawnedRigs final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_CleanSpawnedRigs) == 0x000001, "Wrong alignment on MenuCharacter_C_CleanSpawnedRigs");
static_assert(sizeof(MenuCharacter_C_CleanSpawnedRigs) == 0x000002, "Wrong size on MenuCharacter_C_CleanSpawnedRigs");
static_assert(offsetof(MenuCharacter_C_CleanSpawnedRigs, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'MenuCharacter_C_CleanSpawnedRigs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CleanSpawnedRigs, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'MenuCharacter_C_CleanSpawnedRigs::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.CycleDebugPose
// 0x0010 (0x0010 - 0x0000)
struct MenuCharacter_C_CycleDebugPose final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_CycleDebugPose) == 0x000004, "Wrong alignment on MenuCharacter_C_CycleDebugPose");
static_assert(sizeof(MenuCharacter_C_CycleDebugPose) == 0x000010, "Wrong size on MenuCharacter_C_CycleDebugPose");
static_assert(offsetof(MenuCharacter_C_CycleDebugPose, Temp_int_Variable) == 0x000000, "Member 'MenuCharacter_C_CycleDebugPose::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleDebugPose, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'MenuCharacter_C_CycleDebugPose::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleDebugPose, CallFunc_Add_IntInt_ReturnValue_1) == 0x000008, "Member 'MenuCharacter_C_CycleDebugPose::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleDebugPose, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'MenuCharacter_C_CycleDebugPose::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleDebugPose, K2Node_SwitchInteger_CmpSuccess) == 0x00000D, "Member 'MenuCharacter_C_CycleDebugPose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.CycleCameras
// 0x0080 (0x0080 - 0x0000)
struct MenuCharacter_C_CycleCameras final
{
public:
	ECustomizationMenuCategory                    Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         blendTime;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FCustomizationCategoryCameras          CallFunc_Map_Find_Value;                           // 0x0010(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizationCategoryCameras          CallFunc_Map_Find_Value_1;                         // 0x0030(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBController*                          CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuCharacter_AnimBP_C*                K2Node_DynamicCast_AsMenu_Character_Anim_BP;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuCharacter_C_CycleCameras) == 0x000008, "Wrong alignment on MenuCharacter_C_CycleCameras");
static_assert(sizeof(MenuCharacter_C_CycleCameras) == 0x000080, "Wrong size on MenuCharacter_C_CycleCameras");
static_assert(offsetof(MenuCharacter_C_CycleCameras, Selection) == 0x000000, "Member 'MenuCharacter_C_CycleCameras::Selection' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, blendTime) == 0x000004, "Member 'MenuCharacter_C_CycleCameras::blendTime' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, Temp_float_Variable) == 0x000008, "Member 'MenuCharacter_C_CycleCameras::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'MenuCharacter_C_CycleCameras::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, Temp_bool_Variable) == 0x00000D, "Member 'MenuCharacter_C_CycleCameras::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000E, "Member 'MenuCharacter_C_CycleCameras::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_BooleanOR_ReturnValue) == 0x00000F, "Member 'MenuCharacter_C_CycleCameras::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Map_Find_Value) == 0x000010, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, K2Node_Select_Default) == 0x000024, "Member 'MenuCharacter_C_CycleCameras::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00002C, "Member 'MenuCharacter_C_CycleCameras::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Map_Find_Value_1) == 0x000030, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Map_Find_ReturnValue_1) == 0x000040, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000048, "Member 'MenuCharacter_C_CycleCameras::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Array_Get_Item) == 0x000050, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'MenuCharacter_C_CycleCameras::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_Percent_IntInt_ReturnValue) == 0x000064, "Member 'MenuCharacter_C_CycleCameras::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, CallFunc_GetAnimInstance_ReturnValue) == 0x000068, "Member 'MenuCharacter_C_CycleCameras::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, K2Node_DynamicCast_AsMenu_Character_Anim_BP) == 0x000070, "Member 'MenuCharacter_C_CycleCameras::K2Node_DynamicCast_AsMenu_Character_Anim_BP' has a wrong offset!");
static_assert(offsetof(MenuCharacter_C_CycleCameras, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'MenuCharacter_C_CycleCameras::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MenuCharacter.MenuCharacter_C.DressCharacter
// 0x00C8 (0x00C8 - 0x0000)
struct MenuCharacter_C_DressCharacter final
{
public:
	TArray<class USkeletalMeshComponent*>         SkinAlbedoMeshes;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_Select_Default_1;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuCharacter_AnimBP_C*                K2Node_DynamicCast_AsMenu_Character_Anim_BP;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFace_Emote_AnimBP_C*                   K2Node_DynamicCast_AsFace_Emote_Anim_BP;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
