#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshPopulate_Parent

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "ModuleMeshData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RandomMaterials_structs.hpp"
#include "MeshPopulateDirection_structs.hpp"
#include "Engine_structs.hpp"
#include "ModuleMeshDataMinus02_structs.hpp"
#include "GrayBoxMat_ENU_structs.hpp"
#include "ModuleAlternativeMeshData_structs.hpp"
#include "StaticmeshArray_Stuc_structs.hpp"


namespace SDK::Params
{

// Function MeshPopulate_Parent.MeshPopulate_Parent_C.SelectRandomMesh
// 0x00D0 (0x00D0 - 0x0000)
struct MeshPopulate_Parent_C_SelectRandomMesh final
{
public:
	TArray<struct FModuleAlternativeMeshData>     ArrayMeshAlternatif;                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UStaticMesh*                            _Mesh1;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Mesh;                                              // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MeshOffset;                                        // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              _OffsetAleternativeMesh;                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Chances;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            _Mesh;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChancesOn100;                                      // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModuleMeshData>                NewLocalVar_0;                                     // 0x0048(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModuleAlternativeMeshData             CallFunc_Array_Get_Item;                           // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMod_Remainder;                           // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue;                     // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MeshPopulate_Parent_C_SelectRandomMesh) == 0x000008, "Wrong alignment on MeshPopulate_Parent_C_SelectRandomMesh");
static_assert(sizeof(MeshPopulate_Parent_C_SelectRandomMesh) == 0x0000D0, "Wrong size on MeshPopulate_Parent_C_SelectRandomMesh");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, ArrayMeshAlternatif) == 0x000000, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::ArrayMeshAlternatif' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, _Mesh1) == 0x000010, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::_Mesh1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, Mesh) == 0x000018, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::Mesh' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, MeshOffset) == 0x000020, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::MeshOffset' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, _OffsetAleternativeMesh) == 0x000028, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::_OffsetAleternativeMesh' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, _Chances) == 0x000030, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::_Chances' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, _Mesh) == 0x000038, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::_Mesh' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, ChancesOn100) == 0x000040, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::ChancesOn100' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, NewLocalVar_0) == 0x000048, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, Temp_int_Array_Index_Variable) == 0x000058, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_Array_Get_Item) == 0x000060, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00007C, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00007D, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, Temp_bool_True_if_break_was_hit_Variable) == 0x00007E, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_Add_FloatFloat_ReturnValue) == 0x000080, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_FMod_Remainder) == 0x000084, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_FMod_ReturnValue) == 0x000088, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_Not_PreBool_ReturnValue) == 0x00008C, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, Temp_int_Loop_Counter_Variable) == 0x000090, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_BooleanAND_ReturnValue) == 0x00009C, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A0, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000A4, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000A8, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_IsValid_ReturnValue) == 0x0000AC, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000B0, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_Fraction_ReturnValue) == 0x0000B4, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B8, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, Temp_bool_Variable) == 0x0000BC, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, K2Node_Select_Default) == 0x0000C0, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_FFloor_ReturnValue) == 0x0000C4, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SelectRandomMesh, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000C8, "Member 'MeshPopulate_Parent_C_SelectRandomMesh::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function MeshPopulate_Parent.MeshPopulate_Parent_C.SetStaticMeshSet
// 0x0070 (0x0070 - 0x0000)
struct MeshPopulate_Parent_C_SetStaticMeshSet final
{
public:
	class UStaticMeshComponent*                   Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            NewMesh;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOverwriteMaterial;                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseOverwriteLightmap;                              // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DrawDistance;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionResponse                            Temp_byte_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_3;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionResponse                            K2Node_Select_Default;                             // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            K2Node_Select_Default_1;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_4;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_2;                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionResponse                            Temp_byte_Variable_5;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_SetStaticLightingMapping_ReturnValue;  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionResponse                            K2Node_Select_Default_2;                           // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MeshPopulate_Parent_C_SetStaticMeshSet) == 0x000008, "Wrong alignment on MeshPopulate_Parent_C_SetStaticMeshSet");
static_assert(sizeof(MeshPopulate_Parent_C_SetStaticMeshSet) == 0x000070, "Wrong size on MeshPopulate_Parent_C_SetStaticMeshSet");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, Target) == 0x000000, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::Target' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, NewMesh) == 0x000008, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::NewMesh' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, UseOverwriteMaterial) == 0x000010, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::UseOverwriteMaterial' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, UseOverwriteLightmap) == 0x000011, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::UseOverwriteLightmap' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, DrawDistance) == 0x000014, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::DrawDistance' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, Temp_byte_Variable) == 0x000018, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, CallFunc_SetStaticMesh_ReturnValue) == 0x000019, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, Temp_bool_Variable) == 0x00001A, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, Temp_byte_Variable_1) == 0x00001B, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, Temp_byte_Variable_2) == 0x00001C, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, Temp_byte_Variable_3) == 0x00001D, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, Temp_bool_Variable_1) == 0x00001E, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, K2Node_Select_Default) == 0x00001F, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, K2Node_Select_Default_1) == 0x000020, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, CallFunc_GetDisplayName_ReturnValue) == 0x000028, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000050, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, CallFunc_BooleanOR_ReturnValue) == 0x000051, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, CallFunc_Clamp_ReturnValue) == 0x000054, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, Temp_byte_Variable_4) == 0x000058, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, CallFunc_Clamp_ReturnValue_1) == 0x00005C, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::CallFunc_Clamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000060, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, CallFunc_FTrunc_ReturnValue) == 0x000064, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, CallFunc_Clamp_ReturnValue_2) == 0x000068, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::CallFunc_Clamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, Temp_byte_Variable_5) == 0x00006C, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, CallFunc_BP_SetStaticLightingMapping_ReturnValue) == 0x00006D, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::CallFunc_BP_SetStaticLightingMapping_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, Temp_bool_Variable_2) == 0x00006E, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetStaticMeshSet, K2Node_Select_Default_2) == 0x00006F, "Member 'MeshPopulate_Parent_C_SetStaticMeshSet::K2Node_Select_Default_2' has a wrong offset!");

// Function MeshPopulate_Parent.MeshPopulate_Parent_C.PrintError
// 0x0078 (0x0078 - 0x0000)
struct MeshPopulate_Parent_C_PrintError final
{
public:
	class FText                                   No_Object_error;                                   // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MeshPopulate_Parent_C_PrintError) == 0x000008, "Wrong alignment on MeshPopulate_Parent_C_PrintError");
static_assert(sizeof(MeshPopulate_Parent_C_PrintError) == 0x000078, "Wrong size on MeshPopulate_Parent_C_PrintError");
static_assert(offsetof(MeshPopulate_Parent_C_PrintError, No_Object_error) == 0x000000, "Member 'MeshPopulate_Parent_C_PrintError::No_Object_error' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_PrintError, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'MeshPopulate_Parent_C_PrintError::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_PrintError, CallFunc_GetObjectName_ReturnValue) == 0x000028, "Member 'MeshPopulate_Parent_C_PrintError::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_PrintError, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'MeshPopulate_Parent_C_PrintError::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_PrintError, CallFunc_GetChildrenComponents_Children) == 0x000048, "Member 'MeshPopulate_Parent_C_PrintError::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_PrintError, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'MeshPopulate_Parent_C_PrintError::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_PrintError, CallFunc_Array_LastIndex_ReturnValue) == 0x000070, "Member 'MeshPopulate_Parent_C_PrintError::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_PrintError, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000074, "Member 'MeshPopulate_Parent_C_PrintError::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function MeshPopulate_Parent.MeshPopulate_Parent_C.UseShadowMask
// 0x00E0 (0x00E0 - 0x0000)
struct MeshPopulate_Parent_C_UseShadowMask final
{
public:
	struct FVector                                ShadowMeshScale;                                   // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshPopulateDirection                        XY_0;                                              // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ShadowMeshLocation;                                // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshPopulateDirection                        Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue_1;        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue_2;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MeshPopulate_Parent_C_UseShadowMask) == 0x000010, "Wrong alignment on MeshPopulate_Parent_C_UseShadowMask");
static_assert(sizeof(MeshPopulate_Parent_C_UseShadowMask) == 0x0000E0, "Wrong size on MeshPopulate_Parent_C_UseShadowMask");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, ShadowMeshScale) == 0x000000, "Member 'MeshPopulate_Parent_C_UseShadowMask::ShadowMeshScale' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, XY_0) == 0x00000C, "Member 'MeshPopulate_Parent_C_UseShadowMask::XY_0' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, ShadowMeshLocation) == 0x000010, "Member 'MeshPopulate_Parent_C_UseShadowMask::ShadowMeshLocation' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, Temp_byte_Variable) == 0x00001C, "Member 'MeshPopulate_Parent_C_UseShadowMask::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_Divide_VectorVector_ReturnValue) == 0x000020, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_BreakVector_X) == 0x00002C, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_BreakVector_Y) == 0x000030, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_BreakVector_Z) == 0x000034, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_Divide_VectorVector_ReturnValue_1) == 0x000038, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_Divide_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_MakeVector_ReturnValue) == 0x000044, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_BreakVector_X_1) == 0x000050, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_BreakVector_Y_1) == 0x000054, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_BreakVector_Z_1) == 0x000058, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_Divide_VectorVector_ReturnValue_2) == 0x00005C, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_Divide_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_MakeVector_ReturnValue_1) == 0x000068, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_BreakVector_X_2) == 0x000074, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_BreakVector_Y_2) == 0x000078, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_BreakVector_Z_2) == 0x00007C, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_MakeVector_ReturnValue_2) == 0x000080, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, K2Node_Select_Default) == 0x00008C, "Member 'MeshPopulate_Parent_C_UseShadowMask::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_MakeTransform_ReturnValue) == 0x0000A0, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_AddComponent_ReturnValue) == 0x0000D0, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_UseShadowMask, CallFunc_SetStaticMesh_ReturnValue) == 0x0000D8, "Member 'MeshPopulate_Parent_C_UseShadowMask::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function MeshPopulate_Parent.MeshPopulate_Parent_C.SetMaterials
// 0x00B8 (0x00B8 - 0x0000)
struct MeshPopulate_Parent_C_SetMaterials final
{
public:
	class UPrimitiveComponent*                    Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomMaterials                       CallFunc_Array_Get_Item;                           // 0x0070(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_2;                         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MeshPopulate_Parent_C_SetMaterials) == 0x000008, "Wrong alignment on MeshPopulate_Parent_C_SetMaterials");
static_assert(sizeof(MeshPopulate_Parent_C_SetMaterials) == 0x0000B8, "Wrong size on MeshPopulate_Parent_C_SetMaterials");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, Target) == 0x000000, "Member 'MeshPopulate_Parent_C_SetMaterials::Target' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'MeshPopulate_Parent_C_SetMaterials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_GetNumMaterials_ReturnValue) == 0x00000C, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_GetNumMaterials_ReturnValue_1) == 0x000014, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_GetNumMaterials_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, Temp_int_Array_Index_Variable) == 0x000018, "Member 'MeshPopulate_Parent_C_SetMaterials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Add_FloatFloat_ReturnValue) == 0x000020, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'MeshPopulate_Parent_C_SetMaterials::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000034, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_BreakVector_X) == 0x000038, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_BreakVector_Y) == 0x00003C, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_BreakVector_Z) == 0x000040, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000044, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000048, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Abs_ReturnValue) == 0x00004C, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, Temp_int_Loop_Counter_Variable_1) == 0x000050, "Member 'MeshPopulate_Parent_C_SetMaterials::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000054, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000058, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x000060, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000064, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Fraction_ReturnValue) == 0x000068, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Array_Get_Item) == 0x000070, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000084, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Less_IntInt_ReturnValue) == 0x000085, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00008C, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000098, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00009C, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Array_Length_ReturnValue_2) == 0x0000A0, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_FFloor_ReturnValue) == 0x0000A4, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A8, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MeshPopulate_Parent_C_SetMaterials, CallFunc_Array_Get_Item_2) == 0x0000B0, "Member 'MeshPopulate_Parent_C_SetMaterials::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function MeshPopulate_Parent.MeshPopulate_Parent_C.SetGizmoLimit
// 0x0090 (0x0090 - 0x0000)
struct MeshPopulate_Parent_C_SetGizmoLimit final
{
public:
	EMeshPopulateDirection                        Direction;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _MaxGizmo;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _MinGizmo;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshPopulateDirection                        Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshPopulateDirection                        Temp_byte_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshPopulateDirection                        Temp_byte_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshPopulateDirection                        Temp_byte_Variable_3;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_3;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshPopulateDirection                        Temp_byte_Variable_4;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
