#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshPopulateRow_BP

#include "Basic.hpp"

#include "ModuleMeshDataMinus02_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MeshPopulateDirection_structs.hpp"


namespace SDK::Params
{

// Function MeshPopulateRow_BP.MeshPopulateRow_BP_C.UserConstructionScript
// 0x0080 (0x0080 - 0x0000)
struct MeshPopulateRow_BP_C_UserConstructionScript final
{
public:
	struct FVector                                _NewSize;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _NewYSizeLeft;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _ySizeLeft;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _MeshSize;                                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _SizeLeft;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMeshPopulateDirection                        Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModuleMeshDataMinus02                 K2Node_MakeStruct_ModuleMeshData_02;               // 0x0020(0x0018)(HasGetValueTypeHash)
	TArray<struct FModuleMeshDataMinus02>         K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm)
	float                                         CallFunc_BreakVector_X;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateRow_LastLocation;                 // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_PopulateRow_StaticmeshComponents1;        // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_PopulateRow_LastAlphaMeshSize;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateRow_AlphaScale;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MeshPopulateRow_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on MeshPopulateRow_BP_C_UserConstructionScript");
static_assert(sizeof(MeshPopulateRow_BP_C_UserConstructionScript) == 0x000080, "Wrong size on MeshPopulateRow_BP_C_UserConstructionScript");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, _NewSize) == 0x000000, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::_NewSize' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, _NewYSizeLeft) == 0x00000C, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::_NewYSizeLeft' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, _ySizeLeft) == 0x000010, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::_ySizeLeft' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, _MeshSize) == 0x000014, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::_MeshSize' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, _SizeLeft) == 0x000018, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::_SizeLeft' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, Temp_byte_Variable) == 0x00001C, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, K2Node_MakeStruct_ModuleMeshData_02) == 0x000020, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::K2Node_MakeStruct_ModuleMeshData_02' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000038, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000048, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x00004C, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000050, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, K2Node_Select_Default) == 0x000054, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastLocation) == 0x000058, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastLocation' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, CallFunc_PopulateRow_StaticmeshComponents1) == 0x000068, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::CallFunc_PopulateRow_StaticmeshComponents1' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastAlphaMeshSize) == 0x000078, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastAlphaMeshSize' has a wrong offset!");
static_assert(offsetof(MeshPopulateRow_BP_C_UserConstructionScript, CallFunc_PopulateRow_AlphaScale) == 0x00007C, "Member 'MeshPopulateRow_BP_C_UserConstructionScript::CallFunc_PopulateRow_AlphaScale' has a wrong offset!");

}

