#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshPopulate_BP

#include "Basic.hpp"

#include "StaticmeshArray_Stuc_structs.hpp"
#include "MeshPopulateDirection_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MeshPopulate_Parent_classes.hpp"
#include "ModuleMeshDataMinus02_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MeshPopulate_BP.MeshPopulate_BP_C
// 0x0050 (0x0420 - 0x03D0)
#pragma pack(push, 0x1)
class alignas(0x08) AMeshPopulate_BP_C : public AMeshPopulate_Parent_C
{
public:
	EMeshPopulateDirection                        Direction;                                         // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModuleMeshDataMinus02>         MeshesGroup;                                       // 0x03D8(0x0010)(Edit, BlueprintVisible)
	struct FVector                                Offset;                                            // 0x03E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseShadowBox;                                      // 0x03F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F5[0x3];                                      // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ShadowBoxOffset;                                   // 0x03F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticmeshArray_Stuc>          AllStactimeshArray;                                // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          Z_Inverted;                                        // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MeshPopulate_BP_C">();
	}
	static class AMeshPopulate_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMeshPopulate_BP_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(AMeshPopulate_BP_C) == 0x000008, "Wrong alignment on AMeshPopulate_BP_C");
static_assert(sizeof(AMeshPopulate_BP_C) == 0x000420, "Wrong size on AMeshPopulate_BP_C");
static_assert(offsetof(AMeshPopulate_BP_C, Direction) == 0x0003D0, "Member 'AMeshPopulate_BP_C::Direction' has a wrong offset!");
static_assert(offsetof(AMeshPopulate_BP_C, MeshesGroup) == 0x0003D8, "Member 'AMeshPopulate_BP_C::MeshesGroup' has a wrong offset!");
static_assert(offsetof(AMeshPopulate_BP_C, Offset) == 0x0003E8, "Member 'AMeshPopulate_BP_C::Offset' has a wrong offset!");
static_assert(offsetof(AMeshPopulate_BP_C, UseShadowBox) == 0x0003F4, "Member 'AMeshPopulate_BP_C::UseShadowBox' has a wrong offset!");
static_assert(offsetof(AMeshPopulate_BP_C, ShadowBoxOffset) == 0x0003F8, "Member 'AMeshPopulate_BP_C::ShadowBoxOffset' has a wrong offset!");
static_assert(offsetof(AMeshPopulate_BP_C, AllStactimeshArray) == 0x000408, "Member 'AMeshPopulate_BP_C::AllStactimeshArray' has a wrong offset!");
static_assert(offsetof(AMeshPopulate_BP_C, Z_Inverted) == 0x000418, "Member 'AMeshPopulate_BP_C::Z_Inverted' has a wrong offset!");

}

