#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MessageWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MessageWidget.MessageWidget_C.ExecuteUbergraph_MessageWidget
// 0x00A8 (0x00A8 - 0x0000)
struct MessageWidget_C_ExecuteUbergraph_MessageWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_MessageText;                    // 0x0028(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMessageLineWidget_C*                   CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot;            // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBHUD*                                 CallFunc_GetHUD_ReturnValue;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MessageWidget_C_ExecuteUbergraph_MessageWidget) == 0x000008, "Wrong alignment on MessageWidget_C_ExecuteUbergraph_MessageWidget");
static_assert(sizeof(MessageWidget_C_ExecuteUbergraph_MessageWidget) == 0x0000A8, "Wrong size on MessageWidget_C_ExecuteUbergraph_MessageWidget");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, EntryPoint) == 0x000000, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, K2Node_CustomEvent_MessageText) == 0x000028, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::K2Node_CustomEvent_MessageText' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, K2Node_Event_IsDesignTime) == 0x000040, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000048, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000050, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, CallFunc_Create_ReturnValue) == 0x000058, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, K2Node_MakeStruct_Margin) == 0x000060, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, Temp_int_Variable) == 0x000070, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, CallFunc_AddChild_ReturnValue) == 0x000078, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, K2Node_DynamicCast_AsVertical_Box_Slot) == 0x000080, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::K2Node_DynamicCast_AsVertical_Box_Slot' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000090, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, CallFunc_GetHUD_ReturnValue) == 0x000098, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ExecuteUbergraph_MessageWidget, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'MessageWidget_C_ExecuteUbergraph_MessageWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MessageWidget.MessageWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct MessageWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MessageWidget_C_PreConstruct) == 0x000001, "Wrong alignment on MessageWidget_C_PreConstruct");
static_assert(sizeof(MessageWidget_C_PreConstruct) == 0x000001, "Wrong size on MessageWidget_C_PreConstruct");
static_assert(offsetof(MessageWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'MessageWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function MessageWidget.MessageWidget_C.SendTemporaryText
// 0x0018 (0x0018 - 0x0000)
struct MessageWidget_C_SendTemporaryText final
{
public:
	class FText                                   MessageText;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(MessageWidget_C_SendTemporaryText) == 0x000008, "Wrong alignment on MessageWidget_C_SendTemporaryText");
static_assert(sizeof(MessageWidget_C_SendTemporaryText) == 0x000018, "Wrong size on MessageWidget_C_SendTemporaryText");
static_assert(offsetof(MessageWidget_C_SendTemporaryText, MessageText) == 0x000000, "Member 'MessageWidget_C_SendTemporaryText::MessageText' has a wrong offset!");

// Function MessageWidget.MessageWidget_C.SetMessage
// 0x0078 (0x0078 - 0x0000)
struct MessageWidget_C_SetMessage final
{
public:
	class FText                                   MessageText;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FLinearColor                           DefaultColor;                                      // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMessageLineWidget_C*                   CurrentMessage;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           CallFunc_BP_SplitMessageToMultipleLines_ReturnValue; // 0x0040(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMessageLineWidget_C*                   K2Node_DynamicCast_AsMessage_Line_Widget;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MessageWidget_C_SetMessage) == 0x000008, "Wrong alignment on MessageWidget_C_SetMessage");
static_assert(sizeof(MessageWidget_C_SetMessage) == 0x000078, "Wrong size on MessageWidget_C_SetMessage");
static_assert(offsetof(MessageWidget_C_SetMessage, MessageText) == 0x000000, "Member 'MessageWidget_C_SetMessage::MessageText' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_SetMessage, DefaultColor) == 0x000018, "Member 'MessageWidget_C_SetMessage::DefaultColor' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_SetMessage, CurrentMessage) == 0x000028, "Member 'MessageWidget_C_SetMessage::CurrentMessage' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_SetMessage, Temp_int_Variable) == 0x000030, "Member 'MessageWidget_C_SetMessage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_SetMessage, CallFunc_GetChildAt_ReturnValue) == 0x000038, "Member 'MessageWidget_C_SetMessage::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_SetMessage, CallFunc_BP_SplitMessageToMultipleLines_ReturnValue) == 0x000040, "Member 'MessageWidget_C_SetMessage::CallFunc_BP_SplitMessageToMultipleLines_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_SetMessage, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000050, "Member 'MessageWidget_C_SetMessage::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_SetMessage, K2Node_DynamicCast_AsMessage_Line_Widget) == 0x000058, "Member 'MessageWidget_C_SetMessage::K2Node_DynamicCast_AsMessage_Line_Widget' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_SetMessage, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'MessageWidget_C_SetMessage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_SetMessage, CallFunc_GetChildAt_ReturnValue_1) == 0x000068, "Member 'MessageWidget_C_SetMessage::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_SetMessage, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'MessageWidget_C_SetMessage::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_SetMessage, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'MessageWidget_C_SetMessage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function MessageWidget.MessageWidget_C.HandleItemsIconsDisplay
// 0x0098 (0x0098 - 0x0000)
struct MessageWidget_C_HandleItemsIconsDisplay final
{
public:
	class UTexture2D*                             PickedUpTexture;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             SwapTexture;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSwapValid;                                       // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_DynamicCast_AsRB_Player;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentValue_ScheduledUObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPickup*                              CallFunc_GetCurrentEquippedItem_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocusOnSwappingItem_ReturnValue;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BP_GetItemIndexForSwap_ReturnValue;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPickup*                              CallFunc_BP_GetItemFromIndex_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue_1;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetPickupInFocus_outIsSwap;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPickup*                              CallFunc_BP_GetPickupInFocus_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPickup*                              CallFunc_GetHoldConsumeActionItem_ReturnValue;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BP_GetItemIndexForSwap_ReturnValue_1;     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPickup*                              CallFunc_BP_GetItemFromIndex_ReturnValue_1;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAimingThrowable_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanSwapBetweenItem_ReturnValue;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MessageWidget_C_HandleItemsIconsDisplay) == 0x000008, "Wrong alignment on MessageWidget_C_HandleItemsIconsDisplay");
static_assert(sizeof(MessageWidget_C_HandleItemsIconsDisplay) == 0x000098, "Wrong size on MessageWidget_C_HandleItemsIconsDisplay");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, PickedUpTexture) == 0x000000, "Member 'MessageWidget_C_HandleItemsIconsDisplay::PickedUpTexture' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, SwapTexture) == 0x000008, "Member 'MessageWidget_C_HandleItemsIconsDisplay::SwapTexture' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, IsSwapValid) == 0x000010, "Member 'MessageWidget_C_HandleItemsIconsDisplay::IsSwapValid' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_GetLocalPawn_ReturnValue) == 0x000018, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_GetLocalPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, K2Node_DynamicCast_AsRB_Player) == 0x000020, "Member 'MessageWidget_C_HandleItemsIconsDisplay::K2Node_DynamicCast_AsRB_Player' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'MessageWidget_C_HandleItemsIconsDisplay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_TextIsEmpty_ReturnValue) == 0x000029, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_GetCurrentValue_ScheduledUObject_ReturnValue) == 0x000030, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_GetCurrentValue_ScheduledUObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_GetCurrentEquippedItem_ReturnValue) == 0x000038, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_GetCurrentEquippedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_IsFocusOnSwappingItem_ReturnValue) == 0x000041, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_IsFocusOnSwappingItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_IsValid_ReturnValue_1) == 0x000042, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_BP_GetItemIndexForSwap_ReturnValue) == 0x000044, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_BP_GetItemIndexForSwap_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_BP_GetItemFromIndex_ReturnValue) == 0x000048, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_BP_GetItemFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_IsValid_ReturnValue_3) == 0x000052, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_BooleanAND_ReturnValue_1) == 0x000053, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_IsValid_ReturnValue_4) == 0x000054, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_BooleanAND_ReturnValue_2) == 0x000055, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_GetLocalPawn_ReturnValue_1) == 0x000058, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_GetLocalPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_BP_GetPickupInFocus_outIsSwap) == 0x000060, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_BP_GetPickupInFocus_outIsSwap' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_BP_GetPickupInFocus_ReturnValue) == 0x000068, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_BP_GetPickupInFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_IsValid_ReturnValue_5) == 0x000070, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_IsValid_ReturnValue_6) == 0x000071, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_GetHoldConsumeActionItem_ReturnValue) == 0x000078, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_GetHoldConsumeActionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_BP_GetItemIndexForSwap_ReturnValue_1) == 0x000080, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_BP_GetItemIndexForSwap_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_IsValid_ReturnValue_7) == 0x000084, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_BP_GetItemFromIndex_ReturnValue_1) == 0x000088, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_BP_GetItemFromIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_GetIsAimingThrowable_ReturnValue) == 0x000090, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_GetIsAimingThrowable_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_CanSwapBetweenItem_ReturnValue) == 0x000091, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_CanSwapBetweenItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_BooleanOR_ReturnValue) == 0x000092, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_IsValid_ReturnValue_8) == 0x000093, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_HandleItemsIconsDisplay, CallFunc_BooleanAND_ReturnValue_3) == 0x000094, "Member 'MessageWidget_C_HandleItemsIconsDisplay::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

// Function MessageWidget.MessageWidget_C.ShouldShow
// 0x0003 (0x0003 - 0x0000)
struct MessageWidget_C_ShouldShow final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldShow_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MessageWidget_C_ShouldShow) == 0x000001, "Wrong alignment on MessageWidget_C_ShouldShow");
static_assert(sizeof(MessageWidget_C_ShouldShow) == 0x000003, "Wrong size on MessageWidget_C_ShouldShow");
static_assert(offsetof(MessageWidget_C_ShouldShow, ReturnValue) == 0x000000, "Member 'MessageWidget_C_ShouldShow::ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ShouldShow, CallFunc_ShouldShow_ReturnValue) == 0x000001, "Member 'MessageWidget_C_ShouldShow::CallFunc_ShouldShow_ReturnValue' has a wrong offset!");
static_assert(offsetof(MessageWidget_C_ShouldShow, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'MessageWidget_C_ShouldShow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

