#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MH_CineGorePileMinus01_BP

#include "Basic.hpp"

#include "CineProps_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MH_CineGorePile-01_BP.MH_CineGorePile-01_BP_C
// 0x00A0 (0x02E0 - 0x0240)
class AMH_CineGorePileMinus01_BP_C final : public ACineProps_Base_C
{
public:
	class UStaticMeshComponent*                   BabyBottle_GoreMinus02;                            // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BabyBottle_GoreMinus01;                            // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BabyBottleMinus01;                                 // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BloodyFleshMinus09;                                // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BloodyFleshMinus08;                                // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BloodyFleshMinus07;                                // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Deadbody_M_SoloHead_01_static4;                    // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Deadbody_M_SoloHead_01_static3;                    // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Deadbody_M_SoloHead_01_static2;                    // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Deadbody_M_SoloHead_01_static1;                    // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BloodyFleshMinus06;                                // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BloodyFleshMinus05;                                // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BloodyFleshMinus04;                                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DeadBody_HeadMinus01;                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Deadbody_Explosed_HeadMinus01;                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Deadbody_M_SoloHead_01_static;                     // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Deadbody_M_Head_Cut_04;                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Deadbody_M_Head_Cut_03;                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Deadbody_M_Head_Cut_02;                            // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Deadbody_M_Head_Cut_01;                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MH_CineGorePile-01_BP_C">();
	}
	static class AMH_CineGorePileMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMH_CineGorePileMinus01_BP_C>();
	}
};
static_assert(alignof(AMH_CineGorePileMinus01_BP_C) == 0x000008, "Wrong alignment on AMH_CineGorePileMinus01_BP_C");
static_assert(sizeof(AMH_CineGorePileMinus01_BP_C) == 0x0002E0, "Wrong size on AMH_CineGorePileMinus01_BP_C");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, BabyBottle_GoreMinus02) == 0x000240, "Member 'AMH_CineGorePileMinus01_BP_C::BabyBottle_GoreMinus02' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, BabyBottle_GoreMinus01) == 0x000248, "Member 'AMH_CineGorePileMinus01_BP_C::BabyBottle_GoreMinus01' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, BabyBottleMinus01) == 0x000250, "Member 'AMH_CineGorePileMinus01_BP_C::BabyBottleMinus01' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, BloodyFleshMinus09) == 0x000258, "Member 'AMH_CineGorePileMinus01_BP_C::BloodyFleshMinus09' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, BloodyFleshMinus08) == 0x000260, "Member 'AMH_CineGorePileMinus01_BP_C::BloodyFleshMinus08' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, BloodyFleshMinus07) == 0x000268, "Member 'AMH_CineGorePileMinus01_BP_C::BloodyFleshMinus07' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, Deadbody_M_SoloHead_01_static4) == 0x000270, "Member 'AMH_CineGorePileMinus01_BP_C::Deadbody_M_SoloHead_01_static4' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, Deadbody_M_SoloHead_01_static3) == 0x000278, "Member 'AMH_CineGorePileMinus01_BP_C::Deadbody_M_SoloHead_01_static3' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, Deadbody_M_SoloHead_01_static2) == 0x000280, "Member 'AMH_CineGorePileMinus01_BP_C::Deadbody_M_SoloHead_01_static2' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, Deadbody_M_SoloHead_01_static1) == 0x000288, "Member 'AMH_CineGorePileMinus01_BP_C::Deadbody_M_SoloHead_01_static1' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, BloodyFleshMinus06) == 0x000290, "Member 'AMH_CineGorePileMinus01_BP_C::BloodyFleshMinus06' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, BloodyFleshMinus05) == 0x000298, "Member 'AMH_CineGorePileMinus01_BP_C::BloodyFleshMinus05' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, BloodyFleshMinus04) == 0x0002A0, "Member 'AMH_CineGorePileMinus01_BP_C::BloodyFleshMinus04' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, DeadBody_HeadMinus01) == 0x0002A8, "Member 'AMH_CineGorePileMinus01_BP_C::DeadBody_HeadMinus01' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, Deadbody_Explosed_HeadMinus01) == 0x0002B0, "Member 'AMH_CineGorePileMinus01_BP_C::Deadbody_Explosed_HeadMinus01' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, Deadbody_M_SoloHead_01_static) == 0x0002B8, "Member 'AMH_CineGorePileMinus01_BP_C::Deadbody_M_SoloHead_01_static' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, Deadbody_M_Head_Cut_04) == 0x0002C0, "Member 'AMH_CineGorePileMinus01_BP_C::Deadbody_M_Head_Cut_04' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, Deadbody_M_Head_Cut_03) == 0x0002C8, "Member 'AMH_CineGorePileMinus01_BP_C::Deadbody_M_Head_Cut_03' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, Deadbody_M_Head_Cut_02) == 0x0002D0, "Member 'AMH_CineGorePileMinus01_BP_C::Deadbody_M_Head_Cut_02' has a wrong offset!");
static_assert(offsetof(AMH_CineGorePileMinus01_BP_C, Deadbody_M_Head_Cut_01) == 0x0002D8, "Member 'AMH_CineGorePileMinus01_BP_C::Deadbody_M_Head_Cut_01' has a wrong offset!");

}

