#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MH_DrugConveyorMannequin_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MH_DrugConveyorMannequin_BP.MH_DrugConveyorMannequin_BP_C.UpdateMovement
// 0x0014 (0x0014 - 0x0000)
struct MH_DrugConveyorMannequin_BP_C_UpdateMovement final
{
public:
	float                                         InPos;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MH_DrugConveyorMannequin_BP_C_UpdateMovement) == 0x000004, "Wrong alignment on MH_DrugConveyorMannequin_BP_C_UpdateMovement");
static_assert(sizeof(MH_DrugConveyorMannequin_BP_C_UpdateMovement) == 0x000014, "Wrong size on MH_DrugConveyorMannequin_BP_C_UpdateMovement");
static_assert(offsetof(MH_DrugConveyorMannequin_BP_C_UpdateMovement, InPos) == 0x000000, "Member 'MH_DrugConveyorMannequin_BP_C_UpdateMovement::InPos' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyorMannequin_BP_C_UpdateMovement, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'MH_DrugConveyorMannequin_BP_C_UpdateMovement::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyorMannequin_BP_C_UpdateMovement, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'MH_DrugConveyorMannequin_BP_C_UpdateMovement::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyorMannequin_BP_C_UpdateMovement, CallFunc_Add_FloatFloat_ReturnValue) == 0x00000C, "Member 'MH_DrugConveyorMannequin_BP_C_UpdateMovement::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyorMannequin_BP_C_UpdateMovement, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000010, "Member 'MH_DrugConveyorMannequin_BP_C_UpdateMovement::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");

// Function MH_DrugConveyorMannequin_BP.MH_DrugConveyorMannequin_BP_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct MH_DrugConveyorMannequin_BP_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSingleAnimationPlayData               K2Node_MakeStruct_SingleAnimationPlayData;         // 0x0008(0x0018)(NoDestructor)
};
static_assert(alignof(MH_DrugConveyorMannequin_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on MH_DrugConveyorMannequin_BP_C_UserConstructionScript");
static_assert(sizeof(MH_DrugConveyorMannequin_BP_C_UserConstructionScript) == 0x000020, "Wrong size on MH_DrugConveyorMannequin_BP_C_UserConstructionScript");
static_assert(offsetof(MH_DrugConveyorMannequin_BP_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'MH_DrugConveyorMannequin_BP_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyorMannequin_BP_C_UserConstructionScript, K2Node_MakeStruct_SingleAnimationPlayData) == 0x000008, "Member 'MH_DrugConveyorMannequin_BP_C_UserConstructionScript::K2Node_MakeStruct_SingleAnimationPlayData' has a wrong offset!");

// Function MH_DrugConveyorMannequin_BP.MH_DrugConveyorMannequin_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct MH_DrugConveyorMannequin_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MH_DrugConveyorMannequin_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on MH_DrugConveyorMannequin_BP_C_ReceiveTick");
static_assert(sizeof(MH_DrugConveyorMannequin_BP_C_ReceiveTick) == 0x000004, "Wrong size on MH_DrugConveyorMannequin_BP_C_ReceiveTick");
static_assert(offsetof(MH_DrugConveyorMannequin_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'MH_DrugConveyorMannequin_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function MH_DrugConveyorMannequin_BP.MH_DrugConveyorMannequin_BP_C.ExecuteUbergraph_MH_DrugConveyorMannequin_BP
// 0x000C (0x000C - 0x0000)
struct MH_DrugConveyorMannequin_BP_C_ExecuteUbergraph_MH_DrugConveyorMannequin_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MH_DrugConveyorMannequin_BP_C_ExecuteUbergraph_MH_DrugConveyorMannequin_BP) == 0x000004, "Wrong alignment on MH_DrugConveyorMannequin_BP_C_ExecuteUbergraph_MH_DrugConveyorMannequin_BP");
static_assert(sizeof(MH_DrugConveyorMannequin_BP_C_ExecuteUbergraph_MH_DrugConveyorMannequin_BP) == 0x00000C, "Wrong size on MH_DrugConveyorMannequin_BP_C_ExecuteUbergraph_MH_DrugConveyorMannequin_BP");
static_assert(offsetof(MH_DrugConveyorMannequin_BP_C_ExecuteUbergraph_MH_DrugConveyorMannequin_BP, EntryPoint) == 0x000000, "Member 'MH_DrugConveyorMannequin_BP_C_ExecuteUbergraph_MH_DrugConveyorMannequin_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyorMannequin_BP_C_ExecuteUbergraph_MH_DrugConveyorMannequin_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'MH_DrugConveyorMannequin_BP_C_ExecuteUbergraph_MH_DrugConveyorMannequin_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyorMannequin_BP_C_ExecuteUbergraph_MH_DrugConveyorMannequin_BP, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'MH_DrugConveyorMannequin_BP_C_ExecuteUbergraph_MH_DrugConveyorMannequin_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

