#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MH_DrugConveyor_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MH_DrugConveyor_BP.MH_DrugConveyor_BP_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct MH_DrugConveyor_BP_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MH_DrugConveyor_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on MH_DrugConveyor_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(MH_DrugConveyor_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on MH_DrugConveyor_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(MH_DrugConveyor_BP_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'MH_DrugConveyor_BP_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

// Function MH_DrugConveyor_BP.MH_DrugConveyor_BP_C.UpdateMovement
// 0x000C (0x000C - 0x0000)
struct MH_DrugConveyor_BP_C_UpdateMovement final
{
public:
	float                                         AccumulatedMovement;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MH_DrugConveyor_BP_C_UpdateMovement) == 0x000004, "Wrong alignment on MH_DrugConveyor_BP_C_UpdateMovement");
static_assert(sizeof(MH_DrugConveyor_BP_C_UpdateMovement) == 0x00000C, "Wrong size on MH_DrugConveyor_BP_C_UpdateMovement");
static_assert(offsetof(MH_DrugConveyor_BP_C_UpdateMovement, AccumulatedMovement) == 0x000000, "Member 'MH_DrugConveyor_BP_C_UpdateMovement::AccumulatedMovement' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyor_BP_C_UpdateMovement, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'MH_DrugConveyor_BP_C_UpdateMovement::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyor_BP_C_UpdateMovement, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'MH_DrugConveyor_BP_C_UpdateMovement::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function MH_DrugConveyor_BP.MH_DrugConveyor_BP_C.UpdateCarpetMovement
// 0x00A4 (0x00A4 - 0x0000)
struct MH_DrugConveyor_BP_C_UpdateCarpetMovement final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0018(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MH_DrugConveyor_BP_C_UpdateCarpetMovement) == 0x000004, "Wrong alignment on MH_DrugConveyor_BP_C_UpdateCarpetMovement");
static_assert(sizeof(MH_DrugConveyor_BP_C_UpdateCarpetMovement) == 0x0000A4, "Wrong size on MH_DrugConveyor_BP_C_UpdateCarpetMovement");
static_assert(offsetof(MH_DrugConveyor_BP_C_UpdateCarpetMovement, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'MH_DrugConveyor_BP_C_UpdateCarpetMovement::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyor_BP_C_UpdateCarpetMovement, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'MH_DrugConveyor_BP_C_UpdateCarpetMovement::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyor_BP_C_UpdateCarpetMovement, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'MH_DrugConveyor_BP_C_UpdateCarpetMovement::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyor_BP_C_UpdateCarpetMovement, CallFunc_MakeRotator_ReturnValue) == 0x00000C, "Member 'MH_DrugConveyor_BP_C_UpdateCarpetMovement::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyor_BP_C_UpdateCarpetMovement, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000018, "Member 'MH_DrugConveyor_BP_C_UpdateCarpetMovement::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyor_BP_C_UpdateCarpetMovement, CallFunc_Percent_FloatFloat_ReturnValue) == 0x0000A0, "Member 'MH_DrugConveyor_BP_C_UpdateCarpetMovement::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");

// Function MH_DrugConveyor_BP.MH_DrugConveyor_BP_C.ExecuteUbergraph_MH_DrugConveyor_BP
// 0x0008 (0x0008 - 0x0000)
struct MH_DrugConveyor_BP_C_ExecuteUbergraph_MH_DrugConveyor_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MH_DrugConveyor_BP_C_ExecuteUbergraph_MH_DrugConveyor_BP) == 0x000004, "Wrong alignment on MH_DrugConveyor_BP_C_ExecuteUbergraph_MH_DrugConveyor_BP");
static_assert(sizeof(MH_DrugConveyor_BP_C_ExecuteUbergraph_MH_DrugConveyor_BP) == 0x000008, "Wrong size on MH_DrugConveyor_BP_C_ExecuteUbergraph_MH_DrugConveyor_BP");
static_assert(offsetof(MH_DrugConveyor_BP_C_ExecuteUbergraph_MH_DrugConveyor_BP, EntryPoint) == 0x000000, "Member 'MH_DrugConveyor_BP_C_ExecuteUbergraph_MH_DrugConveyor_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(MH_DrugConveyor_BP_C_ExecuteUbergraph_MH_DrugConveyor_BP, CallFunc_PlayLoopingSoundOnActor_ReturnValue) == 0x000004, "Member 'MH_DrugConveyor_BP_C_ExecuteUbergraph_MH_DrugConveyor_BP::CallFunc_PlayLoopingSoundOnActor_ReturnValue' has a wrong offset!");

}

