#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MH_TrainLeverMinus01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MH_TrainLever-01_BP.MH_TrainLever-01_BP_C.ExecuteUbergraph_MH_TrainLever-01_BP
// 0x000C (0x000C - 0x0000)
struct MH_TrainLeverMinus01_BP_C_ExecuteUbergraph_MH_TrainLeverMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MH_TrainLeverMinus01_BP_C_ExecuteUbergraph_MH_TrainLeverMinus01_BP) == 0x000004, "Wrong alignment on MH_TrainLeverMinus01_BP_C_ExecuteUbergraph_MH_TrainLeverMinus01_BP");
static_assert(sizeof(MH_TrainLeverMinus01_BP_C_ExecuteUbergraph_MH_TrainLeverMinus01_BP) == 0x00000C, "Wrong size on MH_TrainLeverMinus01_BP_C_ExecuteUbergraph_MH_TrainLeverMinus01_BP");
static_assert(offsetof(MH_TrainLeverMinus01_BP_C_ExecuteUbergraph_MH_TrainLeverMinus01_BP, EntryPoint) == 0x000000, "Member 'MH_TrainLeverMinus01_BP_C_ExecuteUbergraph_MH_TrainLeverMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(MH_TrainLeverMinus01_BP_C_ExecuteUbergraph_MH_TrainLeverMinus01_BP, CallFunc_GetFloatValue_ReturnValue) == 0x000004, "Member 'MH_TrainLeverMinus01_BP_C_ExecuteUbergraph_MH_TrainLeverMinus01_BP::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(MH_TrainLeverMinus01_BP_C_ExecuteUbergraph_MH_TrainLeverMinus01_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'MH_TrainLeverMinus01_BP_C_ExecuteUbergraph_MH_TrainLeverMinus01_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MH_TrainLeverMinus01_BP_C_ExecuteUbergraph_MH_TrainLeverMinus01_BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000009, "Member 'MH_TrainLeverMinus01_BP_C_ExecuteUbergraph_MH_TrainLeverMinus01_BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");

// Function MH_TrainLever-01_BP.MH_TrainLever-01_BP_C.UserConstructionScript
// 0x009C (0x009C - 0x0000)
struct MH_TrainLeverMinus01_BP_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0014(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(MH_TrainLeverMinus01_BP_C_UserConstructionScript) == 0x000004, "Wrong alignment on MH_TrainLeverMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(MH_TrainLeverMinus01_BP_C_UserConstructionScript) == 0x00009C, "Wrong size on MH_TrainLeverMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(MH_TrainLeverMinus01_BP_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000000, "Member 'MH_TrainLeverMinus01_BP_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MH_TrainLeverMinus01_BP_C_UserConstructionScript, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'MH_TrainLeverMinus01_BP_C_UserConstructionScript::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(MH_TrainLeverMinus01_BP_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'MH_TrainLeverMinus01_BP_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(MH_TrainLeverMinus01_BP_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000014, "Member 'MH_TrainLeverMinus01_BP_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

