#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MHS_SND_Sound

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MHS_SND_Sound.MHS_SND_Sound_C
// 0x0078 (0x02C0 - 0x0248)
class AMHS_SND_Sound_C final : public ARBLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          BoatmanShouldReactProximity;                       // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ValuablesDropped;                                  // 0x0251(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BoatmanHasSpokenRecently;                          // 0x0252(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_253[0x5];                                      // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBNetworkSoundActor*                   RBNetworkSoundActorJukebox_ExecuteUbergraph_MHS_SND_Sound_RefProperty; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNetworkSoundActor*                   RBNetworkSoundActorMilkBoiler_ExecuteUbergraph_MHS_SND_Sound_RefProperty; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNetworkSoundActor*                   RBNetworkSoundActorFemaleBG02_ExecuteUbergraph_MHS_SND_Sound_RefProperty; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNetworkSoundActor*                   RBNetworkSoundActorFemaleBG01_ExecuteUbergraph_MHS_SND_Sound_RefProperty; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNetworkSoundActor*                   RBNetworkSoundActorMilkBoiler2_ExecuteUbergraph_MHS_SND_Sound_RefProperty; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNetworkSoundActor*                   RBNetworkSoundActorMilkBoilerActive_ExecuteUbergraph_MHS_SND_Sound_RefProperty; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNetworkSoundActor*                   RBNetworkSoundActorBoatman_ExecuteUbergraph_MHS_SND_Sound_RefProperty; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNetworkSoundActor*                   RBNetworkSoundActorAlarmBell_ExecuteUbergraph_MHS_SND_Sound_RefProperty; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNetworkSoundActor*                   RBNetworkSoundActorMilkBoilerActive2_ExecuteUbergraph_MHS_SND_Sound_RefProperty; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNetworkSoundActor*                   RBNetworkSoundActorMilkStart_ExecuteUbergraph_MHS_SND_Sound_RefProperty; // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNetworkSoundActor*                   RBNetworkSoundActorMilkEngineMiddle_ExecuteUbergraph_MHS_SND_Sound_RefProperty; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNetworkSoundActor*                   RBNetworkSoundActorMilkEngineRight_ExecuteUbergraph_MHS_SND_Sound_RefProperty; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNetworkSoundActor*                   RBNetworkSoundActorMilkEngineLeft_ExecuteUbergraph_MHS_SND_Sound_RefProperty; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void RE_SND_MHS_MT02_PoisonCompleted();
	void RE_SND_MHS_MT02_WorldLoaded();
	void RE_SND_MHS_MT01_WorldLoaded();
	void RE_SND_MHS_MT02_TutorialComplete();
	void BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_0_OnPlayerTriggerVolumeTriggered__DelegateSignature(class URBPlayerTriggerComponent* Trigger);
	void BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature(class ARBPlayer* Player);
	void BoatmanSpokeDelayStart();
	void RE_SND_MHS_MT01_GiveToBoatman();
	void OnWorldFullyLoaded();
	void RE_SND_MHS_MT01_BoatmanSpeaks();
	void RE_SND_MHS_MT01_EscapeStarted();
	void TestMeet();
	void TestProx();
	void RE_SND_MHS_MT01_ReachVault();
	void ExecuteUbergraph_MHS_SND_Sound(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MHS_SND_Sound_C">();
	}
	static class AMHS_SND_Sound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMHS_SND_Sound_C>();
	}
};
static_assert(alignof(AMHS_SND_Sound_C) == 0x000008, "Wrong alignment on AMHS_SND_Sound_C");
static_assert(sizeof(AMHS_SND_Sound_C) == 0x0002C0, "Wrong size on AMHS_SND_Sound_C");
static_assert(offsetof(AMHS_SND_Sound_C, UberGraphFrame) == 0x000248, "Member 'AMHS_SND_Sound_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, BoatmanShouldReactProximity) == 0x000250, "Member 'AMHS_SND_Sound_C::BoatmanShouldReactProximity' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, ValuablesDropped) == 0x000251, "Member 'AMHS_SND_Sound_C::ValuablesDropped' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, BoatmanHasSpokenRecently) == 0x000252, "Member 'AMHS_SND_Sound_C::BoatmanHasSpokenRecently' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, RBNetworkSoundActorJukebox_ExecuteUbergraph_MHS_SND_Sound_RefProperty) == 0x000258, "Member 'AMHS_SND_Sound_C::RBNetworkSoundActorJukebox_ExecuteUbergraph_MHS_SND_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, RBNetworkSoundActorMilkBoiler_ExecuteUbergraph_MHS_SND_Sound_RefProperty) == 0x000260, "Member 'AMHS_SND_Sound_C::RBNetworkSoundActorMilkBoiler_ExecuteUbergraph_MHS_SND_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, RBNetworkSoundActorFemaleBG02_ExecuteUbergraph_MHS_SND_Sound_RefProperty) == 0x000268, "Member 'AMHS_SND_Sound_C::RBNetworkSoundActorFemaleBG02_ExecuteUbergraph_MHS_SND_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, RBNetworkSoundActorFemaleBG01_ExecuteUbergraph_MHS_SND_Sound_RefProperty) == 0x000270, "Member 'AMHS_SND_Sound_C::RBNetworkSoundActorFemaleBG01_ExecuteUbergraph_MHS_SND_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, RBNetworkSoundActorMilkBoiler2_ExecuteUbergraph_MHS_SND_Sound_RefProperty) == 0x000278, "Member 'AMHS_SND_Sound_C::RBNetworkSoundActorMilkBoiler2_ExecuteUbergraph_MHS_SND_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, RBNetworkSoundActorMilkBoilerActive_ExecuteUbergraph_MHS_SND_Sound_RefProperty) == 0x000280, "Member 'AMHS_SND_Sound_C::RBNetworkSoundActorMilkBoilerActive_ExecuteUbergraph_MHS_SND_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, RBNetworkSoundActorBoatman_ExecuteUbergraph_MHS_SND_Sound_RefProperty) == 0x000288, "Member 'AMHS_SND_Sound_C::RBNetworkSoundActorBoatman_ExecuteUbergraph_MHS_SND_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, RBNetworkSoundActorAlarmBell_ExecuteUbergraph_MHS_SND_Sound_RefProperty) == 0x000290, "Member 'AMHS_SND_Sound_C::RBNetworkSoundActorAlarmBell_ExecuteUbergraph_MHS_SND_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, RBNetworkSoundActorMilkBoilerActive2_ExecuteUbergraph_MHS_SND_Sound_RefProperty) == 0x000298, "Member 'AMHS_SND_Sound_C::RBNetworkSoundActorMilkBoilerActive2_ExecuteUbergraph_MHS_SND_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, RBNetworkSoundActorMilkStart_ExecuteUbergraph_MHS_SND_Sound_RefProperty) == 0x0002A0, "Member 'AMHS_SND_Sound_C::RBNetworkSoundActorMilkStart_ExecuteUbergraph_MHS_SND_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, RBNetworkSoundActorMilkEngineMiddle_ExecuteUbergraph_MHS_SND_Sound_RefProperty) == 0x0002A8, "Member 'AMHS_SND_Sound_C::RBNetworkSoundActorMilkEngineMiddle_ExecuteUbergraph_MHS_SND_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, RBNetworkSoundActorMilkEngineRight_ExecuteUbergraph_MHS_SND_Sound_RefProperty) == 0x0002B0, "Member 'AMHS_SND_Sound_C::RBNetworkSoundActorMilkEngineRight_ExecuteUbergraph_MHS_SND_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(AMHS_SND_Sound_C, RBNetworkSoundActorMilkEngineLeft_ExecuteUbergraph_MHS_SND_Sound_RefProperty) == 0x0002B8, "Member 'AMHS_SND_Sound_C::RBNetworkSoundActorMilkEngineLeft_ExecuteUbergraph_MHS_SND_Sound_RefProperty' has a wrong offset!");

}

