#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MHS_SND_Sound

#include "Basic.hpp"

#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function MHS_SND_Sound.MHS_SND_Sound_C.BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_0_OnPlayerTriggerVolumeTriggered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MHS_SND_Sound_C_BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_0_OnPlayerTriggerVolumeTriggered__DelegateSignature final
{
public:
	class URBPlayerTriggerComponent*              Trigger;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MHS_SND_Sound_C_BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_0_OnPlayerTriggerVolumeTriggered__DelegateSignature) == 0x000008, "Wrong alignment on MHS_SND_Sound_C_BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_0_OnPlayerTriggerVolumeTriggered__DelegateSignature");
static_assert(sizeof(MHS_SND_Sound_C_BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_0_OnPlayerTriggerVolumeTriggered__DelegateSignature) == 0x000008, "Wrong size on MHS_SND_Sound_C_BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_0_OnPlayerTriggerVolumeTriggered__DelegateSignature");
static_assert(offsetof(MHS_SND_Sound_C_BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_0_OnPlayerTriggerVolumeTriggered__DelegateSignature, Trigger) == 0x000000, "Member 'MHS_SND_Sound_C_BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_0_OnPlayerTriggerVolumeTriggered__DelegateSignature::Trigger' has a wrong offset!");

// Function MHS_SND_Sound.MHS_SND_Sound_C.BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MHS_SND_Sound_C_BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature final
{
public:
	class ARBPlayer*                              Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MHS_SND_Sound_C_BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature) == 0x000008, "Wrong alignment on MHS_SND_Sound_C_BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature");
static_assert(sizeof(MHS_SND_Sound_C_BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature) == 0x000008, "Wrong size on MHS_SND_Sound_C_BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature");
static_assert(offsetof(MHS_SND_Sound_C_BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature, Player) == 0x000000, "Member 'MHS_SND_Sound_C_BndEvt__MHS_SND_Sound_RBPlayerTriggerVolumeBoatmanVO_K2Node_ActorBoundEvent_1_OnPlayerTriggerVolumeActorEvent__DelegateSignature::Player' has a wrong offset!");

// Function MHS_SND_Sound.MHS_SND_Sound_C.ExecuteUbergraph_MHS_SND_Sound
// 0x0120 (0x0120 - 0x0000)
struct MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAkAudioEvent*>                  K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	TArray<class UAkAudioEvent*>                  K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ReferenceParm)
	TArray<class UAkAudioEvent*>                  K2Node_MakeArray_Array_2;                          // 0x0028(0x0010)(ReferenceParm)
	struct FNarrativeSoundEventsInfo              K2Node_MakeStruct_NarrativeSoundEventsInfo;        // 0x0038(0x0020)()
	TArray<class UAkAudioEvent*>                  K2Node_MakeArray_Array_3;                          // 0x0058(0x0010)(ReferenceParm)
	struct FNarrativeSoundEventsInfo              K2Node_MakeStruct_NarrativeSoundEventsInfo_1;      // 0x0068(0x0020)()
	TArray<class UAkAudioEvent*>                  K2Node_MakeArray_Array_4;                          // 0x0088(0x0010)(ReferenceParm)
	TArray<class UAkAudioEvent*>                  K2Node_MakeArray_Array_5;                          // 0x0098(0x0010)(ReferenceParm)
	TArray<class UAkAudioEvent*>                  K2Node_MakeArray_Array_6;                          // 0x00A8(0x0010)(ReferenceParm)
	struct FNarrativeSoundEventsInfo              K2Node_MakeStruct_NarrativeSoundEventsInfo_2;      // 0x00B8(0x0020)()
	TArray<class UAkAudioEvent*>                  K2Node_MakeArray_Array_7;                          // 0x00D8(0x0010)(ReferenceParm)
	struct FNarrativeSoundEventsInfo              K2Node_MakeStruct_NarrativeSoundEventsInfo_3;      // 0x00E8(0x0020)()
	class URBPlayerTriggerComponent*              K2Node_ActorBoundEvent_trigger;                    // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_ActorBoundEvent_player;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound) == 0x000008, "Wrong alignment on MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound");
static_assert(sizeof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound) == 0x000120, "Wrong size on MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, EntryPoint) == 0x000000, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::EntryPoint' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, K2Node_MakeArray_Array) == 0x000008, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, K2Node_MakeArray_Array_1) == 0x000018, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, K2Node_MakeArray_Array_2) == 0x000028, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, K2Node_MakeStruct_NarrativeSoundEventsInfo) == 0x000038, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::K2Node_MakeStruct_NarrativeSoundEventsInfo' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, K2Node_MakeArray_Array_3) == 0x000058, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, K2Node_MakeStruct_NarrativeSoundEventsInfo_1) == 0x000068, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::K2Node_MakeStruct_NarrativeSoundEventsInfo_1' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, K2Node_MakeArray_Array_4) == 0x000088, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, K2Node_MakeArray_Array_5) == 0x000098, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, K2Node_MakeArray_Array_6) == 0x0000A8, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, K2Node_MakeStruct_NarrativeSoundEventsInfo_2) == 0x0000B8, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::K2Node_MakeStruct_NarrativeSoundEventsInfo_2' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, K2Node_MakeArray_Array_7) == 0x0000D8, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, K2Node_MakeStruct_NarrativeSoundEventsInfo_3) == 0x0000E8, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::K2Node_MakeStruct_NarrativeSoundEventsInfo_3' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, K2Node_ActorBoundEvent_trigger) == 0x000108, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::K2Node_ActorBoundEvent_trigger' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, K2Node_ActorBoundEvent_player) == 0x000110, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::K2Node_ActorBoundEvent_player' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, CallFunc_Not_PreBool_ReturnValue) == 0x000118, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound, CallFunc_BooleanOR_ReturnValue) == 0x000119, "Member 'MHS_SND_Sound_C_ExecuteUbergraph_MHS_SND_Sound::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

