#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MHS_PoisonPump_Static_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function MHS_PoisonPump_Static_BP.MHS_PoisonPump_Static_BP_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct MHS_PoisonPump_Static_BP_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MHS_PoisonPump_Static_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on MHS_PoisonPump_Static_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(MHS_PoisonPump_Static_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on MHS_PoisonPump_Static_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(MHS_PoisonPump_Static_BP_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'MHS_PoisonPump_Static_BP_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

// Function MHS_PoisonPump_Static_BP.MHS_PoisonPump_Static_BP_C.ExecuteUbergraph_MHS_PoisonPump_Static_BP
// 0x0004 (0x0004 - 0x0000)
struct MHS_PoisonPump_Static_BP_C_ExecuteUbergraph_MHS_PoisonPump_Static_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MHS_PoisonPump_Static_BP_C_ExecuteUbergraph_MHS_PoisonPump_Static_BP) == 0x000004, "Wrong alignment on MHS_PoisonPump_Static_BP_C_ExecuteUbergraph_MHS_PoisonPump_Static_BP");
static_assert(sizeof(MHS_PoisonPump_Static_BP_C_ExecuteUbergraph_MHS_PoisonPump_Static_BP) == 0x000004, "Wrong size on MHS_PoisonPump_Static_BP_C_ExecuteUbergraph_MHS_PoisonPump_Static_BP");
static_assert(offsetof(MHS_PoisonPump_Static_BP_C_ExecuteUbergraph_MHS_PoisonPump_Static_BP, EntryPoint) == 0x000000, "Member 'MHS_PoisonPump_Static_BP_C_ExecuteUbergraph_MHS_PoisonPump_Static_BP::EntryPoint' has a wrong offset!");

}

