#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MHS_DrugConveyorCrank_Static_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MHS_DrugConveyorCrank_Static_BP.MHS_DrugConveyorCrank_Static_BP_C
// 0x0028 (0x0258 - 0x0230)
class AMHS_DrugConveyorCrank_Static_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   TF_CircularCrankBoxMinus01;                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBActorPrevisComponent*                YellowLight;                                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CrankWheelMinus01;                                 // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   InteractionMesh;                                   // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MHS_DrugConveyorCrank_Static_BP_C">();
	}
	static class AMHS_DrugConveyorCrank_Static_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMHS_DrugConveyorCrank_Static_BP_C>();
	}
};
static_assert(alignof(AMHS_DrugConveyorCrank_Static_BP_C) == 0x000008, "Wrong alignment on AMHS_DrugConveyorCrank_Static_BP_C");
static_assert(sizeof(AMHS_DrugConveyorCrank_Static_BP_C) == 0x000258, "Wrong size on AMHS_DrugConveyorCrank_Static_BP_C");
static_assert(offsetof(AMHS_DrugConveyorCrank_Static_BP_C, TF_CircularCrankBoxMinus01) == 0x000230, "Member 'AMHS_DrugConveyorCrank_Static_BP_C::TF_CircularCrankBoxMinus01' has a wrong offset!");
static_assert(offsetof(AMHS_DrugConveyorCrank_Static_BP_C, YellowLight) == 0x000238, "Member 'AMHS_DrugConveyorCrank_Static_BP_C::YellowLight' has a wrong offset!");
static_assert(offsetof(AMHS_DrugConveyorCrank_Static_BP_C, CrankWheelMinus01) == 0x000240, "Member 'AMHS_DrugConveyorCrank_Static_BP_C::CrankWheelMinus01' has a wrong offset!");
static_assert(offsetof(AMHS_DrugConveyorCrank_Static_BP_C, InteractionMesh) == 0x000248, "Member 'AMHS_DrugConveyorCrank_Static_BP_C::InteractionMesh' has a wrong offset!");
static_assert(offsetof(AMHS_DrugConveyorCrank_Static_BP_C, DefaultSceneRoot) == 0x000250, "Member 'AMHS_DrugConveyorCrank_Static_BP_C::DefaultSceneRoot' has a wrong offset!");

}

