#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MHS_BGCage_AnimMinus02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RBAmbientCharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MHS_BGCage_Anim-02.MHS_BGCage_Anim-02_C
// 0x0028 (0x0270 - 0x0248)
class AMHS_BGCage_AnimMinus02_C final : public ARBAmbientCharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_MHS_BGCage_AnimMinus02_C;           // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBSoundComponent*                      RBSound;                                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head;                                              // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 UpperBody;                                         // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Hair;                                              // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void SetMasterPose();
	void ExecuteUbergraph_MHS_BGCage_AnimMinus02(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MHS_BGCage_Anim-02_C">();
	}
	static class AMHS_BGCage_AnimMinus02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMHS_BGCage_AnimMinus02_C>();
	}
};
static_assert(alignof(AMHS_BGCage_AnimMinus02_C) == 0x000008, "Wrong alignment on AMHS_BGCage_AnimMinus02_C");
static_assert(sizeof(AMHS_BGCage_AnimMinus02_C) == 0x000270, "Wrong size on AMHS_BGCage_AnimMinus02_C");
static_assert(offsetof(AMHS_BGCage_AnimMinus02_C, UberGraphFrame_MHS_BGCage_AnimMinus02_C) == 0x000248, "Member 'AMHS_BGCage_AnimMinus02_C::UberGraphFrame_MHS_BGCage_AnimMinus02_C' has a wrong offset!");
static_assert(offsetof(AMHS_BGCage_AnimMinus02_C, RBSound) == 0x000250, "Member 'AMHS_BGCage_AnimMinus02_C::RBSound' has a wrong offset!");
static_assert(offsetof(AMHS_BGCage_AnimMinus02_C, Head) == 0x000258, "Member 'AMHS_BGCage_AnimMinus02_C::Head' has a wrong offset!");
static_assert(offsetof(AMHS_BGCage_AnimMinus02_C, UpperBody) == 0x000260, "Member 'AMHS_BGCage_AnimMinus02_C::UpperBody' has a wrong offset!");
static_assert(offsetof(AMHS_BGCage_AnimMinus02_C, Hair) == 0x000268, "Member 'AMHS_BGCage_AnimMinus02_C::Hair' has a wrong offset!");

}

