#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MHS_WomanInCageMinus01_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function MHS_WomanInCage-01_BP.MHS_WomanInCage-01_BP_C.SetVoice
// 0x0060 (0x0060 - 0x0000)
struct MHS_WomanInCageMinus01_BP_C_SetVoice final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable_4;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_5;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_6;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_7;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          K2Node_Select_Default_1;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MHS_WomanInCageMinus01_BP_C_SetVoice) == 0x000008, "Wrong alignment on MHS_WomanInCageMinus01_BP_C_SetVoice");
static_assert(sizeof(MHS_WomanInCageMinus01_BP_C_SetVoice) == 0x000060, "Wrong size on MHS_WomanInCageMinus01_BP_C_SetVoice");
static_assert(offsetof(MHS_WomanInCageMinus01_BP_C_SetVoice, Temp_int_Variable) == 0x000000, "Member 'MHS_WomanInCageMinus01_BP_C_SetVoice::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MHS_WomanInCageMinus01_BP_C_SetVoice, Temp_object_Variable) == 0x000008, "Member 'MHS_WomanInCageMinus01_BP_C_SetVoice::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(MHS_WomanInCageMinus01_BP_C_SetVoice, Temp_object_Variable_1) == 0x000010, "Member 'MHS_WomanInCageMinus01_BP_C_SetVoice::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(MHS_WomanInCageMinus01_BP_C_SetVoice, Temp_object_Variable_2) == 0x000018, "Member 'MHS_WomanInCageMinus01_BP_C_SetVoice::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(MHS_WomanInCageMinus01_BP_C_SetVoice, Temp_object_Variable_3) == 0x000020, "Member 'MHS_WomanInCageMinus01_BP_C_SetVoice::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(MHS_WomanInCageMinus01_BP_C_SetVoice, Temp_int_Variable_1) == 0x000028, "Member 'MHS_WomanInCageMinus01_BP_C_SetVoice::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MHS_WomanInCageMinus01_BP_C_SetVoice, Temp_object_Variable_4) == 0x000030, "Member 'MHS_WomanInCageMinus01_BP_C_SetVoice::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(MHS_WomanInCageMinus01_BP_C_SetVoice, Temp_object_Variable_5) == 0x000038, "Member 'MHS_WomanInCageMinus01_BP_C_SetVoice::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(MHS_WomanInCageMinus01_BP_C_SetVoice, Temp_object_Variable_6) == 0x000040, "Member 'MHS_WomanInCageMinus01_BP_C_SetVoice::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(MHS_WomanInCageMinus01_BP_C_SetVoice, Temp_object_Variable_7) == 0x000048, "Member 'MHS_WomanInCageMinus01_BP_C_SetVoice::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(MHS_WomanInCageMinus01_BP_C_SetVoice, K2Node_Select_Default) == 0x000050, "Member 'MHS_WomanInCageMinus01_BP_C_SetVoice::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MHS_WomanInCageMinus01_BP_C_SetVoice, K2Node_Select_Default_1) == 0x000058, "Member 'MHS_WomanInCageMinus01_BP_C_SetVoice::K2Node_Select_Default_1' has a wrong offset!");

// Function MHS_WomanInCage-01_BP.MHS_WomanInCage-01_BP_C.ExecuteUbergraph_MHS_WomanInCage-01_BP
// 0x0004 (0x0004 - 0x0000)
struct MHS_WomanInCageMinus01_BP_C_ExecuteUbergraph_MHS_WomanInCageMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MHS_WomanInCageMinus01_BP_C_ExecuteUbergraph_MHS_WomanInCageMinus01_BP) == 0x000004, "Wrong alignment on MHS_WomanInCageMinus01_BP_C_ExecuteUbergraph_MHS_WomanInCageMinus01_BP");
static_assert(sizeof(MHS_WomanInCageMinus01_BP_C_ExecuteUbergraph_MHS_WomanInCageMinus01_BP) == 0x000004, "Wrong size on MHS_WomanInCageMinus01_BP_C_ExecuteUbergraph_MHS_WomanInCageMinus01_BP");
static_assert(offsetof(MHS_WomanInCageMinus01_BP_C_ExecuteUbergraph_MHS_WomanInCageMinus01_BP, EntryPoint) == 0x000000, "Member 'MHS_WomanInCageMinus01_BP_C_ExecuteUbergraph_MHS_WomanInCageMinus01_BP::EntryPoint' has a wrong offset!");

}

