#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MHS_WallLampMinus08

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MHS_WallLamp-08.MHS_WallLamp-08_C
// 0x0030 (0x07A0 - 0x0770)
class AMHS_WallLampMinus08_C final : public ARBLight_BP_C
{
public:
	class UBillboardComponent*                    Billboard;                                         // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBVolumetricFogLightComponent*         RBVolumetricFogLight1;                             // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight_Static1;                               // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight_Static;                                // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBVolumetricFogLightComponent*         RBVolumetricFogLight;                              // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight_Dual;                                   // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MHS_WallLamp-08_C">();
	}
	static class AMHS_WallLampMinus08_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMHS_WallLampMinus08_C>();
	}
};
static_assert(alignof(AMHS_WallLampMinus08_C) == 0x000010, "Wrong alignment on AMHS_WallLampMinus08_C");
static_assert(sizeof(AMHS_WallLampMinus08_C) == 0x0007A0, "Wrong size on AMHS_WallLampMinus08_C");
static_assert(offsetof(AMHS_WallLampMinus08_C, Billboard) == 0x000770, "Member 'AMHS_WallLampMinus08_C::Billboard' has a wrong offset!");
static_assert(offsetof(AMHS_WallLampMinus08_C, RBVolumetricFogLight1) == 0x000778, "Member 'AMHS_WallLampMinus08_C::RBVolumetricFogLight1' has a wrong offset!");
static_assert(offsetof(AMHS_WallLampMinus08_C, RBSpotLight_Static1) == 0x000780, "Member 'AMHS_WallLampMinus08_C::RBSpotLight_Static1' has a wrong offset!");
static_assert(offsetof(AMHS_WallLampMinus08_C, RBSpotLight_Static) == 0x000788, "Member 'AMHS_WallLampMinus08_C::RBSpotLight_Static' has a wrong offset!");
static_assert(offsetof(AMHS_WallLampMinus08_C, RBVolumetricFogLight) == 0x000790, "Member 'AMHS_WallLampMinus08_C::RBVolumetricFogLight' has a wrong offset!");
static_assert(offsetof(AMHS_WallLampMinus08_C, PointLight_Dual) == 0x000798, "Member 'AMHS_WallLampMinus08_C::PointLight_Dual' has a wrong offset!");

}

