#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MHS_PoisonPump_Static_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MHS_PoisonPump_Static_BP.MHS_PoisonPump_Static_BP_C
// 0x0048 (0x0278 - 0x0230)
class AMHS_PoisonPump_Static_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   DrugProductionMinusFunnelMinusCover;               // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DrugProductionMinusFunnel;                         // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBActorPrevisComponent*                PoisonGauge;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBActorPrevisComponent*                PoisonLight;                                       // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   IndustrialMachineMinusA;                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        MachineRoot;                                       // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TankRoot;                                          // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	bool OnWorldPopulateFinishedTimeSliced();
	void OnWorldFullyLoaded();
	void OnWorldPopulateFinished();
	void ExecuteUbergraph_MHS_PoisonPump_Static_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MHS_PoisonPump_Static_BP_C">();
	}
	static class AMHS_PoisonPump_Static_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMHS_PoisonPump_Static_BP_C>();
	}
};
static_assert(alignof(AMHS_PoisonPump_Static_BP_C) == 0x000008, "Wrong alignment on AMHS_PoisonPump_Static_BP_C");
static_assert(sizeof(AMHS_PoisonPump_Static_BP_C) == 0x000278, "Wrong size on AMHS_PoisonPump_Static_BP_C");
static_assert(offsetof(AMHS_PoisonPump_Static_BP_C, UberGraphFrame) == 0x000230, "Member 'AMHS_PoisonPump_Static_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMHS_PoisonPump_Static_BP_C, DrugProductionMinusFunnelMinusCover) == 0x000238, "Member 'AMHS_PoisonPump_Static_BP_C::DrugProductionMinusFunnelMinusCover' has a wrong offset!");
static_assert(offsetof(AMHS_PoisonPump_Static_BP_C, DrugProductionMinusFunnel) == 0x000240, "Member 'AMHS_PoisonPump_Static_BP_C::DrugProductionMinusFunnel' has a wrong offset!");
static_assert(offsetof(AMHS_PoisonPump_Static_BP_C, PoisonGauge) == 0x000248, "Member 'AMHS_PoisonPump_Static_BP_C::PoisonGauge' has a wrong offset!");
static_assert(offsetof(AMHS_PoisonPump_Static_BP_C, PoisonLight) == 0x000250, "Member 'AMHS_PoisonPump_Static_BP_C::PoisonLight' has a wrong offset!");
static_assert(offsetof(AMHS_PoisonPump_Static_BP_C, IndustrialMachineMinusA) == 0x000258, "Member 'AMHS_PoisonPump_Static_BP_C::IndustrialMachineMinusA' has a wrong offset!");
static_assert(offsetof(AMHS_PoisonPump_Static_BP_C, MachineRoot) == 0x000260, "Member 'AMHS_PoisonPump_Static_BP_C::MachineRoot' has a wrong offset!");
static_assert(offsetof(AMHS_PoisonPump_Static_BP_C, TankRoot) == 0x000268, "Member 'AMHS_PoisonPump_Static_BP_C::TankRoot' has a wrong offset!");
static_assert(offsetof(AMHS_PoisonPump_Static_BP_C, DefaultSceneRoot) == 0x000270, "Member 'AMHS_PoisonPump_Static_BP_C::DefaultSceneRoot' has a wrong offset!");

}

