#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MHS_DrugCrate_Static_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MHS_DrugCrate_Static_BP.MHS_DrugCrate_Static_BP_C
// 0x0038 (0x0268 - 0x0230)
class AMHS_DrugCrate_Static_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   MachineStaticMesh;                                 // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HandleSupport;                                     // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AirVent_2mMinusB;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Piston;                                            // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wheel;                                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        MachineRoot;                                       // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MHS_DrugCrate_Static_BP_C">();
	}
	static class AMHS_DrugCrate_Static_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMHS_DrugCrate_Static_BP_C>();
	}
};
static_assert(alignof(AMHS_DrugCrate_Static_BP_C) == 0x000008, "Wrong alignment on AMHS_DrugCrate_Static_BP_C");
static_assert(sizeof(AMHS_DrugCrate_Static_BP_C) == 0x000268, "Wrong size on AMHS_DrugCrate_Static_BP_C");
static_assert(offsetof(AMHS_DrugCrate_Static_BP_C, MachineStaticMesh) == 0x000230, "Member 'AMHS_DrugCrate_Static_BP_C::MachineStaticMesh' has a wrong offset!");
static_assert(offsetof(AMHS_DrugCrate_Static_BP_C, HandleSupport) == 0x000238, "Member 'AMHS_DrugCrate_Static_BP_C::HandleSupport' has a wrong offset!");
static_assert(offsetof(AMHS_DrugCrate_Static_BP_C, AirVent_2mMinusB) == 0x000240, "Member 'AMHS_DrugCrate_Static_BP_C::AirVent_2mMinusB' has a wrong offset!");
static_assert(offsetof(AMHS_DrugCrate_Static_BP_C, Piston) == 0x000248, "Member 'AMHS_DrugCrate_Static_BP_C::Piston' has a wrong offset!");
static_assert(offsetof(AMHS_DrugCrate_Static_BP_C, Wheel) == 0x000250, "Member 'AMHS_DrugCrate_Static_BP_C::Wheel' has a wrong offset!");
static_assert(offsetof(AMHS_DrugCrate_Static_BP_C, MachineRoot) == 0x000258, "Member 'AMHS_DrugCrate_Static_BP_C::MachineRoot' has a wrong offset!");
static_assert(offsetof(AMHS_DrugCrate_Static_BP_C, DefaultSceneRoot) == 0x000260, "Member 'AMHS_DrugCrate_Static_BP_C::DefaultSceneRoot' has a wrong offset!");

}

