#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MHS_DrugsCooker_Static_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MHS_DrugsCooker_Static_BP.MHS_DrugsCooker_Static_BP_C
// 0x0068 (0x0298 - 0x0230)
class AMHS_DrugsCooker_Static_BP_C final : public AActor
{
public:
	class URBActorPrevisComponent*                PoisonLight;                                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBActorPrevisComponent*                TrayLight;                                         // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBActorPrevisComponent*                WeigthGauge;                                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cocaine1;                                          // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cocaine;                                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBActorPrevisComponent*                PoisonGauge;                                       // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DrugProductionMinusFunnelMinusCover;               // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TrayRoot;                                          // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DrugProductionMinusFunnelMinus01;                  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CookingOvenStaticMesh;                             // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        OvenRoot;                                          // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MHS_DrugsCooker_Static_BP_C">();
	}
	static class AMHS_DrugsCooker_Static_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMHS_DrugsCooker_Static_BP_C>();
	}
};
static_assert(alignof(AMHS_DrugsCooker_Static_BP_C) == 0x000008, "Wrong alignment on AMHS_DrugsCooker_Static_BP_C");
static_assert(sizeof(AMHS_DrugsCooker_Static_BP_C) == 0x000298, "Wrong size on AMHS_DrugsCooker_Static_BP_C");
static_assert(offsetof(AMHS_DrugsCooker_Static_BP_C, PoisonLight) == 0x000230, "Member 'AMHS_DrugsCooker_Static_BP_C::PoisonLight' has a wrong offset!");
static_assert(offsetof(AMHS_DrugsCooker_Static_BP_C, TrayLight) == 0x000238, "Member 'AMHS_DrugsCooker_Static_BP_C::TrayLight' has a wrong offset!");
static_assert(offsetof(AMHS_DrugsCooker_Static_BP_C, WeigthGauge) == 0x000240, "Member 'AMHS_DrugsCooker_Static_BP_C::WeigthGauge' has a wrong offset!");
static_assert(offsetof(AMHS_DrugsCooker_Static_BP_C, Cocaine1) == 0x000248, "Member 'AMHS_DrugsCooker_Static_BP_C::Cocaine1' has a wrong offset!");
static_assert(offsetof(AMHS_DrugsCooker_Static_BP_C, Cocaine) == 0x000250, "Member 'AMHS_DrugsCooker_Static_BP_C::Cocaine' has a wrong offset!");
static_assert(offsetof(AMHS_DrugsCooker_Static_BP_C, PoisonGauge) == 0x000258, "Member 'AMHS_DrugsCooker_Static_BP_C::PoisonGauge' has a wrong offset!");
static_assert(offsetof(AMHS_DrugsCooker_Static_BP_C, DrugProductionMinusFunnelMinusCover) == 0x000260, "Member 'AMHS_DrugsCooker_Static_BP_C::DrugProductionMinusFunnelMinusCover' has a wrong offset!");
static_assert(offsetof(AMHS_DrugsCooker_Static_BP_C, TrayRoot) == 0x000268, "Member 'AMHS_DrugsCooker_Static_BP_C::TrayRoot' has a wrong offset!");
static_assert(offsetof(AMHS_DrugsCooker_Static_BP_C, DrugProductionMinusFunnelMinus01) == 0x000270, "Member 'AMHS_DrugsCooker_Static_BP_C::DrugProductionMinusFunnelMinus01' has a wrong offset!");
static_assert(offsetof(AMHS_DrugsCooker_Static_BP_C, CookingOvenStaticMesh) == 0x000278, "Member 'AMHS_DrugsCooker_Static_BP_C::CookingOvenStaticMesh' has a wrong offset!");
static_assert(offsetof(AMHS_DrugsCooker_Static_BP_C, OvenRoot) == 0x000280, "Member 'AMHS_DrugsCooker_Static_BP_C::OvenRoot' has a wrong offset!");
static_assert(offsetof(AMHS_DrugsCooker_Static_BP_C, Scene) == 0x000288, "Member 'AMHS_DrugsCooker_Static_BP_C::Scene' has a wrong offset!");
static_assert(offsetof(AMHS_DrugsCooker_Static_BP_C, DefaultSceneRoot) == 0x000290, "Member 'AMHS_DrugsCooker_Static_BP_C::DefaultSceneRoot' has a wrong offset!");

}

