#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModuleMeshDataMinus02

#include "Basic.hpp"

#include "ModuleMeshData_structs.hpp"


namespace SDK
{

// UserDefinedStruct ModuleMeshData-02.ModuleMeshData-02
// 0x0018 (0x0018 - 0x0000)
struct FModuleMeshDataMinus02 final
{
public:
	TArray<struct FModuleMeshData>                Mesh_15_6DA698EE4D7D9FAA5C983C9AD3EA5F30;          // 0x0000(0x0010)(Edit, BlueprintVisible)
	float                                         GroupMeshWidth_14_F259B0FB42FC3100A87A15A0144A11FC; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SecondCenterOffset_19_BCB740FB4410BCFAB5466F944E4EED46; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FModuleMeshDataMinus02) == 0x000008, "Wrong alignment on FModuleMeshDataMinus02");
static_assert(sizeof(FModuleMeshDataMinus02) == 0x000018, "Wrong size on FModuleMeshDataMinus02");
static_assert(offsetof(FModuleMeshDataMinus02, Mesh_15_6DA698EE4D7D9FAA5C983C9AD3EA5F30) == 0x000000, "Member 'FModuleMeshDataMinus02::Mesh_15_6DA698EE4D7D9FAA5C983C9AD3EA5F30' has a wrong offset!");
static_assert(offsetof(FModuleMeshDataMinus02, GroupMeshWidth_14_F259B0FB42FC3100A87A15A0144A11FC) == 0x000010, "Member 'FModuleMeshDataMinus02::GroupMeshWidth_14_F259B0FB42FC3100A87A15A0144A11FC' has a wrong offset!");
static_assert(offsetof(FModuleMeshDataMinus02, SecondCenterOffset_19_BCB740FB4410BCFAB5466F944E4EED46) == 0x000014, "Member 'FModuleMeshDataMinus02::SecondCenterOffset_19_BCB740FB4410BCFAB5466F944E4EED46' has a wrong offset!");

}

