#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MolotovProjectile

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MolotovProjectile.MolotovProjectile_C.GetCurrentDebugData
// 0x0020 (0x0020 - 0x0000)
struct MolotovProjectile_C_GetCurrentDebugData final
{
public:
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMolotovPropagationData                CallFunc_Array_Get_Item;                           // 0x0008(0x0018)()
};
static_assert(alignof(MolotovProjectile_C_GetCurrentDebugData) == 0x000008, "Wrong alignment on MolotovProjectile_C_GetCurrentDebugData");
static_assert(sizeof(MolotovProjectile_C_GetCurrentDebugData) == 0x000020, "Wrong size on MolotovProjectile_C_GetCurrentDebugData");
static_assert(offsetof(MolotovProjectile_C_GetCurrentDebugData, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000000, "Member 'MolotovProjectile_C_GetCurrentDebugData::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_GetCurrentDebugData, CallFunc_Array_Get_Item) == 0x000008, "Member 'MolotovProjectile_C_GetCurrentDebugData::CallFunc_Array_Get_Item' has a wrong offset!");

// Function MolotovProjectile.MolotovProjectile_C.DisplayDebugDraw
// 0x0080 (0x0080 - 0x0000)
struct MolotovProjectile_C_DisplayDebugDraw final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MolotovProjectile_C_DisplayDebugDraw) == 0x000010, "Wrong alignment on MolotovProjectile_C_DisplayDebugDraw");
static_assert(sizeof(MolotovProjectile_C_DisplayDebugDraw) == 0x000080, "Wrong size on MolotovProjectile_C_DisplayDebugDraw");
static_assert(offsetof(MolotovProjectile_C_DisplayDebugDraw, Temp_int_Array_Index_Variable) == 0x000000, "Member 'MolotovProjectile_C_DisplayDebugDraw::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_DisplayDebugDraw, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'MolotovProjectile_C_DisplayDebugDraw::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_DisplayDebugDraw, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'MolotovProjectile_C_DisplayDebugDraw::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_DisplayDebugDraw, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'MolotovProjectile_C_DisplayDebugDraw::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_DisplayDebugDraw, CallFunc_Array_Get_Item) == 0x000040, "Member 'MolotovProjectile_C_DisplayDebugDraw::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_DisplayDebugDraw, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'MolotovProjectile_C_DisplayDebugDraw::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_DisplayDebugDraw, CallFunc_TransformLocation_ReturnValue) == 0x000050, "Member 'MolotovProjectile_C_DisplayDebugDraw::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_DisplayDebugDraw, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'MolotovProjectile_C_DisplayDebugDraw::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_DisplayDebugDraw, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000060, "Member 'MolotovProjectile_C_DisplayDebugDraw::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_DisplayDebugDraw, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000068, "Member 'MolotovProjectile_C_DisplayDebugDraw::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function MolotovProjectile.MolotovProjectile_C.Event_OnFireStarted
// 0x0004 (0x0004 - 0x0000)
struct MolotovProjectile_C_Event_OnFireStarted final
{
public:
	float                                         LifeTime;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MolotovProjectile_C_Event_OnFireStarted) == 0x000004, "Wrong alignment on MolotovProjectile_C_Event_OnFireStarted");
static_assert(sizeof(MolotovProjectile_C_Event_OnFireStarted) == 0x000004, "Wrong size on MolotovProjectile_C_Event_OnFireStarted");
static_assert(offsetof(MolotovProjectile_C_Event_OnFireStarted, LifeTime) == 0x000000, "Member 'MolotovProjectile_C_Event_OnFireStarted::LifeTime' has a wrong offset!");

// Function MolotovProjectile.MolotovProjectile_C.ExecuteUbergraph_MolotovProjectile
// 0x0110 (0x0110 - 0x0000)
struct MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_lifeTime;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue;      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x007C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile) == 0x000008, "Wrong alignment on MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile");
static_assert(sizeof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile) == 0x000110, "Wrong size on MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, EntryPoint) == 0x000000, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, Temp_int_Array_Index_Variable) == 0x000004, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000009, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, K2Node_Event_lifeTime) == 0x00000C, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::K2Node_Event_lifeTime' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_Array_Get_Item) == 0x000014, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_Array_Length_ReturnValue_1) == 0x000024, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000028, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00002C, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_RandomFloatInRange_ReturnValue) == 0x000030, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_MakeRotator_ReturnValue) == 0x000034, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000040, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_PlayLoopingSoundOnActor_ReturnValue) == 0x000048, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_PlayLoopingSoundOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_Add_VectorVector_ReturnValue) == 0x00004C, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000064, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000070, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00007C, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, Temp_int_Loop_Counter_Variable) == 0x000104, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile, CallFunc_Add_IntInt_ReturnValue) == 0x00010C, "Member 'MolotovProjectile_C_ExecuteUbergraph_MolotovProjectile::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

