#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MonsterClosetDoorMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MonsterClosetDoorType_Enu_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MonsterClosetDoor-01_BP.MonsterClosetDoor-01_BP_C
// 0x00D8 (0x0490 - 0x03B8)
class AMonsterClosetDoorMinus01_BP_C final : public ARBMonsterCloset
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionBlockingMinus03;                          // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionBlockingMinus02;                          // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CollisionBlockingMinus01;                          // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RevolvingLightMinus01;                             // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight2;                                      // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RevolvingLightMinus02;                             // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AlarmRoot;                                         // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorClearanceCollisionBoxComponent* RBEditorClearanceCollisionBox;                     // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PanelMinus05;                                      // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MonsterClosetShellMinus02;                         // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MonsterClosetShellMinus01;                         // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MurkoffDoorMinus02;                                // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MurkoffDoorMinus01;                                // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door;                                              // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoorFrameMinus01;                                  // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PawnCollision;                                     // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Frame;                                             // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         AnimationTimeline_NewTrack_1_242CDE8C4FA9BB416B7338B8D98DD2AD; // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            AnimationTimeline__Direction_242CDE8C4FA9BB416B7338B8D98DD2AD; // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     AnimationTimeline;                                 // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimationDurationSeconds;                          // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasIdle;                                          // 0x0474(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EMonsterClosetDoorType_Enu                    DoorType;                                          // 0x0475(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_476[0x2];                                      // 0x0476(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             DoorMaterials;                                     // 0x0478(0x0010)(Edit, BlueprintVisible)
	bool                                          UseFrameDoor;                                      // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Alarm_Light_State;                                 // 0x0489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void PlayOpenSound(bool Open);
	bool BP_Tick(float DeltaTime);
	void Set_Height();
	void OnTimelineUpdate(float Ratio);
	void UserConstructionScript();
	void AnimationTimeline__FinishedFunc();
	void AnimationTimeline__UpdateFunc();
	void Event_OnPlayerInClosetChanged(class ARBPlayer* OldPlayer);
	void Event_TriggerNPCSpawnAnnouncement(ENPCType NPCType);
	void SetWarningLightActive(bool AlarmLightState);
	void Event_SetNPCSpawnWarningActive(bool bWarningActive);
	void Event_ApplyOpenState(bool bOpen);
	void ExecuteUbergraph_MonsterClosetDoorMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MonsterClosetDoor-01_BP_C">();
	}
	static class AMonsterClosetDoorMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMonsterClosetDoorMinus01_BP_C>();
	}
};
static_assert(alignof(AMonsterClosetDoorMinus01_BP_C) == 0x000008, "Wrong alignment on AMonsterClosetDoorMinus01_BP_C");
static_assert(sizeof(AMonsterClosetDoorMinus01_BP_C) == 0x000490, "Wrong size on AMonsterClosetDoorMinus01_BP_C");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, UberGraphFrame) == 0x0003B8, "Member 'AMonsterClosetDoorMinus01_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, StaticMesh) == 0x0003C0, "Member 'AMonsterClosetDoorMinus01_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, Decal) == 0x0003C8, "Member 'AMonsterClosetDoorMinus01_BP_C::Decal' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, CollisionBlockingMinus03) == 0x0003D0, "Member 'AMonsterClosetDoorMinus01_BP_C::CollisionBlockingMinus03' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, CollisionBlockingMinus02) == 0x0003D8, "Member 'AMonsterClosetDoorMinus01_BP_C::CollisionBlockingMinus02' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, CollisionBlockingMinus01) == 0x0003E0, "Member 'AMonsterClosetDoorMinus01_BP_C::CollisionBlockingMinus01' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, PointLight) == 0x0003E8, "Member 'AMonsterClosetDoorMinus01_BP_C::PointLight' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, RevolvingLightMinus01) == 0x0003F0, "Member 'AMonsterClosetDoorMinus01_BP_C::RevolvingLightMinus01' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, RBSpotLight2) == 0x0003F8, "Member 'AMonsterClosetDoorMinus01_BP_C::RBSpotLight2' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, RevolvingLightMinus02) == 0x000400, "Member 'AMonsterClosetDoorMinus01_BP_C::RevolvingLightMinus02' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, AlarmRoot) == 0x000408, "Member 'AMonsterClosetDoorMinus01_BP_C::AlarmRoot' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, RBEditorClearanceCollisionBox) == 0x000410, "Member 'AMonsterClosetDoorMinus01_BP_C::RBEditorClearanceCollisionBox' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, PanelMinus05) == 0x000418, "Member 'AMonsterClosetDoorMinus01_BP_C::PanelMinus05' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, MonsterClosetShellMinus02) == 0x000420, "Member 'AMonsterClosetDoorMinus01_BP_C::MonsterClosetShellMinus02' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, MonsterClosetShellMinus01) == 0x000428, "Member 'AMonsterClosetDoorMinus01_BP_C::MonsterClosetShellMinus01' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, MurkoffDoorMinus02) == 0x000430, "Member 'AMonsterClosetDoorMinus01_BP_C::MurkoffDoorMinus02' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, MurkoffDoorMinus01) == 0x000438, "Member 'AMonsterClosetDoorMinus01_BP_C::MurkoffDoorMinus01' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, Door) == 0x000440, "Member 'AMonsterClosetDoorMinus01_BP_C::Door' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, DoorFrameMinus01) == 0x000448, "Member 'AMonsterClosetDoorMinus01_BP_C::DoorFrameMinus01' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, PawnCollision) == 0x000450, "Member 'AMonsterClosetDoorMinus01_BP_C::PawnCollision' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, Frame) == 0x000458, "Member 'AMonsterClosetDoorMinus01_BP_C::Frame' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, AnimationTimeline_NewTrack_1_242CDE8C4FA9BB416B7338B8D98DD2AD) == 0x000460, "Member 'AMonsterClosetDoorMinus01_BP_C::AnimationTimeline_NewTrack_1_242CDE8C4FA9BB416B7338B8D98DD2AD' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, AnimationTimeline__Direction_242CDE8C4FA9BB416B7338B8D98DD2AD) == 0x000464, "Member 'AMonsterClosetDoorMinus01_BP_C::AnimationTimeline__Direction_242CDE8C4FA9BB416B7338B8D98DD2AD' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, AnimationTimeline) == 0x000468, "Member 'AMonsterClosetDoorMinus01_BP_C::AnimationTimeline' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, AnimationDurationSeconds) == 0x000470, "Member 'AMonsterClosetDoorMinus01_BP_C::AnimationDurationSeconds' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, bWasIdle) == 0x000474, "Member 'AMonsterClosetDoorMinus01_BP_C::bWasIdle' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, DoorType) == 0x000475, "Member 'AMonsterClosetDoorMinus01_BP_C::DoorType' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, DoorMaterials) == 0x000478, "Member 'AMonsterClosetDoorMinus01_BP_C::DoorMaterials' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, UseFrameDoor) == 0x000488, "Member 'AMonsterClosetDoorMinus01_BP_C::UseFrameDoor' has a wrong offset!");
static_assert(offsetof(AMonsterClosetDoorMinus01_BP_C, Alarm_Light_State) == 0x000489, "Member 'AMonsterClosetDoorMinus01_BP_C::Alarm_Light_State' has a wrong offset!");

}

