#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MurkoffWallPartitionMinus01_BP

#include "Basic.hpp"

#include "WallMinus01_BP_classes.hpp"
#include "GrayBoxMat_ENU_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MurkoffWallPartition-01_BP.MurkoffWallPartition-01_BP_C
// 0x0010 (0x05B0 - 0x05A0)
class AMurkoffWallPartitionMinus01_BP_C final : public AWallMinus01_BP_C
{
public:
	EGrayBoxMat_ENU                               Materials;                                         // 0x059B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOverwriteMaterials;                             // 0x059C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59D[0x3];                                      // 0x059D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NewSize;                                           // 0x05A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MurkoffWallPartition-01_BP_C">();
	}
	static class AMurkoffWallPartitionMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMurkoffWallPartitionMinus01_BP_C>();
	}
};
static_assert(alignof(AMurkoffWallPartitionMinus01_BP_C) == 0x000008, "Wrong alignment on AMurkoffWallPartitionMinus01_BP_C");
static_assert(sizeof(AMurkoffWallPartitionMinus01_BP_C) == 0x0005B0, "Wrong size on AMurkoffWallPartitionMinus01_BP_C");
static_assert(offsetof(AMurkoffWallPartitionMinus01_BP_C, Materials) == 0x00059B, "Member 'AMurkoffWallPartitionMinus01_BP_C::Materials' has a wrong offset!");
static_assert(offsetof(AMurkoffWallPartitionMinus01_BP_C, UseOverwriteMaterials) == 0x00059C, "Member 'AMurkoffWallPartitionMinus01_BP_C::UseOverwriteMaterials' has a wrong offset!");
static_assert(offsetof(AMurkoffWallPartitionMinus01_BP_C, NewSize) == 0x0005A0, "Member 'AMurkoffWallPartitionMinus01_BP_C::NewSize' has a wrong offset!");

}

