#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NDAOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NDAOverlay.NDAOverlay_C
// 0x0038 (0x02E0 - 0x02A8)
class UNDAOverlay_C final : public URBNDAOverlayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           Box2;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PingText;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RegionNameText;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x02C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_NDAOverlay(int32 EntryPoint);
	void Event_Setup();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void UpdateRegionAndPing();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NDAOverlay_C">();
	}
	static class UNDAOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNDAOverlay_C>();
	}
};
static_assert(alignof(UNDAOverlay_C) == 0x000008, "Wrong alignment on UNDAOverlay_C");
static_assert(sizeof(UNDAOverlay_C) == 0x0002E0, "Wrong size on UNDAOverlay_C");
static_assert(offsetof(UNDAOverlay_C, UberGraphFrame) == 0x0002A8, "Member 'UNDAOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNDAOverlay_C, Box2) == 0x0002B0, "Member 'UNDAOverlay_C::Box2' has a wrong offset!");
static_assert(offsetof(UNDAOverlay_C, PingText) == 0x0002B8, "Member 'UNDAOverlay_C::PingText' has a wrong offset!");
static_assert(offsetof(UNDAOverlay_C, RegionNameText) == 0x0002C0, "Member 'UNDAOverlay_C::RegionNameText' has a wrong offset!");
static_assert(offsetof(UNDAOverlay_C, Text) == 0x0002C8, "Member 'UNDAOverlay_C::Text' has a wrong offset!");

}

