#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Weapon_Molotov

#include "Basic.hpp"


namespace SDK::Params
{

// Function NPC_Weapon_Molotov.NPC_Weapon_Molotov_C.ExecuteUbergraph_NPC_Weapon_Molotov
// 0x0008 (0x0008 - 0x0000)
struct NPC_Weapon_Molotov_C_ExecuteUbergraph_NPC_Weapon_Molotov final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NPC_Weapon_Molotov_C_ExecuteUbergraph_NPC_Weapon_Molotov) == 0x000004, "Wrong alignment on NPC_Weapon_Molotov_C_ExecuteUbergraph_NPC_Weapon_Molotov");
static_assert(sizeof(NPC_Weapon_Molotov_C_ExecuteUbergraph_NPC_Weapon_Molotov) == 0x000008, "Wrong size on NPC_Weapon_Molotov_C_ExecuteUbergraph_NPC_Weapon_Molotov");
static_assert(offsetof(NPC_Weapon_Molotov_C_ExecuteUbergraph_NPC_Weapon_Molotov, EntryPoint) == 0x000000, "Member 'NPC_Weapon_Molotov_C_ExecuteUbergraph_NPC_Weapon_Molotov::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPC_Weapon_Molotov_C_ExecuteUbergraph_NPC_Weapon_Molotov, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'NPC_Weapon_Molotov_C_ExecuteUbergraph_NPC_Weapon_Molotov::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Weapon_Molotov_C_ExecuteUbergraph_NPC_Weapon_Molotov, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000005, "Member 'NPC_Weapon_Molotov_C_ExecuteUbergraph_NPC_Weapon_Molotov::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");

}

