#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Weapon_Shotgun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_Weapon_Shotgun.NPC_Weapon_Shotgun_C
// 0x0030 (0x0458 - 0x0428)
class ANPC_Weapon_Shotgun_C final : public ARBNPCWeapon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   Light_MuzzleMinus01;                               // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_MuzzleFlash;                                   // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ShotgunMinus01;                                    // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         TL_MuzzleLight_Blend_04AA25AF4FC2E7795C7E888D31E189BE; // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_MuzzleLight__Direction_04AA25AF4FC2E7795C7E888D31E189BE; // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_MuzzleLight;                                    // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NPC_Weapon_Shotgun(int32 EntryPoint);
	void PlayMuzzleFlashFX();
	void OnSpecialMoveNotify(class USkeletalMeshComponent* MeshComp, const class URBAnimNotify_SpecialMove* AnimNotify, class UAnimSequenceBase* AnimSequenceBase);
	void PlayWeaponAnimation(class UAnimSequence* AnimSequence);
	void EquippedBy(class ARBNPC* NPC);
	void ReceiveBeginPlay();
	void Special_Move_Notify(ESpecialMoveNotifyType Notify, ESpecialMove SpecialMove);
	void TL_MuzzleLight__UpdateFunc();
	void TL_MuzzleLight__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Weapon_Shotgun_C">();
	}
	static class ANPC_Weapon_Shotgun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_Weapon_Shotgun_C>();
	}
};
static_assert(alignof(ANPC_Weapon_Shotgun_C) == 0x000008, "Wrong alignment on ANPC_Weapon_Shotgun_C");
static_assert(sizeof(ANPC_Weapon_Shotgun_C) == 0x000458, "Wrong size on ANPC_Weapon_Shotgun_C");
static_assert(offsetof(ANPC_Weapon_Shotgun_C, UberGraphFrame) == 0x000428, "Member 'ANPC_Weapon_Shotgun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ANPC_Weapon_Shotgun_C, Light_MuzzleMinus01) == 0x000430, "Member 'ANPC_Weapon_Shotgun_C::Light_MuzzleMinus01' has a wrong offset!");
static_assert(offsetof(ANPC_Weapon_Shotgun_C, Ngr_MuzzleFlash) == 0x000438, "Member 'ANPC_Weapon_Shotgun_C::Ngr_MuzzleFlash' has a wrong offset!");
static_assert(offsetof(ANPC_Weapon_Shotgun_C, ShotgunMinus01) == 0x000440, "Member 'ANPC_Weapon_Shotgun_C::ShotgunMinus01' has a wrong offset!");
static_assert(offsetof(ANPC_Weapon_Shotgun_C, TL_MuzzleLight_Blend_04AA25AF4FC2E7795C7E888D31E189BE) == 0x000448, "Member 'ANPC_Weapon_Shotgun_C::TL_MuzzleLight_Blend_04AA25AF4FC2E7795C7E888D31E189BE' has a wrong offset!");
static_assert(offsetof(ANPC_Weapon_Shotgun_C, TL_MuzzleLight__Direction_04AA25AF4FC2E7795C7E888D31E189BE) == 0x00044C, "Member 'ANPC_Weapon_Shotgun_C::TL_MuzzleLight__Direction_04AA25AF4FC2E7795C7E888D31E189BE' has a wrong offset!");
static_assert(offsetof(ANPC_Weapon_Shotgun_C, TL_MuzzleLight) == 0x000450, "Member 'ANPC_Weapon_Shotgun_C::TL_MuzzleLight' has a wrong offset!");

}

