#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Weapon_Shotgun_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NPC_Weapon_Shotgun_AnimBP.NPC_Weapon_Shotgun_AnimBP_C
// 0x0100 (0x03C0 - 0x02C0)
class UNPC_Weapon_Shotgun_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0340(0x0080)()

public:
	void ExecuteUbergraph_NPC_Weapon_Shotgun_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Weapon_Shotgun_AnimBP_C">();
	}
	static class UNPC_Weapon_Shotgun_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_Weapon_Shotgun_AnimBP_C>();
	}
};
static_assert(alignof(UNPC_Weapon_Shotgun_AnimBP_C) == 0x000010, "Wrong alignment on UNPC_Weapon_Shotgun_AnimBP_C");
static_assert(sizeof(UNPC_Weapon_Shotgun_AnimBP_C) == 0x0003C0, "Wrong size on UNPC_Weapon_Shotgun_AnimBP_C");
static_assert(offsetof(UNPC_Weapon_Shotgun_AnimBP_C, UberGraphFrame) == 0x0002C0, "Member 'UNPC_Weapon_Shotgun_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPC_Weapon_Shotgun_AnimBP_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UNPC_Weapon_Shotgun_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UNPC_Weapon_Shotgun_AnimBP_C, AnimGraphNode_Slot) == 0x0002F8, "Member 'UNPC_Weapon_Shotgun_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UNPC_Weapon_Shotgun_AnimBP_C, AnimGraphNode_SequencePlayer) == 0x000340, "Member 'UNPC_Weapon_Shotgun_AnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

