#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ObjectivesLibrary

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ObjectivesLibrary.ObjectivesLibrary_C.GetClueObjectiveIconFromName
// 0x05F0 (0x05F0 - 0x0000)
struct ObjectivesLibrary_C_GetClueObjectiveIconFromName final
{
public:
	class FName                                   ClueName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            ClueObjectiveIcon;                                 // 0x0010(0x0088)(Parm, OutParm)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0098(0x0088)()
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0128(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x01B0(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_3;                    // 0x0238(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_4;                    // 0x02C0(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_5;                    // 0x0348(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_6;                    // 0x03D0(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_7;                    // 0x0458(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_8;                    // 0x04E0(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_9;                    // 0x0568(0x0088)()
};
static_assert(alignof(ObjectivesLibrary_C_GetClueObjectiveIconFromName) == 0x000008, "Wrong alignment on ObjectivesLibrary_C_GetClueObjectiveIconFromName");
static_assert(sizeof(ObjectivesLibrary_C_GetClueObjectiveIconFromName) == 0x0005F0, "Wrong size on ObjectivesLibrary_C_GetClueObjectiveIconFromName");
static_assert(offsetof(ObjectivesLibrary_C_GetClueObjectiveIconFromName, ClueName) == 0x000000, "Member 'ObjectivesLibrary_C_GetClueObjectiveIconFromName::ClueName' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueObjectiveIconFromName, __WorldContext) == 0x000008, "Member 'ObjectivesLibrary_C_GetClueObjectiveIconFromName::__WorldContext' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueObjectiveIconFromName, ClueObjectiveIcon) == 0x000010, "Member 'ObjectivesLibrary_C_GetClueObjectiveIconFromName::ClueObjectiveIcon' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueObjectiveIconFromName, K2Node_MakeStruct_SlateBrush) == 0x000098, "Member 'ObjectivesLibrary_C_GetClueObjectiveIconFromName::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueObjectiveIconFromName, K2Node_SwitchName_CmpSuccess) == 0x000120, "Member 'ObjectivesLibrary_C_GetClueObjectiveIconFromName::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueObjectiveIconFromName, K2Node_MakeStruct_SlateBrush_1) == 0x000128, "Member 'ObjectivesLibrary_C_GetClueObjectiveIconFromName::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueObjectiveIconFromName, K2Node_MakeStruct_SlateBrush_2) == 0x0001B0, "Member 'ObjectivesLibrary_C_GetClueObjectiveIconFromName::K2Node_MakeStruct_SlateBrush_2' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueObjectiveIconFromName, K2Node_MakeStruct_SlateBrush_3) == 0x000238, "Member 'ObjectivesLibrary_C_GetClueObjectiveIconFromName::K2Node_MakeStruct_SlateBrush_3' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueObjectiveIconFromName, K2Node_MakeStruct_SlateBrush_4) == 0x0002C0, "Member 'ObjectivesLibrary_C_GetClueObjectiveIconFromName::K2Node_MakeStruct_SlateBrush_4' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueObjectiveIconFromName, K2Node_MakeStruct_SlateBrush_5) == 0x000348, "Member 'ObjectivesLibrary_C_GetClueObjectiveIconFromName::K2Node_MakeStruct_SlateBrush_5' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueObjectiveIconFromName, K2Node_MakeStruct_SlateBrush_6) == 0x0003D0, "Member 'ObjectivesLibrary_C_GetClueObjectiveIconFromName::K2Node_MakeStruct_SlateBrush_6' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueObjectiveIconFromName, K2Node_MakeStruct_SlateBrush_7) == 0x000458, "Member 'ObjectivesLibrary_C_GetClueObjectiveIconFromName::K2Node_MakeStruct_SlateBrush_7' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueObjectiveIconFromName, K2Node_MakeStruct_SlateBrush_8) == 0x0004E0, "Member 'ObjectivesLibrary_C_GetClueObjectiveIconFromName::K2Node_MakeStruct_SlateBrush_8' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueObjectiveIconFromName, K2Node_MakeStruct_SlateBrush_9) == 0x000568, "Member 'ObjectivesLibrary_C_GetClueObjectiveIconFromName::K2Node_MakeStruct_SlateBrush_9' has a wrong offset!");

// Function ObjectivesLibrary.ObjectivesLibrary_C.GetClueTextFromName
// 0x0030 (0x0030 - 0x0000)
struct ObjectivesLibrary_C_GetClueTextFromName final
{
public:
	class FName                                   ClueName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ClueText;                                          // 0x0010(0x0018)(Parm, OutParm)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObjectivesLibrary_C_GetClueTextFromName) == 0x000008, "Wrong alignment on ObjectivesLibrary_C_GetClueTextFromName");
static_assert(sizeof(ObjectivesLibrary_C_GetClueTextFromName) == 0x000030, "Wrong size on ObjectivesLibrary_C_GetClueTextFromName");
static_assert(offsetof(ObjectivesLibrary_C_GetClueTextFromName, ClueName) == 0x000000, "Member 'ObjectivesLibrary_C_GetClueTextFromName::ClueName' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueTextFromName, __WorldContext) == 0x000008, "Member 'ObjectivesLibrary_C_GetClueTextFromName::__WorldContext' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueTextFromName, ClueText) == 0x000010, "Member 'ObjectivesLibrary_C_GetClueTextFromName::ClueText' has a wrong offset!");
static_assert(offsetof(ObjectivesLibrary_C_GetClueTextFromName, K2Node_SwitchName_CmpSuccess) == 0x000028, "Member 'ObjectivesLibrary_C_GetClueTextFromName::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

}

