#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ObjectiveInWorld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ObjectiveInWorld.ObjectiveInWorld_C
// 0x0070 (0x03E0 - 0x0370)
class UObjectiveInWorld_C final : public URBHUDObjectiveInWorld
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               IconSize;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             IdentificationText;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_ObjectiveInWorld;                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ObjectiveIcon;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PingIcon;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ProgressText;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RippleImage;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RippleSize;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ObjectiveMaterial;                                 // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FarScalePercentage;                                // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               RippleMaterial;                                    // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RippleSizeMultiplier;                              // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetOpacity;                                     // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetScale;                                       // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasHidden;                                        // 0x03DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ObjectiveInWorld(int32 EntryPoint);
	void Event_OnWatchedPlayerChanged(class ARBPlayer* OldPlayer, class ARBPlayer* NewPlayer);
	void Event_Hide();
	void Event_Show();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void Update_Distance_Effects(const struct FRBWorldIconUpdateContext& UpdateContext, bool SkipTransition);
	void UpdateIcon();
	void UpdateRippleDisplay(bool A);
	void SetupRipple();
	void UpdateIconImage();
	void Event_DrawHudUpdate(const struct FRBWorldIconUpdateContext& UpdateContext);
	void OnIconIdentificationChanged(const int32 IdentificationIndex);
	void GetLetterFromIndex(int32 Index_0, class FText* Letter);

	void ProcessOpacity(float Distance, float* TargetOpacity_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ObjectiveInWorld_C">();
	}
	static class UObjectiveInWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectiveInWorld_C>();
	}
};
static_assert(alignof(UObjectiveInWorld_C) == 0x000008, "Wrong alignment on UObjectiveInWorld_C");
static_assert(sizeof(UObjectiveInWorld_C) == 0x0003E0, "Wrong size on UObjectiveInWorld_C");
static_assert(offsetof(UObjectiveInWorld_C, UberGraphFrame) == 0x000370, "Member 'UObjectiveInWorld_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, IconSize) == 0x000378, "Member 'UObjectiveInWorld_C::IconSize' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, IdentificationText) == 0x000380, "Member 'UObjectiveInWorld_C::IdentificationText' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, InvalidationBox_ObjectiveInWorld) == 0x000388, "Member 'UObjectiveInWorld_C::InvalidationBox_ObjectiveInWorld' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, ObjectiveIcon) == 0x000390, "Member 'UObjectiveInWorld_C::ObjectiveIcon' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, PingIcon) == 0x000398, "Member 'UObjectiveInWorld_C::PingIcon' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, ProgressText) == 0x0003A0, "Member 'UObjectiveInWorld_C::ProgressText' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, RippleImage) == 0x0003A8, "Member 'UObjectiveInWorld_C::RippleImage' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, RippleSize) == 0x0003B0, "Member 'UObjectiveInWorld_C::RippleSize' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, ObjectiveMaterial) == 0x0003B8, "Member 'UObjectiveInWorld_C::ObjectiveMaterial' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, FarScalePercentage) == 0x0003C0, "Member 'UObjectiveInWorld_C::FarScalePercentage' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, RippleMaterial) == 0x0003C8, "Member 'UObjectiveInWorld_C::RippleMaterial' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, RippleSizeMultiplier) == 0x0003D0, "Member 'UObjectiveInWorld_C::RippleSizeMultiplier' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, TargetOpacity) == 0x0003D4, "Member 'UObjectiveInWorld_C::TargetOpacity' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, TargetScale) == 0x0003D8, "Member 'UObjectiveInWorld_C::TargetScale' has a wrong offset!");
static_assert(offsetof(UObjectiveInWorld_C, bWasHidden) == 0x0003DC, "Member 'UObjectiveInWorld_C::bWasHidden' has a wrong offset!");

}

