#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OPP_Persistent

#include "Basic.hpp"

#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function OPP_Persistent.OPP_Persistent_C.OnRBStreamingLoaded
// 0x0008 (0x0008 - 0x0000)
struct OPP_Persistent_C_OnRBStreamingLoaded final
{
public:
	class ARBStreaming*                           RBStreaming;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OPP_Persistent_C_OnRBStreamingLoaded) == 0x000008, "Wrong alignment on OPP_Persistent_C_OnRBStreamingLoaded");
static_assert(sizeof(OPP_Persistent_C_OnRBStreamingLoaded) == 0x000008, "Wrong size on OPP_Persistent_C_OnRBStreamingLoaded");
static_assert(offsetof(OPP_Persistent_C_OnRBStreamingLoaded, RBStreaming) == 0x000000, "Member 'OPP_Persistent_C_OnRBStreamingLoaded::RBStreaming' has a wrong offset!");

// Function OPP_Persistent.OPP_Persistent_C.ExecuteUbergraph_OPP_Persistent
// 0x02F8 (0x02F8 - 0x0000)
struct OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ARBStreaming* RBStreaming)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBStreaming*                           CallFunc_GetRBStreaming_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBWorld*                               CallFunc_GetRBWorld_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBStreaming*                           K2Node_CustomEvent_rbStreaming;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBStreaming*                           CallFunc_GetRBStreaming_ReturnValue_1;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBGameStageInfo                       CallFunc_GetGameStageInfo_ReturnValue;             // 0x0040(0x00B8)()
	struct FRBGameStageInfo                       CallFunc_GetGameStageInfo_ReturnValue_1;           // 0x00F8(0x00B8)()
	class URBStageInfo*                           CallFunc_GetStageInfo_ReturnValue;                 // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBStageInfo*                           CallFunc_GetStageInfo_ReturnValue_1;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_LevelRandomIntRange_ReturnValue;          // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_1;              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FB[0x1];                                      // 0x01FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LevelRandomIntRange_ReturnValue_1;        // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0218(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22B[0x1];                                      // 0x022B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0238(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsShowingLoadingScreen_ReturnValue;       // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCommandLine_ReturnValue;               // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShippingBuild_ReturnValue;              // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_ParseCommandLine_OutTokens;               // 0x0268(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_ParseCommandLine_OutSwitches;             // 0x0278(0x0010)(ReferenceParm)
	TMap<class FString, class FString>            CallFunc_ParseCommandLine_OutParams;               // 0x0288(0x0050)()
	class FString                                 CallFunc_Map_Find_Value;                           // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent) == 0x000008, "Wrong alignment on OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent");
static_assert(sizeof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent) == 0x0002F8, "Wrong size on OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, EntryPoint) == 0x000000, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::EntryPoint' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_GetRBStreaming_ReturnValue) == 0x000018, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_GetRBStreaming_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_GetRBWorld_ReturnValue) == 0x000028, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_GetRBWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, K2Node_CustomEvent_rbStreaming) == 0x000030, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::K2Node_CustomEvent_rbStreaming' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_GetRBStreaming_ReturnValue_1) == 0x000038, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_GetRBStreaming_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_GetGameStageInfo_ReturnValue) == 0x000040, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_GetGameStageInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_GetGameStageInfo_ReturnValue_1) == 0x0000F8, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_GetGameStageInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_GetStageInfo_ReturnValue) == 0x0001B0, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_GetStageInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_GetStageInfo_ReturnValue_1) == 0x0001B8, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_GetStageInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_IsValid_ReturnValue_1) == 0x0001C0, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_Array_Length_ReturnValue) == 0x0001C4, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001C8, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_Array_IsEmpty_ReturnValue) == 0x0001CC, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_LevelRandomIntRange_ReturnValue) == 0x0001D0, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_LevelRandomIntRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_Not_PreBool_ReturnValue) == 0x0001D4, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_GetDisplayName_ReturnValue) == 0x0001D8, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_Concat_StrStr_ReturnValue) == 0x0001E8, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_Array_IsEmpty_ReturnValue_1) == 0x0001F8, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_Array_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_IsValid_ReturnValue_2) == 0x0001F9, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_BooleanAND_ReturnValue) == 0x0001FA, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_Array_Length_ReturnValue_1) == 0x0001FC, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000200, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_GetRBGameState_ReturnValue) == 0x000208, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_GetRBGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_LevelRandomIntRange_ReturnValue_1) == 0x000210, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_LevelRandomIntRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, Temp_string_Variable) == 0x000218, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000228, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, Temp_bool_Variable) == 0x000229, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00022A, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_SelectInt_ReturnValue) == 0x00022C, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, K2Node_Select_Default) == 0x000230, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, K2Node_MakeArray_Array) == 0x000238, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_IsShowingLoadingScreen_ReturnValue) == 0x000248, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_IsShowingLoadingScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_GetCommandLine_ReturnValue) == 0x000250, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_GetCommandLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_IsShippingBuild_ReturnValue) == 0x000260, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_IsShippingBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_ParseCommandLine_OutTokens) == 0x000268, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_ParseCommandLine_OutTokens' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_ParseCommandLine_OutSwitches) == 0x000278, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_ParseCommandLine_OutSwitches' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_ParseCommandLine_OutParams) == 0x000288, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_ParseCommandLine_OutParams' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_Map_Find_Value) == 0x0002D8, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_Map_Find_ReturnValue) == 0x0002E8, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_Conv_StringToInt_ReturnValue) == 0x0002EC, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0002F0, "Member 'OPP_Persistent_C_ExecuteUbergraph_OPP_Persistent::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

