#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OPP_Persistent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass OPP_Persistent.OPP_Persistent_C
// 0x0038 (0x0270 - 0x0238)
class AOPP_Persistent_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FName>                           DrugEnvironmentLevels;                             // 0x0240(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   DefaultDrugLevel;                                  // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DrugStartLevel;                                    // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DrugEndLevel;                                      // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ProfileDrugLevelIndex;                             // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void InitDrugSequences();
	void bpiBlurEntity();
	void StartDrugSpray();
	void StopDrugSpray();
	void CloseLight();
	void ReceiveBeginPlay();
	void OnRBStreamingLoaded(class ARBStreaming* RBStreaming);
	void ExecuteUbergraph_OPP_Persistent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OPP_Persistent_C">();
	}
	static class AOPP_Persistent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOPP_Persistent_C>();
	}
};
static_assert(alignof(AOPP_Persistent_C) == 0x000008, "Wrong alignment on AOPP_Persistent_C");
static_assert(sizeof(AOPP_Persistent_C) == 0x000270, "Wrong size on AOPP_Persistent_C");
static_assert(offsetof(AOPP_Persistent_C, UberGraphFrame) == 0x000238, "Member 'AOPP_Persistent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AOPP_Persistent_C, DrugEnvironmentLevels) == 0x000240, "Member 'AOPP_Persistent_C::DrugEnvironmentLevels' has a wrong offset!");
static_assert(offsetof(AOPP_Persistent_C, DefaultDrugLevel) == 0x000250, "Member 'AOPP_Persistent_C::DefaultDrugLevel' has a wrong offset!");
static_assert(offsetof(AOPP_Persistent_C, DrugStartLevel) == 0x000258, "Member 'AOPP_Persistent_C::DrugStartLevel' has a wrong offset!");
static_assert(offsetof(AOPP_Persistent_C, DrugEndLevel) == 0x000260, "Member 'AOPP_Persistent_C::DrugEndLevel' has a wrong offset!");
static_assert(offsetof(AOPP_Persistent_C, ProfileDrugLevelIndex) == 0x000268, "Member 'AOPP_Persistent_C::ProfileDrugLevelIndex' has a wrong offset!");

}

