#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsDescription

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionsDescription.OptionsDescription_C
// 0x0028 (0x0290 - 0x0268)
class UOptionsDescription_C final : public URBMenuOptionsDescription
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DescriptionImage;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             DescriptionScrollBox;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         DescriptionText;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RestartText;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_OptionsDescription(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateDescription(const struct FOptionData& OptionData);
	void UpdateRestartRequired(const struct FOptionData& Data);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionsDescription_C">();
	}
	static class UOptionsDescription_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionsDescription_C>();
	}
};
static_assert(alignof(UOptionsDescription_C) == 0x000008, "Wrong alignment on UOptionsDescription_C");
static_assert(sizeof(UOptionsDescription_C) == 0x000290, "Wrong size on UOptionsDescription_C");
static_assert(offsetof(UOptionsDescription_C, UberGraphFrame) == 0x000268, "Member 'UOptionsDescription_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionsDescription_C, DescriptionImage) == 0x000270, "Member 'UOptionsDescription_C::DescriptionImage' has a wrong offset!");
static_assert(offsetof(UOptionsDescription_C, DescriptionScrollBox) == 0x000278, "Member 'UOptionsDescription_C::DescriptionScrollBox' has a wrong offset!");
static_assert(offsetof(UOptionsDescription_C, DescriptionText) == 0x000280, "Member 'UOptionsDescription_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UOptionsDescription_C, RestartText) == 0x000288, "Member 'UOptionsDescription_C::RestartText' has a wrong offset!");

}

