#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Orp_Movable_Button_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Orp_Movable_Button_BP.Orp_Movable_Button_BP_C.BndEvt__Orp_Movable_Button_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Orp_Movable_Button_BP_C_BndEvt__Orp_Movable_Button_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature final
{
public:
	class URBInteractionZoneComponent*            Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Orp_Movable_Button_BP_C_BndEvt__Orp_Movable_Button_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature) == 0x000008, "Wrong alignment on Orp_Movable_Button_BP_C_BndEvt__Orp_Movable_Button_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature");
static_assert(sizeof(Orp_Movable_Button_BP_C_BndEvt__Orp_Movable_Button_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature) == 0x000008, "Wrong size on Orp_Movable_Button_BP_C_BndEvt__Orp_Movable_Button_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature");
static_assert(offsetof(Orp_Movable_Button_BP_C_BndEvt__Orp_Movable_Button_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature, Component) == 0x000000, "Member 'Orp_Movable_Button_BP_C_BndEvt__Orp_Movable_Button_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_0_OnEnabledChanged__DelegateSignature::Component' has a wrong offset!");

// Function Orp_Movable_Button_BP.Orp_Movable_Button_BP_C.ExecuteUbergraph_Orp_Movable_Button_BP
// 0x0018 (0x0018 - 0x0000)
struct Orp_Movable_Button_BP_C_ExecuteUbergraph_Orp_Movable_Button_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBInteractionZoneComponent*            K2Node_ComponentBoundEvent_component;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Orp_Movable_Button_BP_C_ExecuteUbergraph_Orp_Movable_Button_BP) == 0x000008, "Wrong alignment on Orp_Movable_Button_BP_C_ExecuteUbergraph_Orp_Movable_Button_BP");
static_assert(sizeof(Orp_Movable_Button_BP_C_ExecuteUbergraph_Orp_Movable_Button_BP) == 0x000018, "Wrong size on Orp_Movable_Button_BP_C_ExecuteUbergraph_Orp_Movable_Button_BP");
static_assert(offsetof(Orp_Movable_Button_BP_C_ExecuteUbergraph_Orp_Movable_Button_BP, EntryPoint) == 0x000000, "Member 'Orp_Movable_Button_BP_C_ExecuteUbergraph_Orp_Movable_Button_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Orp_Movable_Button_BP_C_ExecuteUbergraph_Orp_Movable_Button_BP, K2Node_ComponentBoundEvent_component) == 0x000008, "Member 'Orp_Movable_Button_BP_C_ExecuteUbergraph_Orp_Movable_Button_BP::K2Node_ComponentBoundEvent_component' has a wrong offset!");
static_assert(offsetof(Orp_Movable_Button_BP_C_ExecuteUbergraph_Orp_Movable_Button_BP, CallFunc_IsEnabled_ReturnValue) == 0x000010, "Member 'Orp_Movable_Button_BP_C_ExecuteUbergraph_Orp_Movable_Button_BP::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");

}

