#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OutdoorLightFenceMinus01

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass OutdoorLightFence-01.OutdoorLightFence-01_C
// 0x0020 (0x0790 - 0x0770)
class AOutdoorLightFenceMinus01_C final : public ARBLight_BP_C
{
public:
	class UPointLightComponent*                   PointLight_Static;                                 // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBVolumetricFogLightComponent*         RBVolumetricFogLight;                              // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight_Movable;                                // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Movable;                                 // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OutdoorLightFence-01_C">();
	}
	static class AOutdoorLightFenceMinus01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOutdoorLightFenceMinus01_C>();
	}
};
static_assert(alignof(AOutdoorLightFenceMinus01_C) == 0x000010, "Wrong alignment on AOutdoorLightFenceMinus01_C");
static_assert(sizeof(AOutdoorLightFenceMinus01_C) == 0x000790, "Wrong size on AOutdoorLightFenceMinus01_C");
static_assert(offsetof(AOutdoorLightFenceMinus01_C, PointLight_Static) == 0x000770, "Member 'AOutdoorLightFenceMinus01_C::PointLight_Static' has a wrong offset!");
static_assert(offsetof(AOutdoorLightFenceMinus01_C, RBVolumetricFogLight) == 0x000778, "Member 'AOutdoorLightFenceMinus01_C::RBVolumetricFogLight' has a wrong offset!");
static_assert(offsetof(AOutdoorLightFenceMinus01_C, PointLight_Movable) == 0x000780, "Member 'AOutdoorLightFenceMinus01_C::PointLight_Movable' has a wrong offset!");
static_assert(offsetof(AOutdoorLightFenceMinus01_C, SpotLight_Movable) == 0x000788, "Member 'AOutdoorLightFenceMinus01_C::SpotLight_Movable' has a wrong offset!");

}

