#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Parent_DestructibleDoorWindow_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Parent_DestructibleDoor_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Parent_DestructibleDoorWindow_BP.Parent_DestructibleDoorWindow_BP_C
// 0x0020 (0x0580 - 0x0560)
class AParent_DestructibleDoorWindow_BP_C : public AParent_DestructibleDoor_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Parent_DestructibleDoorWindow_BP_C; // 0x0560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Window_Destroyed;                               // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Window;                                         // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ToggledOff;                                        // 0x0578(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void OnRep_ToggledOff();
	void Update_Broken_Window();
	void BndEvt__DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDamaged__DelegateSignature(class URBDamageableComponent* DamageableComponent_0, bool IsDestroyed);
	void Event_OnResetStage();
	void Event_SnapToState();
	void BndEvt__DamageableComponent_K2Node_ComponentBoundEvent_1_OnDamageableReset__DelegateSignature(class URBDamageableComponent* DamageableComponent_0);
	void PostToggled(bool bToggleEnabled);
	void BndEvt__Parent_DestructibleDoorWindow_BP_DamageableComponent_K2Node_ComponentBoundEvent_2_OnDamageableEvent__DelegateSignature(class URBDamageableComponent* DamageableComponent_0);
	void ExecuteUbergraph_Parent_DestructibleDoorWindow_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Parent_DestructibleDoorWindow_BP_C">();
	}
	static class AParent_DestructibleDoorWindow_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParent_DestructibleDoorWindow_BP_C>();
	}
};
static_assert(alignof(AParent_DestructibleDoorWindow_BP_C) == 0x000010, "Wrong alignment on AParent_DestructibleDoorWindow_BP_C");
static_assert(sizeof(AParent_DestructibleDoorWindow_BP_C) == 0x000580, "Wrong size on AParent_DestructibleDoorWindow_BP_C");
static_assert(offsetof(AParent_DestructibleDoorWindow_BP_C, UberGraphFrame_Parent_DestructibleDoorWindow_BP_C) == 0x000560, "Member 'AParent_DestructibleDoorWindow_BP_C::UberGraphFrame_Parent_DestructibleDoorWindow_BP_C' has a wrong offset!");
static_assert(offsetof(AParent_DestructibleDoorWindow_BP_C, SM_Window_Destroyed) == 0x000568, "Member 'AParent_DestructibleDoorWindow_BP_C::SM_Window_Destroyed' has a wrong offset!");
static_assert(offsetof(AParent_DestructibleDoorWindow_BP_C, SM_Window) == 0x000570, "Member 'AParent_DestructibleDoorWindow_BP_C::SM_Window' has a wrong offset!");
static_assert(offsetof(AParent_DestructibleDoorWindow_BP_C, ToggledOff) == 0x000578, "Member 'AParent_DestructibleDoorWindow_BP_C::ToggledOff' has a wrong offset!");

}

