#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PasscodeTriggerable_Base_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.GetAssociatedInvestigationComponent
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_GetAssociatedInvestigationComponent final
{
public:
	class URBPlayerInvestigationZoneComponent*    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_GetAssociatedInvestigationComponent) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_GetAssociatedInvestigationComponent");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_GetAssociatedInvestigationComponent) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_GetAssociatedInvestigationComponent");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_GetAssociatedInvestigationComponent, ReturnValue) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_GetAssociatedInvestigationComponent::ReturnValue' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.GetClue
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_GetClue final
{
public:
	struct FClueData                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_GetClue) == 0x000004, "Wrong alignment on PasscodeTriggerable_Base_BP_C_GetClue");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_GetClue) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_GetClue");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_GetClue, ReturnValue) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_GetClue::ReturnValue' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on PasscodeTriggerable_Base_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on PasscodeTriggerable_Base_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.GetStateName
// 0x0028 (0x0028 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_GetStateName final
{
public:
	class FString                                 StateA;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StateB;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_GetStateName) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_GetStateName");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_GetStateName) == 0x000028, "Wrong size on PasscodeTriggerable_Base_BP_C_GetStateName");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_GetStateName, StateA) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_GetStateName::StateA' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_GetStateName, StateB) == 0x000010, "Member 'PasscodeTriggerable_Base_BP_C_GetStateName::StateB' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_GetStateName, ReturnValue) == 0x000020, "Member 'PasscodeTriggerable_Base_BP_C_GetStateName::ReturnValue' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.FixUp
// 0x0001 (0x0001 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_FixUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_FixUp) == 0x000001, "Wrong alignment on PasscodeTriggerable_Base_BP_C_FixUp");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_FixUp) == 0x000001, "Wrong size on PasscodeTriggerable_Base_BP_C_FixUp");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_FixUp, ReturnValue) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_FixUp::ReturnValue' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.PlaySuccessSounds
// 0x0044 (0x0044 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_PlaySuccessSounds final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_1;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventOnActor_ReturnValue_2;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_PlaySuccessSounds) == 0x000004, "Wrong alignment on PasscodeTriggerable_Base_BP_C_PlaySuccessSounds");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_PlaySuccessSounds) == 0x000044, "Wrong size on PasscodeTriggerable_Base_BP_C_PlaySuccessSounds");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_PlaySuccessSounds, Temp_delegate_Variable) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_PlaySuccessSounds::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_PlaySuccessSounds, Temp_delegate_Variable_1) == 0x000010, "Member 'PasscodeTriggerable_Base_BP_C_PlaySuccessSounds::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_PlaySuccessSounds, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'PasscodeTriggerable_Base_BP_C_PlaySuccessSounds::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_PlaySuccessSounds, CallFunc_PostEventOnActor_ReturnValue) == 0x000024, "Member 'PasscodeTriggerable_Base_BP_C_PlaySuccessSounds::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_PlaySuccessSounds, Temp_delegate_Variable_2) == 0x000028, "Member 'PasscodeTriggerable_Base_BP_C_PlaySuccessSounds::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_PlaySuccessSounds, CallFunc_PostEventOnActor_ReturnValue_1) == 0x000038, "Member 'PasscodeTriggerable_Base_BP_C_PlaySuccessSounds::CallFunc_PostEventOnActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_PlaySuccessSounds, CallFunc_IsValid_ReturnValue_1) == 0x00003C, "Member 'PasscodeTriggerable_Base_BP_C_PlaySuccessSounds::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_PlaySuccessSounds, CallFunc_PostEventOnActor_ReturnValue_2) == 0x000040, "Member 'PasscodeTriggerable_Base_BP_C_PlaySuccessSounds::CallFunc_PostEventOnActor_ReturnValue_2' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.UpdateTimerButtonLightColor
// 0x0024 (0x0024 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_UpdateTimerButtonLightColor final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_UpdateTimerButtonLightColor) == 0x000004, "Wrong alignment on PasscodeTriggerable_Base_BP_C_UpdateTimerButtonLightColor");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_UpdateTimerButtonLightColor) == 0x000024, "Wrong size on PasscodeTriggerable_Base_BP_C_UpdateTimerButtonLightColor");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UpdateTimerButtonLightColor, Enabled) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_UpdateTimerButtonLightColor::Enabled' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UpdateTimerButtonLightColor, K2Node_MakeStruct_LinearColor) == 0x000004, "Member 'PasscodeTriggerable_Base_BP_C_UpdateTimerButtonLightColor::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UpdateTimerButtonLightColor, K2Node_MakeStruct_LinearColor_1) == 0x000014, "Member 'PasscodeTriggerable_Base_BP_C_UpdateTimerButtonLightColor::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.UpdateButtonFocus
// 0x0050 (0x0050 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_UpdateButtonFocus final
{
public:
	class USceneComponent*                        ButtonComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPasscodeButtonComponent*             K2Node_DynamicCast_AsRB_Passcode_Button_Component; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetChildComponent_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_UpdateButtonFocus) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_UpdateButtonFocus");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_UpdateButtonFocus) == 0x000050, "Wrong size on PasscodeTriggerable_Base_BP_C_UpdateButtonFocus");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UpdateButtonFocus, ButtonComponent) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_UpdateButtonFocus::ButtonComponent' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UpdateButtonFocus, Temp_bool_Variable) == 0x000008, "Member 'PasscodeTriggerable_Base_BP_C_UpdateButtonFocus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UpdateButtonFocus, K2Node_DynamicCast_AsRB_Passcode_Button_Component) == 0x000010, "Member 'PasscodeTriggerable_Base_BP_C_UpdateButtonFocus::K2Node_DynamicCast_AsRB_Passcode_Button_Component' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UpdateButtonFocus, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PasscodeTriggerable_Base_BP_C_UpdateButtonFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UpdateButtonFocus, CallFunc_GetChildComponent_ReturnValue) == 0x000020, "Member 'PasscodeTriggerable_Base_BP_C_UpdateButtonFocus::CallFunc_GetChildComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UpdateButtonFocus, K2Node_DynamicCast_AsPrimitive_Component) == 0x000028, "Member 'PasscodeTriggerable_Base_BP_C_UpdateButtonFocus::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UpdateButtonFocus, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'PasscodeTriggerable_Base_BP_C_UpdateButtonFocus::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UpdateButtonFocus, Temp_float_Variable) == 0x000034, "Member 'PasscodeTriggerable_Base_BP_C_UpdateButtonFocus::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UpdateButtonFocus, Temp_float_Variable_1) == 0x000038, "Member 'PasscodeTriggerable_Base_BP_C_UpdateButtonFocus::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UpdateButtonFocus, K2Node_Select_Default) == 0x00003C, "Member 'PasscodeTriggerable_Base_BP_C_UpdateButtonFocus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UpdateButtonFocus, K2Node_MakeStruct_LinearColor) == 0x000040, "Member 'PasscodeTriggerable_Base_BP_C_UpdateButtonFocus::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.RefreshDiode
// 0x0070 (0x0070 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_RefreshDiode final
{
public:
	bool                                          bFailed;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_RefreshDiode) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_RefreshDiode");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_RefreshDiode) == 0x000070, "Wrong size on PasscodeTriggerable_Base_BP_C_RefreshDiode");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_RefreshDiode, bFailed) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_RefreshDiode::bFailed' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_RefreshDiode, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'PasscodeTriggerable_Base_BP_C_RefreshDiode::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_RefreshDiode, CallFunc_SelectColor_ReturnValue) == 0x000008, "Member 'PasscodeTriggerable_Base_BP_C_RefreshDiode::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_RefreshDiode, Temp_int_Array_Index_Variable) == 0x000018, "Member 'PasscodeTriggerable_Base_BP_C_RefreshDiode::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_RefreshDiode, K2Node_MakeStruct_LinearColor) == 0x00001C, "Member 'PasscodeTriggerable_Base_BP_C_RefreshDiode::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_RefreshDiode, K2Node_MakeStruct_LinearColor_1) == 0x00002C, "Member 'PasscodeTriggerable_Base_BP_C_RefreshDiode::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_RefreshDiode, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'PasscodeTriggerable_Base_BP_C_RefreshDiode::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_RefreshDiode, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'PasscodeTriggerable_Base_BP_C_RefreshDiode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_RefreshDiode, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'PasscodeTriggerable_Base_BP_C_RefreshDiode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_RefreshDiode, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'PasscodeTriggerable_Base_BP_C_RefreshDiode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_RefreshDiode, CallFunc_SelectColor_ReturnValue_1) == 0x00004C, "Member 'PasscodeTriggerable_Base_BP_C_RefreshDiode::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_RefreshDiode, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'PasscodeTriggerable_Base_BP_C_RefreshDiode::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_RefreshDiode, CallFunc_Array_Get_Item) == 0x000060, "Member 'PasscodeTriggerable_Base_BP_C_RefreshDiode::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_RefreshDiode, CallFunc_Less_IntInt_ReturnValue_1) == 0x000068, "Member 'PasscodeTriggerable_Base_BP_C_RefreshDiode::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.ButtonSound
// 0x0068 (0x0068 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_ButtonSound final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsPressed_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetGameTime_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_GetElapsedTime_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_ButtonSound) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_ButtonSound");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_ButtonSound) == 0x000068, "Wrong size on PasscodeTriggerable_Base_BP_C_ButtonSound");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_ButtonSound, Button) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_ButtonSound::Button' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_ButtonSound, Temp_delegate_Variable) == 0x000008, "Member 'PasscodeTriggerable_Base_BP_C_ButtonSound::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_ButtonSound, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'PasscodeTriggerable_Base_BP_C_ButtonSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_ButtonSound, CallFunc_BP_IsPressed_ReturnValue) == 0x000019, "Member 'PasscodeTriggerable_Base_BP_C_ButtonSound::CallFunc_BP_IsPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_ButtonSound, Temp_struct_Variable) == 0x000020, "Member 'PasscodeTriggerable_Base_BP_C_ButtonSound::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_ButtonSound, Temp_delegate_Variable_1) == 0x000030, "Member 'PasscodeTriggerable_Base_BP_C_ButtonSound::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_ButtonSound, CallFunc_GetGameTime_ReturnValue) == 0x000040, "Member 'PasscodeTriggerable_Base_BP_C_ButtonSound::CallFunc_GetGameTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_ButtonSound, CallFunc_PostAkEvent_ReturnValue) == 0x000044, "Member 'PasscodeTriggerable_Base_BP_C_ButtonSound::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_ButtonSound, Temp_struct_Variable_1) == 0x000048, "Member 'PasscodeTriggerable_Base_BP_C_ButtonSound::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_ButtonSound, CallFunc_GetElapsedTime_ReturnValue) == 0x000058, "Member 'PasscodeTriggerable_Base_BP_C_ButtonSound::CallFunc_GetElapsedTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_ButtonSound, CallFunc_PostAkEvent_ReturnValue_1) == 0x00005C, "Member 'PasscodeTriggerable_Base_BP_C_ButtonSound::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_ButtonSound, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000060, "Member 'PasscodeTriggerable_Base_BP_C_ButtonSound::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_UserConstructionScript final
{
public:
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_UserConstructionScript");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_UserConstructionScript) == 0x000010, "Wrong size on PasscodeTriggerable_Base_BP_C_UserConstructionScript");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.PrepareState
// 0x0010 (0x0010 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_PrepareState final
{
public:
	bool                                          bStateA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RandomOwner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_PrepareState) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_PrepareState");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_PrepareState) == 0x000010, "Wrong size on PasscodeTriggerable_Base_BP_C_PrepareState");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_PrepareState, bStateA) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_PrepareState::bStateA' has a wrong offset!");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_PrepareState, RandomOwner) == 0x000008, "Member 'PasscodeTriggerable_Base_BP_C_PrepareState::RandomOwner' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.OnPostActorsPasted
// 0x0010 (0x0010 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_OnPostActorsPasted final
{
public:
	TArray<class AActor*>                         PastedActors;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_OnPostActorsPasted) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_OnPostActorsPasted");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_OnPostActorsPasted) == 0x000010, "Wrong size on PasscodeTriggerable_Base_BP_C_OnPostActorsPasted");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_OnPostActorsPasted, PastedActors) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_OnPostActorsPasted::PastedActors' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.PostDuplicated
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_PostDuplicated final
{
public:
	class AActor*                                 DuplicationParent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_PostDuplicated) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_PostDuplicated");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_PostDuplicated) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_PostDuplicated");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_PostDuplicated, DuplicationParent) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_PostDuplicated::DuplicationParent' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.PostEditChange
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_PostEditChange final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_PostEditChange) == 0x000004, "Wrong alignment on PasscodeTriggerable_Base_BP_C_PostEditChange");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_PostEditChange) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_PostEditChange");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_PostEditChange, PropertyName) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_PostEditChange::PropertyName' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.PostEditMove
// 0x0001 (0x0001 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_PostEditMove final
{
public:
	bool                                          bFinished;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_PostEditMove) == 0x000001, "Wrong alignment on PasscodeTriggerable_Base_BP_C_PostEditMove");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_PostEditMove) == 0x000001, "Wrong size on PasscodeTriggerable_Base_BP_C_PostEditMove");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_PostEditMove, bFinished) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_PostEditMove::bFinished' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.SetShouldBeIgnoredForLots
// 0x0001 (0x0001 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_SetShouldBeIgnoredForLots final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_SetShouldBeIgnoredForLots) == 0x000001, "Wrong alignment on PasscodeTriggerable_Base_BP_C_SetShouldBeIgnoredForLots");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_SetShouldBeIgnoredForLots) == 0x000001, "Wrong size on PasscodeTriggerable_Base_BP_C_SetShouldBeIgnoredForLots");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_SetShouldBeIgnoredForLots, bValue) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_SetShouldBeIgnoredForLots::bValue' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.SetState
// 0x0001 (0x0001 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_SetState final
{
public:
	bool                                          bStateA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_SetState) == 0x000001, "Wrong alignment on PasscodeTriggerable_Base_BP_C_SetState");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_SetState) == 0x000001, "Wrong size on PasscodeTriggerable_Base_BP_C_SetState");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_SetState, bStateA) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_SetState::bStateA' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.Timer Button Press
// 0x0001 (0x0001 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_Timer_Button_Press final
{
public:
	bool                                          Press;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_Timer_Button_Press) == 0x000001, "Wrong alignment on PasscodeTriggerable_Base_BP_C_Timer_Button_Press");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_Timer_Button_Press) == 0x000001, "Wrong size on PasscodeTriggerable_Base_BP_C_Timer_Button_Press");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_Timer_Button_Press, Press) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_Timer_Button_Press::Press' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_28_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_1_K2Node_ComponentBoundEvent_32_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_33_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_34_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_Clear_K2Node_ComponentBoundEvent_35_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_36_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_3_K2Node_ComponentBoundEvent_37_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_38_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_0_K2Node_ComponentBoundEvent_39_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_9_K2Node_ComponentBoundEvent_40_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_41_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(sizeof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong size on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature");
static_assert(offsetof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_8_K2Node_ComponentBoundEvent_42_OnSimplePasscodeButtonStateChanged__DelegateSignature::Button' has a wrong offset!");

// Function PasscodeTriggerable_Base_BP.PasscodeTriggerable_Base_BP_C.BndEvt__DrugPasscodeBox_Base_BP_Button 7_K2Node_ComponentBoundEvent_43_OnSimplePasscodeButtonStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_43_OnSimplePasscodeButtonStateChanged__DelegateSignature final
{
public:
	class URBSimplePasscodeButtonComponent*       Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_43_OnSimplePasscodeButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on PasscodeTriggerable_Base_BP_C_BndEvt__DrugPasscodeBox_Base_BP_Button_7_K2Node_ComponentBoundEvent_43_OnSimplePasscodeButtonStateChanged__DelegateSignature");
