#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkSlotsButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PerkSlotsButton.PerkSlotsButton_C
// 0x0088 (0x02E8 - 0x0260)
class UPerkSlotsButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AmpName;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         CategoryText;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedBottomLeftBracket_1;                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedBottomRightBracket_1;                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedTopLeftBracket_1;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedTopRightBracket_1;                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InteractionButton;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              PerkScale;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkSlotButton_C*                      PerkSlotButton;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PickupListBox;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SelectionBorderPanel;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsGamepad;                                        // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bHovered;                                          // 0x02C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bFocused;                                          // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPerkCategory                                 PerkCategory;                                      // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void SetFocused(bool bInFocused);
	void IsConsideredHovered(bool* bConsideredHovered);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetHovered(bool bInHovered);
	void Refresh();
	void Init();
	void Setup();
	void BndEvt__RigButton_InteractionButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__RigButton_InteractionButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__RigButton_InteractionButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void Destruct();
	void OnMenuInputSourceChanged();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_PerkSlotsButton(int32 EntryPoint);
	void OnClicked__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PerkSlotsButton_C">();
	}
	static class UPerkSlotsButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerkSlotsButton_C>();
	}
};
static_assert(alignof(UPerkSlotsButton_C) == 0x000008, "Wrong alignment on UPerkSlotsButton_C");
static_assert(sizeof(UPerkSlotsButton_C) == 0x0002E8, "Wrong size on UPerkSlotsButton_C");
static_assert(offsetof(UPerkSlotsButton_C, UberGraphFrame) == 0x000260, "Member 'UPerkSlotsButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, AmpName) == 0x000268, "Member 'UPerkSlotsButton_C::AmpName' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, BackgroundImage) == 0x000270, "Member 'UPerkSlotsButton_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, CategoryText) == 0x000278, "Member 'UPerkSlotsButton_C::CategoryText' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, FocussedBottomLeftBracket_1) == 0x000280, "Member 'UPerkSlotsButton_C::FocussedBottomLeftBracket_1' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, FocussedBottomRightBracket_1) == 0x000288, "Member 'UPerkSlotsButton_C::FocussedBottomRightBracket_1' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, FocussedTopLeftBracket_1) == 0x000290, "Member 'UPerkSlotsButton_C::FocussedTopLeftBracket_1' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, FocussedTopRightBracket_1) == 0x000298, "Member 'UPerkSlotsButton_C::FocussedTopRightBracket_1' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, InteractionButton) == 0x0002A0, "Member 'UPerkSlotsButton_C::InteractionButton' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, PerkScale) == 0x0002A8, "Member 'UPerkSlotsButton_C::PerkScale' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, PerkSlotButton) == 0x0002B0, "Member 'UPerkSlotsButton_C::PerkSlotButton' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, PickupListBox) == 0x0002B8, "Member 'UPerkSlotsButton_C::PickupListBox' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, SelectionBorderPanel) == 0x0002C0, "Member 'UPerkSlotsButton_C::SelectionBorderPanel' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, bIsGamepad) == 0x0002C8, "Member 'UPerkSlotsButton_C::bIsGamepad' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, bHovered) == 0x0002C9, "Member 'UPerkSlotsButton_C::bHovered' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, OnClicked) == 0x0002D0, "Member 'UPerkSlotsButton_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, bFocused) == 0x0002E0, "Member 'UPerkSlotsButton_C::bFocused' has a wrong offset!");
static_assert(offsetof(UPerkSlotsButton_C, PerkCategory) == 0x0002E1, "Member 'UPerkSlotsButton_C::PerkCategory' has a wrong offset!");

}

