#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkCategoryButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "OPP_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PerkCategoryButton.PerkCategoryButton_C.Update Is New
// 0x01D8 (0x01D8 - 0x0000)
struct PerkCategoryButton_C_Update_Is_New final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasRecentlyBoughtUpgradeOfType_ReturnValue; // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_FilterItemProgressionDataIds_ReturnValue; // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuUpgradeItemInfo                   CallFunc_GetUpgradeItemInfo_ReturnValue;           // 0x0040(0x0190)()
	bool                                          CallFunc_WasSeenInMenu_ReturnValue;                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkCategoryButton_C_Update_Is_New) == 0x000008, "Wrong alignment on PerkCategoryButton_C_Update_Is_New");
static_assert(sizeof(PerkCategoryButton_C_Update_Is_New) == 0x0001D8, "Wrong size on PerkCategoryButton_C_Update_Is_New");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, Count) == 0x000000, "Member 'PerkCategoryButton_C_Update_Is_New::Count' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, Temp_bool_Variable) == 0x000004, "Member 'PerkCategoryButton_C_Update_Is_New::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, Temp_byte_Variable) == 0x000005, "Member 'PerkCategoryButton_C_Update_Is_New::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, Temp_byte_Variable_1) == 0x000006, "Member 'PerkCategoryButton_C_Update_Is_New::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, Temp_int_Array_Index_Variable) == 0x000008, "Member 'PerkCategoryButton_C_Update_Is_New::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'PerkCategoryButton_C_Update_Is_New::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'PerkCategoryButton_C_Update_Is_New::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, CallFunc_HasRecentlyBoughtUpgradeOfType_ReturnValue) == 0x000014, "Member 'PerkCategoryButton_C_Update_Is_New::CallFunc_HasRecentlyBoughtUpgradeOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, K2Node_Select_Default) == 0x000015, "Member 'PerkCategoryButton_C_Update_Is_New::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x000018, "Member 'PerkCategoryButton_C_Update_Is_New::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, CallFunc_FilterItemProgressionDataIds_ReturnValue) == 0x000020, "Member 'PerkCategoryButton_C_Update_Is_New::CallFunc_FilterItemProgressionDataIds_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'PerkCategoryButton_C_Update_Is_New::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, CallFunc_Array_Get_Item) == 0x000034, "Member 'PerkCategoryButton_C_Update_Is_New::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'PerkCategoryButton_C_Update_Is_New::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, CallFunc_GetUpgradeItemInfo_ReturnValue) == 0x000040, "Member 'PerkCategoryButton_C_Update_Is_New::CallFunc_GetUpgradeItemInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, CallFunc_WasSeenInMenu_ReturnValue) == 0x0001D0, "Member 'PerkCategoryButton_C_Update_Is_New::CallFunc_WasSeenInMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, K2Node_SwitchEnum_CmpSuccess) == 0x0001D1, "Member 'PerkCategoryButton_C_Update_Is_New::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Update_Is_New, CallFunc_Not_PreBool_ReturnValue) == 0x0001D2, "Member 'PerkCategoryButton_C_Update_Is_New::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function PerkCategoryButton.PerkCategoryButton_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct PerkCategoryButton_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(PerkCategoryButton_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on PerkCategoryButton_C_OnRemovedFromFocusPath");
static_assert(sizeof(PerkCategoryButton_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on PerkCategoryButton_C_OnRemovedFromFocusPath");
static_assert(offsetof(PerkCategoryButton_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'PerkCategoryButton_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function PerkCategoryButton.PerkCategoryButton_C.IsConsideredHovered
// 0x0018 (0x0018 - 0x0000)
struct PerkCategoryButton_C_IsConsideredHovered final
{
public:
	bool                                          bConsideredHovered;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkCategoryButton_C_IsConsideredHovered) == 0x000008, "Wrong alignment on PerkCategoryButton_C_IsConsideredHovered");
static_assert(sizeof(PerkCategoryButton_C_IsConsideredHovered) == 0x000018, "Wrong size on PerkCategoryButton_C_IsConsideredHovered");
static_assert(offsetof(PerkCategoryButton_C_IsConsideredHovered, bConsideredHovered) == 0x000000, "Member 'PerkCategoryButton_C_IsConsideredHovered::bConsideredHovered' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_IsConsideredHovered, CallFunc_GetMenuManager_ReturnValue) == 0x000008, "Member 'PerkCategoryButton_C_IsConsideredHovered::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_IsConsideredHovered, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x000010, "Member 'PerkCategoryButton_C_IsConsideredHovered::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");

// Function PerkCategoryButton.PerkCategoryButton_C.OnFocusReceived
// 0x01D0 (0x01D0 - 0x0000)
struct PerkCategoryButton_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00F8(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0118(0x00B8)()
};
static_assert(alignof(PerkCategoryButton_C_OnFocusReceived) == 0x000008, "Wrong alignment on PerkCategoryButton_C_OnFocusReceived");
static_assert(sizeof(PerkCategoryButton_C_OnFocusReceived) == 0x0001D0, "Wrong size on PerkCategoryButton_C_OnFocusReceived");
static_assert(offsetof(PerkCategoryButton_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'PerkCategoryButton_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'PerkCategoryButton_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'PerkCategoryButton_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_OnFocusReceived, CallFunc_MakeLiteralText_ReturnValue) == 0x0000F8, "Member 'PerkCategoryButton_C_OnFocusReceived::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_OnFocusReceived, CallFunc_MakeLiteralName_ReturnValue) == 0x000110, "Member 'PerkCategoryButton_C_OnFocusReceived::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000118, "Member 'PerkCategoryButton_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function PerkCategoryButton.PerkCategoryButton_C.SetFocused
// 0x0030 (0x0030 - 0x0000)
struct PerkCategoryButton_C_SetFocused final
{
public:
	bool                                          bInFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPerkCategory                                 Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkCategoryButton_C_SetFocused) == 0x000008, "Wrong alignment on PerkCategoryButton_C_SetFocused");
static_assert(sizeof(PerkCategoryButton_C_SetFocused) == 0x000030, "Wrong size on PerkCategoryButton_C_SetFocused");
static_assert(offsetof(PerkCategoryButton_C_SetFocused, bInFocused) == 0x000000, "Member 'PerkCategoryButton_C_SetFocused::bInFocused' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetFocused, Temp_byte_Variable) == 0x000001, "Member 'PerkCategoryButton_C_SetFocused::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetFocused, Temp_int_Variable) == 0x000004, "Member 'PerkCategoryButton_C_SetFocused::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetFocused, Temp_int_Variable_1) == 0x000008, "Member 'PerkCategoryButton_C_SetFocused::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetFocused, Temp_int_Variable_2) == 0x00000C, "Member 'PerkCategoryButton_C_SetFocused::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetFocused, Temp_int_Variable_3) == 0x000010, "Member 'PerkCategoryButton_C_SetFocused::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetFocused, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000014, "Member 'PerkCategoryButton_C_SetFocused::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetFocused, K2Node_Select_Default) == 0x000018, "Member 'PerkCategoryButton_C_SetFocused::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetFocused, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x00001C, "Member 'PerkCategoryButton_C_SetFocused::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetFocused, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'PerkCategoryButton_C_SetFocused::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetFocused, CallFunc_GetMenuManager_ReturnValue) == 0x000028, "Member 'PerkCategoryButton_C_SetFocused::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");

// Function PerkCategoryButton.PerkCategoryButton_C.SetHovered
// 0x0030 (0x0030 - 0x0000)
struct PerkCategoryButton_C_SetHovered final
{
public:
	bool                                          IsHovered_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPerkCategory                                 Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkCategoryButton_C_SetHovered) == 0x000008, "Wrong alignment on PerkCategoryButton_C_SetHovered");
static_assert(sizeof(PerkCategoryButton_C_SetHovered) == 0x000030, "Wrong size on PerkCategoryButton_C_SetHovered");
static_assert(offsetof(PerkCategoryButton_C_SetHovered, IsHovered_0) == 0x000000, "Member 'PerkCategoryButton_C_SetHovered::IsHovered_0' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetHovered, Temp_byte_Variable) == 0x000001, "Member 'PerkCategoryButton_C_SetHovered::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetHovered, Temp_int_Variable) == 0x000004, "Member 'PerkCategoryButton_C_SetHovered::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetHovered, Temp_int_Variable_1) == 0x000008, "Member 'PerkCategoryButton_C_SetHovered::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetHovered, Temp_int_Variable_2) == 0x00000C, "Member 'PerkCategoryButton_C_SetHovered::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetHovered, Temp_int_Variable_3) == 0x000010, "Member 'PerkCategoryButton_C_SetHovered::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetHovered, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000014, "Member 'PerkCategoryButton_C_SetHovered::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetHovered, K2Node_Select_Default) == 0x000018, "Member 'PerkCategoryButton_C_SetHovered::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetHovered, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x00001C, "Member 'PerkCategoryButton_C_SetHovered::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetHovered, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'PerkCategoryButton_C_SetHovered::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_SetHovered, CallFunc_GetMenuManager_ReturnValue) == 0x000028, "Member 'PerkCategoryButton_C_SetHovered::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");

// Function PerkCategoryButton.PerkCategoryButton_C.Refresh
// 0x04D8 (0x04D8 - 0x0000)
struct PerkCategoryButton_C_Refresh final
{
public:
	int32                                         TotalCount;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AcquiredCount;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPerkCategory                                 Temp_byte_Variable_2;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_5;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPerkCategory                                 Temp_byte_Variable_3;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_6;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered;   // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00A8(0x0028)()
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered_1; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00E0(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0128(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0178(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_7;                            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default_2;                           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default_3;                           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRBItemProgressionData>         CallFunc_FilterItemProgressionData_ReturnValue;    // 0x01B8(0x0010)(ReferenceParm)
	struct FRBItemProgressionData                 CallFunc_Array_Get_Item;                           // 0x01C8(0x0170)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuUpgradeItemInfo                   CallFunc_GetUpgradeItemInfo_ReturnValue;           // 0x0340(0x0190)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredHovered_bConsideredHovered_2; // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x04D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkCategoryButton_C_Refresh) == 0x000008, "Wrong alignment on PerkCategoryButton_C_Refresh");
static_assert(sizeof(PerkCategoryButton_C_Refresh) == 0x0004D8, "Wrong size on PerkCategoryButton_C_Refresh");
static_assert(offsetof(PerkCategoryButton_C_Refresh, TotalCount) == 0x000000, "Member 'PerkCategoryButton_C_Refresh::TotalCount' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, AcquiredCount) == 0x000004, "Member 'PerkCategoryButton_C_Refresh::AcquiredCount' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_object_Variable) == 0x000008, "Member 'PerkCategoryButton_C_Refresh::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_object_Variable_1) == 0x000010, "Member 'PerkCategoryButton_C_Refresh::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_object_Variable_2) == 0x000018, "Member 'PerkCategoryButton_C_Refresh::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_bool_Variable) == 0x000020, "Member 'PerkCategoryButton_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_struct_Variable) == 0x000024, "Member 'PerkCategoryButton_C_Refresh::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_struct_Variable_1) == 0x000034, "Member 'PerkCategoryButton_C_Refresh::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_bool_Variable_1) == 0x000044, "Member 'PerkCategoryButton_C_Refresh::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_byte_Variable) == 0x000045, "Member 'PerkCategoryButton_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_byte_Variable_1) == 0x000046, "Member 'PerkCategoryButton_C_Refresh::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_object_Variable_3) == 0x000048, "Member 'PerkCategoryButton_C_Refresh::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_byte_Variable_2) == 0x000050, "Member 'PerkCategoryButton_C_Refresh::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_object_Variable_4) == 0x000058, "Member 'PerkCategoryButton_C_Refresh::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_bool_Variable_2) == 0x000060, "Member 'PerkCategoryButton_C_Refresh::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_object_Variable_5) == 0x000068, "Member 'PerkCategoryButton_C_Refresh::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_byte_Variable_3) == 0x000070, "Member 'PerkCategoryButton_C_Refresh::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_int_Variable) == 0x000074, "Member 'PerkCategoryButton_C_Refresh::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_int_Variable_1) == 0x000078, "Member 'PerkCategoryButton_C_Refresh::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_object_Variable_6) == 0x000080, "Member 'PerkCategoryButton_C_Refresh::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'PerkCategoryButton_C_Refresh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'PerkCategoryButton_C_Refresh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_int_Array_Index_Variable) == 0x000090, "Member 'PerkCategoryButton_C_Refresh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_IsConsideredHovered_bConsideredHovered) == 0x000094, "Member 'PerkCategoryButton_C_Refresh::CallFunc_IsConsideredHovered_bConsideredHovered' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_BooleanOR_ReturnValue) == 0x000095, "Member 'PerkCategoryButton_C_Refresh::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, K2Node_Select_Default) == 0x000098, "Member 'PerkCategoryButton_C_Refresh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, K2Node_MakeStruct_SlateColor) == 0x0000A8, "Member 'PerkCategoryButton_C_Refresh::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, K2Node_Select_Default_1) == 0x0000D0, "Member 'PerkCategoryButton_C_Refresh::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_IsConsideredHovered_bConsideredHovered_1) == 0x0000D8, "Member 'PerkCategoryButton_C_Refresh::CallFunc_IsConsideredHovered_bConsideredHovered_1' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_BooleanOR_ReturnValue_1) == 0x0000D9, "Member 'PerkCategoryButton_C_Refresh::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, K2Node_MakeStruct_FormatArgumentData) == 0x0000E0, "Member 'PerkCategoryButton_C_Refresh::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_Add_IntInt_ReturnValue_1) == 0x000120, "Member 'PerkCategoryButton_C_Refresh::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, K2Node_MakeStruct_FormatArgumentData_1) == 0x000128, "Member 'PerkCategoryButton_C_Refresh::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, K2Node_MakeArray_Array) == 0x000168, "Member 'PerkCategoryButton_C_Refresh::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_Format_ReturnValue) == 0x000178, "Member 'PerkCategoryButton_C_Refresh::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_Add_IntInt_ReturnValue_2) == 0x000190, "Member 'PerkCategoryButton_C_Refresh::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, Temp_object_Variable_7) == 0x000198, "Member 'PerkCategoryButton_C_Refresh::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, K2Node_Select_Default_2) == 0x0001A0, "Member 'PerkCategoryButton_C_Refresh::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x0001A8, "Member 'PerkCategoryButton_C_Refresh::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, K2Node_Select_Default_3) == 0x0001B0, "Member 'PerkCategoryButton_C_Refresh::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_FilterItemProgressionData_ReturnValue) == 0x0001B8, "Member 'PerkCategoryButton_C_Refresh::CallFunc_FilterItemProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_Array_Get_Item) == 0x0001C8, "Member 'PerkCategoryButton_C_Refresh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_Array_Length_ReturnValue) == 0x000338, "Member 'PerkCategoryButton_C_Refresh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_Less_IntInt_ReturnValue) == 0x00033C, "Member 'PerkCategoryButton_C_Refresh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_GetUpgradeItemInfo_ReturnValue) == 0x000340, "Member 'PerkCategoryButton_C_Refresh::CallFunc_GetUpgradeItemInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0004D0, "Member 'PerkCategoryButton_C_Refresh::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, CallFunc_IsConsideredHovered_bConsideredHovered_2) == 0x0004D1, "Member 'PerkCategoryButton_C_Refresh::CallFunc_IsConsideredHovered_bConsideredHovered_2' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Refresh, K2Node_Select_Default_4) == 0x0004D2, "Member 'PerkCategoryButton_C_Refresh::K2Node_Select_Default_4' has a wrong offset!");

// Function PerkCategoryButton.PerkCategoryButton_C.Setup
// 0x0060 (0x0060 - 0x0000)
struct PerkCategoryButton_C_Setup final
{
public:
	EPerkCategory                                 Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0038(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkCategoryButton_C_Setup) == 0x000008, "Wrong alignment on PerkCategoryButton_C_Setup");
static_assert(sizeof(PerkCategoryButton_C_Setup) == 0x000060, "Wrong size on PerkCategoryButton_C_Setup");
static_assert(offsetof(PerkCategoryButton_C_Setup, Temp_byte_Variable) == 0x000000, "Member 'PerkCategoryButton_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Setup, Temp_object_Variable) == 0x000008, "Member 'PerkCategoryButton_C_Setup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Setup, Temp_object_Variable_1) == 0x000010, "Member 'PerkCategoryButton_C_Setup::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Setup, Temp_object_Variable_2) == 0x000018, "Member 'PerkCategoryButton_C_Setup::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Setup, Temp_object_Variable_3) == 0x000020, "Member 'PerkCategoryButton_C_Setup::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Setup, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'PerkCategoryButton_C_Setup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Setup, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x000030, "Member 'PerkCategoryButton_C_Setup::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Setup, CallFunc_Map_Find_Value) == 0x000038, "Member 'PerkCategoryButton_C_Setup::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Setup, CallFunc_Map_Find_ReturnValue) == 0x000050, "Member 'PerkCategoryButton_C_Setup::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_Setup, K2Node_Select_Default) == 0x000058, "Member 'PerkCategoryButton_C_Setup::K2Node_Select_Default' has a wrong offset!");

// Function PerkCategoryButton.PerkCategoryButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PerkCategoryButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkCategoryButton_C_PreConstruct) == 0x000001, "Wrong alignment on PerkCategoryButton_C_PreConstruct");
static_assert(sizeof(PerkCategoryButton_C_PreConstruct) == 0x000001, "Wrong size on PerkCategoryButton_C_PreConstruct");
static_assert(offsetof(PerkCategoryButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PerkCategoryButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PerkCategoryButton.PerkCategoryButton_C.ExecuteUbergraph_PerkCategoryButton
// 0x0008 (0x0008 - 0x0000)
struct PerkCategoryButton_C_ExecuteUbergraph_PerkCategoryButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkCategoryButton_C_ExecuteUbergraph_PerkCategoryButton) == 0x000004, "Wrong alignment on PerkCategoryButton_C_ExecuteUbergraph_PerkCategoryButton");
static_assert(sizeof(PerkCategoryButton_C_ExecuteUbergraph_PerkCategoryButton) == 0x000008, "Wrong size on PerkCategoryButton_C_ExecuteUbergraph_PerkCategoryButton");
static_assert(offsetof(PerkCategoryButton_C_ExecuteUbergraph_PerkCategoryButton, EntryPoint) == 0x000000, "Member 'PerkCategoryButton_C_ExecuteUbergraph_PerkCategoryButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(PerkCategoryButton_C_ExecuteUbergraph_PerkCategoryButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'PerkCategoryButton_C_ExecuteUbergraph_PerkCategoryButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function PerkCategoryButton.PerkCategoryButton_C.OnPerkCategoryClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct PerkCategoryButton_C_OnPerkCategoryClicked__DelegateSignature final
{
public:
	EPerkCategory                                 Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkCategoryButton_C_OnPerkCategoryClicked__DelegateSignature) == 0x000001, "Wrong alignment on PerkCategoryButton_C_OnPerkCategoryClicked__DelegateSignature");
static_assert(sizeof(PerkCategoryButton_C_OnPerkCategoryClicked__DelegateSignature) == 0x000001, "Wrong size on PerkCategoryButton_C_OnPerkCategoryClicked__DelegateSignature");
static_assert(offsetof(PerkCategoryButton_C_OnPerkCategoryClicked__DelegateSignature, Category) == 0x000000, "Member 'PerkCategoryButton_C_OnPerkCategoryClicked__DelegateSignature::Category' has a wrong offset!");

}

