#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PharmacyMinus02_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function Pharmacy-02_BP.Pharmacy-02_BP_C.PlaySpecialMoveAnimation
// 0x0020 (0x0020 - 0x0000)
struct PharmacyMinus02_BP_C_PlaySpecialMoveAnimation final
{
public:
	class ARBPawn*                                InteractorPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  SpecialMove;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer_BP_C*                         K2Node_DynamicCast_AsRB_Player_BP;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PharmacyMinus02_BP_C_PlaySpecialMoveAnimation) == 0x000008, "Wrong alignment on PharmacyMinus02_BP_C_PlaySpecialMoveAnimation");
static_assert(sizeof(PharmacyMinus02_BP_C_PlaySpecialMoveAnimation) == 0x000020, "Wrong size on PharmacyMinus02_BP_C_PlaySpecialMoveAnimation");
static_assert(offsetof(PharmacyMinus02_BP_C_PlaySpecialMoveAnimation, InteractorPawn) == 0x000000, "Member 'PharmacyMinus02_BP_C_PlaySpecialMoveAnimation::InteractorPawn' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_PlaySpecialMoveAnimation, SpecialMove) == 0x000008, "Member 'PharmacyMinus02_BP_C_PlaySpecialMoveAnimation::SpecialMove' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_PlaySpecialMoveAnimation, ReturnValue) == 0x000009, "Member 'PharmacyMinus02_BP_C_PlaySpecialMoveAnimation::ReturnValue' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_PlaySpecialMoveAnimation, K2Node_DynamicCast_AsRB_Player_BP) == 0x000010, "Member 'PharmacyMinus02_BP_C_PlaySpecialMoveAnimation::K2Node_DynamicCast_AsRB_Player_BP' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_PlaySpecialMoveAnimation, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PharmacyMinus02_BP_C_PlaySpecialMoveAnimation::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Pharmacy-02_BP.Pharmacy-02_BP_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct PharmacyMinus02_BP_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(PharmacyMinus02_BP_C_UserConstructionScript) == 0x000010, "Wrong alignment on PharmacyMinus02_BP_C_UserConstructionScript");
static_assert(sizeof(PharmacyMinus02_BP_C_UserConstructionScript) == 0x000030, "Wrong size on PharmacyMinus02_BP_C_UserConstructionScript");
static_assert(offsetof(PharmacyMinus02_BP_C_UserConstructionScript, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'PharmacyMinus02_BP_C_UserConstructionScript::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");

// Function Pharmacy-02_BP.Pharmacy-02_BP_C.Set Open
// 0x0001 (0x0001 - 0x0000)
struct PharmacyMinus02_BP_C_Set_Open final
{
public:
	bool                                          FullAnim;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PharmacyMinus02_BP_C_Set_Open) == 0x000001, "Wrong alignment on PharmacyMinus02_BP_C_Set_Open");
static_assert(sizeof(PharmacyMinus02_BP_C_Set_Open) == 0x000001, "Wrong size on PharmacyMinus02_BP_C_Set_Open");
static_assert(offsetof(PharmacyMinus02_BP_C_Set_Open, FullAnim) == 0x000000, "Member 'PharmacyMinus02_BP_C_Set_Open::FullAnim' has a wrong offset!");

// Function Pharmacy-02_BP.Pharmacy-02_BP_C.OnPawnPlaySpecialMoveAnimation
// 0x0010 (0x0010 - 0x0000)
struct PharmacyMinus02_BP_C_OnPawnPlaySpecialMoveAnimation final
{
public:
	const class ARBPawn*                          Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  SpecialMove;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PharmacyMinus02_BP_C_OnPawnPlaySpecialMoveAnimation) == 0x000008, "Wrong alignment on PharmacyMinus02_BP_C_OnPawnPlaySpecialMoveAnimation");
static_assert(sizeof(PharmacyMinus02_BP_C_OnPawnPlaySpecialMoveAnimation) == 0x000010, "Wrong size on PharmacyMinus02_BP_C_OnPawnPlaySpecialMoveAnimation");
static_assert(offsetof(PharmacyMinus02_BP_C_OnPawnPlaySpecialMoveAnimation, Pawn) == 0x000000, "Member 'PharmacyMinus02_BP_C_OnPawnPlaySpecialMoveAnimation::Pawn' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_OnPawnPlaySpecialMoveAnimation, SpecialMove) == 0x000008, "Member 'PharmacyMinus02_BP_C_OnPawnPlaySpecialMoveAnimation::SpecialMove' has a wrong offset!");

// Function Pharmacy-02_BP.Pharmacy-02_BP_C.ExecuteUbergraph_Pharmacy-02_BP
// 0x0040 (0x0040 - 0x0000)
struct PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationAsset*                        Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimationAsset*                        Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_FullAnim;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationAsset*                        K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class ARBPawn*                          K2Node_Event_pawn;                                 // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  K2Node_Event_specialMove;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP) == 0x000008, "Wrong alignment on PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP");
static_assert(sizeof(PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP) == 0x000040, "Wrong size on PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP");
static_assert(offsetof(PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP, EntryPoint) == 0x000000, "Member 'PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP, Temp_bool_Variable) == 0x000004, "Member 'PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP, Temp_object_Variable) == 0x000008, "Member 'PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP, Temp_object_Variable_1) == 0x000010, "Member 'PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP, K2Node_CustomEvent_FullAnim) == 0x000018, "Member 'PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP::K2Node_CustomEvent_FullAnim' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP, K2Node_Select_Default) == 0x000020, "Member 'PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000028, "Member 'PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP, CallFunc_IsOpen_ReturnValue) == 0x000029, "Member 'PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP, K2Node_Event_pawn) == 0x000030, "Member 'PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP::K2Node_Event_pawn' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP, K2Node_Event_specialMove) == 0x000038, "Member 'PharmacyMinus02_BP_C_ExecuteUbergraph_PharmacyMinus02_BP::K2Node_Event_specialMove' has a wrong offset!");

// Function Pharmacy-02_BP.Pharmacy-02_BP_C.GetLookAtLocation
// 0x0018 (0x0018 - 0x0000)
struct PharmacyMinus02_BP_C_GetLookAtLocation final
{
public:
	struct FVector                                OutLookAtLocation;                                 // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PharmacyMinus02_BP_C_GetLookAtLocation) == 0x000004, "Wrong alignment on PharmacyMinus02_BP_C_GetLookAtLocation");
static_assert(sizeof(PharmacyMinus02_BP_C_GetLookAtLocation) == 0x000018, "Wrong size on PharmacyMinus02_BP_C_GetLookAtLocation");
static_assert(offsetof(PharmacyMinus02_BP_C_GetLookAtLocation, OutLookAtLocation) == 0x000000, "Member 'PharmacyMinus02_BP_C_GetLookAtLocation::OutLookAtLocation' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_GetLookAtLocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00000C, "Member 'PharmacyMinus02_BP_C_GetLookAtLocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function Pharmacy-02_BP.Pharmacy-02_BP_C.GetInteractionPawnLocation
// 0x0090 (0x0090 - 0x0000)
struct PharmacyMinus02_BP_C_GetInteractionPawnLocation final
{
public:
	const class ARBPawn*                          Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  SpecialMove;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutLocation;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutDirection;                                      // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0xB];                                       // 0x0025(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetWorldTransformMatrixFromAnimationAnchorByTransformInMeshSpace_outTransform; // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PharmacyMinus02_BP_C_GetInteractionPawnLocation) == 0x000010, "Wrong alignment on PharmacyMinus02_BP_C_GetInteractionPawnLocation");
static_assert(sizeof(PharmacyMinus02_BP_C_GetInteractionPawnLocation) == 0x000090, "Wrong size on PharmacyMinus02_BP_C_GetInteractionPawnLocation");
static_assert(offsetof(PharmacyMinus02_BP_C_GetInteractionPawnLocation, Pawn) == 0x000000, "Member 'PharmacyMinus02_BP_C_GetInteractionPawnLocation::Pawn' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_GetInteractionPawnLocation, SpecialMove) == 0x000008, "Member 'PharmacyMinus02_BP_C_GetInteractionPawnLocation::SpecialMove' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_GetInteractionPawnLocation, OutLocation) == 0x00000C, "Member 'PharmacyMinus02_BP_C_GetInteractionPawnLocation::OutLocation' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_GetInteractionPawnLocation, OutDirection) == 0x000018, "Member 'PharmacyMinus02_BP_C_GetInteractionPawnLocation::OutDirection' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_GetInteractionPawnLocation, ReturnValue) == 0x000024, "Member 'PharmacyMinus02_BP_C_GetInteractionPawnLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_GetInteractionPawnLocation, CallFunc_GetWorldTransformMatrixFromAnimationAnchorByTransformInMeshSpace_outTransform) == 0x000030, "Member 'PharmacyMinus02_BP_C_GetInteractionPawnLocation::CallFunc_GetWorldTransformMatrixFromAnimationAnchorByTransformInMeshSpace_outTransform' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_GetInteractionPawnLocation, CallFunc_BreakTransform_Location) == 0x000060, "Member 'PharmacyMinus02_BP_C_GetInteractionPawnLocation::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_GetInteractionPawnLocation, CallFunc_BreakTransform_Rotation) == 0x00006C, "Member 'PharmacyMinus02_BP_C_GetInteractionPawnLocation::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_GetInteractionPawnLocation, CallFunc_BreakTransform_Scale) == 0x000078, "Member 'PharmacyMinus02_BP_C_GetInteractionPawnLocation::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(PharmacyMinus02_BP_C_GetInteractionPawnLocation, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000084, "Member 'PharmacyMinus02_BP_C_GetInteractionPawnLocation::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");

}

