#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pharma_Well_ActiveSkill_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Pharma_Well_ActiveSkill_BP.Pharma_Well_ActiveSkill_BP_C.ExecuteUbergraph_Pharma_Well_ActiveSkill_BP
// 0x0370 (0x0370 - 0x0000)
struct Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0030(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsActive;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_Event_player;                               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BP_GetSkillRadius_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x1];                                      // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x019C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_226[0x2];                                      // 0x0226(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                CallFunc_Array_Get_Item;                           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_1;                         // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_2;                         // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_Event_pawn;                                 // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bActive;                              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x02B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue;      // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue_1;    // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBActiveSkillController*               CallFunc_GetControllerItem_ReturnValue;            // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMedPharma_SkillController_BP_C*        K2Node_DynamicCast_AsMed_Pharma_Skill_Controller_BP; // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue_2;    // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP) == 0x000008, "Wrong alignment on Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP");
static_assert(sizeof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP) == 0x000370, "Wrong size on Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, EntryPoint) == 0x000000, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, Temp_int_Variable) == 0x000020, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, Temp_int_Array_Index_Variable) == 0x000024, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, Temp_bool_True_if_break_was_hit_Variable) == 0x00002C, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, Temp_object_Variable) == 0x000030, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, K2Node_Event_DeltaSeconds) == 0x000044, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, K2Node_Event_IsActive) == 0x000048, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::K2Node_Event_IsActive' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, K2Node_Event_player) == 0x000050, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BP_GetSkillRadius_ReturnValue) == 0x000058, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BP_GetSkillRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000060, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000070, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000078, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Add_VectorVector_ReturnValue) == 0x000084, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_LineTraceSingle_OutHit) == 0x000090, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_LineTraceSingle_ReturnValue) == 0x000118, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_bBlockingHit) == 0x000119, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_bInitialOverlap) == 0x00011A, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_Time) == 0x00011C, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_Distance) == 0x000120, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_Location) == 0x000124, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_ImpactPoint) == 0x000130, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_Normal) == 0x00013C, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_ImpactNormal) == 0x000148, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_PhysMat) == 0x000158, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_HitActor) == 0x000160, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_HitComponent) == 0x000168, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_HitBoneName) == 0x000170, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_HitItem) == 0x000178, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_ElementIndex) == 0x00017C, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_FaceIndex) == 0x000180, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_TraceStart) == 0x000184, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakHitResult_TraceEnd) == 0x000190, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00019C, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000224, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000225, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Array_Get_Item) == 0x000228, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Array_Length_ReturnValue) == 0x000230, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Array_Get_Item_1) == 0x000238, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Array_Get_Item_2) == 0x000240, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Array_Length_ReturnValue_1) == 0x000248, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Less_IntInt_ReturnValue) == 0x00024C, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, K2Node_Event_pawn) == 0x000250, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::K2Node_Event_pawn' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, K2Node_Event_bActive) == 0x000258, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::K2Node_Event_bActive' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Array_Add_ReturnValue) == 0x00025C, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000260, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000268, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Array_Add_ReturnValue_1) == 0x000270, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000274, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakVector_X) == 0x000280, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakVector_Y) == 0x000284, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BreakVector_Z) == 0x000288, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_MakeVector_ReturnValue) == 0x00028C, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_GetSocketLocation_ReturnValue) == 0x000298, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002A4, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x0002B0, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_PlayLoopingSoundOnActor_ReturnValue) == 0x000338, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_PlayLoopingSoundOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, Temp_int_Loop_Counter_Variable) == 0x00033C, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x000340, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000344, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_BooleanAND_ReturnValue) == 0x000348, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_PlayLoopingSoundOnActor_ReturnValue_1) == 0x00034C, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_PlayLoopingSoundOnActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_GetControllerItem_ReturnValue) == 0x000350, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_GetControllerItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_IsValid_ReturnValue) == 0x000358, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, K2Node_DynamicCast_AsMed_Pharma_Skill_Controller_BP) == 0x000360, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::K2Node_DynamicCast_AsMed_Pharma_Skill_Controller_BP' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, K2Node_DynamicCast_bSuccess) == 0x000368, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP, CallFunc_PlayLoopingSoundOnActor_ReturnValue_2) == 0x00036C, "Member 'Pharma_Well_ActiveSkill_BP_C_ExecuteUbergraph_Pharma_Well_ActiveSkill_BP::CallFunc_PlayLoopingSoundOnActor_ReturnValue_2' has a wrong offset!");

// Function Pharma_Well_ActiveSkill_BP.Pharma_Well_ActiveSkill_BP_C.Event_OnActiveOnPawn
// 0x0010 (0x0010 - 0x0000)
struct Pharma_Well_ActiveSkill_BP_C_Event_OnActiveOnPawn final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bActive;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pharma_Well_ActiveSkill_BP_C_Event_OnActiveOnPawn) == 0x000008, "Wrong alignment on Pharma_Well_ActiveSkill_BP_C_Event_OnActiveOnPawn");
static_assert(sizeof(Pharma_Well_ActiveSkill_BP_C_Event_OnActiveOnPawn) == 0x000010, "Wrong size on Pharma_Well_ActiveSkill_BP_C_Event_OnActiveOnPawn");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_Event_OnActiveOnPawn, Pawn) == 0x000000, "Member 'Pharma_Well_ActiveSkill_BP_C_Event_OnActiveOnPawn::Pawn' has a wrong offset!");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_Event_OnActiveOnPawn, bActive) == 0x000008, "Member 'Pharma_Well_ActiveSkill_BP_C_Event_OnActiveOnPawn::bActive' has a wrong offset!");

// Function Pharma_Well_ActiveSkill_BP.Pharma_Well_ActiveSkill_BP_C.Event_OnPlayerInitReplicated
// 0x0008 (0x0008 - 0x0000)
struct Pharma_Well_ActiveSkill_BP_C_Event_OnPlayerInitReplicated final
{
public:
	class ARBPlayer*                              Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pharma_Well_ActiveSkill_BP_C_Event_OnPlayerInitReplicated) == 0x000008, "Wrong alignment on Pharma_Well_ActiveSkill_BP_C_Event_OnPlayerInitReplicated");
static_assert(sizeof(Pharma_Well_ActiveSkill_BP_C_Event_OnPlayerInitReplicated) == 0x000008, "Wrong size on Pharma_Well_ActiveSkill_BP_C_Event_OnPlayerInitReplicated");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_Event_OnPlayerInitReplicated, Player) == 0x000000, "Member 'Pharma_Well_ActiveSkill_BP_C_Event_OnPlayerInitReplicated::Player' has a wrong offset!");

// Function Pharma_Well_ActiveSkill_BP.Pharma_Well_ActiveSkill_BP_C.Event_OnIsActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct Pharma_Well_ActiveSkill_BP_C_Event_OnIsActiveChanged final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pharma_Well_ActiveSkill_BP_C_Event_OnIsActiveChanged) == 0x000001, "Wrong alignment on Pharma_Well_ActiveSkill_BP_C_Event_OnIsActiveChanged");
static_assert(sizeof(Pharma_Well_ActiveSkill_BP_C_Event_OnIsActiveChanged) == 0x000001, "Wrong size on Pharma_Well_ActiveSkill_BP_C_Event_OnIsActiveChanged");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_Event_OnIsActiveChanged, IsActive) == 0x000000, "Member 'Pharma_Well_ActiveSkill_BP_C_Event_OnIsActiveChanged::IsActive' has a wrong offset!");

// Function Pharma_Well_ActiveSkill_BP.Pharma_Well_ActiveSkill_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Pharma_Well_ActiveSkill_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pharma_Well_ActiveSkill_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on Pharma_Well_ActiveSkill_BP_C_ReceiveTick");
static_assert(sizeof(Pharma_Well_ActiveSkill_BP_C_ReceiveTick) == 0x000004, "Wrong size on Pharma_Well_ActiveSkill_BP_C_ReceiveTick");
static_assert(offsetof(Pharma_Well_ActiveSkill_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Pharma_Well_ActiveSkill_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

