#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhotoFinishCharacter_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PhotoFinishCharacter_BP.PhotoFinishCharacter_BP_C
// 0x0108 (0x03B0 - 0x02A8)
class APhotoFinishCharacter_BP_C final : public ARBMenuCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBSpotLightComponent*                  RBSpotLight1_Face_TrialSuccess;                    // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight1_TrialFailure2;                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight1_TrialFailure1;                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight1_TrialSuccess2;                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight1_TrialSuccess1;                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RopeMesh2;                                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RopeMesh;                                          // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight1_TrialSuccess;                         // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Watch;                                             // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 HairMesh;                                          // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 NightVision;                                       // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Glove_Mesh;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ESOP;                                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ESOP_Battery;                                      // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ESOP_Apparatus;                                    // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Straps;                                            // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 UpperBody_Mesh;                                    // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 LowerBody_Mesh;                                    // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head_Mesh;                                         // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Character_Mesh;                                    // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         ExtraCustomizationMeshes;                          // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AActor*                                 RigChest;                                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 RigComponent;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLightingChannels                      LightingChannels;                                  // 0x0370(0x0001)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FocusedPosition;                                   // 0x0374(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLightingChannels                      LightingChannelsSetup1;                            // 0x0380(0x0001)(Edit, BlueprintVisible, NoDestructor)
	struct FLightingChannels                      LightingChannelsSetup2;                            // 0x0381(0x0001)(Edit, BlueprintVisible, NoDestructor)
	struct FLightingChannels                      LightingChannelsSetup3;                            // 0x0382(0x0001)(Edit, BlueprintVisible, NoDestructor)
	bool                                          bDebugTrialFailed;                                 // 0x0383(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPoseAsset*                             FacePoseAsset;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class URBSpotLightComponent*>          SuccessLights;                                     // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class URBSpotLightComponent*>          FailureLights;                                     // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void UpdateFacePose();
	void RegisterLights();
	void SetBloodAmountByHealthRatio(float HealthRatio_0);
	void GetFacePose(class UPoseAsset** GetFacePose_0);
	void SetupTrialSucessSettings();
	void SetAnimBlueprintSelectionActive(bool bActive);
	void SetCharacterTQ(float In_TQ);
	void TryShow();
	void RefreshRigs();
	void SetLightingChannels();
	void OverrideActorMaterials(class AActor* Actor);
	void SetupMaterialOverride();
	void CleanSpawnedRigs();
	void CleanExtraMeshes();
	void RefreshPlayerCusto();
	void Show();
	void UserConstructionScript();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnExtraCustomizationMeshesAddedForSlot(const TArray<class USkeletalMeshComponent*>& AddedExtraMeshes, EPlayerCustomizationSlot Slot_0);
	void Event_RefreshPlayerCustomization();
	void Event_RefreshPlayerActiveSkill();
	void Event_OnSetup();
	void ExecuteUbergraph_PhotoFinishCharacter_BP(int32 EntryPoint);

	class USkeletalMeshComponent* GetShadowSkeletalMeshComponentForSlot(EPlayerCustomizationSlot Slot_0, bool* OutFound) const;
	class USkeletalMeshComponent* GetMainParentSkeletalMesh() const;
	class UStaticMeshComponent* GetWatchComponent() const;
	struct FRBPlayerCustomizationInfo GetPlayerCustomizationInfo() const;
	class USkeletalMeshComponent* GetSkeletalMeshComponentForSlot(EPlayerCustomizationSlot Slot_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PhotoFinishCharacter_BP_C">();
	}
	static class APhotoFinishCharacter_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APhotoFinishCharacter_BP_C>();
	}
};
static_assert(alignof(APhotoFinishCharacter_BP_C) == 0x000008, "Wrong alignment on APhotoFinishCharacter_BP_C");
static_assert(sizeof(APhotoFinishCharacter_BP_C) == 0x0003B0, "Wrong size on APhotoFinishCharacter_BP_C");
static_assert(offsetof(APhotoFinishCharacter_BP_C, UberGraphFrame) == 0x0002A8, "Member 'APhotoFinishCharacter_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, RBSpotLight1_Face_TrialSuccess) == 0x0002B0, "Member 'APhotoFinishCharacter_BP_C::RBSpotLight1_Face_TrialSuccess' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, RBSpotLight1_TrialFailure2) == 0x0002B8, "Member 'APhotoFinishCharacter_BP_C::RBSpotLight1_TrialFailure2' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, RBSpotLight1_TrialFailure1) == 0x0002C0, "Member 'APhotoFinishCharacter_BP_C::RBSpotLight1_TrialFailure1' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, RBSpotLight1_TrialSuccess2) == 0x0002C8, "Member 'APhotoFinishCharacter_BP_C::RBSpotLight1_TrialSuccess2' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, RBSpotLight1_TrialSuccess1) == 0x0002D0, "Member 'APhotoFinishCharacter_BP_C::RBSpotLight1_TrialSuccess1' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, RopeMesh2) == 0x0002D8, "Member 'APhotoFinishCharacter_BP_C::RopeMesh2' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, RopeMesh) == 0x0002E0, "Member 'APhotoFinishCharacter_BP_C::RopeMesh' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, RBSpotLight1_TrialSuccess) == 0x0002E8, "Member 'APhotoFinishCharacter_BP_C::RBSpotLight1_TrialSuccess' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, Watch) == 0x0002F0, "Member 'APhotoFinishCharacter_BP_C::Watch' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, HairMesh) == 0x0002F8, "Member 'APhotoFinishCharacter_BP_C::HairMesh' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, NightVision) == 0x000300, "Member 'APhotoFinishCharacter_BP_C::NightVision' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, Glove_Mesh) == 0x000308, "Member 'APhotoFinishCharacter_BP_C::Glove_Mesh' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, ESOP) == 0x000310, "Member 'APhotoFinishCharacter_BP_C::ESOP' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, ESOP_Battery) == 0x000318, "Member 'APhotoFinishCharacter_BP_C::ESOP_Battery' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, ESOP_Apparatus) == 0x000320, "Member 'APhotoFinishCharacter_BP_C::ESOP_Apparatus' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, Straps) == 0x000328, "Member 'APhotoFinishCharacter_BP_C::Straps' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, UpperBody_Mesh) == 0x000330, "Member 'APhotoFinishCharacter_BP_C::UpperBody_Mesh' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, LowerBody_Mesh) == 0x000338, "Member 'APhotoFinishCharacter_BP_C::LowerBody_Mesh' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, Head_Mesh) == 0x000340, "Member 'APhotoFinishCharacter_BP_C::Head_Mesh' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, Character_Mesh) == 0x000348, "Member 'APhotoFinishCharacter_BP_C::Character_Mesh' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, ExtraCustomizationMeshes) == 0x000350, "Member 'APhotoFinishCharacter_BP_C::ExtraCustomizationMeshes' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, RigChest) == 0x000360, "Member 'APhotoFinishCharacter_BP_C::RigChest' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, RigComponent) == 0x000368, "Member 'APhotoFinishCharacter_BP_C::RigComponent' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, LightingChannels) == 0x000370, "Member 'APhotoFinishCharacter_BP_C::LightingChannels' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, FocusedPosition) == 0x000374, "Member 'APhotoFinishCharacter_BP_C::FocusedPosition' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, LightingChannelsSetup1) == 0x000380, "Member 'APhotoFinishCharacter_BP_C::LightingChannelsSetup1' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, LightingChannelsSetup2) == 0x000381, "Member 'APhotoFinishCharacter_BP_C::LightingChannelsSetup2' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, LightingChannelsSetup3) == 0x000382, "Member 'APhotoFinishCharacter_BP_C::LightingChannelsSetup3' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, bDebugTrialFailed) == 0x000383, "Member 'APhotoFinishCharacter_BP_C::bDebugTrialFailed' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, FacePoseAsset) == 0x000388, "Member 'APhotoFinishCharacter_BP_C::FacePoseAsset' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, SuccessLights) == 0x000390, "Member 'APhotoFinishCharacter_BP_C::SuccessLights' has a wrong offset!");
static_assert(offsetof(APhotoFinishCharacter_BP_C, FailureLights) == 0x0003A0, "Member 'APhotoFinishCharacter_BP_C::FailureLights' has a wrong offset!");

}

