#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhotoFinishCharacter_BP

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PhotoFinishCharacter_BP.PhotoFinishCharacter_BP_C.UpdateFacePose
// 0x0040 (0x0040 - 0x0000)
struct PhotoFinishCharacter_BP_C_UpdateFacePose final
{
public:
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFace_Emote_AnimBP_C*                   K2Node_DynamicCast_AsFace_Emote_Anim_BP;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerCustomizationOption*           CallFunc_GetPlayerCustomizationOptionForSlot_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPoseAsset*                             K2Node_DynamicCast_AsPose_Asset;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PhotoFinishCharacter_BP_C_UpdateFacePose) == 0x000008, "Wrong alignment on PhotoFinishCharacter_BP_C_UpdateFacePose");
static_assert(sizeof(PhotoFinishCharacter_BP_C_UpdateFacePose) == 0x000040, "Wrong size on PhotoFinishCharacter_BP_C_UpdateFacePose");
static_assert(offsetof(PhotoFinishCharacter_BP_C_UpdateFacePose, CallFunc_GetAnimInstance_ReturnValue) == 0x000000, "Member 'PhotoFinishCharacter_BP_C_UpdateFacePose::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_UpdateFacePose, K2Node_DynamicCast_AsFace_Emote_Anim_BP) == 0x000008, "Member 'PhotoFinishCharacter_BP_C_UpdateFacePose::K2Node_DynamicCast_AsFace_Emote_Anim_BP' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_UpdateFacePose, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'PhotoFinishCharacter_BP_C_UpdateFacePose::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_UpdateFacePose, CallFunc_GetPlayerCustomizationOptionForSlot_ReturnValue) == 0x000018, "Member 'PhotoFinishCharacter_BP_C_UpdateFacePose::CallFunc_GetPlayerCustomizationOptionForSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_UpdateFacePose, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'PhotoFinishCharacter_BP_C_UpdateFacePose::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_UpdateFacePose, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000028, "Member 'PhotoFinishCharacter_BP_C_UpdateFacePose::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_UpdateFacePose, K2Node_DynamicCast_AsPose_Asset) == 0x000030, "Member 'PhotoFinishCharacter_BP_C_UpdateFacePose::K2Node_DynamicCast_AsPose_Asset' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_UpdateFacePose, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'PhotoFinishCharacter_BP_C_UpdateFacePose::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function PhotoFinishCharacter_BP.PhotoFinishCharacter_BP_C.RegisterLights
// 0x0080 (0x0080 - 0x0000)
struct PhotoFinishCharacter_BP_C_RegisterLights final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildComponentsByTag_outComponents;    // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USceneComponent*>                CallFunc_GetChildComponentsByTag_outComponents_1;  // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  K2Node_DynamicCast_AsRB_Spot_Light_Component;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSpotLightComponent*                  K2Node_DynamicCast_AsRB_Spot_Light_Component_1;    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PhotoFinishCharacter_BP_C_RegisterLights) == 0x000008, "Wrong alignment on PhotoFinishCharacter_BP_C_RegisterLights");
static_assert(sizeof(PhotoFinishCharacter_BP_C_RegisterLights) == 0x000080, "Wrong size on PhotoFinishCharacter_BP_C_RegisterLights");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, Temp_int_Array_Index_Variable) == 0x000008, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000010, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, CallFunc_GetChildComponentsByTag_outComponents) == 0x000018, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::CallFunc_GetChildComponentsByTag_outComponents' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, CallFunc_GetChildComponentsByTag_outComponents_1) == 0x000028, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::CallFunc_GetChildComponentsByTag_outComponents_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, CallFunc_Array_Get_Item) == 0x000038, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, K2Node_DynamicCast_AsRB_Spot_Light_Component) == 0x000048, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::K2Node_DynamicCast_AsRB_Spot_Light_Component' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, K2Node_DynamicCast_AsRB_Spot_Light_Component_1) == 0x000058, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::K2Node_DynamicCast_AsRB_Spot_Light_Component_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, CallFunc_Array_Add_ReturnValue) == 0x000068, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, CallFunc_Array_Length_ReturnValue_1) == 0x00006C, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, Temp_int_Loop_Counter_Variable_1) == 0x000070, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, CallFunc_Less_IntInt_ReturnValue_1) == 0x000075, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, CallFunc_Add_IntInt_ReturnValue_1) == 0x000078, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RegisterLights, CallFunc_Array_Add_ReturnValue_1) == 0x00007C, "Member 'PhotoFinishCharacter_BP_C_RegisterLights::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function PhotoFinishCharacter_BP.PhotoFinishCharacter_BP_C.SetBloodAmountByHealthRatio
// 0x0068 (0x0068 - 0x0000)
struct PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio final
{
public:
	float                                         HealthRatio_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UActorComponent*>                ActorComponents;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UActorComponent*>                CallFunc_GetComponentByClass_outComponents;        // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UActorComponent*>                CallFunc_GetComponentByClass_outComponents_1;      // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio) == 0x000008, "Wrong alignment on PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio");
static_assert(sizeof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio) == 0x000068, "Wrong size on PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio, HealthRatio_0) == 0x000000, "Member 'PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio::HealthRatio_0' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio, ActorComponents) == 0x000008, "Member 'PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio::ActorComponents' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio, Temp_int_Array_Index_Variable) == 0x000018, "Member 'PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio, CallFunc_MapRangeClamped_ReturnValue) == 0x000024, "Member 'PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio, CallFunc_Array_Get_Item) == 0x000028, "Member 'PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio, K2Node_DynamicCast_AsPrimitive_Component) == 0x000038, "Member 'PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio::K2Node_DynamicCast_AsPrimitive_Component' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio, CallFunc_IsValid_ReturnValue) == 0x000042, "Member 'PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio, CallFunc_GetComponentByClass_outComponents) == 0x000048, "Member 'PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio::CallFunc_GetComponentByClass_outComponents' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio, CallFunc_GetComponentByClass_outComponents_1) == 0x000058, "Member 'PhotoFinishCharacter_BP_C_SetBloodAmountByHealthRatio::CallFunc_GetComponentByClass_outComponents_1' has a wrong offset!");

// Function PhotoFinishCharacter_BP.PhotoFinishCharacter_BP_C.GetFacePose
// 0x0008 (0x0008 - 0x0000)
struct PhotoFinishCharacter_BP_C_GetFacePose final
{
public:
	class UPoseAsset*                             GetFacePose_0;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PhotoFinishCharacter_BP_C_GetFacePose) == 0x000008, "Wrong alignment on PhotoFinishCharacter_BP_C_GetFacePose");
static_assert(sizeof(PhotoFinishCharacter_BP_C_GetFacePose) == 0x000008, "Wrong size on PhotoFinishCharacter_BP_C_GetFacePose");
static_assert(offsetof(PhotoFinishCharacter_BP_C_GetFacePose, GetFacePose_0) == 0x000000, "Member 'PhotoFinishCharacter_BP_C_GetFacePose::GetFacePose_0' has a wrong offset!");

// Function PhotoFinishCharacter_BP.PhotoFinishCharacter_BP_C.SetupTrialSucessSettings
// 0x0078 (0x0078 - 0x0000)
struct PhotoFinishCharacter_BP_C_SetupTrialSucessSettings final
{
public:
	bool                                          bTrialFailed;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkinColorType                                Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_1;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetAssociatedPlayerState_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESkinColorType                                CallFunc_GetSkinColorType_ReturnValue;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFailureScene_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSpotLightComponent*                  CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuCharacter_AnimBP_C*                K2Node_DynamicCast_AsMenu_Character_Anim_BP;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings) == 0x000008, "Wrong alignment on PhotoFinishCharacter_BP_C_SetupTrialSucessSettings");
static_assert(sizeof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings) == 0x000078, "Wrong size on PhotoFinishCharacter_BP_C_SetupTrialSucessSettings");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, bTrialFailed) == 0x000000, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::bTrialFailed' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, Temp_float_Variable) == 0x000004, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, Temp_float_Variable_1) == 0x000008, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, Temp_byte_Variable) == 0x000010, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_Array_IsEmpty_ReturnValue) == 0x000020, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_Array_IsEmpty_ReturnValue_1) == 0x000021, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_Array_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_GetAssociatedPlayerState_ReturnValue) == 0x000028, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_GetAssociatedPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_BooleanOR_ReturnValue) == 0x000030, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_GetSkinColorType_ReturnValue) == 0x000031, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_GetSkinColorType_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, K2Node_Select_Default) == 0x000034, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_Array_Get_Item) == 0x000038, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_IsFailureScene_ReturnValue) == 0x000044, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_IsFailureScene_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_BooleanOR_ReturnValue_1) == 0x000055, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_Not_PreBool_ReturnValue) == 0x000056, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_GetAnimInstance_ReturnValue) == 0x000058, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, Temp_int_Loop_Counter_Variable_1) == 0x000060, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, K2Node_DynamicCast_AsMenu_Character_Anim_BP) == 0x000068, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::K2Node_DynamicCast_AsMenu_Character_Anim_BP' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_Less_IntInt_ReturnValue_1) == 0x000071, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetupTrialSucessSettings, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'PhotoFinishCharacter_BP_C_SetupTrialSucessSettings::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function PhotoFinishCharacter_BP.PhotoFinishCharacter_BP_C.SetAnimBlueprintSelectionActive
// 0x0020 (0x0020 - 0x0000)
struct PhotoFinishCharacter_BP_C_SetAnimBlueprintSelectionActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEndScreen_Player_AnimBP_C*             K2Node_DynamicCast_AsEnd_Screen_Player_Anim_BP;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PhotoFinishCharacter_BP_C_SetAnimBlueprintSelectionActive) == 0x000008, "Wrong alignment on PhotoFinishCharacter_BP_C_SetAnimBlueprintSelectionActive");
static_assert(sizeof(PhotoFinishCharacter_BP_C_SetAnimBlueprintSelectionActive) == 0x000020, "Wrong size on PhotoFinishCharacter_BP_C_SetAnimBlueprintSelectionActive");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetAnimBlueprintSelectionActive, bActive) == 0x000000, "Member 'PhotoFinishCharacter_BP_C_SetAnimBlueprintSelectionActive::bActive' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetAnimBlueprintSelectionActive, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'PhotoFinishCharacter_BP_C_SetAnimBlueprintSelectionActive::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetAnimBlueprintSelectionActive, K2Node_DynamicCast_AsEnd_Screen_Player_Anim_BP) == 0x000010, "Member 'PhotoFinishCharacter_BP_C_SetAnimBlueprintSelectionActive::K2Node_DynamicCast_AsEnd_Screen_Player_Anim_BP' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetAnimBlueprintSelectionActive, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PhotoFinishCharacter_BP_C_SetAnimBlueprintSelectionActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function PhotoFinishCharacter_BP.PhotoFinishCharacter_BP_C.SetCharacterTQ
// 0x0020 (0x0020 - 0x0000)
struct PhotoFinishCharacter_BP_C_SetCharacterTQ final
{
public:
	float                                         In_TQ;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEndScreen_Player_AnimBP_C*             K2Node_DynamicCast_AsEnd_Screen_Player_Anim_BP;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PhotoFinishCharacter_BP_C_SetCharacterTQ) == 0x000008, "Wrong alignment on PhotoFinishCharacter_BP_C_SetCharacterTQ");
static_assert(sizeof(PhotoFinishCharacter_BP_C_SetCharacterTQ) == 0x000020, "Wrong size on PhotoFinishCharacter_BP_C_SetCharacterTQ");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetCharacterTQ, In_TQ) == 0x000000, "Member 'PhotoFinishCharacter_BP_C_SetCharacterTQ::In_TQ' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetCharacterTQ, CallFunc_Less_FloatFloat_ReturnValue) == 0x000004, "Member 'PhotoFinishCharacter_BP_C_SetCharacterTQ::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetCharacterTQ, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'PhotoFinishCharacter_BP_C_SetCharacterTQ::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetCharacterTQ, K2Node_DynamicCast_AsEnd_Screen_Player_Anim_BP) == 0x000010, "Member 'PhotoFinishCharacter_BP_C_SetCharacterTQ::K2Node_DynamicCast_AsEnd_Screen_Player_Anim_BP' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetCharacterTQ, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PhotoFinishCharacter_BP_C_SetCharacterTQ::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetCharacterTQ, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000019, "Member 'PhotoFinishCharacter_BP_C_SetCharacterTQ::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function PhotoFinishCharacter_BP.PhotoFinishCharacter_BP_C.TryShow
// 0x0001 (0x0001 - 0x0000)
struct PhotoFinishCharacter_BP_C_TryShow final
{
public:
	bool                                          CallFunc_IsWaitingForRessources_ReturnValue;       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PhotoFinishCharacter_BP_C_TryShow) == 0x000001, "Wrong alignment on PhotoFinishCharacter_BP_C_TryShow");
static_assert(sizeof(PhotoFinishCharacter_BP_C_TryShow) == 0x000001, "Wrong size on PhotoFinishCharacter_BP_C_TryShow");
static_assert(offsetof(PhotoFinishCharacter_BP_C_TryShow, CallFunc_IsWaitingForRessources_ReturnValue) == 0x000000, "Member 'PhotoFinishCharacter_BP_C_TryShow::CallFunc_IsWaitingForRessources_ReturnValue' has a wrong offset!");

// Function PhotoFinishCharacter_BP.PhotoFinishCharacter_BP_C.RefreshRigs
// 0x0060 (0x0060 - 0x0000)
struct PhotoFinishCharacter_BP_C_RefreshRigs final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	EActiveSkillType                              CallFunc_GetActiveSkillType_ReturnValue;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ARBActiveSkill>             CallFunc_GetActiveSkillClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PhotoFinishCharacter_BP_C_RefreshRigs) == 0x000010, "Wrong alignment on PhotoFinishCharacter_BP_C_RefreshRigs");
static_assert(sizeof(PhotoFinishCharacter_BP_C_RefreshRigs) == 0x000060, "Wrong size on PhotoFinishCharacter_BP_C_RefreshRigs");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RefreshRigs, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'PhotoFinishCharacter_BP_C_RefreshRigs::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RefreshRigs, CallFunc_GetActiveSkillType_ReturnValue) == 0x000030, "Member 'PhotoFinishCharacter_BP_C_RefreshRigs::CallFunc_GetActiveSkillType_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RefreshRigs, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'PhotoFinishCharacter_BP_C_RefreshRigs::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RefreshRigs, CallFunc_GetActiveSkillClass_ReturnValue) == 0x000038, "Member 'PhotoFinishCharacter_BP_C_RefreshRigs::CallFunc_GetActiveSkillClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RefreshRigs, K2Node_ClassDynamicCast_AsActor) == 0x000040, "Member 'PhotoFinishCharacter_BP_C_RefreshRigs::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RefreshRigs, K2Node_ClassDynamicCast_bSuccess) == 0x000048, "Member 'PhotoFinishCharacter_BP_C_RefreshRigs::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RefreshRigs, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'PhotoFinishCharacter_BP_C_RefreshRigs::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_RefreshRigs, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'PhotoFinishCharacter_BP_C_RefreshRigs::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function PhotoFinishCharacter_BP.PhotoFinishCharacter_BP_C.SetLightingChannels
// 0x0110 (0x0110 - 0x0000)
struct PhotoFinishCharacter_BP_C_SetLightingChannels final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESocialMenuSceneActorSlot                     Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSpotLightComponent*                  CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_2;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x00A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue_2;    // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_3;                         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_4;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESocialMenuSceneActorSlot                     CallFunc_GetSlot_ReturnValue;                      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLightingChannels                      K2Node_Select_Default;                             // 0x00EA(0x0001)(NoDestructor)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue_3;    // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_5;                         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PhotoFinishCharacter_BP_C_SetLightingChannels) == 0x000008, "Wrong alignment on PhotoFinishCharacter_BP_C_SetLightingChannels");
static_assert(sizeof(PhotoFinishCharacter_BP_C_SetLightingChannels) == 0x000110, "Wrong size on PhotoFinishCharacter_BP_C_SetLightingChannels");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, Temp_int_Array_Index_Variable) == 0x000008, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, Temp_byte_Variable) == 0x00000C, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, Temp_int_Array_Index_Variable_2) == 0x00001C, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, Temp_int_Loop_Counter_Variable_2) == 0x000020, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, Temp_int_Array_Index_Variable_3) == 0x000028, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, Temp_int_Loop_Counter_Variable_3) == 0x00002C, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, CallFunc_Add_IntInt_ReturnValue_3) == 0x000030, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, Temp_int_Loop_Counter_Variable_4) == 0x000034, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, CallFunc_Add_IntInt_ReturnValue_4) == 0x000038, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, Temp_int_Array_Index_Variable_4) == 0x00003C, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, Temp_int_Loop_Counter_Variable_5) == 0x000040, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, CallFunc_Array_Get_Item) == 0x000048, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, CallFunc_Add_IntInt_ReturnValue_5) == 0x000050, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PhotoFinishCharacter_BP_C_SetLightingChannels, K2Node_MakeArray_Array) == 0x000060, "Member 'PhotoFinishCharacter_BP_C_SetLightingChannels::K2Node_MakeArray_Array' has a wrong offset!");
