#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhotoFinishOverheadWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PhotoFinishOverheadWidget.PhotoFinishOverheadWidget_C
// 0x0030 (0x04C0 - 0x0490)
class UPhotoFinishOverheadWidget_C final : public URBSocialMenuEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Name_1;                                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ThumbDown;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ThumbUp;                                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVoiceChatOverheadWidget_C*             VoiceChatOverheadWidget;                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           VotePanel;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetName();
	void Event_Refresh();
	void Construct();
	void Destruct();
	void Refresh();
	void ExecuteUbergraph_PhotoFinishOverheadWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PhotoFinishOverheadWidget_C">();
	}
	static class UPhotoFinishOverheadWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhotoFinishOverheadWidget_C>();
	}
};
static_assert(alignof(UPhotoFinishOverheadWidget_C) == 0x000008, "Wrong alignment on UPhotoFinishOverheadWidget_C");
static_assert(sizeof(UPhotoFinishOverheadWidget_C) == 0x0004C0, "Wrong size on UPhotoFinishOverheadWidget_C");
static_assert(offsetof(UPhotoFinishOverheadWidget_C, UberGraphFrame) == 0x000490, "Member 'UPhotoFinishOverheadWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPhotoFinishOverheadWidget_C, Name_1) == 0x000498, "Member 'UPhotoFinishOverheadWidget_C::Name_1' has a wrong offset!");
static_assert(offsetof(UPhotoFinishOverheadWidget_C, ThumbDown) == 0x0004A0, "Member 'UPhotoFinishOverheadWidget_C::ThumbDown' has a wrong offset!");
static_assert(offsetof(UPhotoFinishOverheadWidget_C, ThumbUp) == 0x0004A8, "Member 'UPhotoFinishOverheadWidget_C::ThumbUp' has a wrong offset!");
static_assert(offsetof(UPhotoFinishOverheadWidget_C, VoiceChatOverheadWidget) == 0x0004B0, "Member 'UPhotoFinishOverheadWidget_C::VoiceChatOverheadWidget' has a wrong offset!");
static_assert(offsetof(UPhotoFinishOverheadWidget_C, VotePanel) == 0x0004B8, "Member 'UPhotoFinishOverheadWidget_C::VotePanel' has a wrong offset!");

}

