#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pitcher_FireBreath_NotifyState

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Pitcher_FireBreath_NotifyState.Pitcher_FireBreath_NotifyState_C
// 0x0038 (0x0068 - 0x0030)
class UPitcher_FireBreath_NotifyState_C final : public UAnimNotifyState
{
public:
	class FName                                   Intensity_Curve;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Range_Curve;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsIgnited;                                         // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MultiplySpritesRange;                              // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          StartFirebreathLoop;                               // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          StopFirebreathLoop;                                // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          StartGasLoop;                                      // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          StopGasLoop;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void StartStopFirebreathOrGasSFX(bool IsStart, class ARBNPC_GroundPitcher_C* Pitcher) const;
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float AnimDeltaTime, float TotalDuration) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float AnimDeltaTime) const;
	void GetFirebreathCurveValue(class USkeletalMeshComponent* MeshComp, class FName CurveName, float* Value) const;
	bool Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pitcher_FireBreath_NotifyState_C">();
	}
	static class UPitcher_FireBreath_NotifyState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPitcher_FireBreath_NotifyState_C>();
	}
};
static_assert(alignof(UPitcher_FireBreath_NotifyState_C) == 0x000008, "Wrong alignment on UPitcher_FireBreath_NotifyState_C");
static_assert(sizeof(UPitcher_FireBreath_NotifyState_C) == 0x000068, "Wrong size on UPitcher_FireBreath_NotifyState_C");
static_assert(offsetof(UPitcher_FireBreath_NotifyState_C, Intensity_Curve) == 0x000030, "Member 'UPitcher_FireBreath_NotifyState_C::Intensity_Curve' has a wrong offset!");
static_assert(offsetof(UPitcher_FireBreath_NotifyState_C, Range_Curve) == 0x000038, "Member 'UPitcher_FireBreath_NotifyState_C::Range_Curve' has a wrong offset!");
static_assert(offsetof(UPitcher_FireBreath_NotifyState_C, IsIgnited) == 0x000040, "Member 'UPitcher_FireBreath_NotifyState_C::IsIgnited' has a wrong offset!");
static_assert(offsetof(UPitcher_FireBreath_NotifyState_C, MultiplySpritesRange) == 0x000044, "Member 'UPitcher_FireBreath_NotifyState_C::MultiplySpritesRange' has a wrong offset!");
static_assert(offsetof(UPitcher_FireBreath_NotifyState_C, StartFirebreathLoop) == 0x000048, "Member 'UPitcher_FireBreath_NotifyState_C::StartFirebreathLoop' has a wrong offset!");
static_assert(offsetof(UPitcher_FireBreath_NotifyState_C, StopFirebreathLoop) == 0x000050, "Member 'UPitcher_FireBreath_NotifyState_C::StopFirebreathLoop' has a wrong offset!");
static_assert(offsetof(UPitcher_FireBreath_NotifyState_C, StartGasLoop) == 0x000058, "Member 'UPitcher_FireBreath_NotifyState_C::StartGasLoop' has a wrong offset!");
static_assert(offsetof(UPitcher_FireBreath_NotifyState_C, StopGasLoop) == 0x000060, "Member 'UPitcher_FireBreath_NotifyState_C::StopGasLoop' has a wrong offset!");

}

