#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pitcher_01_Bottles_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Pitcher_01_Bottles_Skeleton_AnimBlueprint.Pitcher_01_Bottles_Skeleton_AnimBlueprint_C
// 0x0210 (0x04D0 - 0x02C0)
class UPitcher_01_Bottles_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x02F8(0x01D8)(ContainsInstancedReference)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Pitcher_01_Bottles_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pitcher_01_Bottles_Skeleton_AnimBlueprint_C">();
	}
	static class UPitcher_01_Bottles_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPitcher_01_Bottles_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UPitcher_01_Bottles_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UPitcher_01_Bottles_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UPitcher_01_Bottles_Skeleton_AnimBlueprint_C) == 0x0004D0, "Wrong size on UPitcher_01_Bottles_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UPitcher_01_Bottles_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'UPitcher_01_Bottles_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPitcher_01_Bottles_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UPitcher_01_Bottles_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPitcher_01_Bottles_Skeleton_AnimBlueprint_C, AnimGraphNode_CopyPoseFromMesh) == 0x0002F8, "Member 'UPitcher_01_Bottles_Skeleton_AnimBlueprint_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");

}

