#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerCellItemBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlayerCellItemBase.PlayerCellItemBase_C
// 0x00E8 (0x0320 - 0x0238)
class APlayerCellItemBase_C final : public ARBPlayerCellItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DisplayStaticMeshComponent;                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBPlayerCellItemDefinition*            PreviewDefinition;                                 // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugTransform;                                   // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0xF];                                      // 0x0271(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DebugTransform;                                    // 0x0280(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	int32                                         AffectedMaterialID;                                // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StaticmeshTag;                                     // 0x02B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         AttachedStaticmeshes;                              // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         FOV;                                               // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RefActor;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBPlayerCellItemDefinition*            PendingTarget;                                     // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPendingAsyncPreview;                              // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHasPendingTarget;                                 // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SpawnTransformActorRef;                            // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 WallMeshRef;                                       // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraFocusOffset;                                 // 0x0300(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerCellItemDefinition*            CurrentPCD;                                        // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Preview;                                        // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PlayerCellItemBase(int32 EntryPoint);
	void Event_ClearItem();
	void ApplyBlueprintClass(class URBPlayerCellItemDefinition* ItemDefinition);
	void ApplyNewStaticmesh(class URBPlayerCellItemDefinition* ItemDefinition);
	void ApplyNewMaterial(class URBPlayerCellItemDefinition* ItemDefinition);
	void ApplyConfig(class URBPlayerCellItemDefinition* Target);
	void Event_AssignItem(class URBPlayerCellItemDefinition* ItemDefinition, bool bIsPreview);
	void OnLoaded_7C1E3CB34C287AB4FE7F69A712E41A69(TSubclassOf<class UObject> Loaded);
	void OnLoaded_2A9FE965428939AA3930E497B1EEF09B(class UObject* Loaded);
	void OnLoaded_4E18DE394F253951F2F6CCB149B0597D(class UObject* Loaded);
	void OnLoaded_979288504F90989FEEAAD0BBDC449001(class UObject* Loaded);
	void UserConstructionScript();
	void PreviewCellItemDefinition_Editor(class URBPlayerCellItemDefinition* CellItemDefinition);
	void Refresh();
	void GetConfigTransform();
	void ChangeMaterialOnStaticmesh(class UPrimitiveComponent* Comp, class UObject* Material);
	void TryDestroyPreviousProp();
	void ApplyTransformToConfig();
	void OnPreviewDone();
	void GetSpawnTransform(struct FTransform* WorldLocation);
	void PreviewBlueprintClass_Editor(TSoftClassPtr<class UClass> Class_0, class URBPlayerCellItemDefinition* CellItemDefinition);
	void Reset();
	void ApplyStaticMesh(class URBPlayerCellItemDefinition* CellItemDefinition);
	void ApplyMaterial(class URBPlayerCellItemDefinition* PlayerCellDefinition);
	void GetCameraFocusWorldLocation(struct FVector* WorldLocation);
	void ResetPreviewStaticMeshMaterials();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerCellItemBase_C">();
	}
	static class APlayerCellItemBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayerCellItemBase_C>();
	}
};
static_assert(alignof(APlayerCellItemBase_C) == 0x000010, "Wrong alignment on APlayerCellItemBase_C");
static_assert(sizeof(APlayerCellItemBase_C) == 0x000320, "Wrong size on APlayerCellItemBase_C");
static_assert(offsetof(APlayerCellItemBase_C, UberGraphFrame) == 0x000238, "Member 'APlayerCellItemBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, TextRender) == 0x000240, "Member 'APlayerCellItemBase_C::TextRender' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, ChildActor) == 0x000248, "Member 'APlayerCellItemBase_C::ChildActor' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, DisplayStaticMeshComponent) == 0x000250, "Member 'APlayerCellItemBase_C::DisplayStaticMeshComponent' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, Scene) == 0x000258, "Member 'APlayerCellItemBase_C::Scene' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, Billboard) == 0x000260, "Member 'APlayerCellItemBase_C::Billboard' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, PreviewDefinition) == 0x000268, "Member 'APlayerCellItemBase_C::PreviewDefinition' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, bDebugTransform) == 0x000270, "Member 'APlayerCellItemBase_C::bDebugTransform' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, DebugTransform) == 0x000280, "Member 'APlayerCellItemBase_C::DebugTransform' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, AffectedMaterialID) == 0x0002B0, "Member 'APlayerCellItemBase_C::AffectedMaterialID' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, StaticmeshTag) == 0x0002B4, "Member 'APlayerCellItemBase_C::StaticmeshTag' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, AttachedStaticmeshes) == 0x0002C0, "Member 'APlayerCellItemBase_C::AttachedStaticmeshes' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, FOV) == 0x0002D0, "Member 'APlayerCellItemBase_C::FOV' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, RefActor) == 0x0002D8, "Member 'APlayerCellItemBase_C::RefActor' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, PendingTarget) == 0x0002E0, "Member 'APlayerCellItemBase_C::PendingTarget' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, bPendingAsyncPreview) == 0x0002E8, "Member 'APlayerCellItemBase_C::bPendingAsyncPreview' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, bHasPendingTarget) == 0x0002E9, "Member 'APlayerCellItemBase_C::bHasPendingTarget' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, SpawnTransformActorRef) == 0x0002F0, "Member 'APlayerCellItemBase_C::SpawnTransformActorRef' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, WallMeshRef) == 0x0002F8, "Member 'APlayerCellItemBase_C::WallMeshRef' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, CameraFocusOffset) == 0x000300, "Member 'APlayerCellItemBase_C::CameraFocusOffset' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, CurrentPCD) == 0x000310, "Member 'APlayerCellItemBase_C::CurrentPCD' has a wrong offset!");
static_assert(offsetof(APlayerCellItemBase_C, Is_Preview) == 0x000318, "Member 'APlayerCellItemBase_C::Is_Preview' has a wrong offset!");

}

