#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerStatus.PlayerStatus_C
// 0x0028 (0x02B8 - 0x0290)
class UPlayerStatus_C final : public URBHUDPlayerStatus
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_PlayerStatus;                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StatusIcon;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               StatusSize;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         DeathTime;                                         // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeBeforeRespawn;                                 // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerStatus(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void UpdateProgress();
	void OnPlayerStatusChanged(EPlayerIndicatorType NewPlayerStatus);
	void OnCompletingObjectiveChanged(bool IsCompletingObjective);
	void UpdateStatusIcon();
	class UTexture2D* GetStatusIconTexture(const EPlayerIndicatorType& PlayerIndicatorType, bool bIsObjective);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerStatus_C">();
	}
	static class UPlayerStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerStatus_C>();
	}
};
static_assert(alignof(UPlayerStatus_C) == 0x000008, "Wrong alignment on UPlayerStatus_C");
static_assert(sizeof(UPlayerStatus_C) == 0x0002B8, "Wrong size on UPlayerStatus_C");
static_assert(offsetof(UPlayerStatus_C, UberGraphFrame) == 0x000290, "Member 'UPlayerStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerStatus_C, InvalidationBox_PlayerStatus) == 0x000298, "Member 'UPlayerStatus_C::InvalidationBox_PlayerStatus' has a wrong offset!");
static_assert(offsetof(UPlayerStatus_C, StatusIcon) == 0x0002A0, "Member 'UPlayerStatus_C::StatusIcon' has a wrong offset!");
static_assert(offsetof(UPlayerStatus_C, StatusSize) == 0x0002A8, "Member 'UPlayerStatus_C::StatusSize' has a wrong offset!");
static_assert(offsetof(UPlayerStatus_C, DeathTime) == 0x0002B0, "Member 'UPlayerStatus_C::DeathTime' has a wrong offset!");
static_assert(offsetof(UPlayerStatus_C, TimeBeforeRespawn) == 0x0002B4, "Member 'UPlayerStatus_C::TimeBeforeRespawn' has a wrong offset!");

}

