#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerLoadoutHoverInfo

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlayerLoadoutHoverInfo.PlayerLoadoutHoverInfo_C.IsTierLocked
// 0x0358 (0x0358 - 0x0000)
struct PlayerLoadoutHoverInfo_C_IsTierLocked final
{
public:
	bool                                          bIsTierLocked;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EMenuUpgradeItemState                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELoadoutElementType                           Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProfileUpgradeCategory                       Temp_byte_Variable_2;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProfileUpgradeCategory                       Temp_byte_Variable_3;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProfileUpgradeCategory                       Temp_byte_Variable_4;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProfileUpgradeCategory                       Temp_byte_Variable_5;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProfileUpgradeCategory                       Temp_byte_Variable_6;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELoadoutElementType                           Temp_byte_Variable_7;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemProgressionCategory                      Temp_byte_Variable_8;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemProgressionCategory                      Temp_byte_Variable_9;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemProgressionCategory                      Temp_byte_Variable_10;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemProgressionCategory                      Temp_byte_Variable_11;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemProgressionCategory                      Temp_byte_Variable_12;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProfileUpgradeCategory                       K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemProgressionCategory                      K2Node_Select_Default_1;                           // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRBItemProgressionData>         CallFunc_FilterItemProgressionData_ReturnValue;    // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBItemProgressionData                 CallFunc_Array_Get_Item;                           // 0x0048(0x0170)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuUpgradeItemInfo                   CallFunc_GetUpgradeItemInfo_ReturnValue;           // 0x01C0(0x0190)()
	bool                                          K2Node_Select_Default_2;                           // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerLoadoutHoverInfo_C_IsTierLocked) == 0x000008, "Wrong alignment on PlayerLoadoutHoverInfo_C_IsTierLocked");
static_assert(sizeof(PlayerLoadoutHoverInfo_C_IsTierLocked) == 0x000358, "Wrong size on PlayerLoadoutHoverInfo_C_IsTierLocked");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, bIsTierLocked) == 0x000000, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::bIsTierLocked' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_byte_Variable) == 0x000001, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_bool_Variable) == 0x000002, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_bool_Variable_1) == 0x000003, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_bool_Variable_2) == 0x000004, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_bool_Variable_3) == 0x000005, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_bool_Variable_4) == 0x000006, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_bool_Variable_5) == 0x000007, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_bool_Variable_6) == 0x000008, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_bool_Variable_7) == 0x000009, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_byte_Variable_1) == 0x00000A, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_byte_Variable_2) == 0x00000B, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_byte_Variable_3) == 0x00000C, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_byte_Variable_4) == 0x00000D, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_byte_Variable_5) == 0x00000E, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_byte_Variable_6) == 0x00000F, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_byte_Variable_7) == 0x000010, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_byte_Variable_8) == 0x000011, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_byte_Variable_9) == 0x000012, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_byte_Variable_10) == 0x000013, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_byte_Variable_11) == 0x000014, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_byte_Variable_12) == 0x000015, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_int_Array_Index_Variable) == 0x000018, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, K2Node_Select_Default) == 0x000024, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, K2Node_Select_Default_1) == 0x000025, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x000028, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, CallFunc_FilterItemProgressionData_ReturnValue) == 0x000030, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::CallFunc_FilterItemProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, CallFunc_Array_Get_Item) == 0x000048, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, CallFunc_Less_IntInt_ReturnValue) == 0x0001B8, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, CallFunc_GetUpgradeItemInfo_ReturnValue) == 0x0001C0, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::CallFunc_GetUpgradeItemInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_IsTierLocked, K2Node_Select_Default_2) == 0x000350, "Member 'PlayerLoadoutHoverInfo_C_IsTierLocked::K2Node_Select_Default_2' has a wrong offset!");

// Function PlayerLoadoutHoverInfo.PlayerLoadoutHoverInfo_C.SetupActionButton2
// 0x0030 (0x0030 - 0x0000)
struct PlayerLoadoutHoverInfo_C_SetupActionButton2 final
{
public:
	class FString                                 ActionName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   ActionText;                                        // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bHold;                                             // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerLoadoutHoverInfo_C_SetupActionButton2) == 0x000008, "Wrong alignment on PlayerLoadoutHoverInfo_C_SetupActionButton2");
static_assert(sizeof(PlayerLoadoutHoverInfo_C_SetupActionButton2) == 0x000030, "Wrong size on PlayerLoadoutHoverInfo_C_SetupActionButton2");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupActionButton2, ActionName) == 0x000000, "Member 'PlayerLoadoutHoverInfo_C_SetupActionButton2::ActionName' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupActionButton2, ActionText) == 0x000010, "Member 'PlayerLoadoutHoverInfo_C_SetupActionButton2::ActionText' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupActionButton2, bHold) == 0x000028, "Member 'PlayerLoadoutHoverInfo_C_SetupActionButton2::bHold' has a wrong offset!");

// Function PlayerLoadoutHoverInfo.PlayerLoadoutHoverInfo_C.SetupActionButton
// 0x0030 (0x0030 - 0x0000)
struct PlayerLoadoutHoverInfo_C_SetupActionButton final
{
public:
	class FString                                 ActionName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   ActionText;                                        // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bHold;                                             // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerLoadoutHoverInfo_C_SetupActionButton) == 0x000008, "Wrong alignment on PlayerLoadoutHoverInfo_C_SetupActionButton");
static_assert(sizeof(PlayerLoadoutHoverInfo_C_SetupActionButton) == 0x000030, "Wrong size on PlayerLoadoutHoverInfo_C_SetupActionButton");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupActionButton, ActionName) == 0x000000, "Member 'PlayerLoadoutHoverInfo_C_SetupActionButton::ActionName' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupActionButton, ActionText) == 0x000010, "Member 'PlayerLoadoutHoverInfo_C_SetupActionButton::ActionText' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupActionButton, bHold) == 0x000028, "Member 'PlayerLoadoutHoverInfo_C_SetupActionButton::bHold' has a wrong offset!");

// Function PlayerLoadoutHoverInfo.PlayerLoadoutHoverInfo_C.SetupError
// 0x0018 (0x0018 - 0x0000)
struct PlayerLoadoutHoverInfo_C_SetupError final
{
public:
	class FText                                   Error;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerLoadoutHoverInfo_C_SetupError) == 0x000008, "Wrong alignment on PlayerLoadoutHoverInfo_C_SetupError");
static_assert(sizeof(PlayerLoadoutHoverInfo_C_SetupError) == 0x000018, "Wrong size on PlayerLoadoutHoverInfo_C_SetupError");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupError, Error) == 0x000000, "Member 'PlayerLoadoutHoverInfo_C_SetupError::Error' has a wrong offset!");

// Function PlayerLoadoutHoverInfo.PlayerLoadoutHoverInfo_C.SetupCoreUpgrade
// 0x0430 (0x0430 - 0x0000)
struct PlayerLoadoutHoverInfo_C_SetupCoreUpgrade final
{
public:
	class FName                                   ItemId_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Tier_0;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuUpgradeItemInfo                   CallFunc_GetUpgradeItemInfo_ReturnValue;           // 0x0010(0x0190)()
	class FText                                   CallFunc_FormatUpgradeEffectText_ReturnValue;      // 0x01A0(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatTextForDecorator_ReturnValue;       // 0x01C0(0x0018)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01E0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0220(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0230(0x0018)()
	bool                                          CallFunc_IsTierLocked_bIsTierLocked;               // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0250(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0290(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02A0(0x0018)()
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBItemProgressionData                 CallFunc_GetItemProgressionData_ReturnValue;       // 0x02C0(0x0170)(ConstParm)
};
static_assert(alignof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade) == 0x000008, "Wrong alignment on PlayerLoadoutHoverInfo_C_SetupCoreUpgrade");
static_assert(sizeof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade) == 0x000430, "Wrong size on PlayerLoadoutHoverInfo_C_SetupCoreUpgrade");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, ItemId_0) == 0x000000, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::ItemId_0' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, Tier_0) == 0x000008, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::Tier_0' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000C, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, CallFunc_GetUpgradeItemInfo_ReturnValue) == 0x000010, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::CallFunc_GetUpgradeItemInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, CallFunc_FormatUpgradeEffectText_ReturnValue) == 0x0001A0, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::CallFunc_FormatUpgradeEffectText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, K2Node_SwitchEnum_CmpSuccess) == 0x0001B8, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, CallFunc_FormatTextForDecorator_ReturnValue) == 0x0001C0, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::CallFunc_FormatTextForDecorator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0001D8, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, K2Node_MakeStruct_FormatArgumentData) == 0x0001E0, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, K2Node_MakeArray_Array) == 0x000220, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, CallFunc_Format_ReturnValue) == 0x000230, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, CallFunc_IsTierLocked_bIsTierLocked) == 0x000248, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::CallFunc_IsTierLocked_bIsTierLocked' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, K2Node_MakeStruct_FormatArgumentData_1) == 0x000250, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, K2Node_MakeArray_Array_1) == 0x000290, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, CallFunc_Format_ReturnValue_1) == 0x0002A0, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x0002B8, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupCoreUpgrade, CallFunc_GetItemProgressionData_ReturnValue) == 0x0002C0, "Member 'PlayerLoadoutHoverInfo_C_SetupCoreUpgrade::CallFunc_GetItemProgressionData_ReturnValue' has a wrong offset!");

// Function PlayerLoadoutHoverInfo.PlayerLoadoutHoverInfo_C.SetupPerk
// 0x04A0 (0x04A0 - 0x0000)
struct PlayerLoadoutHoverInfo_C_SetupPerk final
{
public:
	class FName                                   ItemId_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuUpgradeItemInfo                   CallFunc_GetUpgradeItemInfo_ReturnValue;           // 0x0010(0x0190)()
	class FText                                   CallFunc_FormatUpgradeEffectText_ReturnValue;      // 0x01A0(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatTextForDecorator_ReturnValue;       // 0x01C0(0x0018)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBGlobalUIConfig*                      CallFunc_GetGlobalUIConfig_ReturnValue;            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPerkCategory                                 K2Node_Select_Default;                             // 0x01F0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x01F8(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0218(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0230(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0270(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0280(0x0018)()
	bool                                          CallFunc_CanEditLoadouts_ReturnValue;              // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanEquipPerkInMenuLoadout_ReturnValue;    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBPlayerLoadout                       CallFunc_GetMenuLoadout_ReturnValue;               // 0x02A0(0x0018)()
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBItemProgressionData                 CallFunc_GetItemProgressionData_ReturnValue;       // 0x02C8(0x0170)(ConstParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0438(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0478(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0488(0x0018)()
};
static_assert(alignof(PlayerLoadoutHoverInfo_C_SetupPerk) == 0x000008, "Wrong alignment on PlayerLoadoutHoverInfo_C_SetupPerk");
static_assert(sizeof(PlayerLoadoutHoverInfo_C_SetupPerk) == 0x0004A0, "Wrong size on PlayerLoadoutHoverInfo_C_SetupPerk");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, ItemId_0) == 0x000000, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::ItemId_0' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, SlotIndex) == 0x000008, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::SlotIndex' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_MakeLiteralByte_ReturnValue) == 0x00000C, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_GetUpgradeItemInfo_ReturnValue) == 0x000010, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_GetUpgradeItemInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_FormatUpgradeEffectText_ReturnValue) == 0x0001A0, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_FormatUpgradeEffectText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, K2Node_SwitchEnum_CmpSuccess) == 0x0001B8, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_FormatTextForDecorator_ReturnValue) == 0x0001C0, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_FormatTextForDecorator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001D8, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0001D9, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, Temp_int_Variable) == 0x0001DC, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0001E0, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_GetGlobalUIConfig_ReturnValue) == 0x0001E8, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_GetGlobalUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, K2Node_Select_Default) == 0x0001F0, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_Map_Find_Value) == 0x0001F8, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_Map_Find_ReturnValue) == 0x000210, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_MakeLiteralText_ReturnValue) == 0x000218, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, K2Node_MakeStruct_FormatArgumentData) == 0x000230, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, K2Node_MakeArray_Array) == 0x000270, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_Format_ReturnValue) == 0x000280, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_CanEditLoadouts_ReturnValue) == 0x000298, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_CanEditLoadouts_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_CanEquipPerkInMenuLoadout_ReturnValue) == 0x000299, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_CanEquipPerkInMenuLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_GetMenuLoadout_ReturnValue) == 0x0002A0, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_GetMenuLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_Array_Contains_ReturnValue) == 0x0002B8, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_BooleanAND_ReturnValue) == 0x0002B9, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x0002C0, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_GetItemProgressionData_ReturnValue) == 0x0002C8, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_GetItemProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, K2Node_MakeStruct_FormatArgumentData_1) == 0x000438, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, K2Node_MakeArray_Array_1) == 0x000478, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupPerk, CallFunc_Format_ReturnValue_1) == 0x000488, "Member 'PlayerLoadoutHoverInfo_C_SetupPerk::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function PlayerLoadoutHoverInfo.PlayerLoadoutHoverInfo_C.SetupRigUpgrade
// 0x0710 (0x0710 - 0x0000)
struct PlayerLoadoutHoverInfo_C_SetupRigUpgrade final
{
public:
	class FName                                   ItemId_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatUpgradeEffectText_ReturnValue;      // 0x0010(0x0018)()
	class FText                                   CallFunc_FormatTextForDecorator_ReturnValue;       // 0x0028(0x0018)()
	struct FMenuUpgradeItemInfo                   CallFunc_GetUpgradeItemInfo_ReturnValue;           // 0x0040(0x0190)()
	struct FMenuUpgradeItemInfo                   CallFunc_GetActiveSkillUpgradeItemInfo_ReturnValue; // 0x01D0(0x0190)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0362(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0363(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerLoadoutConfig*                 CallFunc_GetPlayerLoadoutConfig_ReturnValue;       // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveSkillCommonParams               CallFunc_GetActiveSkillCommonParamsById_ReturnValue; // 0x0370(0x0078)(ConstParm)
	class FText                                   CallFunc_FormatTextForDecorator_ReturnValue_1;     // 0x03E8(0x0018)()
	struct FMenuUpgradeItemInfo                   CallFunc_GetActiveSkillUpgradeItemInfo_ReturnValue_1; // 0x0400(0x0190)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerProgressionData*               CallFunc_GetLocalPlayerProgressionData_ReturnValue; // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBItemProgressionData                 CallFunc_GetItemProgressionData_ReturnValue;       // 0x05A0(0x0170)(ConstParm)
};
static_assert(alignof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade) == 0x000008, "Wrong alignment on PlayerLoadoutHoverInfo_C_SetupRigUpgrade");
static_assert(sizeof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade) == 0x000710, "Wrong size on PlayerLoadoutHoverInfo_C_SetupRigUpgrade");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, ItemId_0) == 0x000000, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::ItemId_0' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, SlotIndex) == 0x000008, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::SlotIndex' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000C, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_FormatUpgradeEffectText_ReturnValue) == 0x000010, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_FormatUpgradeEffectText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_FormatTextForDecorator_ReturnValue) == 0x000028, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_FormatTextForDecorator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_GetUpgradeItemInfo_ReturnValue) == 0x000040, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_GetUpgradeItemInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_GetActiveSkillUpgradeItemInfo_ReturnValue) == 0x0001D0, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_GetActiveSkillUpgradeItemInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000360, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000361, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, K2Node_SwitchEnum_CmpSuccess) == 0x000362, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_Not_PreBool_ReturnValue) == 0x000363, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_GetPlayerLoadoutConfig_ReturnValue) == 0x000368, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_GetPlayerLoadoutConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_GetActiveSkillCommonParamsById_ReturnValue) == 0x000370, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_GetActiveSkillCommonParamsById_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_FormatTextForDecorator_ReturnValue_1) == 0x0003E8, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_FormatTextForDecorator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_GetActiveSkillUpgradeItemInfo_ReturnValue_1) == 0x000400, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_GetActiveSkillUpgradeItemInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000590, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_GetLocalPlayerProgressionData_ReturnValue) == 0x000598, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_GetLocalPlayerProgressionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRigUpgrade, CallFunc_GetItemProgressionData_ReturnValue) == 0x0005A0, "Member 'PlayerLoadoutHoverInfo_C_SetupRigUpgrade::CallFunc_GetItemProgressionData_ReturnValue' has a wrong offset!");

// Function PlayerLoadoutHoverInfo.PlayerLoadoutHoverInfo_C.SetupRig
// 0x02D8 (0x02D8 - 0x0000)
struct PlayerLoadoutHoverInfo_C_SetupRig final
{
public:
	class FName                                   ItemId_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuUpgradeItemInfo                   CallFunc_GetUpgradeItemInfo_ReturnValue;           // 0x0010(0x0190)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x01A8(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x01C0(0x0018)()
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEditLoadouts_ReturnValue;              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerLoadoutsTab_C*                   K2Node_DynamicCast_AsPlayer_Loadouts_Tab;          // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBPlayerLoadout                       CallFunc_GetMenuLoadout_ReturnValue;               // 0x0200(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPlayerLoadoutConfig*                 CallFunc_GetPlayerLoadoutConfig_ReturnValue;       // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveSkillCommonParams               CallFunc_GetActiveSkillCommonParamsById_ReturnValue; // 0x0228(0x0078)(ConstParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatTextForDecorator_ReturnValue;       // 0x02A8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x02C0(0x0018)()
};
static_assert(alignof(PlayerLoadoutHoverInfo_C_SetupRig) == 0x000008, "Wrong alignment on PlayerLoadoutHoverInfo_C_SetupRig");
static_assert(sizeof(PlayerLoadoutHoverInfo_C_SetupRig) == 0x0002D8, "Wrong size on PlayerLoadoutHoverInfo_C_SetupRig");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, ItemId_0) == 0x000000, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::ItemId_0' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, Temp_bool_Variable) == 0x000008, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, CallFunc_GetUpgradeItemInfo_ReturnValue) == 0x000010, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::CallFunc_GetUpgradeItemInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001A0, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, K2Node_SwitchEnum_CmpSuccess) == 0x0001A1, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, Temp_text_Variable) == 0x0001A8, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, Temp_text_Variable_1) == 0x0001C0, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, CallFunc_GetParent_ReturnValue) == 0x0001D8, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x0001E0, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, CallFunc_CanEditLoadouts_ReturnValue) == 0x0001E8, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::CallFunc_CanEditLoadouts_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, K2Node_DynamicCast_AsPlayer_Loadouts_Tab) == 0x0001F0, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::K2Node_DynamicCast_AsPlayer_Loadouts_Tab' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, CallFunc_GetMenuLoadout_ReturnValue) == 0x000200, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::CallFunc_GetMenuLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000218, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, CallFunc_GetPlayerLoadoutConfig_ReturnValue) == 0x000220, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::CallFunc_GetPlayerLoadoutConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, CallFunc_GetActiveSkillCommonParamsById_ReturnValue) == 0x000228, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::CallFunc_GetActiveSkillCommonParamsById_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002A0, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, CallFunc_FormatTextForDecorator_ReturnValue) == 0x0002A8, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::CallFunc_FormatTextForDecorator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_SetupRig, K2Node_Select_Default) == 0x0002C0, "Member 'PlayerLoadoutHoverInfo_C_SetupRig::K2Node_Select_Default' has a wrong offset!");

// Function PlayerLoadoutHoverInfo.PlayerLoadoutHoverInfo_C.OnLoadoutItemHovered
// 0x0010 (0x0010 - 0x0000)
struct PlayerLoadoutHoverInfo_C_OnLoadoutItemHovered final
{
public:
	ELoadoutElementType                           LoadoutItemType_0;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ItemId_0;                                          // 0x0004(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Tier_0;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerLoadoutHoverInfo_C_OnLoadoutItemHovered) == 0x000004, "Wrong alignment on PlayerLoadoutHoverInfo_C_OnLoadoutItemHovered");
static_assert(sizeof(PlayerLoadoutHoverInfo_C_OnLoadoutItemHovered) == 0x000010, "Wrong size on PlayerLoadoutHoverInfo_C_OnLoadoutItemHovered");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_OnLoadoutItemHovered, LoadoutItemType_0) == 0x000000, "Member 'PlayerLoadoutHoverInfo_C_OnLoadoutItemHovered::LoadoutItemType_0' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_OnLoadoutItemHovered, ItemId_0) == 0x000004, "Member 'PlayerLoadoutHoverInfo_C_OnLoadoutItemHovered::ItemId_0' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_OnLoadoutItemHovered, Tier_0) == 0x00000C, "Member 'PlayerLoadoutHoverInfo_C_OnLoadoutItemHovered::Tier_0' has a wrong offset!");

// Function PlayerLoadoutHoverInfo.PlayerLoadoutHoverInfo_C.Refresh
// 0x0030 (0x0030 - 0x0000)
struct PlayerLoadoutHoverInfo_C_Refresh final
{
public:
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0010(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerLoadoutHoverInfo_C_Refresh) == 0x000008, "Wrong alignment on PlayerLoadoutHoverInfo_C_Refresh");
static_assert(sizeof(PlayerLoadoutHoverInfo_C_Refresh) == 0x000030, "Wrong size on PlayerLoadoutHoverInfo_C_Refresh");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_Refresh, K2Node_MakeArray_Array) == 0x000000, "Member 'PlayerLoadoutHoverInfo_C_Refresh::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_Refresh, CallFunc_Format_ReturnValue) == 0x000010, "Member 'PlayerLoadoutHoverInfo_C_Refresh::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_Refresh, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'PlayerLoadoutHoverInfo_C_Refresh::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_Refresh, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'PlayerLoadoutHoverInfo_C_Refresh::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function PlayerLoadoutHoverInfo.PlayerLoadoutHoverInfo_C.UpdateNPCActionButton
// 0x0002 (0x0002 - 0x0000)
struct PlayerLoadoutHoverInfo_C_UpdateNPCActionButton final
{
public:
	ELoadoutElementType                           NewCategory;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SecondActionButton;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerLoadoutHoverInfo_C_UpdateNPCActionButton) == 0x000001, "Wrong alignment on PlayerLoadoutHoverInfo_C_UpdateNPCActionButton");
static_assert(sizeof(PlayerLoadoutHoverInfo_C_UpdateNPCActionButton) == 0x000002, "Wrong size on PlayerLoadoutHoverInfo_C_UpdateNPCActionButton");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_UpdateNPCActionButton, NewCategory) == 0x000000, "Member 'PlayerLoadoutHoverInfo_C_UpdateNPCActionButton::NewCategory' has a wrong offset!");
static_assert(offsetof(PlayerLoadoutHoverInfo_C_UpdateNPCActionButton, SecondActionButton) == 0x000001, "Member 'PlayerLoadoutHoverInfo_C_UpdateNPCActionButton::SecondActionButton' has a wrong offset!");

// Function PlayerLoadoutHoverInfo.PlayerLoadoutHoverInfo_C.ExecuteUbergraph_PlayerLoadoutHoverInfo
// 0x0038 (0x0038 - 0x0000)
struct PlayerLoadoutHoverInfo_C_ExecuteUbergraph_PlayerLoadoutHoverInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ELoadoutElementType LoadoutItemType, class FName& ItemId, int32 Tier)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	ELoadoutElementType                           K2Node_CustomEvent_newCategory;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
