#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlywoodMinus01_BP

#include "Basic.hpp"

#include "ModuleMeshDataMinus02_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StaticmeshArray_Stuc_structs.hpp"


namespace SDK::Params
{

// Function Plywood-01_BP.Plywood-01_BP_C.UserConstructionScript
// 0x0078 (0x0078 - 0x0000)
struct PlywoodMinus01_BP_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable;                              // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_1;                            // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModuleMeshDataMinus02>         K2Node_Select_Default_1;                           // 0x0030(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_PopulateSurface_LastLocation;             // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes;          // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlywoodMinus01_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on PlywoodMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(PlywoodMinus01_BP_C_UserConstructionScript) == 0x000078, "Wrong size on PlywoodMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(PlywoodMinus01_BP_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'PlywoodMinus01_BP_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlywoodMinus01_BP_C_UserConstructionScript, Temp_struct_Variable) == 0x000004, "Member 'PlywoodMinus01_BP_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PlywoodMinus01_BP_C_UserConstructionScript, Temp_struct_Variable_1) == 0x000010, "Member 'PlywoodMinus01_BP_C_UserConstructionScript::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PlywoodMinus01_BP_C_UserConstructionScript, Temp_bool_Variable_1) == 0x00001C, "Member 'PlywoodMinus01_BP_C_UserConstructionScript::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PlywoodMinus01_BP_C_UserConstructionScript, K2Node_Select_Default) == 0x000020, "Member 'PlywoodMinus01_BP_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlywoodMinus01_BP_C_UserConstructionScript, K2Node_Select_Default_1) == 0x000030, "Member 'PlywoodMinus01_BP_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PlywoodMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation) == 0x000040, "Member 'PlywoodMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation' has a wrong offset!");
static_assert(offsetof(PlywoodMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize) == 0x00004C, "Member 'PlywoodMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize' has a wrong offset!");
static_assert(offsetof(PlywoodMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale) == 0x000050, "Member 'PlywoodMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale' has a wrong offset!");
static_assert(offsetof(PlywoodMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes) == 0x000058, "Member 'PlywoodMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes' has a wrong offset!");
static_assert(offsetof(PlywoodMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount) == 0x000068, "Member 'PlywoodMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount' has a wrong offset!");
static_assert(offsetof(PlywoodMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize) == 0x00006C, "Member 'PlywoodMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize' has a wrong offset!");
static_assert(offsetof(PlywoodMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale) == 0x000070, "Member 'PlywoodMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale' has a wrong offset!");

}

