#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgramTrialExtraRewardsWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ProgramTrialExtraRewardsWidget.ProgramTrialExtraRewardsWidget_C
// 0x0020 (0x0280 - 0x0260)
class UProgramTrialExtraRewardsWidget_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       NewReward;                                         // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_163;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_114;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Setup(int32 Amount);
	void PlayNewRewardAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProgramTrialExtraRewardsWidget_C">();
	}
	static class UProgramTrialExtraRewardsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgramTrialExtraRewardsWidget_C>();
	}
};
static_assert(alignof(UProgramTrialExtraRewardsWidget_C) == 0x000008, "Wrong alignment on UProgramTrialExtraRewardsWidget_C");
static_assert(sizeof(UProgramTrialExtraRewardsWidget_C) == 0x000280, "Wrong size on UProgramTrialExtraRewardsWidget_C");
static_assert(offsetof(UProgramTrialExtraRewardsWidget_C, NewReward) == 0x000260, "Member 'UProgramTrialExtraRewardsWidget_C::NewReward' has a wrong offset!");
static_assert(offsetof(UProgramTrialExtraRewardsWidget_C, Image) == 0x000268, "Member 'UProgramTrialExtraRewardsWidget_C::Image' has a wrong offset!");
static_assert(offsetof(UProgramTrialExtraRewardsWidget_C, Image_163) == 0x000270, "Member 'UProgramTrialExtraRewardsWidget_C::Image_163' has a wrong offset!");
static_assert(offsetof(UProgramTrialExtraRewardsWidget_C, TextBlock_114) == 0x000278, "Member 'UProgramTrialExtraRewardsWidget_C::TextBlock_114' has a wrong offset!");

}

