#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectionSymbol_BP

#include "Basic.hpp"

#include "ProjectionSymbolExclusionState_structs.hpp"
#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.GetAssociatedInvestigationComponent
// 0x0008 (0x0008 - 0x0000)
struct ProjectionSymbol_BP_C_GetAssociatedInvestigationComponent final
{
public:
	class URBPlayerInvestigationZoneComponent*    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProjectionSymbol_BP_C_GetAssociatedInvestigationComponent) == 0x000008, "Wrong alignment on ProjectionSymbol_BP_C_GetAssociatedInvestigationComponent");
static_assert(sizeof(ProjectionSymbol_BP_C_GetAssociatedInvestigationComponent) == 0x000008, "Wrong size on ProjectionSymbol_BP_C_GetAssociatedInvestigationComponent");
static_assert(offsetof(ProjectionSymbol_BP_C_GetAssociatedInvestigationComponent, ReturnValue) == 0x000000, "Member 'ProjectionSymbol_BP_C_GetAssociatedInvestigationComponent::ReturnValue' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.GetClue
// 0x0008 (0x0008 - 0x0000)
struct ProjectionSymbol_BP_C_GetClue final
{
public:
	struct FClueData                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor)
};
static_assert(alignof(ProjectionSymbol_BP_C_GetClue) == 0x000004, "Wrong alignment on ProjectionSymbol_BP_C_GetClue");
static_assert(sizeof(ProjectionSymbol_BP_C_GetClue) == 0x000008, "Wrong size on ProjectionSymbol_BP_C_GetClue");
static_assert(offsetof(ProjectionSymbol_BP_C_GetClue, ReturnValue) == 0x000000, "Member 'ProjectionSymbol_BP_C_GetClue::ReturnValue' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.OnWorldPopulateFinishedTimeSliced
// 0x0001 (0x0001 - 0x0000)
struct ProjectionSymbol_BP_C_OnWorldPopulateFinishedTimeSliced final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectionSymbol_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong alignment on ProjectionSymbol_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(sizeof(ProjectionSymbol_BP_C_OnWorldPopulateFinishedTimeSliced) == 0x000001, "Wrong size on ProjectionSymbol_BP_C_OnWorldPopulateFinishedTimeSliced");
static_assert(offsetof(ProjectionSymbol_BP_C_OnWorldPopulateFinishedTimeSliced, ReturnValue) == 0x000000, "Member 'ProjectionSymbol_BP_C_OnWorldPopulateFinishedTimeSliced::ReturnValue' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.GetStateName
// 0x0028 (0x0028 - 0x0000)
struct ProjectionSymbol_BP_C_GetStateName final
{
public:
	class FString                                 StateA;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StateB;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectionSymbol_BP_C_GetStateName) == 0x000008, "Wrong alignment on ProjectionSymbol_BP_C_GetStateName");
static_assert(sizeof(ProjectionSymbol_BP_C_GetStateName) == 0x000028, "Wrong size on ProjectionSymbol_BP_C_GetStateName");
static_assert(offsetof(ProjectionSymbol_BP_C_GetStateName, StateA) == 0x000000, "Member 'ProjectionSymbol_BP_C_GetStateName::StateA' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetStateName, StateB) == 0x000010, "Member 'ProjectionSymbol_BP_C_GetStateName::StateB' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetStateName, ReturnValue) == 0x000020, "Member 'ProjectionSymbol_BP_C_GetStateName::ReturnValue' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.HideAllExcludedActors
// 0x0070 (0x0070 - 0x0000)
struct ProjectionSymbol_BP_C_HideAllExcludedActors final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class AActor>>          CallFunc_GetFullExcludeList_FullExcludeList;       // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CallFunc_Array_Get_Item;                           // 0x0028(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectionSymbol_BP_C_HideAllExcludedActors) == 0x000008, "Wrong alignment on ProjectionSymbol_BP_C_HideAllExcludedActors");
static_assert(sizeof(ProjectionSymbol_BP_C_HideAllExcludedActors) == 0x000070, "Wrong size on ProjectionSymbol_BP_C_HideAllExcludedActors");
static_assert(offsetof(ProjectionSymbol_BP_C_HideAllExcludedActors, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ProjectionSymbol_BP_C_HideAllExcludedActors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_HideAllExcludedActors, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ProjectionSymbol_BP_C_HideAllExcludedActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_HideAllExcludedActors, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ProjectionSymbol_BP_C_HideAllExcludedActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_HideAllExcludedActors, CallFunc_GetFullExcludeList_FullExcludeList) == 0x000010, "Member 'ProjectionSymbol_BP_C_HideAllExcludedActors::CallFunc_GetFullExcludeList_FullExcludeList' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_HideAllExcludedActors, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ProjectionSymbol_BP_C_HideAllExcludedActors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_HideAllExcludedActors, CallFunc_Array_Get_Item) == 0x000028, "Member 'ProjectionSymbol_BP_C_HideAllExcludedActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_HideAllExcludedActors, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'ProjectionSymbol_BP_C_HideAllExcludedActors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_HideAllExcludedActors, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000058, "Member 'ProjectionSymbol_BP_C_HideAllExcludedActors::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_HideAllExcludedActors, K2Node_DynamicCast_AsActor) == 0x000060, "Member 'ProjectionSymbol_BP_C_HideAllExcludedActors::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_HideAllExcludedActors, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'ProjectionSymbol_BP_C_HideAllExcludedActors::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.GetFullExcludeList
// 0x0030 (0x0030 - 0x0000)
struct ProjectionSymbol_BP_C_GetFullExcludeList final
{
public:
	TArray<TSoftObjectPtr<class AActor>>          FullExcludeList;                                   // 0x0000(0x0010)(Parm, OutParm)
	TArray<TSoftObjectPtr<class AActor>>          LocalList;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<TSoftObjectPtr<class AActor>>          CallFunc_GatherAllLinkedInverseActors_ReturnValue; // 0x0020(0x0010)(ReferenceParm)
};
static_assert(alignof(ProjectionSymbol_BP_C_GetFullExcludeList) == 0x000008, "Wrong alignment on ProjectionSymbol_BP_C_GetFullExcludeList");
static_assert(sizeof(ProjectionSymbol_BP_C_GetFullExcludeList) == 0x000030, "Wrong size on ProjectionSymbol_BP_C_GetFullExcludeList");
static_assert(offsetof(ProjectionSymbol_BP_C_GetFullExcludeList, FullExcludeList) == 0x000000, "Member 'ProjectionSymbol_BP_C_GetFullExcludeList::FullExcludeList' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetFullExcludeList, LocalList) == 0x000010, "Member 'ProjectionSymbol_BP_C_GetFullExcludeList::LocalList' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetFullExcludeList, CallFunc_GatherAllLinkedInverseActors_ReturnValue) == 0x000020, "Member 'ProjectionSymbol_BP_C_GetFullExcludeList::CallFunc_GatherAllLinkedInverseActors_ReturnValue' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.FindFov
// 0x0014 (0x0014 - 0x0000)
struct ProjectionSymbol_BP_C_FindFov final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAsin_ReturnValue;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProjectionSymbol_BP_C_FindFov) == 0x000004, "Wrong alignment on ProjectionSymbol_BP_C_FindFov");
static_assert(sizeof(ProjectionSymbol_BP_C_FindFov) == 0x000014, "Wrong size on ProjectionSymbol_BP_C_FindFov");
static_assert(offsetof(ProjectionSymbol_BP_C_FindFov, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'ProjectionSymbol_BP_C_FindFov::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_FindFov, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'ProjectionSymbol_BP_C_FindFov::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_FindFov, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'ProjectionSymbol_BP_C_FindFov::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_FindFov, CallFunc_DegAsin_ReturnValue) == 0x00000C, "Member 'ProjectionSymbol_BP_C_FindFov::CallFunc_DegAsin_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_FindFov, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000010, "Member 'ProjectionSymbol_BP_C_FindFov::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.FixUp
// 0x0001 (0x0001 - 0x0000)
struct ProjectionSymbol_BP_C_FixUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectionSymbol_BP_C_FixUp) == 0x000001, "Wrong alignment on ProjectionSymbol_BP_C_FixUp");
static_assert(sizeof(ProjectionSymbol_BP_C_FixUp) == 0x000001, "Wrong size on ProjectionSymbol_BP_C_FixUp");
static_assert(offsetof(ProjectionSymbol_BP_C_FixUp, ReturnValue) == 0x000000, "Member 'ProjectionSymbol_BP_C_FixUp::ReturnValue' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.Set Gizmo
// 0x0150 (0x0150 - 0x0000)
struct ProjectionSymbol_BP_C_Set_Gizmo final
{
public:
	float                                         _PreviousDistance;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _PreviousActorPos;                                 // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _PreviousAnchor;                                   // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorLocalOffset_SweepHitResult;    // 0x0040(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00D0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_InverseTransformRotation_ReturnValue;     // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IsPropertyWidgetSelected_outWidgetIndex;  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPropertyWidgetSelected_ReturnValue;     // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectionSymbol_BP_C_Set_Gizmo) == 0x000010, "Wrong alignment on ProjectionSymbol_BP_C_Set_Gizmo");
static_assert(sizeof(ProjectionSymbol_BP_C_Set_Gizmo) == 0x000150, "Wrong size on ProjectionSymbol_BP_C_Set_Gizmo");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, _PreviousDistance) == 0x000000, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::_PreviousDistance' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, _PreviousActorPos) == 0x000004, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::_PreviousActorPos' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, _PreviousAnchor) == 0x000010, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::_PreviousAnchor' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_MakeVector_ReturnValue) == 0x000014, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_Vector_Distance_ReturnValue) == 0x000020, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_Add_FloatFloat_ReturnValue) == 0x000028, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_MakeVector_ReturnValue_1) == 0x00002C, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_Vector_Distance_ReturnValue_1) == 0x000038, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_K2_AddActorLocalOffset_SweepHitResult) == 0x000040, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_K2_AddActorLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_GetTransform_ReturnValue) == 0x0000D0, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000100, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_InverseTransformRotation_ReturnValue) == 0x00010C, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_InverseTransformRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000118, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000124, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_Add_VectorVector_ReturnValue) == 0x000130, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00013C, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_IsPropertyWidgetSelected_outWidgetIndex) == 0x000148, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_IsPropertyWidgetSelected_outWidgetIndex' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_Set_Gizmo, CallFunc_IsPropertyWidgetSelected_ReturnValue) == 0x00014C, "Member 'ProjectionSymbol_BP_C_Set_Gizmo::CallFunc_IsPropertyWidgetSelected_ReturnValue' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.ClearDebugProjectFlags
// 0x0038 (0x0038 - 0x0000)
struct ProjectionSymbol_BP_C_ClearDebugProjectFlags final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AProjectionSymbol_BP_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProjectionSymbol_BP_C*                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectionSymbol_BP_C_ClearDebugProjectFlags) == 0x000008, "Wrong alignment on ProjectionSymbol_BP_C_ClearDebugProjectFlags");
static_assert(sizeof(ProjectionSymbol_BP_C_ClearDebugProjectFlags) == 0x000038, "Wrong size on ProjectionSymbol_BP_C_ClearDebugProjectFlags");
static_assert(offsetof(ProjectionSymbol_BP_C_ClearDebugProjectFlags, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ProjectionSymbol_BP_C_ClearDebugProjectFlags::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_ClearDebugProjectFlags, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ProjectionSymbol_BP_C_ClearDebugProjectFlags::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_ClearDebugProjectFlags, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ProjectionSymbol_BP_C_ClearDebugProjectFlags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_ClearDebugProjectFlags, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'ProjectionSymbol_BP_C_ClearDebugProjectFlags::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_ClearDebugProjectFlags, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ProjectionSymbol_BP_C_ClearDebugProjectFlags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_ClearDebugProjectFlags, CallFunc_Array_Get_Item) == 0x000028, "Member 'ProjectionSymbol_BP_C_ClearDebugProjectFlags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_ClearDebugProjectFlags, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'ProjectionSymbol_BP_C_ClearDebugProjectFlags::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.ResetEditorTexture
// 0x0020 (0x0020 - 0x0000)
struct ProjectionSymbol_BP_C_ResetEditorTexture final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_DynamicCast_AsTexture;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectionSymbol_BP_C_ResetEditorTexture) == 0x000008, "Wrong alignment on ProjectionSymbol_BP_C_ResetEditorTexture");
static_assert(sizeof(ProjectionSymbol_BP_C_ResetEditorTexture) == 0x000020, "Wrong size on ProjectionSymbol_BP_C_ResetEditorTexture");
static_assert(offsetof(ProjectionSymbol_BP_C_ResetEditorTexture, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'ProjectionSymbol_BP_C_ResetEditorTexture::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_ResetEditorTexture, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000008, "Member 'ProjectionSymbol_BP_C_ResetEditorTexture::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_ResetEditorTexture, K2Node_DynamicCast_AsTexture) == 0x000010, "Member 'ProjectionSymbol_BP_C_ResetEditorTexture::K2Node_DynamicCast_AsTexture' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_ResetEditorTexture, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ProjectionSymbol_BP_C_ResetEditorTexture::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.PreviousClue
// 0x0048 (0x0048 - 0x0000)
struct ProjectionSymbol_BP_C_PreviousClue final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture*>                       CallFunc_Map_Values_Values;                        // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectionSymbol_BP_C_PreviousClue) == 0x000008, "Wrong alignment on ProjectionSymbol_BP_C_PreviousClue");
static_assert(sizeof(ProjectionSymbol_BP_C_PreviousClue) == 0x000048, "Wrong size on ProjectionSymbol_BP_C_PreviousClue");
static_assert(offsetof(ProjectionSymbol_BP_C_PreviousClue, Index_0) == 0x000000, "Member 'ProjectionSymbol_BP_C_PreviousClue::Index_0' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_PreviousClue, Temp_int_Variable) == 0x000004, "Member 'ProjectionSymbol_BP_C_PreviousClue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_PreviousClue, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'ProjectionSymbol_BP_C_PreviousClue::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_PreviousClue, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ProjectionSymbol_BP_C_PreviousClue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_PreviousClue, CallFunc_Map_Values_Values) == 0x000010, "Member 'ProjectionSymbol_BP_C_PreviousClue::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_PreviousClue, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ProjectionSymbol_BP_C_PreviousClue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_PreviousClue, CallFunc_Array_Get_Item) == 0x000028, "Member 'ProjectionSymbol_BP_C_PreviousClue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_PreviousClue, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000030, "Member 'ProjectionSymbol_BP_C_PreviousClue::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_PreviousClue, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000034, "Member 'ProjectionSymbol_BP_C_PreviousClue::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_PreviousClue, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'ProjectionSymbol_BP_C_PreviousClue::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_PreviousClue, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000040, "Member 'ProjectionSymbol_BP_C_PreviousClue::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.NextClue
// 0x0050 (0x0050 - 0x0000)
struct ProjectionSymbol_BP_C_NextClue final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture*>                       CallFunc_Map_Values_Values;                        // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectionSymbol_BP_C_NextClue) == 0x000008, "Wrong alignment on ProjectionSymbol_BP_C_NextClue");
static_assert(sizeof(ProjectionSymbol_BP_C_NextClue) == 0x000050, "Wrong size on ProjectionSymbol_BP_C_NextClue");
static_assert(offsetof(ProjectionSymbol_BP_C_NextClue, Index_0) == 0x000000, "Member 'ProjectionSymbol_BP_C_NextClue::Index_0' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_NextClue, Temp_int_Variable) == 0x000004, "Member 'ProjectionSymbol_BP_C_NextClue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_NextClue, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ProjectionSymbol_BP_C_NextClue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_NextClue, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'ProjectionSymbol_BP_C_NextClue::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_NextClue, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'ProjectionSymbol_BP_C_NextClue::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_NextClue, CallFunc_Map_Values_Values) == 0x000018, "Member 'ProjectionSymbol_BP_C_NextClue::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_NextClue, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'ProjectionSymbol_BP_C_NextClue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_NextClue, CallFunc_Array_Get_Item) == 0x000030, "Member 'ProjectionSymbol_BP_C_NextClue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_NextClue, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'ProjectionSymbol_BP_C_NextClue::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_NextClue, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'ProjectionSymbol_BP_C_NextClue::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_NextClue, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'ProjectionSymbol_BP_C_NextClue::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_NextClue, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'ProjectionSymbol_BP_C_NextClue::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.UpdateClueTexutre
// 0x0030 (0x0030 - 0x0000)
struct ProjectionSymbol_BP_C_UpdateClueTexutre final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture*>                       CallFunc_Map_Values_Values;                        // 0x0008(0x0010)(ReferenceParm)
	class UTexture*                               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_Map_Find_Value;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectionSymbol_BP_C_UpdateClueTexutre) == 0x000008, "Wrong alignment on ProjectionSymbol_BP_C_UpdateClueTexutre");
static_assert(sizeof(ProjectionSymbol_BP_C_UpdateClueTexutre) == 0x000030, "Wrong size on ProjectionSymbol_BP_C_UpdateClueTexutre");
static_assert(offsetof(ProjectionSymbol_BP_C_UpdateClueTexutre, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'ProjectionSymbol_BP_C_UpdateClueTexutre::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_UpdateClueTexutre, CallFunc_Map_Values_Values) == 0x000008, "Member 'ProjectionSymbol_BP_C_UpdateClueTexutre::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_UpdateClueTexutre, CallFunc_Array_Get_Item) == 0x000018, "Member 'ProjectionSymbol_BP_C_UpdateClueTexutre::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_UpdateClueTexutre, CallFunc_Map_Find_Value) == 0x000020, "Member 'ProjectionSymbol_BP_C_UpdateClueTexutre::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_UpdateClueTexutre, CallFunc_Map_Find_ReturnValue) == 0x000028, "Member 'ProjectionSymbol_BP_C_UpdateClueTexutre::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.SetMaterial
// 0x0048 (0x0048 - 0x0000)
struct ProjectionSymbol_BP_C_SetMaterial final
{
public:
	bool                                          Force;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDecalDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProjectionSymbol_BP_C_SetMaterial) == 0x000008, "Wrong alignment on ProjectionSymbol_BP_C_SetMaterial");
static_assert(sizeof(ProjectionSymbol_BP_C_SetMaterial) == 0x000048, "Wrong size on ProjectionSymbol_BP_C_SetMaterial");
static_assert(offsetof(ProjectionSymbol_BP_C_SetMaterial, Force) == 0x000000, "Member 'ProjectionSymbol_BP_C_SetMaterial::Force' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_SetMaterial, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'ProjectionSymbol_BP_C_SetMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_SetMaterial, CallFunc_IsDedicatedServer_ReturnValue) == 0x000002, "Member 'ProjectionSymbol_BP_C_SetMaterial::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_SetMaterial, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'ProjectionSymbol_BP_C_SetMaterial::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_SetMaterial, CallFunc_BreakVector_X) == 0x000010, "Member 'ProjectionSymbol_BP_C_SetMaterial::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_SetMaterial, CallFunc_BreakVector_Y) == 0x000014, "Member 'ProjectionSymbol_BP_C_SetMaterial::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_SetMaterial, CallFunc_BreakVector_Z) == 0x000018, "Member 'ProjectionSymbol_BP_C_SetMaterial::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_SetMaterial, CallFunc_Add_FloatFloat_ReturnValue) == 0x00001C, "Member 'ProjectionSymbol_BP_C_SetMaterial::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_SetMaterial, CallFunc_MakeColor_ReturnValue) == 0x000020, "Member 'ProjectionSymbol_BP_C_SetMaterial::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_SetMaterial, K2Node_MakeStruct_LinearColor) == 0x000030, "Member 'ProjectionSymbol_BP_C_SetMaterial::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_SetMaterial, CallFunc_CreateDecalDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'ProjectionSymbol_BP_C_SetMaterial::CallFunc_CreateDecalDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.getDepthTexture
// 0x0108 (0x0108 - 0x0000)
struct ProjectionSymbol_BP_C_GetDepthTexture final
{
public:
	TScriptInterface<class IAssetRegistry>        CallFunc_GetAssetRegistry_ReturnValue;             // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAssetData                             CallFunc_GetAssetByObjectPath_ReturnValue;         // 0x0068(0x0060)(HasGetValueTypeHash)
	class UObject*                                CallFunc_GetAsset_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x00E0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(ProjectionSymbol_BP_C_GetDepthTexture) == 0x000008, "Wrong alignment on ProjectionSymbol_BP_C_GetDepthTexture");
static_assert(sizeof(ProjectionSymbol_BP_C_GetDepthTexture) == 0x000108, "Wrong size on ProjectionSymbol_BP_C_GetDepthTexture");
static_assert(offsetof(ProjectionSymbol_BP_C_GetDepthTexture, CallFunc_GetAssetRegistry_ReturnValue) == 0x000000, "Member 'ProjectionSymbol_BP_C_GetDepthTexture::CallFunc_GetAssetRegistry_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetDepthTexture, CallFunc_GetSubstring_ReturnValue) == 0x000010, "Member 'ProjectionSymbol_BP_C_GetDepthTexture::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetDepthTexture, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'ProjectionSymbol_BP_C_GetDepthTexture::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetDepthTexture, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'ProjectionSymbol_BP_C_GetDepthTexture::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetDepthTexture, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000040, "Member 'ProjectionSymbol_BP_C_GetDepthTexture::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetDepthTexture, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000050, "Member 'ProjectionSymbol_BP_C_GetDepthTexture::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetDepthTexture, CallFunc_Conv_StringToName_ReturnValue) == 0x000060, "Member 'ProjectionSymbol_BP_C_GetDepthTexture::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetDepthTexture, CallFunc_GetAssetByObjectPath_ReturnValue) == 0x000068, "Member 'ProjectionSymbol_BP_C_GetDepthTexture::CallFunc_GetAssetByObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetDepthTexture, CallFunc_GetAsset_ReturnValue) == 0x0000C8, "Member 'ProjectionSymbol_BP_C_GetDepthTexture::CallFunc_GetAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetDepthTexture, K2Node_DynamicCast_AsTexture_2D) == 0x0000D0, "Member 'ProjectionSymbol_BP_C_GetDepthTexture::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetDepthTexture, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'ProjectionSymbol_BP_C_GetDepthTexture::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_GetDepthTexture, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0000E0, "Member 'ProjectionSymbol_BP_C_GetDepthTexture::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.CaptureDepth
// 0x0090 (0x0090 - 0x0000)
struct ProjectionSymbol_BP_C_CaptureDepth final
{
public:
	TArray<TSoftObjectPtr<class AActor>>          CallFunc_GetFullExcludeList_FullExcludeList;       // 0x0000(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInEditor_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACaptureTextureDepth_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProjectionSymbol_BP_C_CaptureDepth) == 0x000010, "Wrong alignment on ProjectionSymbol_BP_C_CaptureDepth");
static_assert(sizeof(ProjectionSymbol_BP_C_CaptureDepth) == 0x000090, "Wrong size on ProjectionSymbol_BP_C_CaptureDepth");
static_assert(offsetof(ProjectionSymbol_BP_C_CaptureDepth, CallFunc_GetFullExcludeList_FullExcludeList) == 0x000000, "Member 'ProjectionSymbol_BP_C_CaptureDepth::CallFunc_GetFullExcludeList_FullExcludeList' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_CaptureDepth, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'ProjectionSymbol_BP_C_CaptureDepth::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_CaptureDepth, CallFunc_MakeVector_ReturnValue) == 0x00001C, "Member 'ProjectionSymbol_BP_C_CaptureDepth::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_CaptureDepth, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000028, "Member 'ProjectionSymbol_BP_C_CaptureDepth::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_CaptureDepth, CallFunc_Add_VectorVector_ReturnValue) == 0x000034, "Member 'ProjectionSymbol_BP_C_CaptureDepth::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_CaptureDepth, CallFunc_IsInEditor_ReturnValue) == 0x000040, "Member 'ProjectionSymbol_BP_C_CaptureDepth::CallFunc_IsInEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_CaptureDepth, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'ProjectionSymbol_BP_C_CaptureDepth::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_CaptureDepth, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'ProjectionSymbol_BP_C_CaptureDepth::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionSymbol_BP_C_CaptureDepth, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'ProjectionSymbol_BP_C_CaptureDepth::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function ProjectionSymbol_BP.ProjectionSymbol_BP_C.UserConstructionScript
// 0x06D0 (0x06D0 - 0x0000)
struct ProjectionSymbol_BP_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue_1;         // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSettings_Anim*                       CallFunc_GetRBSettings_Anim_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInEditor_ReturnValue;                   // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
