#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectionClue_NarrativeScreen_BP_Child

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ProjectionClue_NarrativeScreen_BP_Child.ProjectionClue_NarrativeScreen_BP_Child_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct ProjectionClue_NarrativeScreen_BP_Child_C_UserConstructionScript final
{
public:
	class URBPlayerInvestigationZoneComponent*    NewLocalVar_0;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProjectionClue_NarrativeScreen_BP_Child_C_UserConstructionScript) == 0x000008, "Wrong alignment on ProjectionClue_NarrativeScreen_BP_Child_C_UserConstructionScript");
static_assert(sizeof(ProjectionClue_NarrativeScreen_BP_Child_C_UserConstructionScript) == 0x000010, "Wrong size on ProjectionClue_NarrativeScreen_BP_Child_C_UserConstructionScript");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_UserConstructionScript, NewLocalVar_0) == 0x000000, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_UserConstructionScript::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ProjectionClue_NarrativeScreen_BP_Child.ProjectionClue_NarrativeScreen_BP_Child_C.GetCluePure
// 0x0038 (0x0038 - 0x0000)
struct ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure final
{
public:
	struct FClueData                              Clue;                                              // 0x0000(0x0008)(Parm, OutParm, NoDestructor)
	struct FClueData                              CallFunc_GetCluePure_Clue;                         // 0x0008(0x0008)(NoDestructor)
	class AProjection_TvChannel_BP_C*             K2Node_DynamicCast_AsProjection_Tv_Channel_BP;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IRBClueable>           CallFunc_GetClue_self_CastInput;                   // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FClueData                              CallFunc_GetClue_ReturnValue;                      // 0x0030(0x0008)(NoDestructor)
};
static_assert(alignof(ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure) == 0x000008, "Wrong alignment on ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure");
static_assert(sizeof(ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure) == 0x000038, "Wrong size on ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure, Clue) == 0x000000, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure::Clue' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure, CallFunc_GetCluePure_Clue) == 0x000008, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure::CallFunc_GetCluePure_Clue' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure, K2Node_DynamicCast_AsProjection_Tv_Channel_BP) == 0x000010, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure::K2Node_DynamicCast_AsProjection_Tv_Channel_BP' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure, CallFunc_GetClue_self_CastInput) == 0x000020, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure::CallFunc_GetClue_self_CastInput' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure, CallFunc_GetClue_ReturnValue) == 0x000030, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetCluePure::CallFunc_GetClue_ReturnValue' has a wrong offset!");

// Function ProjectionClue_NarrativeScreen_BP_Child.ProjectionClue_NarrativeScreen_BP_Child_C.GetPlayerPingData
// 0x01E0 (0x01E0 - 0x0000)
struct ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData final
{
public:
	class ARBPlayer*                              PingOwner;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0008(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FPlayerPingData                        OutData;                                           // 0x0090(0x0030)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClueData                              CallFunc_GetCluePure_Clue;                         // 0x00C4(0x0008)(NoDestructor)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetClueTextFromName_ClueText;             // 0x00E0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0120(0x0018)()
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerPingData                        K2Node_MakeStruct_PlayerPingData;                  // 0x0140(0x0030)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0198(0x0018)()
	struct FPlayerPingData                        K2Node_MakeStruct_PlayerPingData_1;                // 0x01B0(0x0030)()
};
static_assert(alignof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData) == 0x000008, "Wrong alignment on ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData");
static_assert(sizeof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData) == 0x0001E0, "Wrong size on ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, PingOwner) == 0x000000, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::PingOwner' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, HitResult) == 0x000008, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::HitResult' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, OutData) == 0x000090, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::OutData' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, ReturnValue) == 0x0000C0, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, CallFunc_GetCluePure_Clue) == 0x0000C4, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::CallFunc_GetCluePure_Clue' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, CallFunc_Conv_TextToString_ReturnValue) == 0x0000D0, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, CallFunc_GetClueTextFromName_ClueText) == 0x0000E0, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::CallFunc_GetClueTextFromName_ClueText' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000F8, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, CallFunc_TextIsEmpty_ReturnValue) == 0x000108, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, CallFunc_Replace_ReturnValue) == 0x000110, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, CallFunc_Conv_StringToText_ReturnValue) == 0x000120, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, CallFunc_FindSubstring_ReturnValue) == 0x000138, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, K2Node_MakeStruct_PlayerPingData) == 0x000140, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::K2Node_MakeStruct_PlayerPingData' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, CallFunc_Greater_IntInt_ReturnValue) == 0x000170, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, CallFunc_Subtract_IntInt_ReturnValue) == 0x000174, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, CallFunc_Left_ReturnValue) == 0x000178, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, CallFunc_Replace_ReturnValue_1) == 0x000188, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::CallFunc_Replace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000198, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData, K2Node_MakeStruct_PlayerPingData_1) == 0x0001B0, "Member 'ProjectionClue_NarrativeScreen_BP_Child_C_GetPlayerPingData::K2Node_MakeStruct_PlayerPingData_1' has a wrong offset!");

}

