#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProMod_ElectricalConduitsMinus01_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function ProMod_ElectricalConduits-01_BP.ProMod_ElectricalConduits-01_BP_C.WallConnector
// 0x0008 (0x0008 - 0x0000)
struct ProMod_ElectricalConduitsMinus01_BP_C_WallConnector final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProMod_ElectricalConduitsMinus01_BP_C_WallConnector) == 0x000004, "Wrong alignment on ProMod_ElectricalConduitsMinus01_BP_C_WallConnector");
static_assert(sizeof(ProMod_ElectricalConduitsMinus01_BP_C_WallConnector) == 0x000008, "Wrong size on ProMod_ElectricalConduitsMinus01_BP_C_WallConnector");
static_assert(offsetof(ProMod_ElectricalConduitsMinus01_BP_C_WallConnector, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'ProMod_ElectricalConduitsMinus01_BP_C_WallConnector::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_ElectricalConduitsMinus01_BP_C_WallConnector, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'ProMod_ElectricalConduitsMinus01_BP_C_WallConnector::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function ProMod_ElectricalConduits-01_BP.ProMod_ElectricalConduits-01_BP_C.Plug
// 0x0008 (0x0008 - 0x0000)
struct ProMod_ElectricalConduitsMinus01_BP_C_Plug final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProMod_ElectricalConduitsMinus01_BP_C_Plug) == 0x000004, "Wrong alignment on ProMod_ElectricalConduitsMinus01_BP_C_Plug");
static_assert(sizeof(ProMod_ElectricalConduitsMinus01_BP_C_Plug) == 0x000008, "Wrong size on ProMod_ElectricalConduitsMinus01_BP_C_Plug");
static_assert(offsetof(ProMod_ElectricalConduitsMinus01_BP_C_Plug, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'ProMod_ElectricalConduitsMinus01_BP_C_Plug::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_ElectricalConduitsMinus01_BP_C_Plug, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'ProMod_ElectricalConduitsMinus01_BP_C_Plug::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

}

