#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProMod_Manager

#include "Basic.hpp"


namespace SDK::Params
{

// Function ProMod_Manager.ProMod_Manager_C.CreateConnections
// 0x0058 (0x0058 - 0x0000)
struct ProMod_Manager_C_CreateConnections final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AProMod_Parent_C>        CallFunc_Array_Get_Item;                           // 0x0010(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AProMod_Parent_C*                       K2Node_DynamicCast_AsPro_Mod_Parent;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProMod_Manager_C_CreateConnections) == 0x000008, "Wrong alignment on ProMod_Manager_C_CreateConnections");
static_assert(sizeof(ProMod_Manager_C_CreateConnections) == 0x000058, "Wrong size on ProMod_Manager_C_CreateConnections");
static_assert(offsetof(ProMod_Manager_C_CreateConnections, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ProMod_Manager_C_CreateConnections::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_CreateConnections, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ProMod_Manager_C_CreateConnections::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_CreateConnections, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ProMod_Manager_C_CreateConnections::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_CreateConnections, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'ProMod_Manager_C_CreateConnections::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_CreateConnections, CallFunc_Array_Get_Item) == 0x000010, "Member 'ProMod_Manager_C_CreateConnections::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_CreateConnections, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'ProMod_Manager_C_CreateConnections::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_CreateConnections, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000040, "Member 'ProMod_Manager_C_CreateConnections::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_CreateConnections, K2Node_DynamicCast_AsPro_Mod_Parent) == 0x000048, "Member 'ProMod_Manager_C_CreateConnections::K2Node_DynamicCast_AsPro_Mod_Parent' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_CreateConnections, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ProMod_Manager_C_CreateConnections::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ProMod_Manager.ProMod_Manager_C.UserConstructionScript
// 0x0060 (0x0060 - 0x0000)
struct ProMod_Manager_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AProMod_Parent_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	class AProMod_Parent_C*                       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AProMod_Parent_C>        CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0028(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProMod_Manager_C_UserConstructionScript) == 0x000008, "Wrong alignment on ProMod_Manager_C_UserConstructionScript");
static_assert(sizeof(ProMod_Manager_C_UserConstructionScript) == 0x000060, "Wrong size on ProMod_Manager_C_UserConstructionScript");
static_assert(offsetof(ProMod_Manager_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ProMod_Manager_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ProMod_Manager_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ProMod_Manager_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_UserConstructionScript, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'ProMod_Manager_C_UserConstructionScript::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000020, "Member 'ProMod_Manager_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_UserConstructionScript, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000028, "Member 'ProMod_Manager_C_UserConstructionScript::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'ProMod_Manager_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_UserConstructionScript, CallFunc_Array_AddUnique_ReturnValue) == 0x000054, "Member 'ProMod_Manager_C_UserConstructionScript::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProMod_Manager_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'ProMod_Manager_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

