#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProximityDetector_QuestItem_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ProximityDetector_QuestItem_BP.ProximityDetector_QuestItem_BP_C.GetStateName
// 0x0028 (0x0028 - 0x0000)
struct ProximityDetector_QuestItem_BP_C_GetStateName final
{
public:
	class FString                                 StateA;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StateB;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityDetector_QuestItem_BP_C_GetStateName) == 0x000008, "Wrong alignment on ProximityDetector_QuestItem_BP_C_GetStateName");
static_assert(sizeof(ProximityDetector_QuestItem_BP_C_GetStateName) == 0x000028, "Wrong size on ProximityDetector_QuestItem_BP_C_GetStateName");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_GetStateName, StateA) == 0x000000, "Member 'ProximityDetector_QuestItem_BP_C_GetStateName::StateA' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_GetStateName, StateB) == 0x000010, "Member 'ProximityDetector_QuestItem_BP_C_GetStateName::StateB' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_GetStateName, ReturnValue) == 0x000020, "Member 'ProximityDetector_QuestItem_BP_C_GetStateName::ReturnValue' has a wrong offset!");

// Function ProximityDetector_QuestItem_BP.ProximityDetector_QuestItem_BP_C.CheckForProximityChange
// 0x000C (0x000C - 0x0000)
struct ProximityDetector_QuestItem_BP_C_CheckForProximityChange final
{
public:
	bool                                          bSomethingChanged;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bChanged;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EProximityDetectorZLevelState                 CallFunc_GetProximityZLevelState_ReturnValue;      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetProximityLevel_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityDetector_QuestItem_BP_C_CheckForProximityChange) == 0x000004, "Wrong alignment on ProximityDetector_QuestItem_BP_C_CheckForProximityChange");
static_assert(sizeof(ProximityDetector_QuestItem_BP_C_CheckForProximityChange) == 0x00000C, "Wrong size on ProximityDetector_QuestItem_BP_C_CheckForProximityChange");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_CheckForProximityChange, bSomethingChanged) == 0x000000, "Member 'ProximityDetector_QuestItem_BP_C_CheckForProximityChange::bSomethingChanged' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_CheckForProximityChange, bChanged) == 0x000001, "Member 'ProximityDetector_QuestItem_BP_C_CheckForProximityChange::bChanged' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_CheckForProximityChange, CallFunc_GetProximityZLevelState_ReturnValue) == 0x000002, "Member 'ProximityDetector_QuestItem_BP_C_CheckForProximityChange::CallFunc_GetProximityZLevelState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_CheckForProximityChange, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000003, "Member 'ProximityDetector_QuestItem_BP_C_CheckForProximityChange::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_CheckForProximityChange, CallFunc_GetProximityLevel_ReturnValue) == 0x000004, "Member 'ProximityDetector_QuestItem_BP_C_CheckForProximityChange::CallFunc_GetProximityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_CheckForProximityChange, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'ProximityDetector_QuestItem_BP_C_CheckForProximityChange::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function ProximityDetector_QuestItem_BP.ProximityDetector_QuestItem_BP_C.ShouldFogLightBeVisible
// 0x0038 (0x0038 - 0x0000)
struct ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LIghtLevel;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProximityDetectorZLevelState                 Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProximityDetectorZLevelState                 Temp_byte_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EProximityDetectorZLevelState                 CallFunc_GetProximityZLevelState_ReturnValue;      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetProximityLevel_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible) == 0x000004, "Wrong alignment on ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible");
static_assert(sizeof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible) == 0x000038, "Wrong size on ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, ReturnValue) == 0x000000, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, LIghtLevel) == 0x000004, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::LIghtLevel' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, Temp_byte_Variable) == 0x000008, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, Temp_int_Variable) == 0x00000C, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, Temp_int_Variable_1) == 0x000010, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, Temp_int_Variable_2) == 0x000014, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, Temp_int_Variable_3) == 0x000018, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, Temp_byte_Variable_1) == 0x00001C, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, Temp_bool_Variable) == 0x00001D, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, Temp_bool_Variable_1) == 0x00001E, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, Temp_bool_Variable_2) == 0x00001F, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, Temp_bool_Variable_3) == 0x000020, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, CallFunc_GetProximityZLevelState_ReturnValue) == 0x000021, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::CallFunc_GetProximityZLevelState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, CallFunc_GetProximityLevel_ReturnValue) == 0x000024, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::CallFunc_GetProximityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, K2Node_Select_Default) == 0x00002C, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, K2Node_Select_Default_1) == 0x000034, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible, CallFunc_BooleanOR_ReturnValue) == 0x000035, "Member 'ProximityDetector_QuestItem_BP_C_ShouldFogLightBeVisible::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function ProximityDetector_QuestItem_BP.ProximityDetector_QuestItem_BP_C.RefreshFogLight
// 0x0158 (0x0158 - 0x0000)
struct ProximityDetector_QuestItem_BP_C_RefreshFogLight final
{
public:
	int32                                         NumberOfLights;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LightAvgLocation;                                  // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldFogLightBeVisible_ReturnValue;      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ShouldFogLightBeVisible_LIghtLevel;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProximityDetectorZLevelState                 CallFunc_GetProximityZLevelState_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0094(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_GetProximityLevel_ReturnValue;            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityDetector_QuestItem_BP_C_RefreshFogLight) == 0x000008, "Wrong alignment on ProximityDetector_QuestItem_BP_C_RefreshFogLight");
static_assert(sizeof(ProximityDetector_QuestItem_BP_C_RefreshFogLight) == 0x000158, "Wrong size on ProximityDetector_QuestItem_BP_C_RefreshFogLight");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, NumberOfLights) == 0x000000, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::NumberOfLights' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, LightAvgLocation) == 0x000004, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::LightAvgLocation' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, Temp_int_Array_Index_Variable) == 0x000018, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, Temp_int_Variable) == 0x00001C, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, Temp_int_Variable_1) == 0x000020, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_ShouldFogLightBeVisible_ReturnValue) == 0x000024, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_ShouldFogLightBeVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_ShouldFogLightBeVisible_LIghtLevel) == 0x000028, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_ShouldFogLightBeVisible_LIghtLevel' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, Temp_int_Variable_2) == 0x00002C, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000030, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Add_VectorVector_ReturnValue) == 0x000038, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Add_IntInt_ReturnValue_2) == 0x000044, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_GetProximityZLevelState_ReturnValue) == 0x000048, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_GetProximityZLevelState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Add_VectorVector_ReturnValue_1) == 0x00004C, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00005C, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000060, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Add_IntInt_ReturnValue_3) == 0x00006C, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_BreakVector_X) == 0x000070, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_BreakVector_Y) == 0x000074, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_BreakVector_Z) == 0x000078, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_BreakVector_X_1) == 0x00007C, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_BreakVector_Y_1) == 0x000080, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_BreakVector_Z_1) == 0x000084, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_MakeVector_ReturnValue) == 0x000088, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000094, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_GetProximityLevel_ReturnValue) == 0x00011C, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_GetProximityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Greater_IntInt_ReturnValue) == 0x000120, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Array_Get_Item) == 0x000128, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Array_Length_ReturnValue) == 0x000130, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000134, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Less_IntInt_ReturnValue) == 0x000140, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Array_Length_ReturnValue_1) == 0x000144, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000148, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00014C, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshFogLight, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000150, "Member 'ProximityDetector_QuestItem_BP_C_RefreshFogLight::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function ProximityDetector_QuestItem_BP.ProximityDetector_QuestItem_BP_C.StartAudioLoop
// 0x0004 (0x0004 - 0x0000)
struct ProximityDetector_QuestItem_BP_C_StartAudioLoop final
{
public:
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityDetector_QuestItem_BP_C_StartAudioLoop) == 0x000004, "Wrong alignment on ProximityDetector_QuestItem_BP_C_StartAudioLoop");
static_assert(sizeof(ProximityDetector_QuestItem_BP_C_StartAudioLoop) == 0x000004, "Wrong size on ProximityDetector_QuestItem_BP_C_StartAudioLoop");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_StartAudioLoop, CallFunc_PlayLoopingSoundOnActor_ReturnValue) == 0x000000, "Member 'ProximityDetector_QuestItem_BP_C_StartAudioLoop::CallFunc_PlayLoopingSoundOnActor_ReturnValue' has a wrong offset!");

// Function ProximityDetector_QuestItem_BP.ProximityDetector_QuestItem_BP_C.RefreshAudioState
// 0x0028 (0x0028 - 0x0000)
struct ProximityDetector_QuestItem_BP_C_RefreshAudioState final
{
public:
	bool                                          bAllowAudio;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetProximityLevel_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetProximityLevel_ReturnValue_1;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityDetector_QuestItem_BP_C_RefreshAudioState) == 0x000004, "Wrong alignment on ProximityDetector_QuestItem_BP_C_RefreshAudioState");
static_assert(sizeof(ProximityDetector_QuestItem_BP_C_RefreshAudioState) == 0x000028, "Wrong size on ProximityDetector_QuestItem_BP_C_RefreshAudioState");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshAudioState, bAllowAudio) == 0x000000, "Member 'ProximityDetector_QuestItem_BP_C_RefreshAudioState::bAllowAudio' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshAudioState, CallFunc_IsDedicatedServer_ReturnValue) == 0x000001, "Member 'ProximityDetector_QuestItem_BP_C_RefreshAudioState::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshAudioState, CallFunc_GetProximityLevel_ReturnValue) == 0x000004, "Member 'ProximityDetector_QuestItem_BP_C_RefreshAudioState::CallFunc_GetProximityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshAudioState, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'ProximityDetector_QuestItem_BP_C_RefreshAudioState::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshAudioState, CallFunc_GetProximityLevel_ReturnValue_1) == 0x00000C, "Member 'ProximityDetector_QuestItem_BP_C_RefreshAudioState::CallFunc_GetProximityLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshAudioState, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'ProximityDetector_QuestItem_BP_C_RefreshAudioState::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshAudioState, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'ProximityDetector_QuestItem_BP_C_RefreshAudioState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshAudioState, CallFunc_BooleanAND_ReturnValue) == 0x000018, "Member 'ProximityDetector_QuestItem_BP_C_RefreshAudioState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshAudioState, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00001C, "Member 'ProximityDetector_QuestItem_BP_C_RefreshAudioState::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshAudioState, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'ProximityDetector_QuestItem_BP_C_RefreshAudioState::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_RefreshAudioState, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000024, "Member 'ProximityDetector_QuestItem_BP_C_RefreshAudioState::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function ProximityDetector_QuestItem_BP.ProximityDetector_QuestItem_BP_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct ProximityDetector_QuestItem_BP_C_UserConstructionScript final
{
public:
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ProximityDetector_QuestItem_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on ProximityDetector_QuestItem_BP_C_UserConstructionScript");
static_assert(sizeof(ProximityDetector_QuestItem_BP_C_UserConstructionScript) == 0x000010, "Wrong size on ProximityDetector_QuestItem_BP_C_UserConstructionScript");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'ProximityDetector_QuestItem_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");

// Function ProximityDetector_QuestItem_BP.ProximityDetector_QuestItem_BP_C.PrepareState
// 0x0010 (0x0010 - 0x0000)
struct ProximityDetector_QuestItem_BP_C_PrepareState final
{
public:
	bool                                          bStateA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RandomOwner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityDetector_QuestItem_BP_C_PrepareState) == 0x000008, "Wrong alignment on ProximityDetector_QuestItem_BP_C_PrepareState");
static_assert(sizeof(ProximityDetector_QuestItem_BP_C_PrepareState) == 0x000010, "Wrong size on ProximityDetector_QuestItem_BP_C_PrepareState");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_PrepareState, bStateA) == 0x000000, "Member 'ProximityDetector_QuestItem_BP_C_PrepareState::bStateA' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_PrepareState, RandomOwner) == 0x000008, "Member 'ProximityDetector_QuestItem_BP_C_PrepareState::RandomOwner' has a wrong offset!");

// Function ProximityDetector_QuestItem_BP.ProximityDetector_QuestItem_BP_C.SetShouldBeIgnoredForLots
// 0x0001 (0x0001 - 0x0000)
struct ProximityDetector_QuestItem_BP_C_SetShouldBeIgnoredForLots final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityDetector_QuestItem_BP_C_SetShouldBeIgnoredForLots) == 0x000001, "Wrong alignment on ProximityDetector_QuestItem_BP_C_SetShouldBeIgnoredForLots");
static_assert(sizeof(ProximityDetector_QuestItem_BP_C_SetShouldBeIgnoredForLots) == 0x000001, "Wrong size on ProximityDetector_QuestItem_BP_C_SetShouldBeIgnoredForLots");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_SetShouldBeIgnoredForLots, bValue) == 0x000000, "Member 'ProximityDetector_QuestItem_BP_C_SetShouldBeIgnoredForLots::bValue' has a wrong offset!");

// Function ProximityDetector_QuestItem_BP.ProximityDetector_QuestItem_BP_C.SetState
// 0x0001 (0x0001 - 0x0000)
struct ProximityDetector_QuestItem_BP_C_SetState final
{
public:
	bool                                          bStateA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityDetector_QuestItem_BP_C_SetState) == 0x000001, "Wrong alignment on ProximityDetector_QuestItem_BP_C_SetState");
static_assert(sizeof(ProximityDetector_QuestItem_BP_C_SetState) == 0x000001, "Wrong size on ProximityDetector_QuestItem_BP_C_SetState");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_SetState, bStateA) == 0x000000, "Member 'ProximityDetector_QuestItem_BP_C_SetState::bStateA' has a wrong offset!");

// Function ProximityDetector_QuestItem_BP.ProximityDetector_QuestItem_BP_C.ExecuteUbergraph_ProximityDetector_QuestItem_BP
// 0x0138 (0x0138 - 0x0000)
struct ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckForProximityChange_bSomethingChanged; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EProximityDetectorZLevelState                 Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProximityDetectorZLevelState                 Temp_byte_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0090(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStateA_1;                            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_randomOwner;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bValue;                               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStateA;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetProximityLevel_ReturnValue;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                CallFunc_GetPawnOwner_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_DynamicCast_AsRB_Player;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPickup*                              CallFunc_GetCurrentEquippedItem_ReturnValue;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProximityDetectorZLevelState                 CallFunc_GetProximityZLevelState_ReturnValue;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProximityDetectorZLevelState                 CallFunc_GetProximityZLevelState_ReturnValue_1;    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x010C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsCurrentlyEquipped_ReturnValue;       // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11F[0x1];                                      // 0x011F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP) == 0x000008, "Wrong alignment on ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP");
static_assert(sizeof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP) == 0x000138, "Wrong size on ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, EntryPoint) == 0x000000, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, CallFunc_CheckForProximityChange_bSomethingChanged) == 0x000004, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::CallFunc_CheckForProximityChange_bSomethingChanged' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, Temp_byte_Variable) == 0x000005, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, Temp_struct_Variable) == 0x000008, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, Temp_struct_Variable_1) == 0x000018, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, Temp_struct_Variable_2) == 0x000028, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, Temp_struct_Variable_3) == 0x000038, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, Temp_byte_Variable_1) == 0x000048, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, Temp_struct_Variable_4) == 0x00004C, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, Temp_struct_Variable_5) == 0x00005C, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, Temp_struct_Variable_6) == 0x00006C, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, Temp_struct_Variable_7) == 0x00007C, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, Temp_int_Array_Index_Variable) == 0x00008C, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, Temp_delegate_Variable) == 0x000090, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000A0, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, K2Node_Event_bStateA_1) == 0x0000A1, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::K2Node_Event_bStateA_1' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, K2Node_Event_randomOwner) == 0x0000A8, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::K2Node_Event_randomOwner' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, K2Node_Event_bValue) == 0x0000B0, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::K2Node_Event_bValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, K2Node_Event_bStateA) == 0x0000B1, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::K2Node_Event_bStateA' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, Temp_int_Loop_Counter_Variable) == 0x0000B4, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, CallFunc_Add_IntInt_ReturnValue) == 0x0000C4, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, CallFunc_GetProximityLevel_ReturnValue) == 0x0000CC, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::CallFunc_GetProximityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, CallFunc_GetPawnOwner_ReturnValue) == 0x0000D0, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::CallFunc_GetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D8, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, K2Node_DynamicCast_AsRB_Player) == 0x0000E0, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::K2Node_DynamicCast_AsRB_Player' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP, CallFunc_IsValid_ReturnValue) == 0x0000E9, "Member 'ProximityDetector_QuestItem_BP_C_ExecuteUbergraph_ProximityDetector_QuestItem_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
