#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProximityTrigger_QuestItem_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.GetStateName
// 0x0028 (0x0028 - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_GetStateName final
{
public:
	class FString                                 StateA;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StateB;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_GetStateName) == 0x000008, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_GetStateName");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_GetStateName) == 0x000028, "Wrong size on ProximityTrigger_QuestItem_BP_C_GetStateName");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetStateName, StateA) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_GetStateName::StateA' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetStateName, StateB) == 0x000010, "Member 'ProximityTrigger_QuestItem_BP_C_GetStateName::StateB' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetStateName, ReturnValue) == 0x000020, "Member 'ProximityTrigger_QuestItem_BP_C_GetStateName::ReturnValue' has a wrong offset!");

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.RefreshDeviceVisualState
// 0x0028 (0x0028 - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState final
{
public:
	bool                                          bForce;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsCurrentlyEquipped_ReturnValue;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_GetLightColor_MaterialColor;              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLightColor_LightColor;                 // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLightColor_LightIntensity;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState) == 0x000004, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState) == 0x000028, "Wrong size on ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState, bForce) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState::bForce' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState, CallFunc_IsDedicatedServer_ReturnValue) == 0x000001, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState, CallFunc_BP_IsCurrentlyEquipped_ReturnValue) == 0x000002, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState::CallFunc_BP_IsCurrentlyEquipped_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState, CallFunc_GetLightColor_MaterialColor) == 0x000004, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState::CallFunc_GetLightColor_MaterialColor' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState, CallFunc_GetLightColor_LightColor) == 0x000014, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState::CallFunc_GetLightColor_LightColor' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState, CallFunc_GetLightColor_LightIntensity) == 0x000024, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshDeviceVisualState::CallFunc_GetLightColor_LightIntensity' has a wrong offset!");

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.GetLightColor
// 0x0098 (0x0098 - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_GetLightColor final
{
public:
	struct FLinearColor                           MaterialColor;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightColor;                                        // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightIntensity;                                    // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Scapegoat_Bulb_Flash_Ratio_OutFlashRatio; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetScapegoatLockedBulbData_MeshMaterialData; // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetScapegoatLockedBulbData_LightColor;    // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScapegoatLockedBulbData_Intensity;     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBProximityDetectableComponent*        CallFunc_GetProximityComponentDetected_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHoldingButton_ReturnValue;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetProgressRatio_ReturnValue;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Scapegoat_Bulb_Flash_Ratio_OutFlashRatio_1; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetScapegoatBulbData_MeshMaterialColor;   // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetScapegoatBulbData_LightColor;          // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScapegoatBulbData_LightIntensity;      // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_GetLightColor) == 0x000008, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_GetLightColor");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_GetLightColor) == 0x000098, "Wrong size on ProximityTrigger_QuestItem_BP_C_GetLightColor");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, MaterialColor) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::MaterialColor' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, LightColor) == 0x000010, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::LightColor' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, LightIntensity) == 0x000020, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::LightIntensity' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_Get_Scapegoat_Bulb_Flash_Ratio_OutFlashRatio) == 0x000024, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_Get_Scapegoat_Bulb_Flash_Ratio_OutFlashRatio' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_MakeLiteralByte_ReturnValue) == 0x000028, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_GetScapegoatLockedBulbData_MeshMaterialData) == 0x00002C, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_GetScapegoatLockedBulbData_MeshMaterialData' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_GetScapegoatLockedBulbData_LightColor) == 0x00003C, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_GetScapegoatLockedBulbData_LightColor' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_GetScapegoatLockedBulbData_Intensity) == 0x00004C, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_GetScapegoatLockedBulbData_Intensity' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000050, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_GetProximityComponentDetected_ReturnValue) == 0x000058, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_GetProximityComponentDetected_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_IsHoldingButton_ReturnValue) == 0x000060, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_IsHoldingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_BooleanAND_ReturnValue) == 0x000062, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_BooleanOR_ReturnValue) == 0x000063, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_GetProgressRatio_ReturnValue) == 0x000064, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_GetProgressRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_SelectFloat_ReturnValue) == 0x000068, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_Get_Scapegoat_Bulb_Flash_Ratio_OutFlashRatio_1) == 0x00006C, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_Get_Scapegoat_Bulb_Flash_Ratio_OutFlashRatio_1' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_GetScapegoatBulbData_MeshMaterialColor) == 0x000070, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_GetScapegoatBulbData_MeshMaterialColor' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_GetScapegoatBulbData_LightColor) == 0x000080, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_GetScapegoatBulbData_LightColor' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_GetLightColor, CallFunc_GetScapegoatBulbData_LightIntensity) == 0x000090, "Member 'ProximityTrigger_QuestItem_BP_C_GetLightColor::CallFunc_GetScapegoatBulbData_LightIntensity' has a wrong offset!");

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.PlayLoopingProximitySound
// 0x000C (0x000C - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound final
{
public:
	EProximityDetectorDeviceState                 Index_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProximityDetectorDeviceState                 Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound) == 0x000004, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound) == 0x00000C, "Wrong size on ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound, Index_0) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound::Index_0' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound, Temp_byte_Variable) == 0x000001, "Member 'ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound, Temp_bool_Variable) == 0x000002, "Member 'ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound, Temp_bool_Variable_1) == 0x000003, "Member 'ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound, Temp_bool_Variable_2) == 0x000004, "Member 'ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound, K2Node_Select_Default) == 0x000005, "Member 'ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound, CallFunc_PlayLoopingSoundOnActor_ReturnValue) == 0x000008, "Member 'ProximityTrigger_QuestItem_BP_C_PlayLoopingProximitySound::CallFunc_PlayLoopingSoundOnActor_ReturnValue' has a wrong offset!");

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.PlayLEDSound
// 0x0020 (0x0020 - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_PlayLEDSound final
{
public:
	class URBProximityDetectableComponent*        CallFunc_GetProximityComponentDetected_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x000C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_PlayLEDSound) == 0x000008, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_PlayLEDSound");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_PlayLEDSound) == 0x000020, "Wrong size on ProximityTrigger_QuestItem_BP_C_PlayLEDSound");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_PlayLEDSound, CallFunc_GetProximityComponentDetected_ReturnValue) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_PlayLEDSound::CallFunc_GetProximityComponentDetected_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_PlayLEDSound, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'ProximityTrigger_QuestItem_BP_C_PlayLEDSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_PlayLEDSound, Temp_delegate_Variable) == 0x00000C, "Member 'ProximityTrigger_QuestItem_BP_C_PlayLEDSound::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_PlayLEDSound, CallFunc_PostEventOnActor_ReturnValue) == 0x00001C, "Member 'ProximityTrigger_QuestItem_BP_C_PlayLEDSound::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.UpdateProgressLoopRTPC
// 0x0004 (0x0004 - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_UpdateProgressLoopRTPC final
{
public:
	float                                         CallFunc_BP_GetProgress_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_UpdateProgressLoopRTPC) == 0x000004, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_UpdateProgressLoopRTPC");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_UpdateProgressLoopRTPC) == 0x000004, "Wrong size on ProximityTrigger_QuestItem_BP_C_UpdateProgressLoopRTPC");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateProgressLoopRTPC, CallFunc_BP_GetProgress_ReturnValue) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateProgressLoopRTPC::CallFunc_BP_GetProgress_ReturnValue' has a wrong offset!");

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.UpdateArrowLocation
// 0x00C8 (0x00C8 - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation final
{
public:
	float                                         ShakeOffset;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HoldProgressRatio;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BP_GetProgress_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTime_ReturnValue;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0040(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation) == 0x000004, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation) == 0x0000C8, "Wrong size on ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, ShakeOffset) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::ShakeOffset' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, HoldProgressRatio) == 0x000004, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::HoldProgressRatio' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, CallFunc_IsDedicatedServer_ReturnValue) == 0x00000C, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, CallFunc_BP_GetProgress_ReturnValue) == 0x000010, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::CallFunc_BP_GetProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, CallFunc_GetGameTime_ReturnValue) == 0x000014, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::CallFunc_GetGameTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, CallFunc_Sin_ReturnValue) == 0x00001C, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000024, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, CallFunc_MapRangeClamped_ReturnValue) == 0x000028, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, CallFunc_FMax_ReturnValue) == 0x000030, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, CallFunc_MakeRotator_ReturnValue) == 0x000034, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000040, "Member 'ProximityTrigger_QuestItem_BP_C_UpdateArrowLocation::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.RefreshScreenState
// 0x004C (0x004C - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_RefreshScreenState final
{
public:
	EProximityDetectorDeviceState                 OldValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProximityDetectorDeviceState                 NewValue;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProximityDetectorDeviceState                 Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_RefreshScreenState) == 0x000004, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_RefreshScreenState");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_RefreshScreenState) == 0x00004C, "Wrong size on ProximityTrigger_QuestItem_BP_C_RefreshScreenState");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshScreenState, OldValue) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshScreenState::OldValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshScreenState, NewValue) == 0x000001, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshScreenState::NewValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshScreenState, Temp_struct_Variable) == 0x000004, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshScreenState::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshScreenState, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000014, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshScreenState::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshScreenState, Temp_struct_Variable_1) == 0x000018, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshScreenState::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshScreenState, Temp_struct_Variable_2) == 0x000028, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshScreenState::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshScreenState, Temp_byte_Variable) == 0x000038, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshScreenState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshScreenState, K2Node_Select_Default) == 0x00003C, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshScreenState::K2Node_Select_Default' has a wrong offset!");

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.RefreshLightState
// 0x0070 (0x0070 - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_RefreshLightState final
{
public:
	EProximityDetectorDeviceState                 OldValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProximityDetectorDeviceState                 NewValue;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_GetLightColor_MaterialColor;              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLightColor_LightColor;                 // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLightColor_LightIntensity;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBProximityDetectableComponent*        CallFunc_GetProximityComponentDetected_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_RefreshLightState) == 0x000008, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_RefreshLightState");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_RefreshLightState) == 0x000070, "Wrong size on ProximityTrigger_QuestItem_BP_C_RefreshLightState");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, OldValue) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::OldValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, NewValue) == 0x000001, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::NewValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000003, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, CallFunc_GetLightColor_MaterialColor) == 0x000004, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::CallFunc_GetLightColor_MaterialColor' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, CallFunc_GetLightColor_LightColor) == 0x000014, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::CallFunc_GetLightColor_LightColor' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, CallFunc_GetLightColor_LightIntensity) == 0x000024, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::CallFunc_GetLightColor_LightIntensity' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, CallFunc_GetProximityComponentDetected_ReturnValue) == 0x000028, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::CallFunc_GetProximityComponentDetected_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, CallFunc_SelectFloat_ReturnValue) == 0x000034, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, CallFunc_SelectFloat_ReturnValue_1) == 0x000038, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, K2Node_MakeStruct_LinearColor) == 0x00003C, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, K2Node_MakeStruct_LinearColor_1) == 0x00004C, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshLightState, CallFunc_SelectColor_ReturnValue) == 0x00005C, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshLightState::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.RefreshAudioState
// 0x0048 (0x0048 - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_RefreshAudioState final
{
public:
	EProximityDetectorDeviceState                 OldValue;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProximityDetectorDeviceState                 NewValue;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StopLoopingSound_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayLoopingSound_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x000C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PlayLoopingSound_ReturnValue_1;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StopLoopingSound_ReturnValue_1;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayLoopingSound_ReturnValue_2;           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StopLoopingSound_ReturnValue_2;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_1;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState) == 0x000004, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_RefreshAudioState");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState) == 0x000048, "Wrong size on ProximityTrigger_QuestItem_BP_C_RefreshAudioState");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState, OldValue) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshAudioState::OldValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState, NewValue) == 0x000001, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshAudioState::NewValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshAudioState::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState, CallFunc_StopLoopingSound_ReturnValue) == 0x000004, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshAudioState::CallFunc_StopLoopingSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState, CallFunc_PlayLoopingSound_ReturnValue) == 0x000008, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshAudioState::CallFunc_PlayLoopingSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState, Temp_delegate_Variable) == 0x00000C, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshAudioState::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState, CallFunc_PlayLoopingSound_ReturnValue_1) == 0x00001C, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshAudioState::CallFunc_PlayLoopingSound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState, CallFunc_PostEventOnActor_ReturnValue) == 0x000020, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshAudioState::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState, CallFunc_StopLoopingSound_ReturnValue_1) == 0x000024, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshAudioState::CallFunc_StopLoopingSound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState, CallFunc_PlayLoopingSound_ReturnValue_2) == 0x000028, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshAudioState::CallFunc_PlayLoopingSound_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState, CallFunc_StopLoopingSound_ReturnValue_2) == 0x00002C, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshAudioState::CallFunc_StopLoopingSound_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshAudioState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState, Temp_delegate_Variable_1) == 0x000034, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshAudioState::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_RefreshAudioState, CallFunc_PostEventOnActor_ReturnValue_1) == 0x000044, "Member 'ProximityTrigger_QuestItem_BP_C_RefreshAudioState::CallFunc_PostEventOnActor_ReturnValue_1' has a wrong offset!");

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.PrepareState
// 0x0010 (0x0010 - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_PrepareState final
{
public:
	bool                                          bStateA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RandomOwner;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_PrepareState) == 0x000008, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_PrepareState");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_PrepareState) == 0x000010, "Wrong size on ProximityTrigger_QuestItem_BP_C_PrepareState");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_PrepareState, bStateA) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_PrepareState::bStateA' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_PrepareState, RandomOwner) == 0x000008, "Member 'ProximityTrigger_QuestItem_BP_C_PrepareState::RandomOwner' has a wrong offset!");

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.SetShouldBeIgnoredForLots
// 0x0001 (0x0001 - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_SetShouldBeIgnoredForLots final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_SetShouldBeIgnoredForLots) == 0x000001, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_SetShouldBeIgnoredForLots");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_SetShouldBeIgnoredForLots) == 0x000001, "Wrong size on ProximityTrigger_QuestItem_BP_C_SetShouldBeIgnoredForLots");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_SetShouldBeIgnoredForLots, bValue) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_SetShouldBeIgnoredForLots::bValue' has a wrong offset!");

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.SetState
// 0x0001 (0x0001 - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_SetState final
{
public:
	bool                                          bStateA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_SetState) == 0x000001, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_SetState");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_SetState) == 0x000001, "Wrong size on ProximityTrigger_QuestItem_BP_C_SetState");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_SetState, bStateA) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_SetState::bStateA' has a wrong offset!");

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_ReceiveTick");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_ReceiveTick) == 0x000004, "Wrong size on ProximityTrigger_QuestItem_BP_C_ReceiveTick");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ProximityTrigger_QuestItem_BP.ProximityTrigger_QuestItem_BP_C.ExecuteUbergraph_ProximityTrigger_QuestItem_BP
// 0x0170 (0x0170 - 0x0000)
struct ProximityTrigger_QuestItem_BP_C_ExecuteUbergraph_ProximityTrigger_QuestItem_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStateA_1;                            // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_randomOwner;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bValue;                               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStateA;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsHolding_ReturnValue;                 // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                CallFunc_GetPawnOwner_ReturnValue;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_DynamicCast_AsRB_Player;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_2;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_2;              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_1;           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00BC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetLightColor_MaterialColor;              // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLightColor_LightColor;                 // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLightColor_LightIntensity;             // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProximityTrigger_QuestItem_BP_C_ExecuteUbergraph_ProximityTrigger_QuestItem_BP) == 0x000008, "Wrong alignment on ProximityTrigger_QuestItem_BP_C_ExecuteUbergraph_ProximityTrigger_QuestItem_BP");
static_assert(sizeof(ProximityTrigger_QuestItem_BP_C_ExecuteUbergraph_ProximityTrigger_QuestItem_BP) == 0x000170, "Wrong size on ProximityTrigger_QuestItem_BP_C_ExecuteUbergraph_ProximityTrigger_QuestItem_BP");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_ExecuteUbergraph_ProximityTrigger_QuestItem_BP, EntryPoint) == 0x000000, "Member 'ProximityTrigger_QuestItem_BP_C_ExecuteUbergraph_ProximityTrigger_QuestItem_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProximityTrigger_QuestItem_BP_C_ExecuteUbergraph_ProximityTrigger_QuestItem_BP, Temp_struct_Variable) == 0x000008, "Member 'ProximityTrigger_QuestItem_BP_C_ExecuteUbergraph_ProximityTrigger_QuestItem_BP::Temp_struct_Variable' has a wrong offset!");
