#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pusher_Runtime

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Pusher_Runtime.Pusher_Runtime_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Pusher_Runtime_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Pusher_Runtime_C_AnimGraph) == 0x000008, "Wrong alignment on Pusher_Runtime_C_AnimGraph");
static_assert(sizeof(Pusher_Runtime_C_AnimGraph) == 0x000010, "Wrong size on Pusher_Runtime_C_AnimGraph");
static_assert(offsetof(Pusher_Runtime_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Pusher_Runtime_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Pusher_Runtime.Pusher_Runtime_C.ExecuteUbergraph_Pusher_Runtime
// 0x0004 (0x0004 - 0x0000)
struct Pusher_Runtime_C_ExecuteUbergraph_Pusher_Runtime final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pusher_Runtime_C_ExecuteUbergraph_Pusher_Runtime) == 0x000004, "Wrong alignment on Pusher_Runtime_C_ExecuteUbergraph_Pusher_Runtime");
static_assert(sizeof(Pusher_Runtime_C_ExecuteUbergraph_Pusher_Runtime) == 0x000004, "Wrong size on Pusher_Runtime_C_ExecuteUbergraph_Pusher_Runtime");
static_assert(offsetof(Pusher_Runtime_C_ExecuteUbergraph_Pusher_Runtime, EntryPoint) == 0x000000, "Member 'Pusher_Runtime_C_ExecuteUbergraph_Pusher_Runtime::EntryPoint' has a wrong offset!");

}

