#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pushable_OnRail_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Pushable_OnRail_BP.Pushable_OnRail_BP_C.ExecuteUbergraph_Pushable_OnRail_BP
// 0x03A0 (0x03A0 - 0x0000)
struct Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_deltaLocation;                        // 0x0020(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0054(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x00E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Event_frontRotation;                        // 0x0174(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_Event_rearRotation;                         // 0x0180(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x01C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x024C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_Map_Keys_Keys;                            // 0x02D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Map_Find_Value;                           // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x0318(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP) == 0x000008, "Wrong alignment on Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP");
static_assert(sizeof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP) == 0x0003A0, "Wrong size on Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, EntryPoint) == 0x000000, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_GetActorForwardVector_ReturnValue) == 0x000014, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, K2Node_Event_deltaLocation) == 0x000020, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::K2Node_Event_deltaLocation' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_Dot_VectorVector_ReturnValue) == 0x00002C, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_BreakRotator_Roll) == 0x000030, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_BreakRotator_Pitch) == 0x000034, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_BreakRotator_Yaw) == 0x000038, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_MakeRotator_ReturnValue) == 0x00003C, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_BreakRotator_Roll_1) == 0x000048, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_BreakRotator_Pitch_1) == 0x00004C, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_BreakRotator_Yaw_1) == 0x000050, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000054, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_MakeRotator_ReturnValue_1) == 0x0000DC, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0000E8, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, K2Node_Event_frontRotation) == 0x000174, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::K2Node_Event_frontRotation' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, K2Node_Event_rearRotation) == 0x000180, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::K2Node_Event_rearRotation' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_BreakRotator_Roll_2) == 0x00018C, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_BreakRotator_Pitch_2) == 0x000190, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_BreakRotator_Yaw_2) == 0x000194, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_BreakRotator_Roll_3) == 0x000198, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_BreakRotator_Pitch_3) == 0x00019C, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_BreakRotator_Yaw_3) == 0x0001A0, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001A4, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0001A8, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_MakeRotator_ReturnValue_2) == 0x0001AC, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_MakeRotator_ReturnValue_3) == 0x0001B8, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0001C4, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x00024C, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_Map_Keys_Keys) == 0x0002D8, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0002E8, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_Array_Get_Item) == 0x0002F0, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_Map_Find_Value) == 0x0002F8, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_Map_Find_ReturnValue) == 0x0002FC, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_Array_Length_ReturnValue) == 0x000300, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, K2Node_MathExpression_ReturnValue) == 0x000304, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000308, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_MakeRotator_ReturnValue_4) == 0x00030C, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_MakeRotator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x000318, "Member 'Pushable_OnRail_BP_C_ExecuteUbergraph_Pushable_OnRail_BP::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");

// Function Pushable_OnRail_BP.Pushable_OnRail_BP_C.BP_PostRotated
// 0x0018 (0x0018 - 0x0000)
struct Pushable_OnRail_BP_C_BP_PostRotated final
{
public:
	struct FRotator                               FrontRotation;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FRotator                               RearRotation;                                      // 0x000C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pushable_OnRail_BP_C_BP_PostRotated) == 0x000004, "Wrong alignment on Pushable_OnRail_BP_C_BP_PostRotated");
static_assert(sizeof(Pushable_OnRail_BP_C_BP_PostRotated) == 0x000018, "Wrong size on Pushable_OnRail_BP_C_BP_PostRotated");
static_assert(offsetof(Pushable_OnRail_BP_C_BP_PostRotated, FrontRotation) == 0x000000, "Member 'Pushable_OnRail_BP_C_BP_PostRotated::FrontRotation' has a wrong offset!");
static_assert(offsetof(Pushable_OnRail_BP_C_BP_PostRotated, RearRotation) == 0x00000C, "Member 'Pushable_OnRail_BP_C_BP_PostRotated::RearRotation' has a wrong offset!");

// Function Pushable_OnRail_BP.Pushable_OnRail_BP_C.BP_PostMove
// 0x000C (0x000C - 0x0000)
struct Pushable_OnRail_BP_C_BP_PostMove final
{
public:
	struct FVector                                DeltaLocation;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Pushable_OnRail_BP_C_BP_PostMove) == 0x000004, "Wrong alignment on Pushable_OnRail_BP_C_BP_PostMove");
static_assert(sizeof(Pushable_OnRail_BP_C_BP_PostMove) == 0x00000C, "Wrong size on Pushable_OnRail_BP_C_BP_PostMove");
static_assert(offsetof(Pushable_OnRail_BP_C_BP_PostMove, DeltaLocation) == 0x000000, "Member 'Pushable_OnRail_BP_C_BP_PostMove::DeltaLocation' has a wrong offset!");

// Function Pushable_OnRail_BP.Pushable_OnRail_BP_C.ConstructWheelMeshesList
// 0x0050 (0x0050 - 0x0000)
struct Pushable_OnRail_BP_C_ConstructWheelMeshesList final
{
public:
	TMap<class UStaticMeshComponent*, float>      K2Node_MakeMap_Map;                                // 0x0000(0x0050)(ContainsInstancedReference)
};
static_assert(alignof(Pushable_OnRail_BP_C_ConstructWheelMeshesList) == 0x000008, "Wrong alignment on Pushable_OnRail_BP_C_ConstructWheelMeshesList");
static_assert(sizeof(Pushable_OnRail_BP_C_ConstructWheelMeshesList) == 0x000050, "Wrong size on Pushable_OnRail_BP_C_ConstructWheelMeshesList");
static_assert(offsetof(Pushable_OnRail_BP_C_ConstructWheelMeshesList, K2Node_MakeMap_Map) == 0x000000, "Member 'Pushable_OnRail_BP_C_ConstructWheelMeshesList::K2Node_MakeMap_Map' has a wrong offset!");

}

