#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pushable_OnRail_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Pushable_OnRail_BP.Pushable_OnRail_BP_C
// 0x00F0 (0x08B0 - 0x07C0)
class APushable_OnRail_BP_C final : public ARBSplinePushable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   CartRailBrakesMinus01;                             // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CartRailWheelMinus02b;                             // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CartRailWheelMinus01b;                             // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PushableWorldCollision;                            // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBObjectiveActorComponent*             RBObjectiveActor;                                  // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        HandIK;                                            // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PushablePawnCollision;                             // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBPushableComponent*                   RBPushable;                                        // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        PushingAnchor;                                     // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CartRailWheelMinusFront;                           // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CartRailWheelMinusRear;                            // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CartRailMinus01;                                   // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ARBLedgeMarker*                         LedgeMarkerFront;                                  // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLedgeMarker*                         LedgeMarkerRight;                                  // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLedgeMarker*                         LedgeMarkerRear;                                   // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBLedgeMarker*                         LedgeMarkerLeft;                                   // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                LargeObjectCollector;                              // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UStaticMeshComponent*, float>      WheelMeshes;                                       // 0x0858(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          DisableLedgeMarkers;                               // 0x08A8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Pushable_OnRail_BP(int32 EntryPoint);
	void BP_PostRotated(const struct FRotator& FrontRotation, const struct FRotator& RearRotation);
	void BP_PostMove(const struct FVector& DeltaLocation);
	void UserConstructionScript();
	void ConstructWheelMeshesList();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pushable_OnRail_BP_C">();
	}
	static class APushable_OnRail_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APushable_OnRail_BP_C>();
	}
};
static_assert(alignof(APushable_OnRail_BP_C) == 0x000010, "Wrong alignment on APushable_OnRail_BP_C");
static_assert(sizeof(APushable_OnRail_BP_C) == 0x0008B0, "Wrong size on APushable_OnRail_BP_C");
static_assert(offsetof(APushable_OnRail_BP_C, UberGraphFrame) == 0x0007C0, "Member 'APushable_OnRail_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, CartRailBrakesMinus01) == 0x0007C8, "Member 'APushable_OnRail_BP_C::CartRailBrakesMinus01' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, CartRailWheelMinus02b) == 0x0007D0, "Member 'APushable_OnRail_BP_C::CartRailWheelMinus02b' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, CartRailWheelMinus01b) == 0x0007D8, "Member 'APushable_OnRail_BP_C::CartRailWheelMinus01b' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, PushableWorldCollision) == 0x0007E0, "Member 'APushable_OnRail_BP_C::PushableWorldCollision' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, RBObjectiveActor) == 0x0007E8, "Member 'APushable_OnRail_BP_C::RBObjectiveActor' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, HandIK) == 0x0007F0, "Member 'APushable_OnRail_BP_C::HandIK' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, Capsule) == 0x0007F8, "Member 'APushable_OnRail_BP_C::Capsule' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, PushablePawnCollision) == 0x000800, "Member 'APushable_OnRail_BP_C::PushablePawnCollision' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, RBPushable) == 0x000808, "Member 'APushable_OnRail_BP_C::RBPushable' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, PushingAnchor) == 0x000810, "Member 'APushable_OnRail_BP_C::PushingAnchor' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, CartRailWheelMinusFront) == 0x000818, "Member 'APushable_OnRail_BP_C::CartRailWheelMinusFront' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, CartRailWheelMinusRear) == 0x000820, "Member 'APushable_OnRail_BP_C::CartRailWheelMinusRear' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, CartRailMinus01) == 0x000828, "Member 'APushable_OnRail_BP_C::CartRailMinus01' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, LedgeMarkerFront) == 0x000830, "Member 'APushable_OnRail_BP_C::LedgeMarkerFront' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, LedgeMarkerRight) == 0x000838, "Member 'APushable_OnRail_BP_C::LedgeMarkerRight' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, LedgeMarkerRear) == 0x000840, "Member 'APushable_OnRail_BP_C::LedgeMarkerRear' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, LedgeMarkerLeft) == 0x000848, "Member 'APushable_OnRail_BP_C::LedgeMarkerLeft' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, LargeObjectCollector) == 0x000850, "Member 'APushable_OnRail_BP_C::LargeObjectCollector' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, WheelMeshes) == 0x000858, "Member 'APushable_OnRail_BP_C::WheelMeshes' has a wrong offset!");
static_assert(offsetof(APushable_OnRail_BP_C, DisableLedgeMarkers) == 0x0008A8, "Member 'APushable_OnRail_BP_C::DisableLedgeMarkers' has a wrong offset!");

}

