#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadialGaugeMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RBGaugeBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RadialGauge-01_BP.RadialGauge-01_BP_C
// 0x0040 (0x0298 - 0x0258)
class ARadialGaugeMinus01_BP_C : public ARBGaugeBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_RadialGaugeMinus01_BP_C;            // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   GaugeNeedle;                                       // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        NeedleRoot;                                        // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GaugeBaseMesh;                                     // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotationMin;                                       // 0x0278(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               RotationMax;                                       // 0x0284(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         PreviewRotationLerp;                               // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateNeedleRotation(bool bPreviewConstruction);
	void UserConstructionScript();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_RadialGaugeMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RadialGauge-01_BP_C">();
	}
	static class ARadialGaugeMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARadialGaugeMinus01_BP_C>();
	}
};
static_assert(alignof(ARadialGaugeMinus01_BP_C) == 0x000008, "Wrong alignment on ARadialGaugeMinus01_BP_C");
static_assert(sizeof(ARadialGaugeMinus01_BP_C) == 0x000298, "Wrong size on ARadialGaugeMinus01_BP_C");
static_assert(offsetof(ARadialGaugeMinus01_BP_C, UberGraphFrame_RadialGaugeMinus01_BP_C) == 0x000258, "Member 'ARadialGaugeMinus01_BP_C::UberGraphFrame_RadialGaugeMinus01_BP_C' has a wrong offset!");
static_assert(offsetof(ARadialGaugeMinus01_BP_C, GaugeNeedle) == 0x000260, "Member 'ARadialGaugeMinus01_BP_C::GaugeNeedle' has a wrong offset!");
static_assert(offsetof(ARadialGaugeMinus01_BP_C, NeedleRoot) == 0x000268, "Member 'ARadialGaugeMinus01_BP_C::NeedleRoot' has a wrong offset!");
static_assert(offsetof(ARadialGaugeMinus01_BP_C, GaugeBaseMesh) == 0x000270, "Member 'ARadialGaugeMinus01_BP_C::GaugeBaseMesh' has a wrong offset!");
static_assert(offsetof(ARadialGaugeMinus01_BP_C, RotationMin) == 0x000278, "Member 'ARadialGaugeMinus01_BP_C::RotationMin' has a wrong offset!");
static_assert(offsetof(ARadialGaugeMinus01_BP_C, RotationMax) == 0x000284, "Member 'ARadialGaugeMinus01_BP_C::RotationMax' has a wrong offset!");
static_assert(offsetof(ARadialGaugeMinus01_BP_C, PreviewRotationLerp) == 0x000290, "Member 'ARadialGaugeMinus01_BP_C::PreviewRotationLerp' has a wrong offset!");

}

