#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RailBlockMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RailBlock-01_BP.RailBlock-01_BP_C
// 0x0060 (0x0480 - 0x0420)
class ARailBlockMinus01_BP_C final : public ARBPushCartRailBlocker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          CartCollision;                                     // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RailSwitchMinus01a;                                // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      RBSound;                                           // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RailSwitchMinus01b;                                // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NewTrack_1_427381CB49FFB41187B5A5822499E4C8; // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_427381CB49FFB41187B5A5822499E4C8; // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_455[0x3];                                      // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_1_C6A0F84542D37D212EA46A982304AB94; // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_C6A0F84542D37D212EA46A982304AB94; // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_C6A0F84542D37D212EA46A982304AB94; // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateBlockingCollision();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void ReceiveBeginPlay();
	void Event_SnapToState();
	void Event_OnResetStage();
	void Event_OnTriggerSequenceStarted();
	void Event_OnUntriggerSequenceStarted();
	void ExecuteUbergraph_RailBlockMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RailBlock-01_BP_C">();
	}
	static class ARailBlockMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARailBlockMinus01_BP_C>();
	}
};
static_assert(alignof(ARailBlockMinus01_BP_C) == 0x000010, "Wrong alignment on ARailBlockMinus01_BP_C");
static_assert(sizeof(ARailBlockMinus01_BP_C) == 0x000480, "Wrong size on ARailBlockMinus01_BP_C");
static_assert(offsetof(ARailBlockMinus01_BP_C, UberGraphFrame) == 0x000420, "Member 'ARailBlockMinus01_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARailBlockMinus01_BP_C, CartCollision) == 0x000428, "Member 'ARailBlockMinus01_BP_C::CartCollision' has a wrong offset!");
static_assert(offsetof(ARailBlockMinus01_BP_C, RailSwitchMinus01a) == 0x000430, "Member 'ARailBlockMinus01_BP_C::RailSwitchMinus01a' has a wrong offset!");
static_assert(offsetof(ARailBlockMinus01_BP_C, Root) == 0x000438, "Member 'ARailBlockMinus01_BP_C::Root' has a wrong offset!");
static_assert(offsetof(ARailBlockMinus01_BP_C, RBSound) == 0x000440, "Member 'ARailBlockMinus01_BP_C::RBSound' has a wrong offset!");
static_assert(offsetof(ARailBlockMinus01_BP_C, RailSwitchMinus01b) == 0x000448, "Member 'ARailBlockMinus01_BP_C::RailSwitchMinus01b' has a wrong offset!");
static_assert(offsetof(ARailBlockMinus01_BP_C, Timeline_1_NewTrack_1_427381CB49FFB41187B5A5822499E4C8) == 0x000450, "Member 'ARailBlockMinus01_BP_C::Timeline_1_NewTrack_1_427381CB49FFB41187B5A5822499E4C8' has a wrong offset!");
static_assert(offsetof(ARailBlockMinus01_BP_C, Timeline_1__Direction_427381CB49FFB41187B5A5822499E4C8) == 0x000454, "Member 'ARailBlockMinus01_BP_C::Timeline_1__Direction_427381CB49FFB41187B5A5822499E4C8' has a wrong offset!");
static_assert(offsetof(ARailBlockMinus01_BP_C, Timeline_1) == 0x000458, "Member 'ARailBlockMinus01_BP_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ARailBlockMinus01_BP_C, Timeline_0_NewTrack_1_C6A0F84542D37D212EA46A982304AB94) == 0x000460, "Member 'ARailBlockMinus01_BP_C::Timeline_0_NewTrack_1_C6A0F84542D37D212EA46A982304AB94' has a wrong offset!");
static_assert(offsetof(ARailBlockMinus01_BP_C, Timeline_0_NewTrack_0_C6A0F84542D37D212EA46A982304AB94) == 0x000464, "Member 'ARailBlockMinus01_BP_C::Timeline_0_NewTrack_0_C6A0F84542D37D212EA46A982304AB94' has a wrong offset!");
static_assert(offsetof(ARailBlockMinus01_BP_C, Timeline_0__Direction_C6A0F84542D37D212EA46A982304AB94) == 0x000468, "Member 'ARailBlockMinus01_BP_C::Timeline_0__Direction_C6A0F84542D37D212EA46A982304AB94' has a wrong offset!");
static_assert(offsetof(ARailBlockMinus01_BP_C, Timeline_0) == 0x000470, "Member 'ARailBlockMinus01_BP_C::Timeline_0' has a wrong offset!");

}

