#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ray_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Ray_BP.Ray_BP_C
// 0x0038 (0x0268 - 0x0230)
class ARay_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Root;                                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ToasterDetectorRayMinus01;                         // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DetectionDistance;                                 // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0258(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Ray_BP(int32 EntryPoint);
	void RayState(bool IsDetected);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void Get_Distace_Ray();
	void SetDetectionDistance(float Distance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Ray_BP_C">();
	}
	static class ARay_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARay_BP_C>();
	}
};
static_assert(alignof(ARay_BP_C) == 0x000008, "Wrong alignment on ARay_BP_C");
static_assert(sizeof(ARay_BP_C) == 0x000268, "Wrong size on ARay_BP_C");
static_assert(offsetof(ARay_BP_C, UberGraphFrame) == 0x000230, "Member 'ARay_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARay_BP_C, Root) == 0x000238, "Member 'ARay_BP_C::Root' has a wrong offset!");
static_assert(offsetof(ARay_BP_C, Scene) == 0x000240, "Member 'ARay_BP_C::Scene' has a wrong offset!");
static_assert(offsetof(ARay_BP_C, ToasterDetectorRayMinus01) == 0x000248, "Member 'ARay_BP_C::ToasterDetectorRayMinus01' has a wrong offset!");
static_assert(offsetof(ARay_BP_C, DetectionDistance) == 0x000250, "Member 'ARay_BP_C::DetectionDistance' has a wrong offset!");
static_assert(offsetof(ARay_BP_C, ActorsToIgnore) == 0x000258, "Member 'ARay_BP_C::ActorsToIgnore' has a wrong offset!");

}

