#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBAmbientCharacterBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "OPP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass RBAmbientCharacterBase.RBAmbientCharacterBase_C
// 0x0018 (0x0248 - 0x0230)
class ARBAmbientCharacterBase_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	bool BP_MapCheck(EMapCheckType CheckType, class FString* OutErrorMsg);
	void BP_PrepareMapCheck();
	void ExecuteUbergraph_RBAmbientCharacterBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBAmbientCharacterBase_C">();
	}
	static class ARBAmbientCharacterBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARBAmbientCharacterBase_C>();
	}
};
static_assert(alignof(ARBAmbientCharacterBase_C) == 0x000008, "Wrong alignment on ARBAmbientCharacterBase_C");
static_assert(sizeof(ARBAmbientCharacterBase_C) == 0x000248, "Wrong size on ARBAmbientCharacterBase_C");
static_assert(offsetof(ARBAmbientCharacterBase_C, UberGraphFrame) == 0x000230, "Member 'ARBAmbientCharacterBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARBAmbientCharacterBase_C, Mesh) == 0x000238, "Member 'ARBAmbientCharacterBase_C::Mesh' has a wrong offset!");
static_assert(offsetof(ARBAmbientCharacterBase_C, DefaultSceneRoot) == 0x000240, "Member 'ARBAmbientCharacterBase_C::DefaultSceneRoot' has a wrong offset!");

}

