#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBAmbientCharacterBase

#include "Basic.hpp"

#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function RBAmbientCharacterBase.RBAmbientCharacterBase_C.BP_MapCheck
// 0x0020 (0x0020 - 0x0000)
struct RBAmbientCharacterBase_C_BP_MapCheck final
{
public:
	EMapCheckType                                 CheckType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutErrorMsg;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBAmbientCharacterBase_C_BP_MapCheck) == 0x000008, "Wrong alignment on RBAmbientCharacterBase_C_BP_MapCheck");
static_assert(sizeof(RBAmbientCharacterBase_C_BP_MapCheck) == 0x000020, "Wrong size on RBAmbientCharacterBase_C_BP_MapCheck");
static_assert(offsetof(RBAmbientCharacterBase_C_BP_MapCheck, CheckType) == 0x000000, "Member 'RBAmbientCharacterBase_C_BP_MapCheck::CheckType' has a wrong offset!");
static_assert(offsetof(RBAmbientCharacterBase_C_BP_MapCheck, OutErrorMsg) == 0x000008, "Member 'RBAmbientCharacterBase_C_BP_MapCheck::OutErrorMsg' has a wrong offset!");
static_assert(offsetof(RBAmbientCharacterBase_C_BP_MapCheck, ReturnValue) == 0x000018, "Member 'RBAmbientCharacterBase_C_BP_MapCheck::ReturnValue' has a wrong offset!");

// Function RBAmbientCharacterBase.RBAmbientCharacterBase_C.ExecuteUbergraph_RBAmbientCharacterBase
// 0x0004 (0x0004 - 0x0000)
struct RBAmbientCharacterBase_C_ExecuteUbergraph_RBAmbientCharacterBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBAmbientCharacterBase_C_ExecuteUbergraph_RBAmbientCharacterBase) == 0x000004, "Wrong alignment on RBAmbientCharacterBase_C_ExecuteUbergraph_RBAmbientCharacterBase");
static_assert(sizeof(RBAmbientCharacterBase_C_ExecuteUbergraph_RBAmbientCharacterBase) == 0x000004, "Wrong size on RBAmbientCharacterBase_C_ExecuteUbergraph_RBAmbientCharacterBase");
static_assert(offsetof(RBAmbientCharacterBase_C_ExecuteUbergraph_RBAmbientCharacterBase, EntryPoint) == 0x000000, "Member 'RBAmbientCharacterBase_C_ExecuteUbergraph_RBAmbientCharacterBase::EntryPoint' has a wrong offset!");

}

