#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBAnimNotify_Shotgun_SyncAnim

#include "Basic.hpp"


namespace SDK::Params
{

// Function RBAnimNotify_Shotgun_SyncAnim.RBAnimNotify_Shotgun_SyncAnim_C.GetNotifyName
// 0x0010 (0x0010 - 0x0000)
struct RBAnimNotify_Shotgun_SyncAnim_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(RBAnimNotify_Shotgun_SyncAnim_C_GetNotifyName) == 0x000008, "Wrong alignment on RBAnimNotify_Shotgun_SyncAnim_C_GetNotifyName");
static_assert(sizeof(RBAnimNotify_Shotgun_SyncAnim_C_GetNotifyName) == 0x000010, "Wrong size on RBAnimNotify_Shotgun_SyncAnim_C_GetNotifyName");
static_assert(offsetof(RBAnimNotify_Shotgun_SyncAnim_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'RBAnimNotify_Shotgun_SyncAnim_C_GetNotifyName::ReturnValue' has a wrong offset!");

// Function RBAnimNotify_Shotgun_SyncAnim.RBAnimNotify_Shotgun_SyncAnim_C.Received_Notify
// 0x0068 (0x0068 - 0x0000)
struct RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNPC*                                 K2Node_DynamicCast_AsRB_NPC;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBNPCWeapon*                           CallFunc_BP_GetWeaponActor_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPC_Weapon_Shotgun_C*                  K2Node_DynamicCast_AsNPC_Weapon_Shotgun;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNPC_Weapon_Shotgun_AnimBP_C*           K2Node_DynamicCast_AsNPC_Weapon_Shotgun_Anim_BP;   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify) == 0x000008, "Wrong alignment on RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify");
static_assert(sizeof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify) == 0x000068, "Wrong size on RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify");
static_assert(offsetof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify, MeshComp) == 0x000000, "Member 'RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify, Animation) == 0x000008, "Member 'RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify, ReturnValue) == 0x000010, "Member 'RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify, K2Node_DynamicCast_AsRB_NPC) == 0x000020, "Member 'RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify::K2Node_DynamicCast_AsRB_NPC' has a wrong offset!");
static_assert(offsetof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify, CallFunc_BP_GetWeaponActor_ReturnValue) == 0x000030, "Member 'RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify::CallFunc_BP_GetWeaponActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify, K2Node_DynamicCast_AsNPC_Weapon_Shotgun) == 0x000038, "Member 'RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify::K2Node_DynamicCast_AsNPC_Weapon_Shotgun' has a wrong offset!");
static_assert(offsetof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify, CallFunc_GetAnimInstance_ReturnValue) == 0x000048, "Member 'RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify, K2Node_DynamicCast_AsNPC_Weapon_Shotgun_Anim_BP) == 0x000050, "Member 'RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify::K2Node_DynamicCast_AsNPC_Weapon_Shotgun_Anim_BP' has a wrong offset!");
static_assert(offsetof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify, CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue) == 0x000060, "Member 'RBAnimNotify_Shotgun_SyncAnim_C_Received_Notify::CallFunc_PlaySlotAnimationAsDynamicMontage_ReturnValue' has a wrong offset!");

}

