#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBGameState_BP

#include "Basic.hpp"

#include "GameVar_structs.hpp"


namespace SDK::Params
{

// Function RBGameState_BP.RBGameState_BP_C.OnGameVarDeactivated (Server)__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct RBGameState_BP_C_OnGameVarDeactivated__Server___DelegateSignature final
{
public:
	EGameVar                                      GameVar;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBGameState_BP_C_OnGameVarDeactivated__Server___DelegateSignature) == 0x000001, "Wrong alignment on RBGameState_BP_C_OnGameVarDeactivated__Server___DelegateSignature");
static_assert(sizeof(RBGameState_BP_C_OnGameVarDeactivated__Server___DelegateSignature) == 0x000001, "Wrong size on RBGameState_BP_C_OnGameVarDeactivated__Server___DelegateSignature");
static_assert(offsetof(RBGameState_BP_C_OnGameVarDeactivated__Server___DelegateSignature, GameVar) == 0x000000, "Member 'RBGameState_BP_C_OnGameVarDeactivated__Server___DelegateSignature::GameVar' has a wrong offset!");

// Function RBGameState_BP.RBGameState_BP_C.OnGameVarDeactivated (Client)__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct RBGameState_BP_C_OnGameVarDeactivated__Client___DelegateSignature final
{
public:
	EGameVar                                      GameVar;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBGameState_BP_C_OnGameVarDeactivated__Client___DelegateSignature) == 0x000001, "Wrong alignment on RBGameState_BP_C_OnGameVarDeactivated__Client___DelegateSignature");
static_assert(sizeof(RBGameState_BP_C_OnGameVarDeactivated__Client___DelegateSignature) == 0x000001, "Wrong size on RBGameState_BP_C_OnGameVarDeactivated__Client___DelegateSignature");
static_assert(offsetof(RBGameState_BP_C_OnGameVarDeactivated__Client___DelegateSignature, GameVar) == 0x000000, "Member 'RBGameState_BP_C_OnGameVarDeactivated__Client___DelegateSignature::GameVar' has a wrong offset!");

// Function RBGameState_BP.RBGameState_BP_C.OnGameVarActivated (Server)__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct RBGameState_BP_C_OnGameVarActivated__Server___DelegateSignature final
{
public:
	EGameVar                                      GameVar;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBGameState_BP_C_OnGameVarActivated__Server___DelegateSignature) == 0x000001, "Wrong alignment on RBGameState_BP_C_OnGameVarActivated__Server___DelegateSignature");
static_assert(sizeof(RBGameState_BP_C_OnGameVarActivated__Server___DelegateSignature) == 0x000001, "Wrong size on RBGameState_BP_C_OnGameVarActivated__Server___DelegateSignature");
static_assert(offsetof(RBGameState_BP_C_OnGameVarActivated__Server___DelegateSignature, GameVar) == 0x000000, "Member 'RBGameState_BP_C_OnGameVarActivated__Server___DelegateSignature::GameVar' has a wrong offset!");

// Function RBGameState_BP.RBGameState_BP_C.OnGameVarActivated (Client)__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct RBGameState_BP_C_OnGameVarActivated__Client___DelegateSignature final
{
public:
	EGameVar                                      GameVar;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBGameState_BP_C_OnGameVarActivated__Client___DelegateSignature) == 0x000001, "Wrong alignment on RBGameState_BP_C_OnGameVarActivated__Client___DelegateSignature");
static_assert(sizeof(RBGameState_BP_C_OnGameVarActivated__Client___DelegateSignature) == 0x000001, "Wrong size on RBGameState_BP_C_OnGameVarActivated__Client___DelegateSignature");
static_assert(offsetof(RBGameState_BP_C_OnGameVarActivated__Client___DelegateSignature, GameVar) == 0x000000, "Member 'RBGameState_BP_C_OnGameVarActivated__Client___DelegateSignature::GameVar' has a wrong offset!");

}

