#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBHUD_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RBHUD_BP.RBHUD_BP_C
// 0x0020 (0x0710 - 0x06F0)
class ARBHUD_BP_C final : public ARBHUD
{
public:
	class UPostProcessComponent*                  PostProcessFP;                                     // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ArrowForwardOffet;                                 // 0x0700(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PointerSize_0;                                     // 0x0704(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBHUD_BP_C">();
	}
	static class ARBHUD_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARBHUD_BP_C>();
	}
};
static_assert(alignof(ARBHUD_BP_C) == 0x000008, "Wrong alignment on ARBHUD_BP_C");
static_assert(sizeof(ARBHUD_BP_C) == 0x000710, "Wrong size on ARBHUD_BP_C");
static_assert(offsetof(ARBHUD_BP_C, PostProcessFP) == 0x0006F0, "Member 'ARBHUD_BP_C::PostProcessFP' has a wrong offset!");
static_assert(offsetof(ARBHUD_BP_C, DefaultSceneRoot) == 0x0006F8, "Member 'ARBHUD_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ARBHUD_BP_C, ArrowForwardOffet) == 0x000700, "Member 'ARBHUD_BP_C::ArrowForwardOffet' has a wrong offset!");
static_assert(offsetof(ARBHUD_BP_C, PointerSize_0) == 0x000704, "Member 'ARBHUD_BP_C::PointerSize_0' has a wrong offset!");

}

