#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBNPC_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Face_AllList_Enum_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RBNPC_BP.RBNPC_BP_C
// 0x0060 (0x5A70 - 0x5A10)
#pragma pack(push, 0x1)
class alignas(0x10) ARBNPC_BP_C : public ARBNPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x5A10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBActiveSkillVisionComponent*          RBActiveSkillVision;                               // 0x5A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AS_WaveSphere;                                     // 0x5A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBAimAssistComponent*                  Head_Aim_Assist;                                   // 0x5A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             BroadcastWeaponAnimation;                          // 0x5A30(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UNiagaraComponent*                      RageEyeFX_R;                                       // 0x5A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      RageEyeFX_L;                                       // 0x5A48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BloodDripsParticles;                               // 0x5A50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SubtitleDistanceOverride;                          // 0x5A58(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         SubtitleDistanceOccludedOverride;                  // 0x5A5C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	EFace_AllList_Enum                            FaceAnimType;                                      // 0x5A60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BroadcastWeaponAnimation__DelegateSignature(class UAnimSequence* Sequence);
	void ExecuteUbergraph_RBNPC_BP(int32 EntryPoint);
	void TestFakeBlurComplete();
	void TestFakeBlurHead();
	void ReceiveBeginPlay();
	void Event_OnDealtUnarmedDamage(class ARBPawn* OtherPawn, class FName DamageSourceBone);
	void Event_OnDealtWeaponDamage(class ARBPawn* OtherPawn, const struct FVector& DamageLocation);
	void Event_OnFootstep(const struct FFootstepData& FootstepData);
	void Event_PlayHitReactionEffects(const struct FVector& AttackLoc, const struct FRotator& EffectRotation);
	void UserConstructionScript();
	void SetNormalMeshVisibility(bool bVisible);
	void SpawnVariatorEffects();
	void GetFaceAnimBP(class UEnemyFace_AnimBlueprint_C** EnemyFaceAnimBP);
	void EnableLODs();
	void OnRep_SubtitleDistanceOverride();
	void OnRep_SubtitleDistanceOccludedOverride();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBNPC_BP_C">();
	}
	static class ARBNPC_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARBNPC_BP_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ARBNPC_BP_C) == 0x000010, "Wrong alignment on ARBNPC_BP_C");
static_assert(sizeof(ARBNPC_BP_C) == 0x005A70, "Wrong size on ARBNPC_BP_C");
static_assert(offsetof(ARBNPC_BP_C, UberGraphFrame) == 0x005A10, "Member 'ARBNPC_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, RBActiveSkillVision) == 0x005A18, "Member 'ARBNPC_BP_C::RBActiveSkillVision' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, AS_WaveSphere) == 0x005A20, "Member 'ARBNPC_BP_C::AS_WaveSphere' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, Head_Aim_Assist) == 0x005A28, "Member 'ARBNPC_BP_C::Head_Aim_Assist' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, BroadcastWeaponAnimation) == 0x005A30, "Member 'ARBNPC_BP_C::BroadcastWeaponAnimation' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, RageEyeFX_R) == 0x005A40, "Member 'ARBNPC_BP_C::RageEyeFX_R' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, RageEyeFX_L) == 0x005A48, "Member 'ARBNPC_BP_C::RageEyeFX_L' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, BloodDripsParticles) == 0x005A50, "Member 'ARBNPC_BP_C::BloodDripsParticles' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, SubtitleDistanceOverride) == 0x005A58, "Member 'ARBNPC_BP_C::SubtitleDistanceOverride' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, SubtitleDistanceOccludedOverride) == 0x005A5C, "Member 'ARBNPC_BP_C::SubtitleDistanceOccludedOverride' has a wrong offset!");
static_assert(offsetof(ARBNPC_BP_C, FaceAnimType) == 0x005A60, "Member 'ARBNPC_BP_C::FaceAnimType' has a wrong offset!");

}

