#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBNPC_Grunt

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RBNPC_Grunt.RBNPC_Grunt_C.GetFaceAnimBP
// 0x0020 (0x0020 - 0x0000)
struct RBNPC_Grunt_C_GetFaceAnimBP final
{
public:
	class UEnemyFace_AnimBlueprint_C*             EnemyFaceAnimBP;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnemyFace_AnimBlueprint_C*             K2Node_DynamicCast_AsEnemy_Face_Anim_Blueprint;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Grunt_C_GetFaceAnimBP) == 0x000008, "Wrong alignment on RBNPC_Grunt_C_GetFaceAnimBP");
static_assert(sizeof(RBNPC_Grunt_C_GetFaceAnimBP) == 0x000020, "Wrong size on RBNPC_Grunt_C_GetFaceAnimBP");
static_assert(offsetof(RBNPC_Grunt_C_GetFaceAnimBP, EnemyFaceAnimBP) == 0x000000, "Member 'RBNPC_Grunt_C_GetFaceAnimBP::EnemyFaceAnimBP' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_GetFaceAnimBP, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'RBNPC_Grunt_C_GetFaceAnimBP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_GetFaceAnimBP, K2Node_DynamicCast_AsEnemy_Face_Anim_Blueprint) == 0x000010, "Member 'RBNPC_Grunt_C_GetFaceAnimBP::K2Node_DynamicCast_AsEnemy_Face_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_GetFaceAnimBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'RBNPC_Grunt_C_GetFaceAnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function RBNPC_Grunt.RBNPC_Grunt_C.GetFacePoseAsset
// 0x0008 (0x0008 - 0x0000)
struct RBNPC_Grunt_C_GetFacePoseAsset final
{
public:
	class UPoseAsset*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Grunt_C_GetFacePoseAsset) == 0x000008, "Wrong alignment on RBNPC_Grunt_C_GetFacePoseAsset");
static_assert(sizeof(RBNPC_Grunt_C_GetFacePoseAsset) == 0x000008, "Wrong size on RBNPC_Grunt_C_GetFacePoseAsset");
static_assert(offsetof(RBNPC_Grunt_C_GetFacePoseAsset, ReturnValue) == 0x000000, "Member 'RBNPC_Grunt_C_GetFacePoseAsset::ReturnValue' has a wrong offset!");

// Function RBNPC_Grunt.RBNPC_Grunt_C.OnRep_SelectedCustomizationInfo
// 0x0001 (0x0001 - 0x0000)
struct RBNPC_Grunt_C_OnRep_SelectedCustomizationInfo final
{
public:
	bool                                          CallFunc_HasActorNotBegunPlay_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Grunt_C_OnRep_SelectedCustomizationInfo) == 0x000001, "Wrong alignment on RBNPC_Grunt_C_OnRep_SelectedCustomizationInfo");
static_assert(sizeof(RBNPC_Grunt_C_OnRep_SelectedCustomizationInfo) == 0x000001, "Wrong size on RBNPC_Grunt_C_OnRep_SelectedCustomizationInfo");
static_assert(offsetof(RBNPC_Grunt_C_OnRep_SelectedCustomizationInfo, CallFunc_HasActorNotBegunPlay_ReturnValue) == 0x000000, "Member 'RBNPC_Grunt_C_OnRep_SelectedCustomizationInfo::CallFunc_HasActorNotBegunPlay_ReturnValue' has a wrong offset!");

// Function RBNPC_Grunt.RBNPC_Grunt_C.ApplyGruntCustomization
// 0x0018 (0x0018 - 0x0000)
struct RBNPC_Grunt_C_ApplyGruntCustomization final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(RBNPC_Grunt_C_ApplyGruntCustomization) == 0x000008, "Wrong alignment on RBNPC_Grunt_C_ApplyGruntCustomization");
static_assert(sizeof(RBNPC_Grunt_C_ApplyGruntCustomization) == 0x000018, "Wrong size on RBNPC_Grunt_C_ApplyGruntCustomization");
static_assert(offsetof(RBNPC_Grunt_C_ApplyGruntCustomization, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'RBNPC_Grunt_C_ApplyGruntCustomization::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_ApplyGruntCustomization, K2Node_MakeArray_Array) == 0x000008, "Member 'RBNPC_Grunt_C_ApplyGruntCustomization::K2Node_MakeArray_Array' has a wrong offset!");

// Function RBNPC_Grunt.RBNPC_Grunt_C.CustomizeCharacter
// 0x0120 (0x0120 - 0x0000)
struct RBNPC_Grunt_C_CustomizeCharacter final
{
public:
	bool                                          bIsFemale;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UpperBodyIndex;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LowerBodyIndex;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HairIndex;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HeadIndex;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsForcedCustomizationSex_ReturnValue;     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsForcedCustomizationFemale_ReturnValue;  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRandomIndexForNPCCustomizationSlot_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRandomIndexForNPCCustomizationSlot_ReturnValue_1; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRandomIndexForNPCCustomizationSlot_ReturnValue_2; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRandomIndexForNPCCustomizationSlot_ReturnValue_3; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanNPCBeFemale_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingConfigVoiceType_ReturnValue;       // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSelectedGruntCustomizationMeshesInfo  K2Node_MakeStruct_SelectedGruntCustomizationMeshesInfo; // 0x0030(0x0014)(NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNPCCustomizationMesh                  CallFunc_GetCustomizationMeshForGrunt_ReturnValue; // 0x0048(0x00D0)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Grunt_C_CustomizeCharacter) == 0x000008, "Wrong alignment on RBNPC_Grunt_C_CustomizeCharacter");
static_assert(sizeof(RBNPC_Grunt_C_CustomizeCharacter) == 0x000120, "Wrong size on RBNPC_Grunt_C_CustomizeCharacter");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, bIsFemale) == 0x000000, "Member 'RBNPC_Grunt_C_CustomizeCharacter::bIsFemale' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, UpperBodyIndex) == 0x000004, "Member 'RBNPC_Grunt_C_CustomizeCharacter::UpperBodyIndex' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, LowerBodyIndex) == 0x000008, "Member 'RBNPC_Grunt_C_CustomizeCharacter::LowerBodyIndex' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, HairIndex) == 0x00000C, "Member 'RBNPC_Grunt_C_CustomizeCharacter::HairIndex' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, HeadIndex) == 0x000010, "Member 'RBNPC_Grunt_C_CustomizeCharacter::HeadIndex' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, CallFunc_IsForcedCustomizationSex_ReturnValue) == 0x000014, "Member 'RBNPC_Grunt_C_CustomizeCharacter::CallFunc_IsForcedCustomizationSex_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, CallFunc_IsForcedCustomizationFemale_ReturnValue) == 0x000015, "Member 'RBNPC_Grunt_C_CustomizeCharacter::CallFunc_IsForcedCustomizationFemale_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, CallFunc_GetRandomIndexForNPCCustomizationSlot_ReturnValue) == 0x000018, "Member 'RBNPC_Grunt_C_CustomizeCharacter::CallFunc_GetRandomIndexForNPCCustomizationSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, CallFunc_GetRandomIndexForNPCCustomizationSlot_ReturnValue_1) == 0x00001C, "Member 'RBNPC_Grunt_C_CustomizeCharacter::CallFunc_GetRandomIndexForNPCCustomizationSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, CallFunc_GetRandomIndexForNPCCustomizationSlot_ReturnValue_2) == 0x000020, "Member 'RBNPC_Grunt_C_CustomizeCharacter::CallFunc_GetRandomIndexForNPCCustomizationSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, CallFunc_RandomBool_ReturnValue) == 0x000024, "Member 'RBNPC_Grunt_C_CustomizeCharacter::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, CallFunc_GetRandomIndexForNPCCustomizationSlot_ReturnValue_3) == 0x000028, "Member 'RBNPC_Grunt_C_CustomizeCharacter::CallFunc_GetRandomIndexForNPCCustomizationSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, CallFunc_CanNPCBeFemale_ReturnValue) == 0x00002C, "Member 'RBNPC_Grunt_C_CustomizeCharacter::CallFunc_CanNPCBeFemale_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, CallFunc_HasAuthority_ReturnValue) == 0x00002D, "Member 'RBNPC_Grunt_C_CustomizeCharacter::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, CallFunc_BooleanAND_ReturnValue) == 0x00002E, "Member 'RBNPC_Grunt_C_CustomizeCharacter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, CallFunc_IsUsingConfigVoiceType_ReturnValue) == 0x00002F, "Member 'RBNPC_Grunt_C_CustomizeCharacter::CallFunc_IsUsingConfigVoiceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, K2Node_MakeStruct_SelectedGruntCustomizationMeshesInfo) == 0x000030, "Member 'RBNPC_Grunt_C_CustomizeCharacter::K2Node_MakeStruct_SelectedGruntCustomizationMeshesInfo' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, CallFunc_GetCustomizationMeshForGrunt_ReturnValue) == 0x000048, "Member 'RBNPC_Grunt_C_CustomizeCharacter::CallFunc_GetCustomizationMeshForGrunt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_CustomizeCharacter, CallFunc_IsEmpty_ReturnValue) == 0x000118, "Member 'RBNPC_Grunt_C_CustomizeCharacter::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");

// Function RBNPC_Grunt.RBNPC_Grunt_C.UpdateMaterialsOnCustomizedMeshFromMap
// 0x00A8 (0x00A8 - 0x0000)
struct RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UMaterialInstanceConstant*> MaterialOverrides;                                 // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0058(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceConstant*              CallFunc_Map_Find_Value;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap) == 0x000008, "Wrong alignment on RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap");
static_assert(sizeof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap) == 0x0000A8, "Wrong size on RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap, SkeletalMeshComponent) == 0x000000, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap, MaterialOverrides) == 0x000008, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap::MaterialOverrides' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap, CallFunc_Map_Keys_Keys) == 0x000058, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap, Temp_int_Array_Index_Variable) == 0x000068, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap, CallFunc_Array_Get_Item) == 0x000070, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap, CallFunc_Map_Find_Value) == 0x000080, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap, CallFunc_Map_Find_ReturnValue) == 0x000088, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap, CallFunc_Conv_StringToName_ReturnValue) == 0x00008C, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap, CallFunc_IsValid_ReturnValue) == 0x000094, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap, Temp_int_Loop_Counter_Variable) == 0x000098, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMeshFromMap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function RBNPC_Grunt.RBNPC_Grunt_C.UpdateMaterialsOnCustomizedMesh
// 0x0058 (0x0058 - 0x0000)
struct RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMesh final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UMaterialInstanceConstant*> MaterialOverrides;                                 // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMesh) == 0x000008, "Wrong alignment on RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMesh");
static_assert(sizeof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMesh) == 0x000058, "Wrong size on RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMesh");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMesh, SkeletalMeshComponent) == 0x000000, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMesh::SkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMesh, MaterialOverrides) == 0x000008, "Member 'RBNPC_Grunt_C_UpdateMaterialsOnCustomizedMesh::MaterialOverrides' has a wrong offset!");

// Function RBNPC_Grunt.RBNPC_Grunt_C.UpdateComponentFromIndex
// 0x0380 (0x0380 - 0x0000)
struct RBNPC_Grunt_C_UpdateComponentFromIndex final
{
public:
	class USkeletalMeshComponent*                 MeshComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENPCCustomizationSlot                         Slot;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class UMaterialInstanceConstant*> LoadedMaterialOverrides;                           // 0x0010(0x0050)(Edit, BlueprintVisible)
	struct FNPCCustomizationMesh                  SelectedCustomization;                             // 0x0060(0x00D0)(Edit, BlueprintVisible)
	class USkeletalMeshComponent*                 LoopSkeletalMeshComponent;                         // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          LoopSkeletalMesh;                                  // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0xB];                                      // 0x0155(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0160(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNPCCustomizationMesh                  CallFunc_GetCustomizationMeshForGrunt_ReturnValue; // 0x01A8(0x00D0)()
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0280(0x0010)(ReferenceParm)
	class UPoseAsset*                             K2Node_DynamicCast_AsPose_Asset;                   // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstanceConstant> CallFunc_Map_Find_Value;                           // 0x02B0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceConstant*              K2Node_DynamicCast_AsMaterial_Instance_Constant;   // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           CallFunc_Array_Get_Item_1;                         // 0x0300(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_343[0x5];                                      // 0x0343(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh_1;              // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array;                            // 0x0360(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Grunt_C_UpdateComponentFromIndex) == 0x000010, "Wrong alignment on RBNPC_Grunt_C_UpdateComponentFromIndex");
static_assert(sizeof(RBNPC_Grunt_C_UpdateComponentFromIndex) == 0x000380, "Wrong size on RBNPC_Grunt_C_UpdateComponentFromIndex");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, MeshComponent) == 0x000000, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::MeshComponent' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, Slot) == 0x000008, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::Slot' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, LoadedMaterialOverrides) == 0x000010, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::LoadedMaterialOverrides' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, SelectedCustomization) == 0x000060, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::SelectedCustomization' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, LoopSkeletalMeshComponent) == 0x000130, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::LoopSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, LoopSkeletalMesh) == 0x000138, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::LoopSkeletalMesh' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, Temp_int_Loop_Counter_Variable) == 0x000140, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000144, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Add_IntInt_ReturnValue) == 0x000148, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, Temp_int_Array_Index_Variable) == 0x00014C, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, Temp_int_Array_Index_Variable_1) == 0x000150, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000154, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, Temp_struct_Variable) == 0x000160, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Not_PreBool_ReturnValue) == 0x000190, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, Temp_int_Loop_Counter_Variable_1) == 0x000194, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_AddComponent_ReturnValue) == 0x000198, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001A0, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0001A4, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_GetCustomizationMeshForGrunt_ReturnValue) == 0x0001A8, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_GetCustomizationMeshForGrunt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000278, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Map_Keys_Keys) == 0x000280, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, K2Node_DynamicCast_AsPose_Asset) == 0x000290, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::K2Node_DynamicCast_AsPose_Asset' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, K2Node_DynamicCast_bSuccess) == 0x000298, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Array_Get_Item) == 0x0002A0, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Map_Find_Value) == 0x0002B0, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Map_Find_ReturnValue) == 0x0002D8, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Array_Length_ReturnValue) == 0x0002DC, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Less_IntInt_ReturnValue) == 0x0002E0, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0002E8, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, K2Node_DynamicCast_AsMaterial_Instance_Constant) == 0x0002F0, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::K2Node_DynamicCast_AsMaterial_Instance_Constant' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, K2Node_DynamicCast_bSuccess_1) == 0x0002F8, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Array_Get_Item_1) == 0x000300, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2) == 0x000328, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Array_Length_ReturnValue_1) == 0x000330, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x000338, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, K2Node_DynamicCast_bSuccess_2) == 0x000340, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Less_IntInt_ReturnValue_1) == 0x000341, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_IsValid_ReturnValue) == 0x000342, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3) == 0x000348, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, K2Node_DynamicCast_AsSkeletal_Mesh_1) == 0x000350, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::K2Node_DynamicCast_AsSkeletal_Mesh_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, K2Node_DynamicCast_bSuccess_3) == 0x000358, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_IsValid_ReturnValue_1) == 0x000359, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, K2Node_MakeArray_Array) == 0x000360, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UpdateComponentFromIndex, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000370, "Member 'RBNPC_Grunt_C_UpdateComponentFromIndex::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function RBNPC_Grunt.RBNPC_Grunt_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct RBNPC_Grunt_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Grunt_C_UserConstructionScript) == 0x000001, "Wrong alignment on RBNPC_Grunt_C_UserConstructionScript");
static_assert(sizeof(RBNPC_Grunt_C_UserConstructionScript) == 0x000004, "Wrong size on RBNPC_Grunt_C_UserConstructionScript");
static_assert(offsetof(RBNPC_Grunt_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'RBNPC_Grunt_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'RBNPC_Grunt_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'RBNPC_Grunt_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_3) == 0x000003, "Member 'RBNPC_Grunt_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function RBNPC_Grunt.RBNPC_Grunt_C.OnCustomizationLoaded
// 0x0010 (0x0010 - 0x0000)
struct RBNPC_Grunt_C_OnCustomizationLoaded final
{
public:
	class AActor*                                 CustomizationOwner;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequestID;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPawnCustomizationRequestType                 RequestType;                                       // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Grunt_C_OnCustomizationLoaded) == 0x000008, "Wrong alignment on RBNPC_Grunt_C_OnCustomizationLoaded");
static_assert(sizeof(RBNPC_Grunt_C_OnCustomizationLoaded) == 0x000010, "Wrong size on RBNPC_Grunt_C_OnCustomizationLoaded");
static_assert(offsetof(RBNPC_Grunt_C_OnCustomizationLoaded, CustomizationOwner) == 0x000000, "Member 'RBNPC_Grunt_C_OnCustomizationLoaded::CustomizationOwner' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_OnCustomizationLoaded, RequestID) == 0x000008, "Member 'RBNPC_Grunt_C_OnCustomizationLoaded::RequestID' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_OnCustomizationLoaded, RequestType) == 0x00000C, "Member 'RBNPC_Grunt_C_OnCustomizationLoaded::RequestType' has a wrong offset!");

// Function RBNPC_Grunt.RBNPC_Grunt_C.ExecuteUbergraph_RBNPC_Grunt
// 0x0040 (0x0040 - 0x0000)
struct RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* CustomizationOwner, int32 RequestID, EPawnCustomizationRequestType RequestType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPawnCustomizationManager*            CallFunc_GetPawnCustomizationManager_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_customizationOwner;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_requestID;                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPawnCustomizationRequestType                 K2Node_CustomEvent_requestType;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_LoadNPCGruntResources_ReturnValue;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBPawnCustomizationManager*            CallFunc_GetPawnCustomizationManager_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt) == 0x000008, "Wrong alignment on RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt");
static_assert(sizeof(RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt) == 0x000040, "Wrong size on RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt");
static_assert(offsetof(RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt, EntryPoint) == 0x000000, "Member 'RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt::EntryPoint' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt, CallFunc_GetPawnCustomizationManager_ReturnValue) == 0x000018, "Member 'RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt::CallFunc_GetPawnCustomizationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt, K2Node_CustomEvent_customizationOwner) == 0x000020, "Member 'RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt::K2Node_CustomEvent_customizationOwner' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt, K2Node_CustomEvent_requestID) == 0x000028, "Member 'RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt::K2Node_CustomEvent_requestID' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt, K2Node_CustomEvent_requestType) == 0x00002C, "Member 'RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt::K2Node_CustomEvent_requestType' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00002D, "Member 'RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt, CallFunc_IsDedicatedServer_ReturnValue) == 0x00002E, "Member 'RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt, CallFunc_LoadNPCGruntResources_ReturnValue) == 0x000030, "Member 'RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt::CallFunc_LoadNPCGruntResources_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt, CallFunc_GetPawnCustomizationManager_ReturnValue_1) == 0x000038, "Member 'RBNPC_Grunt_C_ExecuteUbergraph_RBNPC_Grunt::CallFunc_GetPawnCustomizationManager_ReturnValue_1' has a wrong offset!");

// Function RBNPC_Grunt.RBNPC_Grunt_C.GetFaceFXSkeletalMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct RBNPC_Grunt_C_GetFaceFXSkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Grunt_C_GetFaceFXSkeletalMeshComponent) == 0x000008, "Wrong alignment on RBNPC_Grunt_C_GetFaceFXSkeletalMeshComponent");
static_assert(sizeof(RBNPC_Grunt_C_GetFaceFXSkeletalMeshComponent) == 0x000008, "Wrong size on RBNPC_Grunt_C_GetFaceFXSkeletalMeshComponent");
static_assert(offsetof(RBNPC_Grunt_C_GetFaceFXSkeletalMeshComponent, ReturnValue) == 0x000000, "Member 'RBNPC_Grunt_C_GetFaceFXSkeletalMeshComponent::ReturnValue' has a wrong offset!");

// Function RBNPC_Grunt.RBNPC_Grunt_C.GetFoleySwitchOverride
// 0x0010 (0x0010 - 0x0000)
struct RBNPC_Grunt_C_GetFoleySwitchOverride final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetFoleySwitchOverrideFromGruntCustomization_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Grunt_C_GetFoleySwitchOverride) == 0x000004, "Wrong alignment on RBNPC_Grunt_C_GetFoleySwitchOverride");
static_assert(sizeof(RBNPC_Grunt_C_GetFoleySwitchOverride) == 0x000010, "Wrong size on RBNPC_Grunt_C_GetFoleySwitchOverride");
static_assert(offsetof(RBNPC_Grunt_C_GetFoleySwitchOverride, ReturnValue) == 0x000000, "Member 'RBNPC_Grunt_C_GetFoleySwitchOverride::ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Grunt_C_GetFoleySwitchOverride, CallFunc_GetFoleySwitchOverrideFromGruntCustomization_ReturnValue) == 0x000008, "Member 'RBNPC_Grunt_C_GetFoleySwitchOverride::CallFunc_GetFoleySwitchOverrideFromGruntCustomization_ReturnValue' has a wrong offset!");

}

