#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBNPC_GroundPitcher

#include "Basic.hpp"


namespace SDK::Params
{

// Function RBNPC_GroundPitcher.RBNPC_GroundPitcher_C.SetNormalMeshVisibility
// 0x0001 (0x0001 - 0x0000)
struct RBNPC_GroundPitcher_C_SetNormalMeshVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_GroundPitcher_C_SetNormalMeshVisibility) == 0x000001, "Wrong alignment on RBNPC_GroundPitcher_C_SetNormalMeshVisibility");
static_assert(sizeof(RBNPC_GroundPitcher_C_SetNormalMeshVisibility) == 0x000001, "Wrong size on RBNPC_GroundPitcher_C_SetNormalMeshVisibility");
static_assert(offsetof(RBNPC_GroundPitcher_C_SetNormalMeshVisibility, bVisible) == 0x000000, "Member 'RBNPC_GroundPitcher_C_SetNormalMeshVisibility::bVisible' has a wrong offset!");

// Function RBNPC_GroundPitcher.RBNPC_GroundPitcher_C.ExecuteUbergraph_RBNPC_GroundPitcher
// 0x0008 (0x0008 - 0x0000)
struct RBNPC_GroundPitcher_C_ExecuteUbergraph_RBNPC_GroundPitcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_GroundPitcher_C_ExecuteUbergraph_RBNPC_GroundPitcher) == 0x000004, "Wrong alignment on RBNPC_GroundPitcher_C_ExecuteUbergraph_RBNPC_GroundPitcher");
static_assert(sizeof(RBNPC_GroundPitcher_C_ExecuteUbergraph_RBNPC_GroundPitcher) == 0x000008, "Wrong size on RBNPC_GroundPitcher_C_ExecuteUbergraph_RBNPC_GroundPitcher");
static_assert(offsetof(RBNPC_GroundPitcher_C_ExecuteUbergraph_RBNPC_GroundPitcher, EntryPoint) == 0x000000, "Member 'RBNPC_GroundPitcher_C_ExecuteUbergraph_RBNPC_GroundPitcher::EntryPoint' has a wrong offset!");
static_assert(offsetof(RBNPC_GroundPitcher_C_ExecuteUbergraph_RBNPC_GroundPitcher, K2Node_Event_bVisible) == 0x000004, "Member 'RBNPC_GroundPitcher_C_ExecuteUbergraph_RBNPC_GroundPitcher::K2Node_Event_bVisible' has a wrong offset!");

}

