#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBNPC_Spectre_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.UpdateSpectreMeshes
// 0x0018 (0x0018 - 0x0000)
struct RBNPC_Spectre_BP_C_UpdateSpectreMeshes final
{
public:
	EAISpectreVisualType                          Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAISpectreVisualType                          Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Spectre_BP_C_UpdateSpectreMeshes) == 0x000008, "Wrong alignment on RBNPC_Spectre_BP_C_UpdateSpectreMeshes");
static_assert(sizeof(RBNPC_Spectre_BP_C_UpdateSpectreMeshes) == 0x000018, "Wrong size on RBNPC_Spectre_BP_C_UpdateSpectreMeshes");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectreMeshes, Temp_byte_Variable) == 0x000000, "Member 'RBNPC_Spectre_BP_C_UpdateSpectreMeshes::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectreMeshes, Temp_byte_Variable_1) == 0x000001, "Member 'RBNPC_Spectre_BP_C_UpdateSpectreMeshes::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectreMeshes, K2Node_Select_Default) == 0x000008, "Member 'RBNPC_Spectre_BP_C_UpdateSpectreMeshes::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectreMeshes, K2Node_Select_Default_1) == 0x000010, "Member 'RBNPC_Spectre_BP_C_UpdateSpectreMeshes::K2Node_Select_Default_1' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.Update Spectre Meshes Visibiliy
// 0x0078 (0x0078 - 0x0000)
struct RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy final
{
public:
	bool                                          OldMeshVisible;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AllMeshesVisible;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_2;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_3;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy) == 0x000008, "Wrong alignment on RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy");
static_assert(sizeof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy) == 0x000078, "Wrong size on RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, OldMeshVisible) == 0x000000, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::OldMeshVisible' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, AllMeshesVisible) == 0x000001, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::AllMeshesVisible' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, Temp_int_Array_Index_Variable) == 0x000004, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, Temp_int_Array_Index_Variable_2) == 0x00001C, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, Temp_int_Loop_Counter_Variable_2) == 0x000020, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, Temp_int_Array_Index_Variable_3) == 0x000028, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, Temp_int_Loop_Counter_Variable_3) == 0x00002C, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Add_IntInt_ReturnValue_3) == 0x000030, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_IsDedicatedServer_ReturnValue) == 0x000034, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Array_Get_Item) == 0x000038, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Less_IntInt_ReturnValue_1) == 0x000054, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Array_Get_Item_2) == 0x000058, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Array_Length_ReturnValue_2) == 0x000060, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000064, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Less_IntInt_ReturnValue_2) == 0x000065, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Array_Get_Item_3) == 0x000068, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Array_Length_ReturnValue_3) == 0x000070, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000074, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_Less_IntInt_ReturnValue_3) == 0x000075, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000076, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy, CallFunc_BooleanOR_ReturnValue) == 0x000077, "Member 'RBNPC_Spectre_BP_C_Update_Spectre_Meshes_Visibiliy::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.UpdateSpectreVisibility
// 0x0010 (0x0010 - 0x0000)
struct RBNPC_Spectre_BP_C_UpdateSpectreVisibility final
{
public:
	class USkeletalMeshComponent*                 SpectreMesh;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNewVisibility;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Spectre_BP_C_UpdateSpectreVisibility) == 0x000008, "Wrong alignment on RBNPC_Spectre_BP_C_UpdateSpectreVisibility");
static_assert(sizeof(RBNPC_Spectre_BP_C_UpdateSpectreVisibility) == 0x000010, "Wrong size on RBNPC_Spectre_BP_C_UpdateSpectreVisibility");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectreVisibility, SpectreMesh) == 0x000000, "Member 'RBNPC_Spectre_BP_C_UpdateSpectreVisibility::SpectreMesh' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectreVisibility, bNewVisibility) == 0x000008, "Member 'RBNPC_Spectre_BP_C_UpdateSpectreVisibility::bNewVisibility' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectreVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'RBNPC_Spectre_BP_C_UpdateSpectreVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.UpdateRandomOffset
// 0x0020 (0x0020 - 0x0000)
struct RBNPC_Spectre_BP_C_UpdateRandomOffset final
{
public:
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_MakePerlinNoiseAndRemap_ReturnValue;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Spectre_BP_C_UpdateRandomOffset) == 0x000004, "Wrong alignment on RBNPC_Spectre_BP_C_UpdateRandomOffset");
static_assert(sizeof(RBNPC_Spectre_BP_C_UpdateRandomOffset) == 0x000020, "Wrong size on RBNPC_Spectre_BP_C_UpdateRandomOffset");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateRandomOffset, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000000, "Member 'RBNPC_Spectre_BP_C_UpdateRandomOffset::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateRandomOffset, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'RBNPC_Spectre_BP_C_UpdateRandomOffset::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateRandomOffset, CallFunc_K2_MakePerlinNoiseAndRemap_ReturnValue) == 0x000008, "Member 'RBNPC_Spectre_BP_C_UpdateRandomOffset::CallFunc_K2_MakePerlinNoiseAndRemap_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateRandomOffset, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00000C, "Member 'RBNPC_Spectre_BP_C_UpdateRandomOffset::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateRandomOffset, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'RBNPC_Spectre_BP_C_UpdateRandomOffset::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateRandomOffset, CallFunc_MakeVector_ReturnValue) == 0x000014, "Member 'RBNPC_Spectre_BP_C_UpdateRandomOffset::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.UpdateSpectre
// 0x0068 (0x0068 - 0x0000)
struct RBNPC_Spectre_BP_C_UpdateSpectre final
{
public:
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_MakePerlinNoiseAndRemap_ReturnValue;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Spectre_BP_C_UpdateSpectre) == 0x000008, "Wrong alignment on RBNPC_Spectre_BP_C_UpdateSpectre");
static_assert(sizeof(RBNPC_Spectre_BP_C_UpdateSpectre) == 0x000068, "Wrong size on RBNPC_Spectre_BP_C_UpdateSpectre");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000000, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_K2_MakePerlinNoiseAndRemap_ReturnValue) == 0x000010, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_K2_MakePerlinNoiseAndRemap_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_Add_VectorVector_ReturnValue) == 0x000014, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000024, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_IsDedicatedServer_ReturnValue) == 0x000034, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_GetLocalPawn_ReturnValue) == 0x000038, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_GetLocalPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_GetDistanceTo_ReturnValue) == 0x000040, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000044, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000048, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00004C, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_FMin_ReturnValue) == 0x000050, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_FMax_ReturnValue) == 0x000054, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_Add_FloatFloat_ReturnValue) == 0x00005C, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000060, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UpdateSpectre, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000064, "Member 'RBNPC_Spectre_BP_C_UpdateSpectre::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct RBNPC_Spectre_BP_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(RBNPC_Spectre_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on RBNPC_Spectre_BP_C_UserConstructionScript");
static_assert(sizeof(RBNPC_Spectre_BP_C_UserConstructionScript) == 0x000018, "Wrong size on RBNPC_Spectre_BP_C_UserConstructionScript");
static_assert(offsetof(RBNPC_Spectre_BP_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'RBNPC_Spectre_BP_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000008, "Member 'RBNPC_Spectre_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct RBNPC_Spectre_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Spectre_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on RBNPC_Spectre_BP_C_ReceiveTick");
static_assert(sizeof(RBNPC_Spectre_BP_C_ReceiveTick) == 0x000004, "Wrong size on RBNPC_Spectre_BP_C_ReceiveTick");
static_assert(offsetof(RBNPC_Spectre_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'RBNPC_Spectre_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.SetNormalMeshVisibility
// 0x0001 (0x0001 - 0x0000)
struct RBNPC_Spectre_BP_C_SetNormalMeshVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Spectre_BP_C_SetNormalMeshVisibility) == 0x000001, "Wrong alignment on RBNPC_Spectre_BP_C_SetNormalMeshVisibility");
static_assert(sizeof(RBNPC_Spectre_BP_C_SetNormalMeshVisibility) == 0x000001, "Wrong size on RBNPC_Spectre_BP_C_SetNormalMeshVisibility");
static_assert(offsetof(RBNPC_Spectre_BP_C_SetNormalMeshVisibility, bVisible) == 0x000000, "Member 'RBNPC_Spectre_BP_C_SetNormalMeshVisibility::bVisible' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.MotionBlurByBones
// 0x0030 (0x0030 - 0x0000)
struct RBNPC_Spectre_BP_C_MotionBlurByBones final
{
public:
	TArray<class FName>                           ListOfBones;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class USkeletalMeshComponent*>         Target;                                            // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FVector                                Rotation;                                          // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Spectre_BP_C_MotionBlurByBones) == 0x000008, "Wrong alignment on RBNPC_Spectre_BP_C_MotionBlurByBones");
static_assert(sizeof(RBNPC_Spectre_BP_C_MotionBlurByBones) == 0x000030, "Wrong size on RBNPC_Spectre_BP_C_MotionBlurByBones");
static_assert(offsetof(RBNPC_Spectre_BP_C_MotionBlurByBones, ListOfBones) == 0x000000, "Member 'RBNPC_Spectre_BP_C_MotionBlurByBones::ListOfBones' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_MotionBlurByBones, Target) == 0x000010, "Member 'RBNPC_Spectre_BP_C_MotionBlurByBones::Target' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_MotionBlurByBones, Rotation) == 0x000020, "Member 'RBNPC_Spectre_BP_C_MotionBlurByBones::Rotation' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.MotionBlurSwap
// 0x0004 (0x0004 - 0x0000)
struct RBNPC_Spectre_BP_C_MotionBlurSwap final
{
public:
	float                                         blurIntensity;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Spectre_BP_C_MotionBlurSwap) == 0x000004, "Wrong alignment on RBNPC_Spectre_BP_C_MotionBlurSwap");
static_assert(sizeof(RBNPC_Spectre_BP_C_MotionBlurSwap) == 0x000004, "Wrong size on RBNPC_Spectre_BP_C_MotionBlurSwap");
static_assert(offsetof(RBNPC_Spectre_BP_C_MotionBlurSwap, blurIntensity) == 0x000000, "Member 'RBNPC_Spectre_BP_C_MotionBlurSwap::blurIntensity' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.Event_OnSpectreVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct RBNPC_Spectre_BP_C_Event_OnSpectreVisibilityChanged final
{
public:
	bool                                          bShouldBeVisible;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Spectre_BP_C_Event_OnSpectreVisibilityChanged) == 0x000001, "Wrong alignment on RBNPC_Spectre_BP_C_Event_OnSpectreVisibilityChanged");
static_assert(sizeof(RBNPC_Spectre_BP_C_Event_OnSpectreVisibilityChanged) == 0x000001, "Wrong size on RBNPC_Spectre_BP_C_Event_OnSpectreVisibilityChanged");
static_assert(offsetof(RBNPC_Spectre_BP_C_Event_OnSpectreVisibilityChanged, bShouldBeVisible) == 0x000000, "Member 'RBNPC_Spectre_BP_C_Event_OnSpectreVisibilityChanged::bShouldBeVisible' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.startGlitch
// 0x0001 (0x0001 - 0x0000)
struct RBNPC_Spectre_BP_C_StartGlitch final
{
public:
	bool                                          Reset;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Spectre_BP_C_StartGlitch) == 0x000001, "Wrong alignment on RBNPC_Spectre_BP_C_StartGlitch");
static_assert(sizeof(RBNPC_Spectre_BP_C_StartGlitch) == 0x000001, "Wrong size on RBNPC_Spectre_BP_C_StartGlitch");
static_assert(offsetof(RBNPC_Spectre_BP_C_StartGlitch, Reset) == 0x000000, "Member 'RBNPC_Spectre_BP_C_StartGlitch::Reset' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.Event_OnSpectreVisualTypeChanged
// 0x0002 (0x0002 - 0x0000)
struct RBNPC_Spectre_BP_C_Event_OnSpectreVisualTypeChanged final
{
public:
	EAISpectreVisualType                          OldType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAISpectreVisualType                          NewType;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Spectre_BP_C_Event_OnSpectreVisualTypeChanged) == 0x000001, "Wrong alignment on RBNPC_Spectre_BP_C_Event_OnSpectreVisualTypeChanged");
static_assert(sizeof(RBNPC_Spectre_BP_C_Event_OnSpectreVisualTypeChanged) == 0x000002, "Wrong size on RBNPC_Spectre_BP_C_Event_OnSpectreVisualTypeChanged");
static_assert(offsetof(RBNPC_Spectre_BP_C_Event_OnSpectreVisualTypeChanged, OldType) == 0x000000, "Member 'RBNPC_Spectre_BP_C_Event_OnSpectreVisualTypeChanged::OldType' has a wrong offset!");
static_assert(offsetof(RBNPC_Spectre_BP_C_Event_OnSpectreVisualTypeChanged, NewType) == 0x000001, "Member 'RBNPC_Spectre_BP_C_Event_OnSpectreVisualTypeChanged::NewType' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.Event_OnFootstep
// 0x0038 (0x0038 - 0x0000)
struct RBNPC_Spectre_BP_C_Event_OnFootstep final
{
public:
	struct FFootstepData                          FootstepData;                                      // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(RBNPC_Spectre_BP_C_Event_OnFootstep) == 0x000008, "Wrong alignment on RBNPC_Spectre_BP_C_Event_OnFootstep");
static_assert(sizeof(RBNPC_Spectre_BP_C_Event_OnFootstep) == 0x000038, "Wrong size on RBNPC_Spectre_BP_C_Event_OnFootstep");
static_assert(offsetof(RBNPC_Spectre_BP_C_Event_OnFootstep, FootstepData) == 0x000000, "Member 'RBNPC_Spectre_BP_C_Event_OnFootstep::FootstepData' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.BlurHead
// 0x0004 (0x0004 - 0x0000)
struct RBNPC_Spectre_BP_C_BlurHead final
{
public:
	float                                         blurIntensity;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Spectre_BP_C_BlurHead) == 0x000004, "Wrong alignment on RBNPC_Spectre_BP_C_BlurHead");
static_assert(sizeof(RBNPC_Spectre_BP_C_BlurHead) == 0x000004, "Wrong size on RBNPC_Spectre_BP_C_BlurHead");
static_assert(offsetof(RBNPC_Spectre_BP_C_BlurHead, blurIntensity) == 0x000000, "Member 'RBNPC_Spectre_BP_C_BlurHead::blurIntensity' has a wrong offset!");

// Function RBNPC_Spectre_BP.RBNPC_Spectre_BP_C.ExecuteUbergraph_RBNPC_Spectre_BP
// 0x02B8 (0x02B8 - 0x0000)
struct RBNPC_Spectre_BP_C_ExecuteUbergraph_RBNPC_Spectre_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x000C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_1;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_5;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_6;          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_7;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_8;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_9;          // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_CustomEvent_ListOfBones;                    // 0x0058(0x0010)(ConstParm, ReferenceParm)
	TArray<class USkeletalMeshComponent*>         K2Node_CustomEvent_Target;                         // 0x0068(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	struct FVector                                K2Node_CustomEvent_Rotation;                       // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_blurIntensity_1;                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsAHiddenSpectre_ReturnValue;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShouldBeVisible;                     // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_3;                             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Reset;                          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array_1;                          // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBool_ReturnValue_1;                 // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEntity_AnimBP_C*                       K2Node_DynamicCast_AsEntity_Anim_BP;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEntity_AnimBP_C*                       K2Node_DynamicCast_AsEntity_Anim_BP_1;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAISpectreVisualType                          K2Node_Event_oldType;                              // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAISpectreVisualType                          K2Node_Event_newType;                              // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_3;            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEntity_AnimBP_C*                       K2Node_DynamicCast_AsEntity_Anim_BP_2;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEntity_AnimBP_C*                       K2Node_DynamicCast_AsEntity_Anim_BP_3;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAISpectreVisualType                          Temp_byte_Variable;                                // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x017E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x017F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue_1;      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalSpectre_ReturnValue;               // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFootstepData                          K2Node_Event_footstepData;                         // 0x01A0(0x0038)(ConstParm, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_2;                         // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x01F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_blurIntensity;                  // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_2;                          // 0x0220(0x0010)(ConstParm, ReferenceParm)
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array_3;                          // 0x0230(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_4;            // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEntity_AnimBP_C*                       K2Node_DynamicCast_AsEntity_Anim_BP_4;             // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_5;            // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEntity_AnimBP_C*                       K2Node_DynamicCast_AsEntity_Anim_BP_5;             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_6;            // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
