#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBNPC_SleeperScreamer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RBNPC_SleeperScreamer.RBNPC_SleeperScreamer_C.UserConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct RBNPC_SleeperScreamer_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_SleeperScreamer_C_UserConstructionScript) == 0x000001, "Wrong alignment on RBNPC_SleeperScreamer_C_UserConstructionScript");
static_assert(sizeof(RBNPC_SleeperScreamer_C_UserConstructionScript) == 0x000002, "Wrong size on RBNPC_SleeperScreamer_C_UserConstructionScript");
static_assert(offsetof(RBNPC_SleeperScreamer_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'RBNPC_SleeperScreamer_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_SleeperScreamer_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'RBNPC_SleeperScreamer_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function RBNPC_SleeperScreamer.RBNPC_SleeperScreamer_C.Event_OnScreamerSonicStun
// 0x000C (0x000C - 0x0000)
struct RBNPC_SleeperScreamer_C_Event_OnScreamerSonicStun final
{
public:
	struct FVector                                HeadLocation;                                      // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_SleeperScreamer_C_Event_OnScreamerSonicStun) == 0x000004, "Wrong alignment on RBNPC_SleeperScreamer_C_Event_OnScreamerSonicStun");
static_assert(sizeof(RBNPC_SleeperScreamer_C_Event_OnScreamerSonicStun) == 0x00000C, "Wrong size on RBNPC_SleeperScreamer_C_Event_OnScreamerSonicStun");
static_assert(offsetof(RBNPC_SleeperScreamer_C_Event_OnScreamerSonicStun, HeadLocation) == 0x000000, "Member 'RBNPC_SleeperScreamer_C_Event_OnScreamerSonicStun::HeadLocation' has a wrong offset!");

// Function RBNPC_SleeperScreamer.RBNPC_SleeperScreamer_C.ExecuteUbergraph_RBNPC_SleeperScreamer
// 0x0010 (0x0010 - 0x0000)
struct RBNPC_SleeperScreamer_C_ExecuteUbergraph_RBNPC_SleeperScreamer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_headLocation;                         // 0x0004(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_SleeperScreamer_C_ExecuteUbergraph_RBNPC_SleeperScreamer) == 0x000004, "Wrong alignment on RBNPC_SleeperScreamer_C_ExecuteUbergraph_RBNPC_SleeperScreamer");
static_assert(sizeof(RBNPC_SleeperScreamer_C_ExecuteUbergraph_RBNPC_SleeperScreamer) == 0x000010, "Wrong size on RBNPC_SleeperScreamer_C_ExecuteUbergraph_RBNPC_SleeperScreamer");
static_assert(offsetof(RBNPC_SleeperScreamer_C_ExecuteUbergraph_RBNPC_SleeperScreamer, EntryPoint) == 0x000000, "Member 'RBNPC_SleeperScreamer_C_ExecuteUbergraph_RBNPC_SleeperScreamer::EntryPoint' has a wrong offset!");
static_assert(offsetof(RBNPC_SleeperScreamer_C_ExecuteUbergraph_RBNPC_SleeperScreamer, K2Node_Event_headLocation) == 0x000004, "Member 'RBNPC_SleeperScreamer_C_ExecuteUbergraph_RBNPC_SleeperScreamer::K2Node_Event_headLocation' has a wrong offset!");

}

