#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBNPC_SleeperScreamer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RBNPC_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RBNPC_SleeperScreamer.RBNPC_SleeperScreamer_C
// 0x0020 (0x5A90 - 0x5A70)
class ARBNPC_SleeperScreamer_C final : public ARBNPC_BP_C
{
public:
	uint8                                         Pad_5A61[0x7];                                     // 0x5A61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_RBNPC_SleeperScreamer_C;            // 0x5A68(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Ptc_SoundWave;                                     // 0x5A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head_Mesh;                                         // 0x5A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Body_Mesh;                                         // 0x5A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void Event_OnScreamerSonicStun(const struct FVector& HeadLocation);
	void ExecuteUbergraph_RBNPC_SleeperScreamer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RBNPC_SleeperScreamer_C">();
	}
	static class ARBNPC_SleeperScreamer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARBNPC_SleeperScreamer_C>();
	}
};
static_assert(alignof(ARBNPC_SleeperScreamer_C) == 0x000010, "Wrong alignment on ARBNPC_SleeperScreamer_C");
static_assert(sizeof(ARBNPC_SleeperScreamer_C) == 0x005A90, "Wrong size on ARBNPC_SleeperScreamer_C");
static_assert(offsetof(ARBNPC_SleeperScreamer_C, UberGraphFrame_RBNPC_SleeperScreamer_C) == 0x005A68, "Member 'ARBNPC_SleeperScreamer_C::UberGraphFrame_RBNPC_SleeperScreamer_C' has a wrong offset!");
static_assert(offsetof(ARBNPC_SleeperScreamer_C, Ptc_SoundWave) == 0x005A70, "Member 'ARBNPC_SleeperScreamer_C::Ptc_SoundWave' has a wrong offset!");
static_assert(offsetof(ARBNPC_SleeperScreamer_C, Head_Mesh) == 0x005A78, "Member 'ARBNPC_SleeperScreamer_C::Head_Mesh' has a wrong offset!");
static_assert(offsetof(ARBNPC_SleeperScreamer_C, Body_Mesh) == 0x005A80, "Member 'ARBNPC_SleeperScreamer_C::Body_Mesh' has a wrong offset!");

}

