#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBNPC_Pusher

#include "Basic.hpp"


namespace SDK::Params
{

// Function RBNPC_Pusher.RBNPC_Pusher_C.SetNormalMeshVisibility
// 0x0001 (0x0001 - 0x0000)
struct RBNPC_Pusher_C_SetNormalMeshVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Pusher_C_SetNormalMeshVisibility) == 0x000001, "Wrong alignment on RBNPC_Pusher_C_SetNormalMeshVisibility");
static_assert(sizeof(RBNPC_Pusher_C_SetNormalMeshVisibility) == 0x000001, "Wrong size on RBNPC_Pusher_C_SetNormalMeshVisibility");
static_assert(offsetof(RBNPC_Pusher_C_SetNormalMeshVisibility, bVisible) == 0x000000, "Member 'RBNPC_Pusher_C_SetNormalMeshVisibility::bVisible' has a wrong offset!");

// Function RBNPC_Pusher.RBNPC_Pusher_C.ExecuteUbergraph_RBNPC_Pusher
// 0x0008 (0x0008 - 0x0000)
struct RBNPC_Pusher_C_ExecuteUbergraph_RBNPC_Pusher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Pusher_C_ExecuteUbergraph_RBNPC_Pusher) == 0x000004, "Wrong alignment on RBNPC_Pusher_C_ExecuteUbergraph_RBNPC_Pusher");
static_assert(sizeof(RBNPC_Pusher_C_ExecuteUbergraph_RBNPC_Pusher) == 0x000008, "Wrong size on RBNPC_Pusher_C_ExecuteUbergraph_RBNPC_Pusher");
static_assert(offsetof(RBNPC_Pusher_C_ExecuteUbergraph_RBNPC_Pusher, EntryPoint) == 0x000000, "Member 'RBNPC_Pusher_C_ExecuteUbergraph_RBNPC_Pusher::EntryPoint' has a wrong offset!");
static_assert(offsetof(RBNPC_Pusher_C_ExecuteUbergraph_RBNPC_Pusher, K2Node_Event_bVisible) == 0x000004, "Member 'RBNPC_Pusher_C_ExecuteUbergraph_RBNPC_Pusher::K2Node_Event_bVisible' has a wrong offset!");

}

