#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBNPC_Imposter_BP

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RBNPC_Imposter_BP.RBNPC_Imposter_BP_C.GetFacePoseAsset
// 0x0008 (0x0008 - 0x0000)
struct RBNPC_Imposter_BP_C_GetFacePoseAsset final
{
public:
	class UPoseAsset*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Imposter_BP_C_GetFacePoseAsset) == 0x000008, "Wrong alignment on RBNPC_Imposter_BP_C_GetFacePoseAsset");
static_assert(sizeof(RBNPC_Imposter_BP_C_GetFacePoseAsset) == 0x000008, "Wrong size on RBNPC_Imposter_BP_C_GetFacePoseAsset");
static_assert(offsetof(RBNPC_Imposter_BP_C_GetFacePoseAsset, ReturnValue) == 0x000000, "Member 'RBNPC_Imposter_BP_C_GetFacePoseAsset::ReturnValue' has a wrong offset!");

// Function RBNPC_Imposter_BP.RBNPC_Imposter_BP_C.UpdateESOPBatteryType
// 0x0005 (0x0005 - 0x0000)
struct RBNPC_Imposter_BP_C_UpdateESOPBatteryType final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Imposter_BP_C_UpdateESOPBatteryType) == 0x000001, "Wrong alignment on RBNPC_Imposter_BP_C_UpdateESOPBatteryType");
static_assert(sizeof(RBNPC_Imposter_BP_C_UpdateESOPBatteryType) == 0x000005, "Wrong size on RBNPC_Imposter_BP_C_UpdateESOPBatteryType");
static_assert(offsetof(RBNPC_Imposter_BP_C_UpdateESOPBatteryType, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'RBNPC_Imposter_BP_C_UpdateESOPBatteryType::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_UpdateESOPBatteryType, CallFunc_SetStaticMesh_ReturnValue) == 0x000001, "Member 'RBNPC_Imposter_BP_C_UpdateESOPBatteryType::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_UpdateESOPBatteryType, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000002, "Member 'RBNPC_Imposter_BP_C_UpdateESOPBatteryType::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_UpdateESOPBatteryType, CallFunc_SetStaticMesh_ReturnValue_2) == 0x000003, "Member 'RBNPC_Imposter_BP_C_UpdateESOPBatteryType::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_UpdateESOPBatteryType, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'RBNPC_Imposter_BP_C_UpdateESOPBatteryType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function RBNPC_Imposter_BP.RBNPC_Imposter_BP_C.DressCharacter
// 0x0110 (0x0110 - 0x0000)
struct RBNPC_Imposter_BP_C_DressCharacter final
{
public:
	class USkeletalMeshComponent*                 CurrentDataTable;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FImposterDisguiseData                  CallFunc_GetDisguiseData_ReturnValue;              // 0x0018(0x0088)(ConstParm)
	class URBVariatorAction*                      CallFunc_GetVariatorAction_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_GetDefaultActiveSkillMesh_ReturnValue;    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBPlayerCustomizationOption*           CallFunc_GetPlayerCustomizationOptionForSlot_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnemyFace_AnimBlueprint_C*             K2Node_DynamicCast_AsEnemy_Face_Anim_Blueprint;    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBPawnCustomizationManager*            CallFunc_GetPawnCustomizationManager_ReturnValue;  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPoseAsset*                             K2Node_DynamicCast_AsPose_Asset;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Imposter_BP_C_DressCharacter) == 0x000008, "Wrong alignment on RBNPC_Imposter_BP_C_DressCharacter");
static_assert(sizeof(RBNPC_Imposter_BP_C_DressCharacter) == 0x000110, "Wrong size on RBNPC_Imposter_BP_C_DressCharacter");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CurrentDataTable) == 0x000000, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CurrentDataTable' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'RBNPC_Imposter_BP_C_DressCharacter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, Temp_int_Array_Index_Variable) == 0x000010, "Member 'RBNPC_Imposter_BP_C_DressCharacter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_GetDisguiseData_ReturnValue) == 0x000018, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_GetDisguiseData_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_GetVariatorAction_ReturnValue) == 0x0000A0, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_GetVariatorAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_GetDefaultActiveSkillMesh_ReturnValue) == 0x0000B0, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_GetDefaultActiveSkillMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_SetStaticMesh_ReturnValue) == 0x0000B9, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_GetAnimInstance_ReturnValue) == 0x0000C0, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_GetPlayerCustomizationOptionForSlot_ReturnValue) == 0x0000C8, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_GetPlayerCustomizationOptionForSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, K2Node_DynamicCast_AsEnemy_Face_Anim_Blueprint) == 0x0000D0, "Member 'RBNPC_Imposter_BP_C_DressCharacter::K2Node_DynamicCast_AsEnemy_Face_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'RBNPC_Imposter_BP_C_DressCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_IsValid_ReturnValue_2) == 0x0000D9, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000E0, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_GetPawnCustomizationManager_ReturnValue) == 0x0000E8, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_GetPawnCustomizationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, K2Node_DynamicCast_AsPose_Asset) == 0x0000F0, "Member 'RBNPC_Imposter_BP_C_DressCharacter::K2Node_DynamicCast_AsPose_Asset' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'RBNPC_Imposter_BP_C_DressCharacter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_Array_Get_Item) == 0x000100, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_IsValid_ReturnValue_3) == 0x00010C, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_DressCharacter, CallFunc_Less_IntInt_ReturnValue) == 0x00010D, "Member 'RBNPC_Imposter_BP_C_DressCharacter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function RBNPC_Imposter_BP.RBNPC_Imposter_BP_C.UserConstructionScript
// 0x0006 (0x0006 - 0x0000)
struct RBNPC_Imposter_BP_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Imposter_BP_C_UserConstructionScript) == 0x000001, "Wrong alignment on RBNPC_Imposter_BP_C_UserConstructionScript");
static_assert(sizeof(RBNPC_Imposter_BP_C_UserConstructionScript) == 0x000006, "Wrong size on RBNPC_Imposter_BP_C_UserConstructionScript");
static_assert(offsetof(RBNPC_Imposter_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'RBNPC_Imposter_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'RBNPC_Imposter_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'RBNPC_Imposter_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_3) == 0x000003, "Member 'RBNPC_Imposter_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_4) == 0x000004, "Member 'RBNPC_Imposter_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_5) == 0x000005, "Member 'RBNPC_Imposter_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

// Function RBNPC_Imposter_BP.RBNPC_Imposter_BP_C.Event_OnTakeDamage
// 0x0050 (0x0050 - 0x0000)
struct RBNPC_Imposter_BP_C_Event_OnTakeDamage final
{
public:
	struct FDamageInfo                            Info;                                              // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(RBNPC_Imposter_BP_C_Event_OnTakeDamage) == 0x000008, "Wrong alignment on RBNPC_Imposter_BP_C_Event_OnTakeDamage");
static_assert(sizeof(RBNPC_Imposter_BP_C_Event_OnTakeDamage) == 0x000050, "Wrong size on RBNPC_Imposter_BP_C_Event_OnTakeDamage");
static_assert(offsetof(RBNPC_Imposter_BP_C_Event_OnTakeDamage, Info) == 0x000000, "Member 'RBNPC_Imposter_BP_C_Event_OnTakeDamage::Info' has a wrong offset!");

// Function RBNPC_Imposter_BP.RBNPC_Imposter_BP_C.Event_SetCustomization
// 0x0050 (0x0050 - 0x0000)
struct RBNPC_Imposter_BP_C_Event_SetCustomization final
{
public:
	struct FRBPlayerCustomizationInfo             NewCustomization;                                  // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(RBNPC_Imposter_BP_C_Event_SetCustomization) == 0x000008, "Wrong alignment on RBNPC_Imposter_BP_C_Event_SetCustomization");
static_assert(sizeof(RBNPC_Imposter_BP_C_Event_SetCustomization) == 0x000050, "Wrong size on RBNPC_Imposter_BP_C_Event_SetCustomization");
static_assert(offsetof(RBNPC_Imposter_BP_C_Event_SetCustomization, NewCustomization) == 0x000000, "Member 'RBNPC_Imposter_BP_C_Event_SetCustomization::NewCustomization' has a wrong offset!");

// Function RBNPC_Imposter_BP.RBNPC_Imposter_BP_C.OnExtraCustomizationMeshesAddedForSlot
// 0x0018 (0x0018 - 0x0000)
struct RBNPC_Imposter_BP_C_OnExtraCustomizationMeshesAddedForSlot final
{
public:
	TArray<class USkeletalMeshComponent*>         AddedExtraMeshes;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	EPlayerCustomizationSlot                      Slot;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Imposter_BP_C_OnExtraCustomizationMeshesAddedForSlot) == 0x000008, "Wrong alignment on RBNPC_Imposter_BP_C_OnExtraCustomizationMeshesAddedForSlot");
static_assert(sizeof(RBNPC_Imposter_BP_C_OnExtraCustomizationMeshesAddedForSlot) == 0x000018, "Wrong size on RBNPC_Imposter_BP_C_OnExtraCustomizationMeshesAddedForSlot");
static_assert(offsetof(RBNPC_Imposter_BP_C_OnExtraCustomizationMeshesAddedForSlot, AddedExtraMeshes) == 0x000000, "Member 'RBNPC_Imposter_BP_C_OnExtraCustomizationMeshesAddedForSlot::AddedExtraMeshes' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_OnExtraCustomizationMeshesAddedForSlot, Slot) == 0x000010, "Member 'RBNPC_Imposter_BP_C_OnExtraCustomizationMeshesAddedForSlot::Slot' has a wrong offset!");

// Function RBNPC_Imposter_BP.RBNPC_Imposter_BP_C.ExecuteUbergraph_RBNPC_Imposter_BP
// 0x0120 (0x0120 - 0x0000)
struct RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageInfo                            K2Node_Event_info;                                 // 0x0010(0x0050)(ConstParm, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FDamageParameters                      CallFunc_BP_DamageParams_ReturnValue;              // 0x006C(0x0014)(ConstParm, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBPlayerCustomizationInfo             K2Node_Event_newCustomization;                     // 0x0098(0x0050)(ConstParm)
	TArray<class USkeletalMeshComponent*>         K2Node_Event_addedExtraMeshes;                     // 0x00E8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	EPlayerCustomizationSlot                      K2Node_Event_slot;                                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP) == 0x000008, "Wrong alignment on RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP");
static_assert(sizeof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP) == 0x000120, "Wrong size on RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, EntryPoint) == 0x000000, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, Temp_int_Array_Index_Variable) == 0x000004, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, K2Node_Event_info) == 0x000010, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::K2Node_Event_info' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000060, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, CallFunc_BP_DamageParams_ReturnValue) == 0x00006C, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::CallFunc_BP_DamageParams_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, CallFunc_GetSocketLocation_ReturnValue) == 0x000080, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000090, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, K2Node_Event_newCustomization) == 0x000098, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::K2Node_Event_newCustomization' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, K2Node_Event_addedExtraMeshes) == 0x0000E8, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::K2Node_Event_addedExtraMeshes' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, K2Node_Event_slot) == 0x0000F8, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::K2Node_Event_slot' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, CallFunc_Array_Get_Item) == 0x000100, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, CallFunc_Array_Add_ReturnValue) == 0x00010C, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000110, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, Temp_int_Loop_Counter_Variable) == 0x000114, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000118, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00011C, "Member 'RBNPC_Imposter_BP_C_ExecuteUbergraph_RBNPC_Imposter_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function RBNPC_Imposter_BP.RBNPC_Imposter_BP_C.GetShadowSkeletalMeshComponentForSlot
// 0x0010 (0x0010 - 0x0000)
struct RBNPC_Imposter_BP_C_GetShadowSkeletalMeshComponentForSlot final
{
public:
	EPlayerCustomizationSlot                      Slot;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutFound;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Imposter_BP_C_GetShadowSkeletalMeshComponentForSlot) == 0x000008, "Wrong alignment on RBNPC_Imposter_BP_C_GetShadowSkeletalMeshComponentForSlot");
static_assert(sizeof(RBNPC_Imposter_BP_C_GetShadowSkeletalMeshComponentForSlot) == 0x000010, "Wrong size on RBNPC_Imposter_BP_C_GetShadowSkeletalMeshComponentForSlot");
static_assert(offsetof(RBNPC_Imposter_BP_C_GetShadowSkeletalMeshComponentForSlot, Slot) == 0x000000, "Member 'RBNPC_Imposter_BP_C_GetShadowSkeletalMeshComponentForSlot::Slot' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_GetShadowSkeletalMeshComponentForSlot, OutFound) == 0x000001, "Member 'RBNPC_Imposter_BP_C_GetShadowSkeletalMeshComponentForSlot::OutFound' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_GetShadowSkeletalMeshComponentForSlot, ReturnValue) == 0x000008, "Member 'RBNPC_Imposter_BP_C_GetShadowSkeletalMeshComponentForSlot::ReturnValue' has a wrong offset!");

// Function RBNPC_Imposter_BP.RBNPC_Imposter_BP_C.GetMainParentSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct RBNPC_Imposter_BP_C_GetMainParentSkeletalMesh final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Imposter_BP_C_GetMainParentSkeletalMesh) == 0x000008, "Wrong alignment on RBNPC_Imposter_BP_C_GetMainParentSkeletalMesh");
static_assert(sizeof(RBNPC_Imposter_BP_C_GetMainParentSkeletalMesh) == 0x000008, "Wrong size on RBNPC_Imposter_BP_C_GetMainParentSkeletalMesh");
static_assert(offsetof(RBNPC_Imposter_BP_C_GetMainParentSkeletalMesh, ReturnValue) == 0x000000, "Member 'RBNPC_Imposter_BP_C_GetMainParentSkeletalMesh::ReturnValue' has a wrong offset!");

// Function RBNPC_Imposter_BP.RBNPC_Imposter_BP_C.GetWatchComponent
// 0x0008 (0x0008 - 0x0000)
struct RBNPC_Imposter_BP_C_GetWatchComponent final
{
public:
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Imposter_BP_C_GetWatchComponent) == 0x000008, "Wrong alignment on RBNPC_Imposter_BP_C_GetWatchComponent");
static_assert(sizeof(RBNPC_Imposter_BP_C_GetWatchComponent) == 0x000008, "Wrong size on RBNPC_Imposter_BP_C_GetWatchComponent");
static_assert(offsetof(RBNPC_Imposter_BP_C_GetWatchComponent, ReturnValue) == 0x000000, "Member 'RBNPC_Imposter_BP_C_GetWatchComponent::ReturnValue' has a wrong offset!");

// Function RBNPC_Imposter_BP.RBNPC_Imposter_BP_C.GetPlayerCustomizationInfo
// 0x00A0 (0x00A0 - 0x0000)
struct RBNPC_Imposter_BP_C_GetPlayerCustomizationInfo final
{
public:
	struct FRBPlayerCustomizationInfo             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm)
	struct FRBPlayerCustomizationInfo             CallFunc_BP_GetCustomizationInfo_ReturnValue;      // 0x0050(0x0050)(ConstParm)
};
static_assert(alignof(RBNPC_Imposter_BP_C_GetPlayerCustomizationInfo) == 0x000008, "Wrong alignment on RBNPC_Imposter_BP_C_GetPlayerCustomizationInfo");
static_assert(sizeof(RBNPC_Imposter_BP_C_GetPlayerCustomizationInfo) == 0x0000A0, "Wrong size on RBNPC_Imposter_BP_C_GetPlayerCustomizationInfo");
static_assert(offsetof(RBNPC_Imposter_BP_C_GetPlayerCustomizationInfo, ReturnValue) == 0x000000, "Member 'RBNPC_Imposter_BP_C_GetPlayerCustomizationInfo::ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_GetPlayerCustomizationInfo, CallFunc_BP_GetCustomizationInfo_ReturnValue) == 0x000050, "Member 'RBNPC_Imposter_BP_C_GetPlayerCustomizationInfo::CallFunc_BP_GetCustomizationInfo_ReturnValue' has a wrong offset!");

// Function RBNPC_Imposter_BP.RBNPC_Imposter_BP_C.GetSkeletalMeshComponentForSlot
// 0x0018 (0x0018 - 0x0000)
struct RBNPC_Imposter_BP_C_GetSkeletalMeshComponentForSlot final
{
public:
	EPlayerCustomizationSlot                      Slot;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBNPC_Imposter_BP_C_GetSkeletalMeshComponentForSlot) == 0x000008, "Wrong alignment on RBNPC_Imposter_BP_C_GetSkeletalMeshComponentForSlot");
static_assert(sizeof(RBNPC_Imposter_BP_C_GetSkeletalMeshComponentForSlot) == 0x000018, "Wrong size on RBNPC_Imposter_BP_C_GetSkeletalMeshComponentForSlot");
static_assert(offsetof(RBNPC_Imposter_BP_C_GetSkeletalMeshComponentForSlot, Slot) == 0x000000, "Member 'RBNPC_Imposter_BP_C_GetSkeletalMeshComponentForSlot::Slot' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_GetSkeletalMeshComponentForSlot, ReturnValue) == 0x000008, "Member 'RBNPC_Imposter_BP_C_GetSkeletalMeshComponentForSlot::ReturnValue' has a wrong offset!");
static_assert(offsetof(RBNPC_Imposter_BP_C_GetSkeletalMeshComponentForSlot, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'RBNPC_Imposter_BP_C_GetSkeletalMeshComponentForSlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function RBNPC_Imposter_BP.RBNPC_Imposter_BP_C.GetFaceFXSkeletalMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct RBNPC_Imposter_BP_C_GetFaceFXSkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RBNPC_Imposter_BP_C_GetFaceFXSkeletalMeshComponent) == 0x000008, "Wrong alignment on RBNPC_Imposter_BP_C_GetFaceFXSkeletalMeshComponent");
static_assert(sizeof(RBNPC_Imposter_BP_C_GetFaceFXSkeletalMeshComponent) == 0x000008, "Wrong size on RBNPC_Imposter_BP_C_GetFaceFXSkeletalMeshComponent");
static_assert(offsetof(RBNPC_Imposter_BP_C_GetFaceFXSkeletalMeshComponent, ReturnValue) == 0x000000, "Member 'RBNPC_Imposter_BP_C_GetFaceFXSkeletalMeshComponent::ReturnValue' has a wrong offset!");

}

