#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RBOptionsTabMenuButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function RBOptionsTabMenuButton.RBOptionsTabMenuButton_C.ExecuteUbergraph_RBOptionsTabMenuButton
// 0x0008 (0x0008 - 0x0000)
struct RBOptionsTabMenuButton_C_ExecuteUbergraph_RBOptionsTabMenuButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBOptionsTabMenuButton_C_ExecuteUbergraph_RBOptionsTabMenuButton) == 0x000004, "Wrong alignment on RBOptionsTabMenuButton_C_ExecuteUbergraph_RBOptionsTabMenuButton");
static_assert(sizeof(RBOptionsTabMenuButton_C_ExecuteUbergraph_RBOptionsTabMenuButton) == 0x000008, "Wrong size on RBOptionsTabMenuButton_C_ExecuteUbergraph_RBOptionsTabMenuButton");
static_assert(offsetof(RBOptionsTabMenuButton_C_ExecuteUbergraph_RBOptionsTabMenuButton, EntryPoint) == 0x000000, "Member 'RBOptionsTabMenuButton_C_ExecuteUbergraph_RBOptionsTabMenuButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_ExecuteUbergraph_RBOptionsTabMenuButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'RBOptionsTabMenuButton_C_ExecuteUbergraph_RBOptionsTabMenuButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function RBOptionsTabMenuButton.RBOptionsTabMenuButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct RBOptionsTabMenuButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBOptionsTabMenuButton_C_PreConstruct) == 0x000001, "Wrong alignment on RBOptionsTabMenuButton_C_PreConstruct");
static_assert(sizeof(RBOptionsTabMenuButton_C_PreConstruct) == 0x000001, "Wrong size on RBOptionsTabMenuButton_C_PreConstruct");
static_assert(offsetof(RBOptionsTabMenuButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'RBOptionsTabMenuButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function RBOptionsTabMenuButton.RBOptionsTabMenuButton_C.Refresh
// 0x0060 (0x0060 - 0x0000)
struct RBOptionsTabMenuButton_C_Refresh final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_3;                           // 0x0038(0x0028)()
};
static_assert(alignof(RBOptionsTabMenuButton_C_Refresh) == 0x000008, "Wrong alignment on RBOptionsTabMenuButton_C_Refresh");
static_assert(sizeof(RBOptionsTabMenuButton_C_Refresh) == 0x000060, "Wrong size on RBOptionsTabMenuButton_C_Refresh");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, Temp_bool_Variable) == 0x000000, "Member 'RBOptionsTabMenuButton_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, Temp_float_Variable) == 0x000004, "Member 'RBOptionsTabMenuButton_C_Refresh::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, Temp_float_Variable_1) == 0x000008, "Member 'RBOptionsTabMenuButton_C_Refresh::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, Temp_bool_Variable_1) == 0x00000C, "Member 'RBOptionsTabMenuButton_C_Refresh::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, Temp_byte_Variable) == 0x00000D, "Member 'RBOptionsTabMenuButton_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, Temp_byte_Variable_1) == 0x00000E, "Member 'RBOptionsTabMenuButton_C_Refresh::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, Temp_bool_Variable_2) == 0x00000F, "Member 'RBOptionsTabMenuButton_C_Refresh::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, Temp_byte_Variable_2) == 0x000010, "Member 'RBOptionsTabMenuButton_C_Refresh::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, Temp_byte_Variable_3) == 0x000011, "Member 'RBOptionsTabMenuButton_C_Refresh::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, Temp_bool_Variable_3) == 0x000012, "Member 'RBOptionsTabMenuButton_C_Refresh::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000018, "Member 'RBOptionsTabMenuButton_C_Refresh::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, K2Node_Select_Default) == 0x000020, "Member 'RBOptionsTabMenuButton_C_Refresh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, K2Node_MakeStruct_Margin) == 0x000024, "Member 'RBOptionsTabMenuButton_C_Refresh::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, K2Node_Select_Default_1) == 0x000034, "Member 'RBOptionsTabMenuButton_C_Refresh::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, CallFunc_BooleanOR_ReturnValue) == 0x000035, "Member 'RBOptionsTabMenuButton_C_Refresh::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, K2Node_Select_Default_2) == 0x000036, "Member 'RBOptionsTabMenuButton_C_Refresh::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(RBOptionsTabMenuButton_C_Refresh, K2Node_Select_Default_3) == 0x000038, "Member 'RBOptionsTabMenuButton_C_Refresh::K2Node_Select_Default_3' has a wrong offset!");

// Function RBOptionsTabMenuButton.RBOptionsTabMenuButton_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct RBOptionsTabMenuButton_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(RBOptionsTabMenuButton_C_SetText) == 0x000008, "Wrong alignment on RBOptionsTabMenuButton_C_SetText");
static_assert(sizeof(RBOptionsTabMenuButton_C_SetText) == 0x000018, "Wrong size on RBOptionsTabMenuButton_C_SetText");
static_assert(offsetof(RBOptionsTabMenuButton_C_SetText, Text) == 0x000000, "Member 'RBOptionsTabMenuButton_C_SetText::Text' has a wrong offset!");

// Function RBOptionsTabMenuButton.RBOptionsTabMenuButton_C.SetHovered
// 0x0001 (0x0001 - 0x0000)
struct RBOptionsTabMenuButton_C_SetHovered final
{
public:
	bool                                          bInHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RBOptionsTabMenuButton_C_SetHovered) == 0x000001, "Wrong alignment on RBOptionsTabMenuButton_C_SetHovered");
static_assert(sizeof(RBOptionsTabMenuButton_C_SetHovered) == 0x000001, "Wrong size on RBOptionsTabMenuButton_C_SetHovered");
static_assert(offsetof(RBOptionsTabMenuButton_C_SetHovered, bInHovered) == 0x000000, "Member 'RBOptionsTabMenuButton_C_SetHovered::bInHovered' has a wrong offset!");

}

