#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RespawnMinusConsumable_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SimpleMesh_Pickup_BP_classes.hpp"
#include "OPP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Respawn-Consumable_BP.Respawn-Consumable_BP_C
// 0x0020 (0x0AA0 - 0x0A80)
class ARespawnMinusConsumable_BP_C final : public ASimpleMesh_Pickup_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_RespawnMinusConsumable_BP_C;        // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Pill;                                              // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 ItemHandMesh;                                      // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ResetPill();
	void SwapHand();
	void UserConstructionScript();
	void OnPawnSpecialMoveCompleted(class ARBPawn* Pawn, ESpecialMove SpecialMove, bool bInterrupted);
	void OnPawnDoSpecialMoveAction(class ARBPawn* Pawn, ESpecialMove SpecialMove);
	void BP_OnConsumeItemAnimNotify(class FName ID);
	void ExecuteUbergraph_RespawnMinusConsumable_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Respawn-Consumable_BP_C">();
	}
	static class ARespawnMinusConsumable_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARespawnMinusConsumable_BP_C>();
	}
};
static_assert(alignof(ARespawnMinusConsumable_BP_C) == 0x000010, "Wrong alignment on ARespawnMinusConsumable_BP_C");
static_assert(sizeof(ARespawnMinusConsumable_BP_C) == 0x000AA0, "Wrong size on ARespawnMinusConsumable_BP_C");
static_assert(offsetof(ARespawnMinusConsumable_BP_C, UberGraphFrame_RespawnMinusConsumable_BP_C) == 0x000A80, "Member 'ARespawnMinusConsumable_BP_C::UberGraphFrame_RespawnMinusConsumable_BP_C' has a wrong offset!");
static_assert(offsetof(ARespawnMinusConsumable_BP_C, Pill) == 0x000A88, "Member 'ARespawnMinusConsumable_BP_C::Pill' has a wrong offset!");
static_assert(offsetof(ARespawnMinusConsumable_BP_C, ItemHandMesh) == 0x000A90, "Member 'ARespawnMinusConsumable_BP_C::ItemHandMesh' has a wrong offset!");

}

