#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReturningToSleepRoomPendingWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ReturningToSleepRoomPendingWidget.ReturningToSleepRoomPendingWidget_C
// 0x0030 (0x0318 - 0x02E8)
class UReturningToSleepRoomPendingWidget_C final : public URBHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              backgroundScaleBox;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 buttonBackground;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              LoadingVideoContainer;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadingVideoWidget_C*                  LoadingVideoWidget;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TravellingTextBlock;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetText(const class FText& Text);
	void Construct();
	void ExecuteUbergraph_ReturningToSleepRoomPendingWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ReturningToSleepRoomPendingWidget_C">();
	}
	static class UReturningToSleepRoomPendingWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReturningToSleepRoomPendingWidget_C>();
	}
};
static_assert(alignof(UReturningToSleepRoomPendingWidget_C) == 0x000008, "Wrong alignment on UReturningToSleepRoomPendingWidget_C");
static_assert(sizeof(UReturningToSleepRoomPendingWidget_C) == 0x000318, "Wrong size on UReturningToSleepRoomPendingWidget_C");
static_assert(offsetof(UReturningToSleepRoomPendingWidget_C, UberGraphFrame) == 0x0002E8, "Member 'UReturningToSleepRoomPendingWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UReturningToSleepRoomPendingWidget_C, backgroundScaleBox) == 0x0002F0, "Member 'UReturningToSleepRoomPendingWidget_C::backgroundScaleBox' has a wrong offset!");
static_assert(offsetof(UReturningToSleepRoomPendingWidget_C, buttonBackground) == 0x0002F8, "Member 'UReturningToSleepRoomPendingWidget_C::buttonBackground' has a wrong offset!");
static_assert(offsetof(UReturningToSleepRoomPendingWidget_C, LoadingVideoContainer) == 0x000300, "Member 'UReturningToSleepRoomPendingWidget_C::LoadingVideoContainer' has a wrong offset!");
static_assert(offsetof(UReturningToSleepRoomPendingWidget_C, LoadingVideoWidget) == 0x000308, "Member 'UReturningToSleepRoomPendingWidget_C::LoadingVideoWidget' has a wrong offset!");
static_assert(offsetof(UReturningToSleepRoomPendingWidget_C, TravellingTextBlock) == 0x000310, "Member 'UReturningToSleepRoomPendingWidget_C::TravellingTextBlock' has a wrong offset!");

}

