#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReviveSyringeStationBreak_GhostAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ReviveSyringeStationBreak_GhostAnimBP.ReviveSyringeStationBreak_GhostAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ReviveSyringeStationBreak_GhostAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ReviveSyringeStationBreak_GhostAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on ReviveSyringeStationBreak_GhostAnimBP_C_AnimGraph");
static_assert(sizeof(ReviveSyringeStationBreak_GhostAnimBP_C_AnimGraph) == 0x000010, "Wrong size on ReviveSyringeStationBreak_GhostAnimBP_C_AnimGraph");
static_assert(offsetof(ReviveSyringeStationBreak_GhostAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ReviveSyringeStationBreak_GhostAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ReviveSyringeStationBreak_GhostAnimBP.ReviveSyringeStationBreak_GhostAnimBP_C.ExecuteUbergraph_ReviveSyringeStationBreak_GhostAnimBP
// 0x0008 (0x0008 - 0x0000)
struct ReviveSyringeStationBreak_GhostAnimBP_C_ExecuteUbergraph_ReviveSyringeStationBreak_GhostAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GhostAnimTransition_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReviveSyringeStationBreak_GhostAnimBP_C_ExecuteUbergraph_ReviveSyringeStationBreak_GhostAnimBP) == 0x000004, "Wrong alignment on ReviveSyringeStationBreak_GhostAnimBP_C_ExecuteUbergraph_ReviveSyringeStationBreak_GhostAnimBP");
static_assert(sizeof(ReviveSyringeStationBreak_GhostAnimBP_C_ExecuteUbergraph_ReviveSyringeStationBreak_GhostAnimBP) == 0x000008, "Wrong size on ReviveSyringeStationBreak_GhostAnimBP_C_ExecuteUbergraph_ReviveSyringeStationBreak_GhostAnimBP");
static_assert(offsetof(ReviveSyringeStationBreak_GhostAnimBP_C_ExecuteUbergraph_ReviveSyringeStationBreak_GhostAnimBP, EntryPoint) == 0x000000, "Member 'ReviveSyringeStationBreak_GhostAnimBP_C_ExecuteUbergraph_ReviveSyringeStationBreak_GhostAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ReviveSyringeStationBreak_GhostAnimBP_C_ExecuteUbergraph_ReviveSyringeStationBreak_GhostAnimBP, CallFunc_GhostAnimTransition_ReturnValue) == 0x000004, "Member 'ReviveSyringeStationBreak_GhostAnimBP_C_ExecuteUbergraph_ReviveSyringeStationBreak_GhostAnimBP::CallFunc_GhostAnimTransition_ReturnValue' has a wrong offset!");

}

