#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardDetailLineEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RewardDetailLineEntry.RewardDetailLineEntry_C.Setup
// 0x00D0 (0x00D0 - 0x0000)
struct RewardDetailLineEntry_C_Setup final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00B8(0x0018)()
};
static_assert(alignof(RewardDetailLineEntry_C_Setup) == 0x000008, "Wrong alignment on RewardDetailLineEntry_C_Setup");
static_assert(sizeof(RewardDetailLineEntry_C_Setup) == 0x0000D0, "Wrong size on RewardDetailLineEntry_C_Setup");
static_assert(offsetof(RewardDetailLineEntry_C_Setup, Temp_bool_Variable) == 0x000000, "Member 'RewardDetailLineEntry_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RewardDetailLineEntry_C_Setup, Temp_text_Variable) == 0x000008, "Member 'RewardDetailLineEntry_C_Setup::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(RewardDetailLineEntry_C_Setup, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'RewardDetailLineEntry_C_Setup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardDetailLineEntry_C_Setup, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'RewardDetailLineEntry_C_Setup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardDetailLineEntry_C_Setup, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'RewardDetailLineEntry_C_Setup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardDetailLineEntry_C_Setup, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'RewardDetailLineEntry_C_Setup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(RewardDetailLineEntry_C_Setup, CallFunc_BooleanAND_ReturnValue) == 0x000088, "Member 'RewardDetailLineEntry_C_Setup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardDetailLineEntry_C_Setup, K2Node_MakeArray_Array) == 0x000090, "Member 'RewardDetailLineEntry_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(RewardDetailLineEntry_C_Setup, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'RewardDetailLineEntry_C_Setup::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardDetailLineEntry_C_Setup, K2Node_Select_Default) == 0x0000B8, "Member 'RewardDetailLineEntry_C_Setup::K2Node_Select_Default' has a wrong offset!");

// Function RewardDetailLineEntry.RewardDetailLineEntry_C.Init
// 0x0020 (0x0020 - 0x0000)
struct RewardDetailLineEntry_C_Init final
{
public:
	class FText                                   DetailText_0;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Xp;                                                // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMaxLevel;                                       // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RewardDetailLineEntry_C_Init) == 0x000008, "Wrong alignment on RewardDetailLineEntry_C_Init");
static_assert(sizeof(RewardDetailLineEntry_C_Init) == 0x000020, "Wrong size on RewardDetailLineEntry_C_Init");
static_assert(offsetof(RewardDetailLineEntry_C_Init, DetailText_0) == 0x000000, "Member 'RewardDetailLineEntry_C_Init::DetailText_0' has a wrong offset!");
static_assert(offsetof(RewardDetailLineEntry_C_Init, Xp) == 0x000018, "Member 'RewardDetailLineEntry_C_Init::Xp' has a wrong offset!");
static_assert(offsetof(RewardDetailLineEntry_C_Init, bIsMaxLevel) == 0x00001C, "Member 'RewardDetailLineEntry_C_Init::bIsMaxLevel' has a wrong offset!");

// Function RewardDetailLineEntry.RewardDetailLineEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct RewardDetailLineEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RewardDetailLineEntry_C_PreConstruct) == 0x000001, "Wrong alignment on RewardDetailLineEntry_C_PreConstruct");
static_assert(sizeof(RewardDetailLineEntry_C_PreConstruct) == 0x000001, "Wrong size on RewardDetailLineEntry_C_PreConstruct");
static_assert(offsetof(RewardDetailLineEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'RewardDetailLineEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function RewardDetailLineEntry.RewardDetailLineEntry_C.ExecuteUbergraph_RewardDetailLineEntry
// 0x0008 (0x0008 - 0x0000)
struct RewardDetailLineEntry_C_ExecuteUbergraph_RewardDetailLineEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RewardDetailLineEntry_C_ExecuteUbergraph_RewardDetailLineEntry) == 0x000004, "Wrong alignment on RewardDetailLineEntry_C_ExecuteUbergraph_RewardDetailLineEntry");
static_assert(sizeof(RewardDetailLineEntry_C_ExecuteUbergraph_RewardDetailLineEntry) == 0x000008, "Wrong size on RewardDetailLineEntry_C_ExecuteUbergraph_RewardDetailLineEntry");
static_assert(offsetof(RewardDetailLineEntry_C_ExecuteUbergraph_RewardDetailLineEntry, EntryPoint) == 0x000000, "Member 'RewardDetailLineEntry_C_ExecuteUbergraph_RewardDetailLineEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(RewardDetailLineEntry_C_ExecuteUbergraph_RewardDetailLineEntry, K2Node_Event_IsDesignTime) == 0x000004, "Member 'RewardDetailLineEntry_C_ExecuteUbergraph_RewardDetailLineEntry::K2Node_Event_IsDesignTime' has a wrong offset!");

}

