#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardRoom_DoorMinus02_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RewardRoom_Door-02_BP.RewardRoom_Door-02_BP_C.RefreshVisualHackState
// 0x0003 (0x0003 - 0x0000)
struct RewardRoom_DoorMinus02_BP_C_RefreshVisualHackState final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHackedDisabled_out;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActivelyBeingHacked_out;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RewardRoom_DoorMinus02_BP_C_RefreshVisualHackState) == 0x000001, "Wrong alignment on RewardRoom_DoorMinus02_BP_C_RefreshVisualHackState");
static_assert(sizeof(RewardRoom_DoorMinus02_BP_C_RefreshVisualHackState) == 0x000003, "Wrong size on RewardRoom_DoorMinus02_BP_C_RefreshVisualHackState");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_RefreshVisualHackState, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'RewardRoom_DoorMinus02_BP_C_RefreshVisualHackState::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_RefreshVisualHackState, CallFunc_IsHackedDisabled_out) == 0x000001, "Member 'RewardRoom_DoorMinus02_BP_C_RefreshVisualHackState::CallFunc_IsHackedDisabled_out' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_RefreshVisualHackState, CallFunc_IsActivelyBeingHacked_out) == 0x000002, "Member 'RewardRoom_DoorMinus02_BP_C_RefreshVisualHackState::CallFunc_IsActivelyBeingHacked_out' has a wrong offset!");

// Function RewardRoom_Door-02_BP.RewardRoom_Door-02_BP_C.IsHackedDisabled
// 0x0020 (0x0020 - 0x0000)
struct RewardRoom_DoorMinus02_BP_C_IsHackedDisabled final
{
public:
	bool                                          Out;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBHackableComponent*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHackState                                    CallFunc_GetCurrentHackState_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RewardRoom_DoorMinus02_BP_C_IsHackedDisabled) == 0x000008, "Wrong alignment on RewardRoom_DoorMinus02_BP_C_IsHackedDisabled");
static_assert(sizeof(RewardRoom_DoorMinus02_BP_C_IsHackedDisabled) == 0x000020, "Wrong size on RewardRoom_DoorMinus02_BP_C_IsHackedDisabled");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsHackedDisabled, Out) == 0x000000, "Member 'RewardRoom_DoorMinus02_BP_C_IsHackedDisabled::Out' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsHackedDisabled, Temp_int_Array_Index_Variable) == 0x000004, "Member 'RewardRoom_DoorMinus02_BP_C_IsHackedDisabled::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsHackedDisabled, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'RewardRoom_DoorMinus02_BP_C_IsHackedDisabled::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsHackedDisabled, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'RewardRoom_DoorMinus02_BP_C_IsHackedDisabled::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsHackedDisabled, CallFunc_Array_Get_Item) == 0x000010, "Member 'RewardRoom_DoorMinus02_BP_C_IsHackedDisabled::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsHackedDisabled, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'RewardRoom_DoorMinus02_BP_C_IsHackedDisabled::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsHackedDisabled, CallFunc_GetCurrentHackState_ReturnValue) == 0x00001C, "Member 'RewardRoom_DoorMinus02_BP_C_IsHackedDisabled::CallFunc_GetCurrentHackState_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsHackedDisabled, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'RewardRoom_DoorMinus02_BP_C_IsHackedDisabled::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsHackedDisabled, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001E, "Member 'RewardRoom_DoorMinus02_BP_C_IsHackedDisabled::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function RewardRoom_Door-02_BP.RewardRoom_Door-02_BP_C.IsActivelyBeingHacked
// 0x0020 (0x0020 - 0x0000)
struct RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked final
{
public:
	bool                                          Out;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBHackableComponent*                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHackState                                    CallFunc_GetCurrentHackState_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked) == 0x000008, "Wrong alignment on RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked");
static_assert(sizeof(RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked) == 0x000020, "Wrong size on RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked, Out) == 0x000000, "Member 'RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked::Out' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked, Temp_int_Array_Index_Variable) == 0x000004, "Member 'RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked, CallFunc_Array_Get_Item) == 0x000010, "Member 'RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked, CallFunc_GetCurrentHackState_ReturnValue) == 0x00001C, "Member 'RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked::CallFunc_GetCurrentHackState_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001E, "Member 'RewardRoom_DoorMinus02_BP_C_IsActivelyBeingHacked::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function RewardRoom_Door-02_BP.RewardRoom_Door-02_BP_C.UserConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct RewardRoom_DoorMinus02_BP_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RewardRoom_DoorMinus02_BP_C_UserConstructionScript) == 0x000001, "Wrong alignment on RewardRoom_DoorMinus02_BP_C_UserConstructionScript");
static_assert(sizeof(RewardRoom_DoorMinus02_BP_C_UserConstructionScript) == 0x000002, "Wrong size on RewardRoom_DoorMinus02_BP_C_UserConstructionScript");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'RewardRoom_DoorMinus02_BP_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000001, "Member 'RewardRoom_DoorMinus02_BP_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function RewardRoom_Door-02_BP.RewardRoom_Door-02_BP_C.BP_OnNumberOfRewardUnlockActiveChanged
// 0x0004 (0x0004 - 0x0000)
struct RewardRoom_DoorMinus02_BP_C_BP_OnNumberOfRewardUnlockActiveChanged final
{
public:
	int32                                         NumberOfRewardUnlockActive_0;                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardRoom_DoorMinus02_BP_C_BP_OnNumberOfRewardUnlockActiveChanged) == 0x000004, "Wrong alignment on RewardRoom_DoorMinus02_BP_C_BP_OnNumberOfRewardUnlockActiveChanged");
static_assert(sizeof(RewardRoom_DoorMinus02_BP_C_BP_OnNumberOfRewardUnlockActiveChanged) == 0x000004, "Wrong size on RewardRoom_DoorMinus02_BP_C_BP_OnNumberOfRewardUnlockActiveChanged");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_BP_OnNumberOfRewardUnlockActiveChanged, NumberOfRewardUnlockActive_0) == 0x000000, "Member 'RewardRoom_DoorMinus02_BP_C_BP_OnNumberOfRewardUnlockActiveChanged::NumberOfRewardUnlockActive_0' has a wrong offset!");

// Function RewardRoom_Door-02_BP.RewardRoom_Door-02_BP_C.BndEvt__RewardRoom_Door-02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'RewardRoom_DoorMinus02_BP_C_BndEvt__RewardRoom_DoorMinus02_BP_StingerBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function RewardRoom_Door-02_BP.RewardRoom_Door-02_BP_C.OnAnyHackStateChange
// 0x0008 (0x0008 - 0x0000)
struct RewardRoom_DoorMinus02_BP_C_OnAnyHackStateChange final
{
public:
	class URBHackableComponent*                   HackableComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RewardRoom_DoorMinus02_BP_C_OnAnyHackStateChange) == 0x000008, "Wrong alignment on RewardRoom_DoorMinus02_BP_C_OnAnyHackStateChange");
static_assert(sizeof(RewardRoom_DoorMinus02_BP_C_OnAnyHackStateChange) == 0x000008, "Wrong size on RewardRoom_DoorMinus02_BP_C_OnAnyHackStateChange");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_OnAnyHackStateChange, HackableComponent) == 0x000000, "Member 'RewardRoom_DoorMinus02_BP_C_OnAnyHackStateChange::HackableComponent' has a wrong offset!");

// Function RewardRoom_Door-02_BP.RewardRoom_Door-02_BP_C.ExecuteUbergraph_RewardRoom_Door-02_BP
// 0x02F8 (0x02F8 - 0x0000)
struct RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class URBHackableComponent* HackableComponent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_numberOfRewardUnlockActive;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0058(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_Select_Default;                             // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0108(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0194(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x01C8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BP_IsOpen_ReturnValue;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_DynamicCast_AsRB_Player;                    // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x2];                                      // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0268(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_1;           // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerTime_ReturnValue;                // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetElapsedTime_ReturnValue;               // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0286(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0287(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class URBCoopOperatableComponent*             CallFunc_Array_Get_Item;                           // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARewardRoom_ButtonMinusCoop_BP_C*       K2Node_DynamicCast_AsReward_Room_Button__Coop_BP;  // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URBHackableComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBHackableComponent*                   K2Node_CustomEvent_hackableComponent;              // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBHackableComponent*                   CallFunc_Array_Get_Item_1;                         // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARewardRoom_ButtonMinusCoop_BP_C*       CallFunc_Array_Get_Item_2;                         // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP) == 0x000008, "Wrong alignment on RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP");
static_assert(sizeof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP) == 0x0002F8, "Wrong size on RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, EntryPoint) == 0x000000, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, Temp_int_Array_Index_Variable) == 0x000004, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, Temp_bool_Variable) == 0x000008, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_MakeRotator_ReturnValue) == 0x00000C, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000024, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00002C, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, Temp_int_Loop_Counter_Variable_2) == 0x000034, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Add_IntInt_ReturnValue_2) == 0x000038, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, Temp_int_Array_Index_Variable_2) == 0x00003C, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x000040, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_Event_numberOfRewardUnlockActive) == 0x000054, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_Event_numberOfRewardUnlockActive' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000058, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_SwitchInteger_CmpSuccess) == 0x0000E0, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E8, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_SelectFloat_ReturnValue) == 0x0000EC, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_Select_Default) == 0x0000F0, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_MakeRotator_ReturnValue_1) == 0x0000F8, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000104, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x000108, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000190, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, Temp_delegate_Variable) == 0x000194, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_PostEventOnActor_ReturnValue) == 0x0001A4, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001A8, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_ComponentBoundEvent_OtherActor) == 0x0001B0, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_ComponentBoundEvent_OtherComp) == 0x0001B8, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001C0, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_ComponentBoundEvent_bFromSweep) == 0x0001C4, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_ComponentBoundEvent_SweepResult) == 0x0001C8, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_BP_IsOpen_ReturnValue) == 0x000250, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_BP_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_DynamicCast_AsRB_Player) == 0x000258, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_DynamicCast_AsRB_Player' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_DynamicCast_bSuccess) == 0x000260, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Array_Contains_ReturnValue) == 0x000261, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Array_AddUnique_ReturnValue) == 0x000264, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, Temp_delegate_Variable_1) == 0x000268, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_PostEventOnActor_ReturnValue_1) == 0x000278, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_PostEventOnActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_GetServerTime_ReturnValue) == 0x00027C, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_GetServerTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_GetElapsedTime_ReturnValue) == 0x000280, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_GetElapsedTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Less_FloatFloat_ReturnValue) == 0x000284, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Not_PreBool_ReturnValue_1) == 0x000285, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x000286, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_HasAuthority_ReturnValue) == 0x000287, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Array_Get_Item) == 0x000288, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_GetOwner_ReturnValue) == 0x000290, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Array_Length_ReturnValue_1) == 0x000298, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_DynamicCast_AsReward_Room_Button__Coop_BP) == 0x0002A0, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_DynamicCast_AsReward_Room_Button__Coop_BP' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_DynamicCast_bSuccess_1) == 0x0002A8, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Less_IntInt_ReturnValue) == 0x0002A9, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_GetComponentByClass_ReturnValue) == 0x0002B0, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Array_Add_ReturnValue) == 0x0002B8, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, K2Node_CustomEvent_hackableComponent) == 0x0002C0, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::K2Node_CustomEvent_hackableComponent' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Array_Add_ReturnValue_1) == 0x0002C8, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Array_Get_Item_1) == 0x0002D0, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Array_Add_ReturnValue_2) == 0x0002D8, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Array_Length_ReturnValue_2) == 0x0002DC, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002E0, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Array_Get_Item_2) == 0x0002E8, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Array_Length_ReturnValue_3) == 0x0002F0, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002F4, "Member 'RewardRoom_DoorMinus02_BP_C_ExecuteUbergraph_RewardRoom_DoorMinus02_BP::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function RewardRoom_Door-02_BP.RewardRoom_Door-02_BP_C.DoorInteracted__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct RewardRoom_DoorMinus02_BP_C_DoorInteracted__DelegateSignature final
{
public:
	bool                                          bOpen_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RewardRoom_DoorMinus02_BP_C_DoorInteracted__DelegateSignature) == 0x000001, "Wrong alignment on RewardRoom_DoorMinus02_BP_C_DoorInteracted__DelegateSignature");
static_assert(sizeof(RewardRoom_DoorMinus02_BP_C_DoorInteracted__DelegateSignature) == 0x000001, "Wrong size on RewardRoom_DoorMinus02_BP_C_DoorInteracted__DelegateSignature");
static_assert(offsetof(RewardRoom_DoorMinus02_BP_C_DoorInteracted__DelegateSignature, bOpen_0) == 0x000000, "Member 'RewardRoom_DoorMinus02_BP_C_DoorInteracted__DelegateSignature::bOpen_0' has a wrong offset!");

}

