#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardRoom_ButtonMinusCoop_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "ButtonMinusCoop_BaseMinus01_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RewardRoom_Button-Coop_BP.RewardRoom_Button-Coop_BP_C
// 0x0050 (0x02F8 - 0x02A8)
class ARewardRoom_ButtonMinusCoop_BP_C final : public AButtonMinusCoop_BaseMinus01_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_RewardRoom_ButtonMinusCoop_BP_C;    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      OnRewiredVFX;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      OnHackVFX;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBHackableComponent*                   RBHackable;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBActiveSkillVisionComponent*          RBActiveSkillVision;                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBRoomAssociationComponent*            Room_Association;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        ButtonMurkoffDeal;                                 // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ARBDoor*                                LinkedRewardDoor;                                  // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class URBHackableComponent*>           LinkedHackableComponents;                          // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void IsHackedDisabled(bool* Out);
	void IsActivelyBeingHacked(bool* Out);
	void RefreshVisualHackState();
	void SetLinkedRewardDoor(class ARBDoor* LinkedRewardDoor_0);
	void UserConstructionScript();
	void BndEvt__RewardRoom_ButtonMinusCoop_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnEnabledChanged__DelegateSignature(class URBInteractionZoneComponent* Component);
	void ExecuteUbergraph_RewardRoom_ButtonMinusCoop_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RewardRoom_Button-Coop_BP_C">();
	}
	static class ARewardRoom_ButtonMinusCoop_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARewardRoom_ButtonMinusCoop_BP_C>();
	}
};
static_assert(alignof(ARewardRoom_ButtonMinusCoop_BP_C) == 0x000008, "Wrong alignment on ARewardRoom_ButtonMinusCoop_BP_C");
static_assert(sizeof(ARewardRoom_ButtonMinusCoop_BP_C) == 0x0002F8, "Wrong size on ARewardRoom_ButtonMinusCoop_BP_C");
static_assert(offsetof(ARewardRoom_ButtonMinusCoop_BP_C, UberGraphFrame_RewardRoom_ButtonMinusCoop_BP_C) == 0x0002A8, "Member 'ARewardRoom_ButtonMinusCoop_BP_C::UberGraphFrame_RewardRoom_ButtonMinusCoop_BP_C' has a wrong offset!");
static_assert(offsetof(ARewardRoom_ButtonMinusCoop_BP_C, OnRewiredVFX) == 0x0002B0, "Member 'ARewardRoom_ButtonMinusCoop_BP_C::OnRewiredVFX' has a wrong offset!");
static_assert(offsetof(ARewardRoom_ButtonMinusCoop_BP_C, OnHackVFX) == 0x0002B8, "Member 'ARewardRoom_ButtonMinusCoop_BP_C::OnHackVFX' has a wrong offset!");
static_assert(offsetof(ARewardRoom_ButtonMinusCoop_BP_C, RBHackable) == 0x0002C0, "Member 'ARewardRoom_ButtonMinusCoop_BP_C::RBHackable' has a wrong offset!");
static_assert(offsetof(ARewardRoom_ButtonMinusCoop_BP_C, RBActiveSkillVision) == 0x0002C8, "Member 'ARewardRoom_ButtonMinusCoop_BP_C::RBActiveSkillVision' has a wrong offset!");
static_assert(offsetof(ARewardRoom_ButtonMinusCoop_BP_C, Room_Association) == 0x0002D0, "Member 'ARewardRoom_ButtonMinusCoop_BP_C::Room_Association' has a wrong offset!");
static_assert(offsetof(ARewardRoom_ButtonMinusCoop_BP_C, ButtonMurkoffDeal) == 0x0002D8, "Member 'ARewardRoom_ButtonMinusCoop_BP_C::ButtonMurkoffDeal' has a wrong offset!");
static_assert(offsetof(ARewardRoom_ButtonMinusCoop_BP_C, LinkedRewardDoor) == 0x0002E0, "Member 'ARewardRoom_ButtonMinusCoop_BP_C::LinkedRewardDoor' has a wrong offset!");
static_assert(offsetof(ARewardRoom_ButtonMinusCoop_BP_C, LinkedHackableComponents) == 0x0002E8, "Member 'ARewardRoom_ButtonMinusCoop_BP_C::LinkedHackableComponents' has a wrong offset!");

}

