#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RigList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RigList.RigList_C
// 0x00B8 (0x0330 - 0x0278)
class URigList_C final : public URBUpgradeMenuTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUniformGridPanel*                      RigGrid;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsLoadout;                                        // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnRigHovered;                                      // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnRigUnhovered;                                    // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnRigClicked;                                      // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIgnoreNextClickEvent;                             // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EActiveSkillType, class URigButton_C*>   RigButtonByASType;                                 // 0x02C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	EActiveSkillType                              LastInspectedAS;                                   // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnRigRightClicked;                                 // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnRigReleasedEvent(class FName ItemId, EActiveSkillType ActiveSkillType);
	void OnRigPressedEvent(class FName ItemId, EActiveSkillType ActiveSkillType);
	void OnRigRightClickedEvent(class FName ItemId, EActiveSkillType ActiveSkillType);
	void OnRigClickedEvent(class FName ItemId, EActiveSkillType ActiveSkillType);
	void OnRigUnhoveredEvent(class FName ItemId, EActiveSkillType ActiveSkillType);
	void OnRigHoveredEvent(class FName ItemId, EActiveSkillType ActiveSkillType);
	void Refresh();
	void Init(bool bIsLoadout_0);
	void Setup();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_RigList(int32 EntryPoint);
	void OnRigRightClicked__DelegateSignature(class FName ItemId, EActiveSkillType ActiveSkillType);
	void OnRigClicked__DelegateSignature(class FName ItemId, EActiveSkillType ActiveSkillType);
	void OnRigUnhovered__DelegateSignature(class FName ItemId, EActiveSkillType ActiveSkillType);
	void OnRigHovered__DelegateSignature(class FName ItemId, EActiveSkillType ActiveSkillType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RigList_C">();
	}
	static class URigList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URigList_C>();
	}
};
static_assert(alignof(URigList_C) == 0x000008, "Wrong alignment on URigList_C");
static_assert(sizeof(URigList_C) == 0x000330, "Wrong size on URigList_C");
static_assert(offsetof(URigList_C, UberGraphFrame) == 0x000278, "Member 'URigList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URigList_C, RigGrid) == 0x000280, "Member 'URigList_C::RigGrid' has a wrong offset!");
static_assert(offsetof(URigList_C, bIsLoadout) == 0x000288, "Member 'URigList_C::bIsLoadout' has a wrong offset!");
static_assert(offsetof(URigList_C, OnRigHovered) == 0x000290, "Member 'URigList_C::OnRigHovered' has a wrong offset!");
static_assert(offsetof(URigList_C, OnRigUnhovered) == 0x0002A0, "Member 'URigList_C::OnRigUnhovered' has a wrong offset!");
static_assert(offsetof(URigList_C, OnRigClicked) == 0x0002B0, "Member 'URigList_C::OnRigClicked' has a wrong offset!");
static_assert(offsetof(URigList_C, bIgnoreNextClickEvent) == 0x0002C0, "Member 'URigList_C::bIgnoreNextClickEvent' has a wrong offset!");
static_assert(offsetof(URigList_C, RigButtonByASType) == 0x0002C8, "Member 'URigList_C::RigButtonByASType' has a wrong offset!");
static_assert(offsetof(URigList_C, LastInspectedAS) == 0x000318, "Member 'URigList_C::LastInspectedAS' has a wrong offset!");
static_assert(offsetof(URigList_C, OnRigRightClicked) == 0x000320, "Member 'URigList_C::OnRigRightClicked' has a wrong offset!");

}

