#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RollingDoorMinusBase_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TimedOpenClosedGateState_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RollingDoor-Base_BP.RollingDoor-Base_BP_C.ExecuteUbergraph_RollingDoor-Base_BP
// 0x0328 (0x0328 - 0x0000)
struct RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimedOpenClosedGateState                     Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimedOpenClosedGateState                     Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimedOpenClosedGateState                     Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bDisabled)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bDisabled)>               K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimedOpenClosedGateState                     Temp_byte_Variable_3;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimedOpenClosedGateState                     Temp_byte_Variable_4;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimedOpenClosedGateState                     K2Node_Select_Default;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPlayerSoundDetectionState OldState, EPlayerSoundDetectionState NewState)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsOn, class ARBOperatable* Operatable)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0054(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(class ARBPawn* Interactor, class ARBInteractible* Interactible)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0074(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0088(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_operatable;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_oldProgress;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_currentProgress;                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSnap;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB[0x1];                                       // 0x00BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimelineLength_ReturnValue_1;          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              K2Node_ComponentBoundEvent_player_3;               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_ComponentBoundEvent_player_2;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_ComponentBoundEvent_player_1;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_ComponentBoundEvent_player;                 // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3;                          // 0x00F0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimedOpenClosedGateState                     Temp_byte_Variable_5;                              // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ERollingGateVariatorType                      CallFunc_GetCurrentVariatorType_ReturnValue;       // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_CustomEvent_interactor;                     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBInteractible*                        K2Node_CustomEvent_interactible;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AElectricalSwitchMinusRollingdoorVariatorMinus01_BP_C* K2Node_CustomEvent_Switch;                         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimelineDirection                            Temp_byte_Variable_6;                              // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0147(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4;                          // 0x0148(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5;                          // 0x0158(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default_2;                           // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsOn;                          // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16E[0x2];                                      // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBOperatable*                          K2Node_CustomEvent_operatable;                     // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Unlockable_Duration_State;            // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERollingGateVariatorType                      CallFunc_GetCurrentVariatorType_ReturnValue_1;     // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0180(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_7;                              // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ERollingGateVariatorType                      CallFunc_GetCurrentVariatorType_ReturnValue_2;     // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0197(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ARBDoor*                                K2Node_Event_door;                                 // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_8;                              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x01A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_NewTime;                        // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerSoundDetectionState                    K2Node_CustomEvent_oldState;                       // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerSoundDetectionState                    K2Node_CustomEvent_newState;                       // 0x01AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x01AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_5;               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             K2Node_Select_Default_3;                           // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B3[0x1];                                      // 0x01B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_1;           // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_2;           // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_3;           // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimedOpenClosedGateState                     K2Node_Select_Default_4;                           // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnabled;                             // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ERollingGateVariatorType                      CallFunc_GetCurrentVariatorType_ReturnValue_3;     // 0x01C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C7[0x1];                                      // 0x01C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01F8(0x0040)(HasGetValueTypeHash)
	TScriptInterface<class IRBRollingGateVariatorActor> K2Node_DynamicCast_AsRB_Rolling_Gate_Variator_Actor; // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0250(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0260(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_4;           // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_5;           // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_6;               // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ERollingGateVariatorType                      CallFunc_GetCurrentVariatorType_ReturnValue_4;     // 0x0293(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0296(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_297[0x1];                                      // 0x0297(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Duration;                       // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bResetCount;                    // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_7;               // 0x029E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x029F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_8;               // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_20;                   // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A3[0x1];                                      // 0x02A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTime_ReturnValue;                  // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_9;                              // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AE[0x2];                                      // 0x02AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTime_ReturnValue_1;                // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BA[0x2];                                      // 0x02BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IRBRollingGateVariatorActor> CallFunc_SetVariatorEnabled_self_CastInput;        // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             Temp_byte_Variable_10;                             // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default_5;                           // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D3[0x1];                                      // 0x02D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GenerateRandomSeed_ReturnValue;           // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReversing_ReturnValue;                  // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_LevelRandomInt_ReturnValue;               // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimedOpenClosedGateState                     K2Node_Select_Default_6;                           // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReversing_ReturnValue_1;                // 0x02E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue_1;                  // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x02E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E7[0x1];                                      // 0x02E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayLoopingSoundOnActor_ReturnValue;      // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_9;               // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasUnlockableInteractors_NewParam;        // 0x02ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x02EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x02EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F3[0x5];                                      // 0x02F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AToasterDetectorMinus01_BP_C*           K2Node_CustomEvent_ToasterDetector;                // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bDisabled_1;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASoundDetector_BP_C*                    K2Node_CustomEvent_SoundDetector;                  // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_StopLoopingSound_ReturnValue;             // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayLoopingSound_ReturnValue;             // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bDisabled;                      // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StopLoopingSound_ReturnValue_1;           // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayLoopingSound_ReturnValue_1;           // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP) == 0x000008, "Wrong alignment on RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP");
static_assert(sizeof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP) == 0x000328, "Wrong size on RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, EntryPoint) == 0x000000, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_byte_Variable) == 0x000004, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_bool_Variable) == 0x000005, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_byte_Variable_1) == 0x000006, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_byte_Variable_2) == 0x000007, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_bool_Variable_1) == 0x000028, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_byte_Variable_3) == 0x000029, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_byte_Variable_4) == 0x00002A, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_bool_Variable_2) == 0x00002B, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_Select_Default) == 0x00002C, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_HasAuthority_ReturnValue) == 0x000040, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_delegate_Variable) == 0x000054, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_CreateDelegate_OutputDelegate_4) == 0x000064, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_delegate_Variable_1) == 0x000074, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_HasAuthority_ReturnValue_1) == 0x000084, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_delegate_Variable_2) == 0x000088, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_HasAuthority_ReturnValue_2) == 0x000098, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_float_Variable) == 0x00009C, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000A0, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_bool_Variable_3) == 0x0000A1, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_HasAuthority_ReturnValue_3) == 0x0000A2, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_Event_operatable) == 0x0000A8, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_Event_operatable' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_Event_oldProgress) == 0x0000B0, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_Event_oldProgress' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_Event_currentProgress) == 0x0000B4, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_Event_currentProgress' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_Event_bSnap) == 0x0000B8, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_Event_bSnap' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_Not_PreBool_ReturnValue) == 0x0000B9, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000BA, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_GetTimelineLength_ReturnValue) == 0x0000BC, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_Select_Default_1) == 0x0000C0, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_GetTimelineLength_ReturnValue_1) == 0x0000C4, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_GetTimelineLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000C8, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_ComponentBoundEvent_player_3) == 0x0000D0, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_ComponentBoundEvent_player_3' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_ComponentBoundEvent_player_2) == 0x0000D8, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_ComponentBoundEvent_player_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_ComponentBoundEvent_player_1) == 0x0000E0, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_ComponentBoundEvent_player_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_ComponentBoundEvent_player) == 0x0000E8, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_ComponentBoundEvent_player' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_delegate_Variable_3) == 0x0000F0, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_bool_Variable_4) == 0x000100, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_Array_AddUnique_ReturnValue) == 0x000104, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000108, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_Array_RemoveItem_ReturnValue) == 0x00010C, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_Array_Contains_ReturnValue) == 0x00010D, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_byte_Variable_5) == 0x00010E, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_bool_Variable_5) == 0x00010F, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_Array_Contains_ReturnValue_1) == 0x000110, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x000111, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_int_Variable) == 0x000114, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000118, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_Add_IntInt_ReturnValue) == 0x00011C, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_Event_EndPlayReason) == 0x000120, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_IsValid_ReturnValue) == 0x000121, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_IsValid_ReturnValue_1) == 0x000122, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_GetCurrentVariatorType_ReturnValue) == 0x000123, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_GetCurrentVariatorType_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000124, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_CustomEvent_interactor) == 0x000128, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_CustomEvent_interactor' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_CustomEvent_interactible) == 0x000130, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_CustomEvent_interactible' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_CustomEvent_Switch) == 0x000138, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_CustomEvent_Switch' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_IsValid_ReturnValue_2) == 0x000140, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_byte_Variable_6) == 0x000141, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_IsValid_ReturnValue_3) == 0x000142, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_IsValid_ReturnValue_4) == 0x000143, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_HasAuthority_ReturnValue_4) == 0x000144, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_IsValid_ReturnValue_5) == 0x000145, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_IsValid_ReturnValue_6) == 0x000146, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_IsValid_ReturnValue_7) == 0x000147, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_delegate_Variable_4) == 0x000148, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_delegate_Variable_5) == 0x000158, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_IsValid_ReturnValue_8) == 0x000168, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_IsValid_ReturnValue_9) == 0x000169, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_IsValid_ReturnValue_10) == 0x00016A, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_Select_Default_2) == 0x00016B, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_IsValid_ReturnValue_11) == 0x00016C, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_CustomEvent_bIsOn) == 0x00016D, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_CustomEvent_bIsOn' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_CustomEvent_operatable) == 0x000170, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_CustomEvent_operatable' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_Get_Unlockable_Duration_State) == 0x000178, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_Get_Unlockable_Duration_State' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_GetCurrentVariatorType_ReturnValue_1) == 0x00017C, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_GetCurrentVariatorType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00017D, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000180, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_Array_Length_ReturnValue) == 0x000190, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_byte_Variable_7) == 0x000194, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000195, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_GetCurrentVariatorType_ReturnValue_2) == 0x000196, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_GetCurrentVariatorType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_SwitchEnum_CmpSuccess_1) == 0x000197, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, K2Node_Event_door) == 0x000198, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::K2Node_Event_door' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, Temp_byte_Variable_8) == 0x0001A0, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001A1, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0001A2, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_BooleanAND_ReturnValue) == 0x0001A3, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP, CallFunc_BooleanAND_ReturnValue_1) == 0x0001A4, "Member 'RollingDoorMinusBase_BP_C_ExecuteUbergraph_RollingDoorMinusBase_BP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
