#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SAS_TvChannel_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function SAS_TvChannel_BP.SAS_TvChannel_BP_C.DisableInteractibleUI
// 0x0048 (0x0048 - 0x0000)
struct SAS_TvChannel_BP_C_DisableInteractibleUI final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARBNarrativeScreen*>             CallFunc_BP_GetLinkedScreens_ReturnValue;          // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBNarrativeScreen*                     CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANarrativeScreenBase_BP_C*              K2Node_DynamicCast_AsNarrative_Screen_Base_BP;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAS_TvChannel_BP_C_DisableInteractibleUI) == 0x000008, "Wrong alignment on SAS_TvChannel_BP_C_DisableInteractibleUI");
static_assert(sizeof(SAS_TvChannel_BP_C_DisableInteractibleUI) == 0x000048, "Wrong size on SAS_TvChannel_BP_C_DisableInteractibleUI");
static_assert(offsetof(SAS_TvChannel_BP_C_DisableInteractibleUI, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SAS_TvChannel_BP_C_DisableInteractibleUI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_DisableInteractibleUI, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SAS_TvChannel_BP_C_DisableInteractibleUI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_DisableInteractibleUI, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SAS_TvChannel_BP_C_DisableInteractibleUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_DisableInteractibleUI, CallFunc_BP_GetLinkedScreens_ReturnValue) == 0x000010, "Member 'SAS_TvChannel_BP_C_DisableInteractibleUI::CallFunc_BP_GetLinkedScreens_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_DisableInteractibleUI, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'SAS_TvChannel_BP_C_DisableInteractibleUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_DisableInteractibleUI, CallFunc_Array_Get_Item) == 0x000028, "Member 'SAS_TvChannel_BP_C_DisableInteractibleUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_DisableInteractibleUI, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'SAS_TvChannel_BP_C_DisableInteractibleUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_DisableInteractibleUI, K2Node_DynamicCast_AsNarrative_Screen_Base_BP) == 0x000038, "Member 'SAS_TvChannel_BP_C_DisableInteractibleUI::K2Node_DynamicCast_AsNarrative_Screen_Base_BP' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_DisableInteractibleUI, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'SAS_TvChannel_BP_C_DisableInteractibleUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function SAS_TvChannel_BP.SAS_TvChannel_BP_C.EnableInteractibleUI
// 0x0040 (0x0040 - 0x0000)
struct SAS_TvChannel_BP_C_EnableInteractibleUI final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARBNarrativeScreen*>             CallFunc_BP_GetLinkedScreens_ReturnValue;          // 0x0010(0x0010)(ReferenceParm)
	class ARBNarrativeScreen*                     CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ANarrativeScreenBase_BP_C*              K2Node_DynamicCast_AsNarrative_Screen_Base_BP;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SAS_TvChannel_BP_C_EnableInteractibleUI) == 0x000008, "Wrong alignment on SAS_TvChannel_BP_C_EnableInteractibleUI");
static_assert(sizeof(SAS_TvChannel_BP_C_EnableInteractibleUI) == 0x000040, "Wrong size on SAS_TvChannel_BP_C_EnableInteractibleUI");
static_assert(offsetof(SAS_TvChannel_BP_C_EnableInteractibleUI, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SAS_TvChannel_BP_C_EnableInteractibleUI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_EnableInteractibleUI, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SAS_TvChannel_BP_C_EnableInteractibleUI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_EnableInteractibleUI, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SAS_TvChannel_BP_C_EnableInteractibleUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_EnableInteractibleUI, CallFunc_BP_GetLinkedScreens_ReturnValue) == 0x000010, "Member 'SAS_TvChannel_BP_C_EnableInteractibleUI::CallFunc_BP_GetLinkedScreens_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_EnableInteractibleUI, CallFunc_Array_Get_Item) == 0x000020, "Member 'SAS_TvChannel_BP_C_EnableInteractibleUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_EnableInteractibleUI, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'SAS_TvChannel_BP_C_EnableInteractibleUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_EnableInteractibleUI, K2Node_DynamicCast_AsNarrative_Screen_Base_BP) == 0x000030, "Member 'SAS_TvChannel_BP_C_EnableInteractibleUI::K2Node_DynamicCast_AsNarrative_Screen_Base_BP' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_EnableInteractibleUI, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'SAS_TvChannel_BP_C_EnableInteractibleUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SAS_TvChannel_BP_C_EnableInteractibleUI, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'SAS_TvChannel_BP_C_EnableInteractibleUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

