#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SAS_TanglingCableMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SAS_TanglingCable-01_BP.SAS_TanglingCable-01_BP_C
// 0x0040 (0x0270 - 0x0230)
class ASAS_TanglingCableMinus01_BP_C final : public ARBClientOnlyActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBPropOptimizerComponent*              RBPropOptimizer;                                   // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CableEnd;                                          // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCableComponent*                        Cable;                                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CableEndGizmo;                                     // 0x0258(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SwingActive;                                       // 0x0264(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OtherAxis;                                         // 0x0265(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_266[0x2];                                      // 0x0266(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShakeForce;                                        // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_SAS_TanglingCableMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SAS_TanglingCable-01_BP_C">();
	}
	static class ASAS_TanglingCableMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASAS_TanglingCableMinus01_BP_C>();
	}
};
static_assert(alignof(ASAS_TanglingCableMinus01_BP_C) == 0x000008, "Wrong alignment on ASAS_TanglingCableMinus01_BP_C");
static_assert(sizeof(ASAS_TanglingCableMinus01_BP_C) == 0x000270, "Wrong size on ASAS_TanglingCableMinus01_BP_C");
static_assert(offsetof(ASAS_TanglingCableMinus01_BP_C, UberGraphFrame) == 0x000230, "Member 'ASAS_TanglingCableMinus01_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASAS_TanglingCableMinus01_BP_C, RBPropOptimizer) == 0x000238, "Member 'ASAS_TanglingCableMinus01_BP_C::RBPropOptimizer' has a wrong offset!");
static_assert(offsetof(ASAS_TanglingCableMinus01_BP_C, CableEnd) == 0x000240, "Member 'ASAS_TanglingCableMinus01_BP_C::CableEnd' has a wrong offset!");
static_assert(offsetof(ASAS_TanglingCableMinus01_BP_C, Cable) == 0x000248, "Member 'ASAS_TanglingCableMinus01_BP_C::Cable' has a wrong offset!");
static_assert(offsetof(ASAS_TanglingCableMinus01_BP_C, DefaultSceneRoot) == 0x000250, "Member 'ASAS_TanglingCableMinus01_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ASAS_TanglingCableMinus01_BP_C, CableEndGizmo) == 0x000258, "Member 'ASAS_TanglingCableMinus01_BP_C::CableEndGizmo' has a wrong offset!");
static_assert(offsetof(ASAS_TanglingCableMinus01_BP_C, SwingActive) == 0x000264, "Member 'ASAS_TanglingCableMinus01_BP_C::SwingActive' has a wrong offset!");
static_assert(offsetof(ASAS_TanglingCableMinus01_BP_C, OtherAxis) == 0x000265, "Member 'ASAS_TanglingCableMinus01_BP_C::OtherAxis' has a wrong offset!");
static_assert(offsetof(ASAS_TanglingCableMinus01_BP_C, ShakeForce) == 0x000268, "Member 'ASAS_TanglingCableMinus01_BP_C::ShakeForce' has a wrong offset!");

}

