#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SAS_TanglingCableMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SAS_TanglingCable-01_BP.SAS_TanglingCable-01_BP_C.UserConstructionScript
// 0x0088 (0x0088 - 0x0000)
struct SAS_TanglingCableMinus01_BP_C_UserConstructionScript final
{
public:
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0000(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SAS_TanglingCableMinus01_BP_C_UserConstructionScript) == 0x000004, "Wrong alignment on SAS_TanglingCableMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(SAS_TanglingCableMinus01_BP_C_UserConstructionScript) == 0x000088, "Wrong size on SAS_TanglingCableMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(SAS_TanglingCableMinus01_BP_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000000, "Member 'SAS_TanglingCableMinus01_BP_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

// Function SAS_TanglingCable-01_BP.SAS_TanglingCable-01_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SAS_TanglingCableMinus01_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAS_TanglingCableMinus01_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on SAS_TanglingCableMinus01_BP_C_ReceiveTick");
static_assert(sizeof(SAS_TanglingCableMinus01_BP_C_ReceiveTick) == 0x000004, "Wrong size on SAS_TanglingCableMinus01_BP_C_ReceiveTick");
static_assert(offsetof(SAS_TanglingCableMinus01_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'SAS_TanglingCableMinus01_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function SAS_TanglingCable-01_BP.SAS_TanglingCable-01_BP_C.ExecuteUbergraph_SAS_TanglingCable-01_BP
// 0x0040 (0x0040 - 0x0000)
struct SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP) == 0x000004, "Wrong alignment on SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP");
static_assert(sizeof(SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP) == 0x000040, "Wrong size on SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP");
static_assert(offsetof(SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP, EntryPoint) == 0x000000, "Member 'SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP, CallFunc_GetTimeSeconds_ReturnValue) == 0x000014, "Member 'SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP, CallFunc_Sin_ReturnValue) == 0x00001C, "Member 'SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP, CallFunc_Lerp_ReturnValue) == 0x000020, "Member 'SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000024, "Member 'SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP, CallFunc_MakeVector_ReturnValue_1) == 0x000028, "Member 'SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP, CallFunc_MakeVector_ReturnValue_2) == 0x000034, "Member 'SAS_TanglingCableMinus01_BP_C_ExecuteUbergraph_SAS_TanglingCableMinus01_BP::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");

}

