#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SASChairPanelComponent_BP

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SASChairPanelComponent_BP.SASChairPanelComponent_BP_C.ShouldBPTick
// 0x0020 (0x0020 - 0x0000)
struct SASChairPanelComponent_BP_C_ShouldBPTick final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASASChair_BP_C*                         K2Node_DynamicCast_AsSAS_Chair_BP;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChairRotating_Value;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SASChairPanelComponent_BP_C_ShouldBPTick) == 0x000008, "Wrong alignment on SASChairPanelComponent_BP_C_ShouldBPTick");
static_assert(sizeof(SASChairPanelComponent_BP_C_ShouldBPTick) == 0x000020, "Wrong size on SASChairPanelComponent_BP_C_ShouldBPTick");
static_assert(offsetof(SASChairPanelComponent_BP_C_ShouldBPTick, ReturnValue) == 0x000000, "Member 'SASChairPanelComponent_BP_C_ShouldBPTick::ReturnValue' has a wrong offset!");
static_assert(offsetof(SASChairPanelComponent_BP_C_ShouldBPTick, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'SASChairPanelComponent_BP_C_ShouldBPTick::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASChairPanelComponent_BP_C_ShouldBPTick, K2Node_DynamicCast_AsSAS_Chair_BP) == 0x000010, "Member 'SASChairPanelComponent_BP_C_ShouldBPTick::K2Node_DynamicCast_AsSAS_Chair_BP' has a wrong offset!");
static_assert(offsetof(SASChairPanelComponent_BP_C_ShouldBPTick, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SASChairPanelComponent_BP_C_ShouldBPTick::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SASChairPanelComponent_BP_C_ShouldBPTick, CallFunc_IsChairRotating_Value) == 0x000019, "Member 'SASChairPanelComponent_BP_C_ShouldBPTick::CallFunc_IsChairRotating_Value' has a wrong offset!");

// Function SASChairPanelComponent_BP.SASChairPanelComponent_BP_C.GetInteractionPawnLocation
// 0x0058 (0x0058 - 0x0000)
struct SASChairPanelComponent_BP_C_GetInteractionPawnLocation final
{
public:
	const class ARBPawn*                          Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  SpecialMove;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutLocation;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutDirection;                                      // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASASChair_BP_C*                         K2Node_DynamicCast_AsSAS_Chair_BP;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetWorldTransformFromAnimationAnchor_outLocation; // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWorldTransformFromAnimationAnchor_outDirection; // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SASChairPanelComponent_BP_C_GetInteractionPawnLocation) == 0x000008, "Wrong alignment on SASChairPanelComponent_BP_C_GetInteractionPawnLocation");
static_assert(sizeof(SASChairPanelComponent_BP_C_GetInteractionPawnLocation) == 0x000058, "Wrong size on SASChairPanelComponent_BP_C_GetInteractionPawnLocation");
static_assert(offsetof(SASChairPanelComponent_BP_C_GetInteractionPawnLocation, Pawn) == 0x000000, "Member 'SASChairPanelComponent_BP_C_GetInteractionPawnLocation::Pawn' has a wrong offset!");
static_assert(offsetof(SASChairPanelComponent_BP_C_GetInteractionPawnLocation, SpecialMove) == 0x000008, "Member 'SASChairPanelComponent_BP_C_GetInteractionPawnLocation::SpecialMove' has a wrong offset!");
static_assert(offsetof(SASChairPanelComponent_BP_C_GetInteractionPawnLocation, OutLocation) == 0x00000C, "Member 'SASChairPanelComponent_BP_C_GetInteractionPawnLocation::OutLocation' has a wrong offset!");
static_assert(offsetof(SASChairPanelComponent_BP_C_GetInteractionPawnLocation, OutDirection) == 0x000018, "Member 'SASChairPanelComponent_BP_C_GetInteractionPawnLocation::OutDirection' has a wrong offset!");
static_assert(offsetof(SASChairPanelComponent_BP_C_GetInteractionPawnLocation, ReturnValue) == 0x000024, "Member 'SASChairPanelComponent_BP_C_GetInteractionPawnLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(SASChairPanelComponent_BP_C_GetInteractionPawnLocation, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'SASChairPanelComponent_BP_C_GetInteractionPawnLocation::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASChairPanelComponent_BP_C_GetInteractionPawnLocation, K2Node_DynamicCast_AsSAS_Chair_BP) == 0x000030, "Member 'SASChairPanelComponent_BP_C_GetInteractionPawnLocation::K2Node_DynamicCast_AsSAS_Chair_BP' has a wrong offset!");
static_assert(offsetof(SASChairPanelComponent_BP_C_GetInteractionPawnLocation, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'SASChairPanelComponent_BP_C_GetInteractionPawnLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SASChairPanelComponent_BP_C_GetInteractionPawnLocation, CallFunc_GetWorldTransformFromAnimationAnchor_outLocation) == 0x00003C, "Member 'SASChairPanelComponent_BP_C_GetInteractionPawnLocation::CallFunc_GetWorldTransformFromAnimationAnchor_outLocation' has a wrong offset!");
static_assert(offsetof(SASChairPanelComponent_BP_C_GetInteractionPawnLocation, CallFunc_GetWorldTransformFromAnimationAnchor_outDirection) == 0x000048, "Member 'SASChairPanelComponent_BP_C_GetInteractionPawnLocation::CallFunc_GetWorldTransformFromAnimationAnchor_outDirection' has a wrong offset!");

}

