#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SASChair_ChairAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SASChair_ChairAnimBP.SASChair_ChairAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct SASChair_ChairAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SASChair_ChairAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on SASChair_ChairAnimBP_C_AnimGraph");
static_assert(sizeof(SASChair_ChairAnimBP_C_AnimGraph) == 0x000010, "Wrong size on SASChair_ChairAnimBP_C_AnimGraph");
static_assert(offsetof(SASChair_ChairAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'SASChair_ChairAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function SASChair_ChairAnimBP.SASChair_ChairAnimBP_C.Is Chair Done Rotating
// 0x0005 (0x0005 - 0x0000)
struct SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating) == 0x000001, "Wrong alignment on SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating");
static_assert(sizeof(SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating) == 0x000005, "Wrong size on SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating");
static_assert(offsetof(SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating, Value) == 0x000000, "Member 'SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating::Value' has a wrong offset!");
static_assert(offsetof(SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating, CallFunc_BooleanAND_ReturnValue_1) == 0x000003, "Member 'SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'SASChair_ChairAnimBP_C_Is_Chair_Done_Rotating::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function SASChair_ChairAnimBP.SASChair_ChairAnimBP_C.SetShouldFaceTV
// 0x0002 (0x0002 - 0x0000)
struct SASChair_ChairAnimBP_C_SetShouldFaceTV final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SASChair_ChairAnimBP_C_SetShouldFaceTV) == 0x000001, "Wrong alignment on SASChair_ChairAnimBP_C_SetShouldFaceTV");
static_assert(sizeof(SASChair_ChairAnimBP_C_SetShouldFaceTV) == 0x000002, "Wrong size on SASChair_ChairAnimBP_C_SetShouldFaceTV");
static_assert(offsetof(SASChair_ChairAnimBP_C_SetShouldFaceTV, Value) == 0x000000, "Member 'SASChair_ChairAnimBP_C_SetShouldFaceTV::Value' has a wrong offset!");
static_assert(offsetof(SASChair_ChairAnimBP_C_SetShouldFaceTV, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'SASChair_ChairAnimBP_C_SetShouldFaceTV::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function SASChair_ChairAnimBP.SASChair_ChairAnimBP_C.ExecuteUbergraph_SASChair_ChairAnimBP
// 0x0004 (0x0004 - 0x0000)
struct SASChair_ChairAnimBP_C_ExecuteUbergraph_SASChair_ChairAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SASChair_ChairAnimBP_C_ExecuteUbergraph_SASChair_ChairAnimBP) == 0x000004, "Wrong alignment on SASChair_ChairAnimBP_C_ExecuteUbergraph_SASChair_ChairAnimBP");
static_assert(sizeof(SASChair_ChairAnimBP_C_ExecuteUbergraph_SASChair_ChairAnimBP) == 0x000004, "Wrong size on SASChair_ChairAnimBP_C_ExecuteUbergraph_SASChair_ChairAnimBP");
static_assert(offsetof(SASChair_ChairAnimBP_C_ExecuteUbergraph_SASChair_ChairAnimBP, EntryPoint) == 0x000000, "Member 'SASChair_ChairAnimBP_C_ExecuteUbergraph_SASChair_ChairAnimBP::EntryPoint' has a wrong offset!");

}

