#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SasDoor_SoloMinus01_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SasDoor_Solo-01_BP.SasDoor_Solo-01_BP_C.ExecuteUbergraph_SasDoor_Solo-01_BP
// 0x02A0 (0x02A0 - 0x0000)
struct SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x004C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class UCanvas* Canvas, int32 Width, int32 Height)> K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ASASTubeMinus02_BP_C* SASTube)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ARBSASTube* Tube)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x009C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x012C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvas*                                K2Node_CustomEvent_Canvas;                         // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Width;                          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Height;                         // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasRenderTarget2D*                  CallFunc_CreateCanvasRenderTarget2D_ReturnValue;   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClient_ReturnValue;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASASTubeMinus02_BP_C*                   K2Node_CustomEvent_Tube_1;                         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASASTubeMinus02_BP_C*                   K2Node_CustomEvent_SASTube;                        // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSASDoor_ReturnValue;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x027C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBSASTube*                             K2Node_CustomEvent_Tube;                           // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP) == 0x000008, "Wrong alignment on SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP");
static_assert(sizeof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP) == 0x0002A0, "Wrong size on SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, EntryPoint) == 0x000000, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, Temp_struct_Variable) == 0x000008, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, Temp_delegate_Variable) == 0x000024, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, Temp_struct_Variable_1) == 0x000038, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000048, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, Temp_delegate_Variable_1) == 0x00004C, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Add_FloatFloat_ReturnValue) == 0x00005C, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_MakeRotator_ReturnValue_1) == 0x000060, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x00007C, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, K2Node_CreateDelegate_OutputDelegate_2) == 0x00008C, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00009C, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_HasAuthority_ReturnValue) == 0x000124, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_PostAkEvent_ReturnValue) == 0x000128, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x00012C, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_HasAuthority_ReturnValue_1) == 0x0001B4, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_PostAkEvent_ReturnValue_1) == 0x0001B8, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, K2Node_CustomEvent_Canvas) == 0x0001C0, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::K2Node_CustomEvent_Canvas' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, K2Node_CustomEvent_Width) == 0x0001C8, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::K2Node_CustomEvent_Width' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, K2Node_CustomEvent_Height) == 0x0001CC, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::K2Node_CustomEvent_Height' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0001D0, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_BreakVector2D_X) == 0x0001D4, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_BreakVector2D_Y) == 0x0001D8, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0001DC, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_FTrunc_ReturnValue) == 0x0001E0, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_MakeVector2D_ReturnValue) == 0x0001E4, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_FTrunc_ReturnValue_1) == 0x0001EC, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_CreateCanvasRenderTarget2D_ReturnValue) == 0x0001F0, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_CreateCanvasRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_IsClient_ReturnValue) == 0x0001F8, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_IsClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000200, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000208, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Conv_TextToString_ReturnValue) == 0x000210, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Concat_StrStr_ReturnValue) == 0x000220, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000230, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Len_ReturnValue) == 0x000240, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000244, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Subtract_IntInt_ReturnValue) == 0x000248, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, K2Node_CustomEvent_Tube_1) == 0x000250, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::K2Node_CustomEvent_Tube_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, K2Node_CustomEvent_SASTube) == 0x000258, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::K2Node_CustomEvent_SASTube' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_IsSASDoor_ReturnValue) == 0x000260, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_IsSASDoor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_BreakVector2D_X_1) == 0x000264, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_BreakVector2D_Y_1) == 0x000268, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00026C, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000270, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000274, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000278, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_MakeVector2D_ReturnValue_1) == 0x00027C, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000284, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000288, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, K2Node_CustomEvent_Tube) == 0x000290, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::K2Node_CustomEvent_Tube' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP, CallFunc_MakeVector2D_ReturnValue_2) == 0x000298, "Member 'SasDoor_SoloMinus01_BP_C_ExecuteUbergraph_SasDoor_SoloMinus01_BP::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");

// Function SasDoor_Solo-01_BP.SasDoor_Solo-01_BP_C.OnPlayersInsideChanged
// 0x0008 (0x0008 - 0x0000)
struct SasDoor_SoloMinus01_BP_C_OnPlayersInsideChanged final
{
public:
	class ARBSASTube*                             Tube;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SasDoor_SoloMinus01_BP_C_OnPlayersInsideChanged) == 0x000008, "Wrong alignment on SasDoor_SoloMinus01_BP_C_OnPlayersInsideChanged");
static_assert(sizeof(SasDoor_SoloMinus01_BP_C_OnPlayersInsideChanged) == 0x000008, "Wrong size on SasDoor_SoloMinus01_BP_C_OnPlayersInsideChanged");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnPlayersInsideChanged, Tube) == 0x000000, "Member 'SasDoor_SoloMinus01_BP_C_OnPlayersInsideChanged::Tube' has a wrong offset!");

// Function SasDoor_Solo-01_BP.SasDoor_Solo-01_BP_C.OnOpenedStageChanged
// 0x0008 (0x0008 - 0x0000)
struct SasDoor_SoloMinus01_BP_C_OnOpenedStageChanged final
{
public:
	class ASASTubeMinus02_BP_C*                   SASTube;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SasDoor_SoloMinus01_BP_C_OnOpenedStageChanged) == 0x000008, "Wrong alignment on SasDoor_SoloMinus01_BP_C_OnOpenedStageChanged");
static_assert(sizeof(SasDoor_SoloMinus01_BP_C_OnOpenedStageChanged) == 0x000008, "Wrong size on SasDoor_SoloMinus01_BP_C_OnOpenedStageChanged");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnOpenedStageChanged, SASTube) == 0x000000, "Member 'SasDoor_SoloMinus01_BP_C_OnOpenedStageChanged::SASTube' has a wrong offset!");

// Function SasDoor_Solo-01_BP.SasDoor_Solo-01_BP_C.BindEventsOnTube
// 0x0008 (0x0008 - 0x0000)
struct SasDoor_SoloMinus01_BP_C_BindEventsOnTube final
{
public:
	class ASASTubeMinus02_BP_C*                   Tube;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SasDoor_SoloMinus01_BP_C_BindEventsOnTube) == 0x000008, "Wrong alignment on SasDoor_SoloMinus01_BP_C_BindEventsOnTube");
static_assert(sizeof(SasDoor_SoloMinus01_BP_C_BindEventsOnTube) == 0x000008, "Wrong size on SasDoor_SoloMinus01_BP_C_BindEventsOnTube");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_BindEventsOnTube, Tube) == 0x000000, "Member 'SasDoor_SoloMinus01_BP_C_BindEventsOnTube::Tube' has a wrong offset!");

// Function SasDoor_Solo-01_BP.SasDoor_Solo-01_BP_C.CanvasRenderUpdate
// 0x0010 (0x0010 - 0x0000)
struct SasDoor_SoloMinus01_BP_C_CanvasRenderUpdate final
{
public:
	class UCanvas*                                Canvas_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Width;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Height;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SasDoor_SoloMinus01_BP_C_CanvasRenderUpdate) == 0x000008, "Wrong alignment on SasDoor_SoloMinus01_BP_C_CanvasRenderUpdate");
static_assert(sizeof(SasDoor_SoloMinus01_BP_C_CanvasRenderUpdate) == 0x000010, "Wrong size on SasDoor_SoloMinus01_BP_C_CanvasRenderUpdate");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_CanvasRenderUpdate, Canvas_0) == 0x000000, "Member 'SasDoor_SoloMinus01_BP_C_CanvasRenderUpdate::Canvas_0' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_CanvasRenderUpdate, Width) == 0x000008, "Member 'SasDoor_SoloMinus01_BP_C_CanvasRenderUpdate::Width' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_CanvasRenderUpdate, Height) == 0x00000C, "Member 'SasDoor_SoloMinus01_BP_C_CanvasRenderUpdate::Height' has a wrong offset!");

// Function SasDoor_Solo-01_BP.SasDoor_Solo-01_BP_C.UserConstructionScript
// 0x0048 (0x0048 - 0x0000)
struct SasDoor_SoloMinus01_BP_C_UserConstructionScript final
{
public:
	float                                         Rotation;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USceneComponent*>                K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array_2;                          // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array_3;                          // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(SasDoor_SoloMinus01_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on SasDoor_SoloMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(SasDoor_SoloMinus01_BP_C_UserConstructionScript) == 0x000048, "Wrong size on SasDoor_SoloMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_UserConstructionScript, Rotation) == 0x000000, "Member 'SasDoor_SoloMinus01_BP_C_UserConstructionScript::Rotation' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000008, "Member 'SasDoor_SoloMinus01_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_UserConstructionScript, K2Node_MakeArray_Array_1) == 0x000018, "Member 'SasDoor_SoloMinus01_BP_C_UserConstructionScript::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_UserConstructionScript, K2Node_MakeArray_Array_2) == 0x000028, "Member 'SasDoor_SoloMinus01_BP_C_UserConstructionScript::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_UserConstructionScript, K2Node_MakeArray_Array_3) == 0x000038, "Member 'SasDoor_SoloMinus01_BP_C_UserConstructionScript::K2Node_MakeArray_Array_3' has a wrong offset!");

// Function SasDoor_Solo-01_BP.SasDoor_Solo-01_BP_C.InitializeTubes
// 0x0038 (0x0038 - 0x0000)
struct SasDoor_SoloMinus01_BP_C_InitializeTubes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBSASTube*                             CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ASASTubeMinus02_BP_C*                   K2Node_DynamicCast_AsSAS_Tube_02_BP;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_2;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SasDoor_SoloMinus01_BP_C_InitializeTubes) == 0x000008, "Wrong alignment on SasDoor_SoloMinus01_BP_C_InitializeTubes");
static_assert(sizeof(SasDoor_SoloMinus01_BP_C_InitializeTubes) == 0x000038, "Wrong size on SasDoor_SoloMinus01_BP_C_InitializeTubes");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_InitializeTubes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'SasDoor_SoloMinus01_BP_C_InitializeTubes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_InitializeTubes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SasDoor_SoloMinus01_BP_C_InitializeTubes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_InitializeTubes, CallFunc_Array_Get_Item) == 0x000008, "Member 'SasDoor_SoloMinus01_BP_C_InitializeTubes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_InitializeTubes, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'SasDoor_SoloMinus01_BP_C_InitializeTubes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_InitializeTubes, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'SasDoor_SoloMinus01_BP_C_InitializeTubes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_InitializeTubes, CallFunc_Less_IntInt_ReturnValue) == 0x000015, "Member 'SasDoor_SoloMinus01_BP_C_InitializeTubes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_InitializeTubes, K2Node_DynamicCast_AsSAS_Tube_02_BP) == 0x000018, "Member 'SasDoor_SoloMinus01_BP_C_InitializeTubes::K2Node_DynamicCast_AsSAS_Tube_02_BP' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_InitializeTubes, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SasDoor_SoloMinus01_BP_C_InitializeTubes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_InitializeTubes, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'SasDoor_SoloMinus01_BP_C_InitializeTubes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_InitializeTubes, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'SasDoor_SoloMinus01_BP_C_InitializeTubes::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_InitializeTubes, CallFunc_Array_Get_Item_2) == 0x000030, "Member 'SasDoor_SoloMinus01_BP_C_InitializeTubes::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function SasDoor_Solo-01_BP.SasDoor_Solo-01_BP_C.OnActivationChanged
// 0x0038 (0x0038 - 0x0000)
struct SasDoor_SoloMinus01_BP_C_OnActivationChanged final
{
public:
	bool                                          LightsEnabled;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSASDoor_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBSASTube*                             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASASTubeMinus02_BP_C*                   K2Node_DynamicCast_AsSAS_Tube_02_BP;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoor_SoloMinus01_BP_C_OnActivationChanged) == 0x000008, "Wrong alignment on SasDoor_SoloMinus01_BP_C_OnActivationChanged");
static_assert(sizeof(SasDoor_SoloMinus01_BP_C_OnActivationChanged) == 0x000038, "Wrong size on SasDoor_SoloMinus01_BP_C_OnActivationChanged");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnActivationChanged, LightsEnabled) == 0x000000, "Member 'SasDoor_SoloMinus01_BP_C_OnActivationChanged::LightsEnabled' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnActivationChanged, Temp_int_Array_Index_Variable) == 0x000004, "Member 'SasDoor_SoloMinus01_BP_C_OnActivationChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnActivationChanged, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'SasDoor_SoloMinus01_BP_C_OnActivationChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnActivationChanged, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SasDoor_SoloMinus01_BP_C_OnActivationChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnActivationChanged, CallFunc_IsSASDoor_ReturnValue) == 0x000010, "Member 'SasDoor_SoloMinus01_BP_C_OnActivationChanged::CallFunc_IsSASDoor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnActivationChanged, CallFunc_Array_Get_Item) == 0x000018, "Member 'SasDoor_SoloMinus01_BP_C_OnActivationChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnActivationChanged, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'SasDoor_SoloMinus01_BP_C_OnActivationChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnActivationChanged, K2Node_DynamicCast_AsSAS_Tube_02_BP) == 0x000028, "Member 'SasDoor_SoloMinus01_BP_C_OnActivationChanged::K2Node_DynamicCast_AsSAS_Tube_02_BP' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnActivationChanged, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SasDoor_SoloMinus01_BP_C_OnActivationChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnActivationChanged, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'SasDoor_SoloMinus01_BP_C_OnActivationChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnActivationChanged, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'SasDoor_SoloMinus01_BP_C_OnActivationChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnActivationChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000033, "Member 'SasDoor_SoloMinus01_BP_C_OnActivationChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function SasDoor_Solo-01_BP.SasDoor_Solo-01_BP_C.GetCurrentStageText
// 0x00F8 (0x00F8 - 0x0000)
struct SasDoor_SoloMinus01_BP_C_GetCurrentStageText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	bool                                          CallFunc_IsSASDoor_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBStageID                             CallFunc_GetStageID_ReturnValue;                   // 0x0030(0x0028)(ConstParm)
	class URBStageInfo*                           CallFunc_GetStageInfo_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStageIDValid_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
};
static_assert(alignof(SasDoor_SoloMinus01_BP_C_GetCurrentStageText) == 0x000008, "Wrong alignment on SasDoor_SoloMinus01_BP_C_GetCurrentStageText");
static_assert(sizeof(SasDoor_SoloMinus01_BP_C_GetCurrentStageText) == 0x0000F8, "Wrong size on SasDoor_SoloMinus01_BP_C_GetCurrentStageText");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_GetCurrentStageText, Text) == 0x000000, "Member 'SasDoor_SoloMinus01_BP_C_GetCurrentStageText::Text' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_GetCurrentStageText, CallFunc_IsSASDoor_ReturnValue) == 0x000018, "Member 'SasDoor_SoloMinus01_BP_C_GetCurrentStageText::CallFunc_IsSASDoor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_GetCurrentStageText, CallFunc_GetRBGameState_ReturnValue) == 0x000020, "Member 'SasDoor_SoloMinus01_BP_C_GetCurrentStageText::CallFunc_GetRBGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_GetCurrentStageText, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'SasDoor_SoloMinus01_BP_C_GetCurrentStageText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_GetCurrentStageText, CallFunc_GetStageID_ReturnValue) == 0x000030, "Member 'SasDoor_SoloMinus01_BP_C_GetCurrentStageText::CallFunc_GetStageID_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_GetCurrentStageText, CallFunc_GetStageInfo_ReturnValue) == 0x000058, "Member 'SasDoor_SoloMinus01_BP_C_GetCurrentStageText::CallFunc_GetStageInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_GetCurrentStageText, CallFunc_IsStageIDValid_ReturnValue) == 0x000060, "Member 'SasDoor_SoloMinus01_BP_C_GetCurrentStageText::CallFunc_IsStageIDValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_GetCurrentStageText, CallFunc_GetDisplayName_ReturnValue) == 0x000068, "Member 'SasDoor_SoloMinus01_BP_C_GetCurrentStageText::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_GetCurrentStageText, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'SasDoor_SoloMinus01_BP_C_GetCurrentStageText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_GetCurrentStageText, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'SasDoor_SoloMinus01_BP_C_GetCurrentStageText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_GetCurrentStageText, K2Node_MakeArray_Array) == 0x0000D0, "Member 'SasDoor_SoloMinus01_BP_C_GetCurrentStageText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_GetCurrentStageText, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'SasDoor_SoloMinus01_BP_C_GetCurrentStageText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function SasDoor_Solo-01_BP.SasDoor_Solo-01_BP_C.OnRep_CurrentText
// 0x0001 (0x0001 - 0x0000)
struct SasDoor_SoloMinus01_BP_C_OnRep_CurrentText final
{
public:
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoor_SoloMinus01_BP_C_OnRep_CurrentText) == 0x000001, "Wrong alignment on SasDoor_SoloMinus01_BP_C_OnRep_CurrentText");
static_assert(sizeof(SasDoor_SoloMinus01_BP_C_OnRep_CurrentText) == 0x000001, "Wrong size on SasDoor_SoloMinus01_BP_C_OnRep_CurrentText");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_OnRep_CurrentText, CallFunc_TextIsEmpty_ReturnValue) == 0x000000, "Member 'SasDoor_SoloMinus01_BP_C_OnRep_CurrentText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function SasDoor_Solo-01_BP.SasDoor_Solo-01_BP_C.SetCurrentText
// 0x0020 (0x0020 - 0x0000)
struct SasDoor_SoloMinus01_BP_C_SetCurrentText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoor_SoloMinus01_BP_C_SetCurrentText) == 0x000008, "Wrong alignment on SasDoor_SoloMinus01_BP_C_SetCurrentText");
static_assert(sizeof(SasDoor_SoloMinus01_BP_C_SetCurrentText) == 0x000020, "Wrong size on SasDoor_SoloMinus01_BP_C_SetCurrentText");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_SetCurrentText, Text) == 0x000000, "Member 'SasDoor_SoloMinus01_BP_C_SetCurrentText::Text' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_SetCurrentText, CallFunc_NotEqual_TextText_ReturnValue) == 0x000018, "Member 'SasDoor_SoloMinus01_BP_C_SetCurrentText::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");

// Function SasDoor_Solo-01_BP.SasDoor_Solo-01_BP_C.UpdateArmoredDoors
// 0x0007 (0x0007 - 0x0000)
struct SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors final
{
public:
	bool                                          ShouldBeOpened;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPlayersInside_Value;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasOpenedTube_out;                        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors) == 0x000001, "Wrong alignment on SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors");
static_assert(sizeof(SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors) == 0x000007, "Wrong size on SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors, ShouldBeOpened) == 0x000000, "Member 'SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors::ShouldBeOpened' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors, CallFunc_HasPlayersInside_Value) == 0x000001, "Member 'SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors::CallFunc_HasPlayersInside_Value' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors, CallFunc_HasOpenedTube_out) == 0x000002, "Member 'SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors::CallFunc_HasOpenedTube_out' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000003, "Member 'SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors, CallFunc_BooleanOR_ReturnValue_1) == 0x000005, "Member 'SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors, CallFunc_BooleanOR_ReturnValue_2) == 0x000006, "Member 'SasDoor_SoloMinus01_BP_C_UpdateArmoredDoors::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function SasDoor_Solo-01_BP.SasDoor_Solo-01_BP_C.HasOpenedTube
// 0x0020 (0x0020 - 0x0000)
struct SasDoor_SoloMinus01_BP_C_HasOpenedTube final
{
public:
	bool                                          Out;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBSASTube*                             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SasDoor_SoloMinus01_BP_C_HasOpenedTube) == 0x000008, "Wrong alignment on SasDoor_SoloMinus01_BP_C_HasOpenedTube");
static_assert(sizeof(SasDoor_SoloMinus01_BP_C_HasOpenedTube) == 0x000020, "Wrong size on SasDoor_SoloMinus01_BP_C_HasOpenedTube");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_HasOpenedTube, Out) == 0x000000, "Member 'SasDoor_SoloMinus01_BP_C_HasOpenedTube::Out' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_HasOpenedTube, Temp_int_Array_Index_Variable) == 0x000004, "Member 'SasDoor_SoloMinus01_BP_C_HasOpenedTube::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_HasOpenedTube, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'SasDoor_SoloMinus01_BP_C_HasOpenedTube::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_HasOpenedTube, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SasDoor_SoloMinus01_BP_C_HasOpenedTube::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_HasOpenedTube, CallFunc_Array_Get_Item) == 0x000010, "Member 'SasDoor_SoloMinus01_BP_C_HasOpenedTube::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_HasOpenedTube, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'SasDoor_SoloMinus01_BP_C_HasOpenedTube::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_HasOpenedTube, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'SasDoor_SoloMinus01_BP_C_HasOpenedTube::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SasDoor_SoloMinus01_BP_C_HasOpenedTube, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'SasDoor_SoloMinus01_BP_C_HasOpenedTube::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function SasDoor_Solo-01_BP.SasDoor_Solo-01_BP_C.ForceLightDisabled
// 0x0038 (0x0038 - 0x0000)
struct SasDoor_SoloMinus01_BP_C_ForceLightDisabled final
{
public:
	bool                                          Disabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBSASTube*                             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
