#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SASLoadoutMenuTabs

#include "Basic.hpp"


namespace SDK::Params
{

// Function SASLoadoutMenuTabs.SASLoadoutMenuTabs_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SASLoadoutMenuTabs_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SASLoadoutMenuTabs_C_PreConstruct) == 0x000001, "Wrong alignment on SASLoadoutMenuTabs_C_PreConstruct");
static_assert(sizeof(SASLoadoutMenuTabs_C_PreConstruct) == 0x000001, "Wrong size on SASLoadoutMenuTabs_C_PreConstruct");
static_assert(offsetof(SASLoadoutMenuTabs_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SASLoadoutMenuTabs_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SASLoadoutMenuTabs.SASLoadoutMenuTabs_C.ExecuteUbergraph_SASLoadoutMenuTabs
// 0x0008 (0x0008 - 0x0000)
struct SASLoadoutMenuTabs_C_ExecuteUbergraph_SASLoadoutMenuTabs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SASLoadoutMenuTabs_C_ExecuteUbergraph_SASLoadoutMenuTabs) == 0x000004, "Wrong alignment on SASLoadoutMenuTabs_C_ExecuteUbergraph_SASLoadoutMenuTabs");
static_assert(sizeof(SASLoadoutMenuTabs_C_ExecuteUbergraph_SASLoadoutMenuTabs) == 0x000008, "Wrong size on SASLoadoutMenuTabs_C_ExecuteUbergraph_SASLoadoutMenuTabs");
static_assert(offsetof(SASLoadoutMenuTabs_C_ExecuteUbergraph_SASLoadoutMenuTabs, EntryPoint) == 0x000000, "Member 'SASLoadoutMenuTabs_C_ExecuteUbergraph_SASLoadoutMenuTabs::EntryPoint' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenuTabs_C_ExecuteUbergraph_SASLoadoutMenuTabs, K2Node_Event_IsDesignTime) == 0x000004, "Member 'SASLoadoutMenuTabs_C_ExecuteUbergraph_SASLoadoutMenuTabs::K2Node_Event_IsDesignTime' has a wrong offset!");

}

