#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SASLoadoutMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function SASLoadoutMenu.SASLoadoutMenu_C.OnMouseButtonDown
// 0x03B0 (0x03B0 - 0x0000)
struct SASLoadoutMenu_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0168(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0180(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0240(0x00B8)()
	struct FEventReply                            K2Node_Select_Default;                             // 0x02F8(0x00B8)()
};
static_assert(alignof(SASLoadoutMenu_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on SASLoadoutMenu_C_OnMouseButtonDown");
static_assert(sizeof(SASLoadoutMenu_C_OnMouseButtonDown) == 0x0003B0, "Wrong size on SASLoadoutMenu_C_OnMouseButtonDown");
static_assert(offsetof(SASLoadoutMenu_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'SASLoadoutMenu_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'SASLoadoutMenu_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'SASLoadoutMenu_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_OnMouseButtonDown, Temp_bool_Variable) == 0x000160, "Member 'SASLoadoutMenu_C_OnMouseButtonDown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_OnMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000168, "Member 'SASLoadoutMenu_C_OnMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000180, "Member 'SASLoadoutMenu_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_OnMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000238, "Member 'SASLoadoutMenu_C_OnMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000240, "Member 'SASLoadoutMenu_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_OnMouseButtonDown, K2Node_Select_Default) == 0x0002F8, "Member 'SASLoadoutMenu_C_OnMouseButtonDown::K2Node_Select_Default' has a wrong offset!");

// Function SASLoadoutMenu.SASLoadoutMenu_C.Refresh
// 0x00F0 (0x00F0 - 0x0000)
struct SASLoadoutMenu_C_Refresh final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBCharacterSheetMenuTabWidget*         K2Node_DynamicCast_AsRB_Character_Sheet_Menu_Tab_Widget; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetPageSpecificButtons_outButtons;        // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_GetNavigationOverrideWidget_ReturnValue;  // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPageSubtitle_ReturnValue;              // 0x0098(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowPageTitle_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowNavigation_ReturnValue;         // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPageTitle_ReturnValue;                 // 0x00D8(0x0018)()
};
static_assert(alignof(SASLoadoutMenu_C_Refresh) == 0x000008, "Wrong alignment on SASLoadoutMenu_C_Refresh");
static_assert(sizeof(SASLoadoutMenu_C_Refresh) == 0x0000F0, "Wrong size on SASLoadoutMenu_C_Refresh");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, Temp_byte_Variable) == 0x000000, "Member 'SASLoadoutMenu_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, Temp_bool_Variable) == 0x000001, "Member 'SASLoadoutMenu_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, Temp_byte_Variable_1) == 0x000002, "Member 'SASLoadoutMenu_C_Refresh::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, Temp_byte_Variable_2) == 0x000003, "Member 'SASLoadoutMenu_C_Refresh::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, Temp_byte_Variable_3) == 0x000004, "Member 'SASLoadoutMenu_C_Refresh::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, Temp_int_Array_Index_Variable) == 0x000008, "Member 'SASLoadoutMenu_C_Refresh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'SASLoadoutMenu_C_Refresh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'SASLoadoutMenu_C_Refresh::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_Array_Get_Item) == 0x000028, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, Temp_bool_Variable_1) == 0x000034, "Member 'SASLoadoutMenu_C_Refresh::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'SASLoadoutMenu_C_Refresh::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_GetActiveWidget_ReturnValue) == 0x000048, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, K2Node_DynamicCast_AsRB_Character_Sheet_Menu_Tab_Widget) == 0x000050, "Member 'SASLoadoutMenu_C_Refresh::K2Node_DynamicCast_AsRB_Character_Sheet_Menu_Tab_Widget' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'SASLoadoutMenu_C_Refresh::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_GetPageSpecificButtons_outButtons) == 0x000060, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_GetPageSpecificButtons_outButtons' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_GetNavigationOverrideWidget_ReturnValue) == 0x000070, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_GetNavigationOverrideWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000088, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_GetPageSubtitle_ReturnValue) == 0x000098, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_GetPageSubtitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B0, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B8, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_ShouldShowPageTitle_ReturnValue) == 0x0000C8, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_ShouldShowPageTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_Len_ReturnValue) == 0x0000CC, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D0, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, K2Node_Select_Default) == 0x0000D1, "Member 'SASLoadoutMenu_C_Refresh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, K2Node_Select_Default_1) == 0x0000D2, "Member 'SASLoadoutMenu_C_Refresh::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_ShouldShowNavigation_ReturnValue) == 0x0000D3, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_ShouldShowNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_Refresh, CallFunc_GetPageTitle_ReturnValue) == 0x0000D8, "Member 'SASLoadoutMenu_C_Refresh::CallFunc_GetPageTitle_ReturnValue' has a wrong offset!");

// Function SASLoadoutMenu.SASLoadoutMenu_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct SASLoadoutMenu_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0108(0x00B8)()
};
static_assert(alignof(SASLoadoutMenu_C_OnFocusReceived) == 0x000008, "Wrong alignment on SASLoadoutMenu_C_OnFocusReceived");
static_assert(sizeof(SASLoadoutMenu_C_OnFocusReceived) == 0x0001C0, "Wrong size on SASLoadoutMenu_C_OnFocusReceived");
static_assert(offsetof(SASLoadoutMenu_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'SASLoadoutMenu_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'SASLoadoutMenu_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'SASLoadoutMenu_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_OnFocusReceived, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x0000F8, "Member 'SASLoadoutMenu_C_OnFocusReceived::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_OnFocusReceived, CallFunc_GetActiveWidget_ReturnValue) == 0x000100, "Member 'SASLoadoutMenu_C_OnFocusReceived::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000108, "Member 'SASLoadoutMenu_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function SASLoadoutMenu.SASLoadoutMenu_C.BndEvt__ExitButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SASLoadoutMenu_C_BndEvt__ExitButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	class URBMenuButton_C*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SASLoadoutMenu_C_BndEvt__ExitButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on SASLoadoutMenu_C_BndEvt__ExitButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(SASLoadoutMenu_C_BndEvt__ExitButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong size on SASLoadoutMenu_C_BndEvt__ExitButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(SASLoadoutMenu_C_BndEvt__ExitButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, Button) == 0x000000, "Member 'SASLoadoutMenu_C_BndEvt__ExitButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function SASLoadoutMenu.SASLoadoutMenu_C.OnPlayerSASChanged
// 0x0010 (0x0010 - 0x0000)
struct SASLoadoutMenu_C_OnPlayerSASChanged final
{
public:
	class ARBPlayerState*                         RBPlayerState;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBSAS*                                 CurrentSAS;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SASLoadoutMenu_C_OnPlayerSASChanged) == 0x000008, "Wrong alignment on SASLoadoutMenu_C_OnPlayerSASChanged");
static_assert(sizeof(SASLoadoutMenu_C_OnPlayerSASChanged) == 0x000010, "Wrong size on SASLoadoutMenu_C_OnPlayerSASChanged");
static_assert(offsetof(SASLoadoutMenu_C_OnPlayerSASChanged, RBPlayerState) == 0x000000, "Member 'SASLoadoutMenu_C_OnPlayerSASChanged::RBPlayerState' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_OnPlayerSASChanged, CurrentSAS) == 0x000008, "Member 'SASLoadoutMenu_C_OnPlayerSASChanged::CurrentSAS' has a wrong offset!");

// Function SASLoadoutMenu.SASLoadoutMenu_C.Event_OnMenuTabSwitched
// 0x0004 (0x0004 - 0x0000)
struct SASLoadoutMenu_C_Event_OnMenuTabSwitched final
{
public:
	int32                                         PreviousIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SASLoadoutMenu_C_Event_OnMenuTabSwitched) == 0x000004, "Wrong alignment on SASLoadoutMenu_C_Event_OnMenuTabSwitched");
static_assert(sizeof(SASLoadoutMenu_C_Event_OnMenuTabSwitched) == 0x000004, "Wrong size on SASLoadoutMenu_C_Event_OnMenuTabSwitched");
static_assert(offsetof(SASLoadoutMenu_C_Event_OnMenuTabSwitched, PreviousIndex) == 0x000000, "Member 'SASLoadoutMenu_C_Event_OnMenuTabSwitched::PreviousIndex' has a wrong offset!");

// Function SASLoadoutMenu.SASLoadoutMenu_C.ExecuteUbergraph_SASLoadoutMenu
// 0x00B8 (0x00B8 - 0x0000)
struct SASLoadoutMenu_C_ExecuteUbergraph_SASLoadoutMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewTier)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ARBPlayerState* RBPlayerState, class ARBSAS* CurrentSAS)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuButton_C*                        K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBCharacterSheetMenuTabWidget*         K2Node_DynamicCast_AsRB_Character_Sheet_Menu_Tab_Widget; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleMenuTabRight_ReturnValue;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPerkCategory NewCategory)>    K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayerState*                         K2Node_CustomEvent_rbPlayerState;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBSAS*                                 K2Node_CustomEvent_currentSAS;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBCharacterSheetMenuTabWidget*         K2Node_DynamicCast_AsRB_Character_Sheet_Menu_Tab_Widget_1; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URBMenuTabButton*>               K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_HandleMenuTabLeft_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_previousIndex;                        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SASLoadoutMenu_C_ExecuteUbergraph_SASLoadoutMenu) == 0x000008, "Wrong alignment on SASLoadoutMenu_C_ExecuteUbergraph_SASLoadoutMenu");
static_assert(sizeof(SASLoadoutMenu_C_ExecuteUbergraph_SASLoadoutMenu) == 0x0000B8, "Wrong size on SASLoadoutMenu_C_ExecuteUbergraph_SASLoadoutMenu");
static_assert(offsetof(SASLoadoutMenu_C_ExecuteUbergraph_SASLoadoutMenu, EntryPoint) == 0x000000, "Member 'SASLoadoutMenu_C_ExecuteUbergraph_SASLoadoutMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(SASLoadoutMenu_C_ExecuteUbergraph_SASLoadoutMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SASLoadoutMenu_C_ExecuteUbergraph_SASLoadoutMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
