#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SASLoadoutMenuTabs

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SASLoadoutMenuTabs.SASLoadoutMenuTabs_C
// 0x0020 (0x0280 - 0x0260)
class USASLoadoutMenuTabs_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UActionIconWidget_C*                    LeftTabButton;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URBCharacterSheetTabMenuButton_C*       LoadoutsButton;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UActionIconWidget_C*                    RightTabButton;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_SASLoadoutMenuTabs(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SASLoadoutMenuTabs_C">();
	}
	static class USASLoadoutMenuTabs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USASLoadoutMenuTabs_C>();
	}
};
static_assert(alignof(USASLoadoutMenuTabs_C) == 0x000008, "Wrong alignment on USASLoadoutMenuTabs_C");
static_assert(sizeof(USASLoadoutMenuTabs_C) == 0x000280, "Wrong size on USASLoadoutMenuTabs_C");
static_assert(offsetof(USASLoadoutMenuTabs_C, UberGraphFrame) == 0x000260, "Member 'USASLoadoutMenuTabs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenuTabs_C, LeftTabButton) == 0x000268, "Member 'USASLoadoutMenuTabs_C::LeftTabButton' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenuTabs_C, LoadoutsButton) == 0x000270, "Member 'USASLoadoutMenuTabs_C::LoadoutsButton' has a wrong offset!");
static_assert(offsetof(USASLoadoutMenuTabs_C, RightTabButton) == 0x000278, "Member 'USASLoadoutMenuTabs_C::RightTabButton' has a wrong offset!");

}

