#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SASWagonEndTimer_NarrativeScreen_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NarrativeScreenBase_BP_classes.hpp"
#include "OPP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SASWagonEndTimer_NarrativeScreen_BP.SASWagonEndTimer_NarrativeScreen_BP_C
// 0x0018 (0x03F8 - 0x03E0)
class ASASWagonEndTimer_NarrativeScreen_BP_C final : public ANarrativeScreenBase_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SASWagonEndTimer_NarrativeScreen_BP_C; // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SupportMinus01;                                    // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SupportPoleMinus01;                                // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void On_Game_Phase_Updated(EGamePhase GamePhase);
	void ReceiveBeginPlay();
	void OnGamePhaseUpdatedEvent(EGamePhase GamePhase);
	void ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SASWagonEndTimer_NarrativeScreen_BP_C">();
	}
	static class ASASWagonEndTimer_NarrativeScreen_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASASWagonEndTimer_NarrativeScreen_BP_C>();
	}
};
static_assert(alignof(ASASWagonEndTimer_NarrativeScreen_BP_C) == 0x000008, "Wrong alignment on ASASWagonEndTimer_NarrativeScreen_BP_C");
static_assert(sizeof(ASASWagonEndTimer_NarrativeScreen_BP_C) == 0x0003F8, "Wrong size on ASASWagonEndTimer_NarrativeScreen_BP_C");
static_assert(offsetof(ASASWagonEndTimer_NarrativeScreen_BP_C, UberGraphFrame_SASWagonEndTimer_NarrativeScreen_BP_C) == 0x0003E0, "Member 'ASASWagonEndTimer_NarrativeScreen_BP_C::UberGraphFrame_SASWagonEndTimer_NarrativeScreen_BP_C' has a wrong offset!");
static_assert(offsetof(ASASWagonEndTimer_NarrativeScreen_BP_C, SupportMinus01) == 0x0003E8, "Member 'ASASWagonEndTimer_NarrativeScreen_BP_C::SupportMinus01' has a wrong offset!");
static_assert(offsetof(ASASWagonEndTimer_NarrativeScreen_BP_C, SupportPoleMinus01) == 0x0003F0, "Member 'ASASWagonEndTimer_NarrativeScreen_BP_C::SupportPoleMinus01' has a wrong offset!");

}

