#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SASWagon_NarrativeScreen_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function SASWagon_NarrativeScreen_BP.SASWagon_NarrativeScreen_BP_C.UserConstructionScript
// 0x0003 (0x0003 - 0x0000)
struct SASWagon_NarrativeScreen_BP_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SASWagon_NarrativeScreen_BP_C_UserConstructionScript) == 0x000001, "Wrong alignment on SASWagon_NarrativeScreen_BP_C_UserConstructionScript");
static_assert(sizeof(SASWagon_NarrativeScreen_BP_C_UserConstructionScript) == 0x000003, "Wrong size on SASWagon_NarrativeScreen_BP_C_UserConstructionScript");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'SASWagon_NarrativeScreen_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000001, "Member 'SASWagon_NarrativeScreen_BP_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'SASWagon_NarrativeScreen_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function SASWagon_NarrativeScreen_BP.SASWagon_NarrativeScreen_BP_C.SetTVDown
// 0x0001 (0x0001 - 0x0000)
struct SASWagon_NarrativeScreen_BP_C_SetTVDown final
{
public:
	bool                                          IsDown;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SASWagon_NarrativeScreen_BP_C_SetTVDown) == 0x000001, "Wrong alignment on SASWagon_NarrativeScreen_BP_C_SetTVDown");
static_assert(sizeof(SASWagon_NarrativeScreen_BP_C_SetTVDown) == 0x000001, "Wrong size on SASWagon_NarrativeScreen_BP_C_SetTVDown");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_SetTVDown, IsDown) == 0x000000, "Member 'SASWagon_NarrativeScreen_BP_C_SetTVDown::IsDown' has a wrong offset!");

// Function SASWagon_NarrativeScreen_BP.SASWagon_NarrativeScreen_BP_C.DebugScreenDown
// 0x0110 (0x0110 - 0x0000)
struct SASWagon_NarrativeScreen_BP_C_DebugScreenDown final
{
public:
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0000(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0088(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SASWagon_NarrativeScreen_BP_C_DebugScreenDown) == 0x000004, "Wrong alignment on SASWagon_NarrativeScreen_BP_C_DebugScreenDown");
static_assert(sizeof(SASWagon_NarrativeScreen_BP_C_DebugScreenDown) == 0x000110, "Wrong size on SASWagon_NarrativeScreen_BP_C_DebugScreenDown");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_DebugScreenDown, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000000, "Member 'SASWagon_NarrativeScreen_BP_C_DebugScreenDown::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_DebugScreenDown, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x000088, "Member 'SASWagon_NarrativeScreen_BP_C_DebugScreenDown::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");

// Function SASWagon_NarrativeScreen_BP.SASWagon_NarrativeScreen_BP_C.ExecuteUbergraph_SASWagon_NarrativeScreen_BP
// 0x0180 (0x0180 - 0x0000)
struct SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0044(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x00CC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBNarrativeScreenChannel*              K2Node_DynamicCast_AsRB_Narrative_Screen_Channel;  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16B[0x1];                                      // 0x016B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_1;           // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP) == 0x000008, "Wrong alignment on SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP");
static_assert(sizeof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP) == 0x000180, "Wrong size on SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, EntryPoint) == 0x000000, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_Lerp_ReturnValue_1) == 0x000014, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, Temp_delegate_Variable) == 0x000018, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_MakeRotator_ReturnValue_1) == 0x000028, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, Temp_delegate_Variable_1) == 0x000034, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000044, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0000CC, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000154, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000158, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, K2Node_DynamicCast_AsRB_Narrative_Screen_Channel) == 0x000160, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::K2Node_DynamicCast_AsRB_Narrative_Screen_Channel' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_IsValid_ReturnValue) == 0x000169, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_IsValid_ReturnValue_1) == 0x00016A, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_Lerp_ReturnValue_2) == 0x00016C, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_IsValid_ReturnValue_2) == 0x000170, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_Lerp_ReturnValue_3) == 0x000174, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_PostEventOnActor_ReturnValue) == 0x000178, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP, CallFunc_PostEventOnActor_ReturnValue_1) == 0x00017C, "Member 'SASWagon_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagon_NarrativeScreen_BP::CallFunc_PostEventOnActor_ReturnValue_1' has a wrong offset!");

}

