#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SASWagonEndTimer_NarrativeScreen_BP

#include "Basic.hpp"

#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function SASWagonEndTimer_NarrativeScreen_BP.SASWagonEndTimer_NarrativeScreen_BP_C.On Game Phase Updated
// 0x0002 (0x0002 - 0x0000)
struct SASWagonEndTimer_NarrativeScreen_BP_C_On_Game_Phase_Updated final
{
public:
	EGamePhase                                    GamePhase;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SASWagonEndTimer_NarrativeScreen_BP_C_On_Game_Phase_Updated) == 0x000001, "Wrong alignment on SASWagonEndTimer_NarrativeScreen_BP_C_On_Game_Phase_Updated");
static_assert(sizeof(SASWagonEndTimer_NarrativeScreen_BP_C_On_Game_Phase_Updated) == 0x000002, "Wrong size on SASWagonEndTimer_NarrativeScreen_BP_C_On_Game_Phase_Updated");
static_assert(offsetof(SASWagonEndTimer_NarrativeScreen_BP_C_On_Game_Phase_Updated, GamePhase) == 0x000000, "Member 'SASWagonEndTimer_NarrativeScreen_BP_C_On_Game_Phase_Updated::GamePhase' has a wrong offset!");
static_assert(offsetof(SASWagonEndTimer_NarrativeScreen_BP_C_On_Game_Phase_Updated, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'SASWagonEndTimer_NarrativeScreen_BP_C_On_Game_Phase_Updated::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function SASWagonEndTimer_NarrativeScreen_BP.SASWagonEndTimer_NarrativeScreen_BP_C.OnGamePhaseUpdatedEvent
// 0x0001 (0x0001 - 0x0000)
struct SASWagonEndTimer_NarrativeScreen_BP_C_OnGamePhaseUpdatedEvent final
{
public:
	EGamePhase                                    GamePhase;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SASWagonEndTimer_NarrativeScreen_BP_C_OnGamePhaseUpdatedEvent) == 0x000001, "Wrong alignment on SASWagonEndTimer_NarrativeScreen_BP_C_OnGamePhaseUpdatedEvent");
static_assert(sizeof(SASWagonEndTimer_NarrativeScreen_BP_C_OnGamePhaseUpdatedEvent) == 0x000001, "Wrong size on SASWagonEndTimer_NarrativeScreen_BP_C_OnGamePhaseUpdatedEvent");
static_assert(offsetof(SASWagonEndTimer_NarrativeScreen_BP_C_OnGamePhaseUpdatedEvent, GamePhase) == 0x000000, "Member 'SASWagonEndTimer_NarrativeScreen_BP_C_OnGamePhaseUpdatedEvent::GamePhase' has a wrong offset!");

// Function SASWagonEndTimer_NarrativeScreen_BP.SASWagonEndTimer_NarrativeScreen_BP_C.ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP
// 0x0030 (0x0030 - 0x0000)
struct SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePhase                                    K2Node_CustomEvent_gamePhase;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EGamePhase GamePhase)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP) == 0x000008, "Wrong alignment on SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP");
static_assert(sizeof(SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP) == 0x000030, "Wrong size on SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP");
static_assert(offsetof(SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP, EntryPoint) == 0x000000, "Member 'SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP, K2Node_CustomEvent_gamePhase) == 0x000004, "Member 'SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP::K2Node_CustomEvent_gamePhase' has a wrong offset!");
static_assert(offsetof(SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP, CallFunc_GetRBGameState_ReturnValue) == 0x000020, "Member 'SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP::CallFunc_GetRBGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'SASWagonEndTimer_NarrativeScreen_BP_C_ExecuteUbergraph_SASWagonEndTimer_NarrativeScreen_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

