#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scientist_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Scientist_BP.Scientist_BP_C.RandomizeMeshes
// 0x0078 (0x0078 - 0x0000)
struct Scientist_BP_C_RandomizeMeshes final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class USkeletalMesh>>   K2Node_Select_Default;                             // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeFemale_Result;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class USkeletalMesh>>   K2Node_Select_Default_1;                           // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class USkeletalMesh>>   K2Node_Select_Default_2;                           // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue_1;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue_2;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scientist_BP_C_RandomizeMeshes) == 0x000008, "Wrong alignment on Scientist_BP_C_RandomizeMeshes");
static_assert(sizeof(Scientist_BP_C_RandomizeMeshes) == 0x000078, "Wrong size on Scientist_BP_C_RandomizeMeshes");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, Temp_bool_Variable) == 0x000000, "Member 'Scientist_BP_C_RandomizeMeshes::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, Temp_bool_Variable_1) == 0x000001, "Member 'Scientist_BP_C_RandomizeMeshes::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, K2Node_Select_Default) == 0x000008, "Member 'Scientist_BP_C_RandomizeMeshes::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_RandomBool_ReturnValue) == 0x000018, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_CanBeFemale_Result) == 0x000020, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_CanBeFemale_Result' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_Greater_IntInt_ReturnValue) == 0x000021, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_RandomInteger_ReturnValue) == 0x000024, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_SelectInt_ReturnValue) == 0x000028, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, Temp_bool_Variable_2) == 0x00002C, "Member 'Scientist_BP_C_RandomizeMeshes::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, K2Node_Select_Default_1) == 0x000030, "Member 'Scientist_BP_C_RandomizeMeshes::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, K2Node_Select_Default_2) == 0x000048, "Member 'Scientist_BP_C_RandomizeMeshes::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000058, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_Array_Length_ReturnValue_2) == 0x00005C, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_RandomInteger_ReturnValue_1) == 0x000060, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_RandomInteger_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000064, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_SelectInt_ReturnValue_1) == 0x000068, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_RandomInteger_ReturnValue_2) == 0x00006C, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_RandomInteger_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_RandomizeMeshes, CallFunc_SelectInt_ReturnValue_2) == 0x000070, "Member 'Scientist_BP_C_RandomizeMeshes::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");

// Function Scientist_BP.Scientist_BP_C.CanBeFemale
// 0x0009 (0x0009 - 0x0000)
struct Scientist_BP_C_CanBeFemale final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_1;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_2;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Scientist_BP_C_CanBeFemale) == 0x000001, "Wrong alignment on Scientist_BP_C_CanBeFemale");
static_assert(sizeof(Scientist_BP_C_CanBeFemale) == 0x000009, "Wrong size on Scientist_BP_C_CanBeFemale");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, Result) == 0x000000, "Member 'Scientist_BP_C_CanBeFemale::Result' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_Array_IsEmpty_ReturnValue) == 0x000001, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_Array_IsEmpty_ReturnValue_1) == 0x000002, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_Array_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_Array_IsEmpty_ReturnValue_2) == 0x000005, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_Array_IsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_Not_PreBool_ReturnValue_2) == 0x000006, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_CanBeFemale, CallFunc_BooleanAND_ReturnValue_1) == 0x000008, "Member 'Scientist_BP_C_CanBeFemale::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function Scientist_BP.Scientist_BP_C.OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA
// 0x0008 (0x0008 - 0x0000)
struct Scientist_BP_C_OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scientist_BP_C_OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA) == 0x000008, "Wrong alignment on Scientist_BP_C_OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA");
static_assert(sizeof(Scientist_BP_C_OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA) == 0x000008, "Wrong size on Scientist_BP_C_OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA");
static_assert(offsetof(Scientist_BP_C_OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA, Loaded) == 0x000000, "Member 'Scientist_BP_C_OnLoaded_5B190DD74C9C1BA5309F1B83ACAC3AEA::Loaded' has a wrong offset!");

// Function Scientist_BP.Scientist_BP_C.BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Scientist_BP.Scientist_BP_C.BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Scientist_BP_C_BndEvt__HailingZone_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Scientist_BP.Scientist_BP_C.ApplyMesh
// 0x0020 (0x0020 - 0x0000)
struct Scientist_BP_C_ApplyMesh final
{
public:
	TArray<TSoftObjectPtr<class USkeletalMesh>>   Meshes;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	const class USkeletalMeshComponent*           Component;                                         // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MeshIndex;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scientist_BP_C_ApplyMesh) == 0x000008, "Wrong alignment on Scientist_BP_C_ApplyMesh");
static_assert(sizeof(Scientist_BP_C_ApplyMesh) == 0x000020, "Wrong size on Scientist_BP_C_ApplyMesh");
static_assert(offsetof(Scientist_BP_C_ApplyMesh, Meshes) == 0x000000, "Member 'Scientist_BP_C_ApplyMesh::Meshes' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ApplyMesh, Component) == 0x000010, "Member 'Scientist_BP_C_ApplyMesh::Component' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ApplyMesh, MeshIndex) == 0x000018, "Member 'Scientist_BP_C_ApplyMesh::MeshIndex' has a wrong offset!");

// Function Scientist_BP.Scientist_BP_C.ExecuteUbergraph_Scientist_BP
// 0x0230 (0x0230 - 0x0000)
struct Scientist_BP_C_ExecuteUbergraph_Scientist_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class USkeletalMesh>>   K2Node_Select_Default;                             // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TArray<TSoftObjectPtr<class USkeletalMesh>>   K2Node_Select_Default_1;                           // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TArray<TSoftObjectPtr<class USkeletalMesh>>   K2Node_Select_Default_2;                           // 0x0040(0x0010)(ConstParm, ReferenceParm)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0070(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue;                 // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBackgroundCharacter_AnimBP_C*          K2Node_DynamicCast_AsBackground_Character_Anim_BP; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0xF];                                      // 0x0141(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue_1;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBackgroundCharacter_AnimBP_C*          K2Node_DynamicCast_AsBackground_Character_Anim_BP_1; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class USkeletalMesh>>   K2Node_CustomEvent_Meshes;                         // 0x01D0(0x0010)(ConstParm, ReferenceParm)
	const class USkeletalMeshComponent*           K2Node_CustomEvent_Component;                      // 0x01E0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MeshIndex;                      // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           CallFunc_Array_Get_Item;                           // 0x01F0(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP) == 0x000010, "Wrong alignment on Scientist_BP_C_ExecuteUbergraph_Scientist_BP");
static_assert(sizeof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP) == 0x000230, "Wrong size on Scientist_BP_C_ExecuteUbergraph_Scientist_BP");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, EntryPoint) == 0x000000, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, Temp_object_Variable) == 0x000008, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Scientist_BP_C_ExecuteUbergraph_Scientist_BP, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x000010, "Member 'Scientist_BP_C_ExecuteUbergraph_Scientist_BP::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
