#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScorePlayerEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function ScorePlayerEntry.ScorePlayerEntry_C.Setup
// 0x0198 (0x0198 - 0x0000)
struct ScorePlayerEntry_C_Setup final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0028(0x0028)()
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0058(0x0028)()
	bool                                          Temp_bool_Variable_1;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0090(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x00B8(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00E8(0x0018)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0108(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x0130(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_NormalizedScoreToText_ReturnValue;        // 0x0160(0x0018)()
	class UTexture2D*                             CallFunc_GetPlatformIconTexture_texture;           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0180(0x0018)()
};
static_assert(alignof(ScorePlayerEntry_C_Setup) == 0x000008, "Wrong alignment on ScorePlayerEntry_C_Setup");
static_assert(sizeof(ScorePlayerEntry_C_Setup) == 0x000198, "Wrong size on ScorePlayerEntry_C_Setup");
static_assert(offsetof(ScorePlayerEntry_C_Setup, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'ScorePlayerEntry_C_Setup::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, K2Node_MakeStruct_SlateColor_1) == 0x000028, "Member 'ScorePlayerEntry_C_Setup::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, Temp_bool_Variable) == 0x000050, "Member 'ScorePlayerEntry_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, K2Node_MakeStruct_SlateColor_2) == 0x000058, "Member 'ScorePlayerEntry_C_Setup::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, Temp_bool_Variable_1) == 0x000080, "Member 'ScorePlayerEntry_C_Setup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, Temp_byte_Variable) == 0x000081, "Member 'ScorePlayerEntry_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, Temp_byte_Variable_1) == 0x000082, "Member 'ScorePlayerEntry_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, Temp_bool_Variable_2) == 0x000083, "Member 'ScorePlayerEntry_C_Setup::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, Temp_byte_Variable_2) == 0x000084, "Member 'ScorePlayerEntry_C_Setup::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, Temp_byte_Variable_3) == 0x000085, "Member 'ScorePlayerEntry_C_Setup::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, Temp_int_Variable) == 0x000088, "Member 'ScorePlayerEntry_C_Setup::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, K2Node_MakeStruct_SlateColor_3) == 0x000090, "Member 'ScorePlayerEntry_C_Setup::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, K2Node_MakeStruct_SlateColor_4) == 0x0000B8, "Member 'ScorePlayerEntry_C_Setup::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'ScorePlayerEntry_C_Setup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, CallFunc_Conv_IntToText_ReturnValue) == 0x0000E8, "Member 'ScorePlayerEntry_C_Setup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000100, "Member 'ScorePlayerEntry_C_Setup::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, K2Node_Select_Default) == 0x000108, "Member 'ScorePlayerEntry_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, K2Node_Select_Default_1) == 0x000130, "Member 'ScorePlayerEntry_C_Setup::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, CallFunc_IsValid_ReturnValue_1) == 0x000158, "Member 'ScorePlayerEntry_C_Setup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, K2Node_Select_Default_2) == 0x000159, "Member 'ScorePlayerEntry_C_Setup::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, K2Node_Select_Default_3) == 0x00015A, "Member 'ScorePlayerEntry_C_Setup::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, CallFunc_NormalizedScoreToText_ReturnValue) == 0x000160, "Member 'ScorePlayerEntry_C_Setup::CallFunc_NormalizedScoreToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, CallFunc_GetPlatformIconTexture_texture) == 0x000178, "Member 'ScorePlayerEntry_C_Setup::CallFunc_GetPlatformIconTexture_texture' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Setup, CallFunc_Conv_StringToText_ReturnValue) == 0x000180, "Member 'ScorePlayerEntry_C_Setup::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function ScorePlayerEntry.ScorePlayerEntry_C.Init
// 0x00B0 (0x00B0 - 0x0000)
struct ScorePlayerEntry_C_Init final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EProfilePlatform                              Platform_0;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDead;                                             // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Score_0;                                           // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Icon_0;                                            // 0x0018(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              IconBorder_0;                                      // 0x0040(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         ReleaseCount;                                      // 0x0068(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Level_0;                                           // 0x006C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScorePlayerEntry_C_Init) == 0x000008, "Wrong alignment on ScorePlayerEntry_C_Init");
static_assert(sizeof(ScorePlayerEntry_C_Init) == 0x0000B0, "Wrong size on ScorePlayerEntry_C_Init");
static_assert(offsetof(ScorePlayerEntry_C_Init, Name_0) == 0x000000, "Member 'ScorePlayerEntry_C_Init::Name_0' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, Platform_0) == 0x000010, "Member 'ScorePlayerEntry_C_Init::Platform_0' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, bDead) == 0x000011, "Member 'ScorePlayerEntry_C_Init::bDead' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, Score_0) == 0x000014, "Member 'ScorePlayerEntry_C_Init::Score_0' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, Icon_0) == 0x000018, "Member 'ScorePlayerEntry_C_Init::Icon_0' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, IconBorder_0) == 0x000040, "Member 'ScorePlayerEntry_C_Init::IconBorder_0' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, ReleaseCount) == 0x000068, "Member 'ScorePlayerEntry_C_Init::ReleaseCount' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, Level_0) == 0x00006C, "Member 'ScorePlayerEntry_C_Init::Level_0' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000070, "Member 'ScorePlayerEntry_C_Init::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000078, "Member 'ScorePlayerEntry_C_Init::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, K2Node_DynamicCast_AsTexture_2D) == 0x000080, "Member 'ScorePlayerEntry_C_Init::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'ScorePlayerEntry_C_Init::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000090, "Member 'ScorePlayerEntry_C_Init::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000098, "Member 'ScorePlayerEntry_C_Init::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, K2Node_DynamicCast_AsTexture_2D_1) == 0x0000A0, "Member 'ScorePlayerEntry_C_Init::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(ScorePlayerEntry_C_Init, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'ScorePlayerEntry_C_Init::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

