#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScriptedNPC_Base_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ScriptedNPC_Base_BP.ScriptedNPC_Base_BP_C.ExecuteUbergraph_ScriptedNPC_Base_BP
// 0x0220 (0x0220 - 0x0000)
struct ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetFaceFXSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnemyFace_AnimBlueprint_C*             K2Node_DynamicCast_AsEnemy_Face_Anim_Blueprint;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	TArray<class UObject*>                        CallFunc_Map_Values_Values;                        // 0x0098(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A8(0x0040)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBNPC*                                 K2Node_DynamicCast_AsRB_NPC;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue_1;        // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0118(0x0018)()
	bool                                          CallFunc_IsPlayInEditor_ReturnValue;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0138(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0188(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UScriptedNPC_Base_AnimBP_C*             CallFunc_Array_Get_Item_1;                         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptedNPC_Base_AnimBP_C*             CallFunc_Array_Get_Item_2;                         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D6[0x2];                                      // 0x01D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_WillSkeletalMeshTick_ReturnValue;      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptedNPC_Base_AnimBP_C*             CallFunc_Array_Get_Item_3;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPoseAsset*                             CallFunc_GetFacePoseAsset_ReturnValue;             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPoseAsset*                             CallFunc_GetFacePoseAsset_ReturnValue_1;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP) == 0x000008, "Wrong alignment on ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP");
static_assert(sizeof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP) == 0x000220, "Wrong size on ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, EntryPoint) == 0x000000, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_GetFaceFXSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_GetFaceFXSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, K2Node_DynamicCast_AsEnemy_Face_Anim_Blueprint) == 0x000028, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::K2Node_DynamicCast_AsEnemy_Face_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, Temp_int_Loop_Counter_Variable_2) == 0x000048, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Add_IntInt_ReturnValue_2) == 0x00004C, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, Temp_int_Array_Index_Variable_1) == 0x000050, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, Temp_int_Loop_Counter_Variable_3) == 0x000054, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Add_IntInt_ReturnValue_3) == 0x000058, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, Temp_int_Array_Index_Variable_2) == 0x00005C, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000060, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, Temp_int_Array_Index_Variable_3) == 0x000064, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_IsValid_ReturnValue_2) == 0x000068, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Conv_ObjectToString_ReturnValue) == 0x000070, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Map_Values_Values) == 0x000098, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, K2Node_MakeStruct_FormatArgumentData) == 0x0000A8, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_IsValid_ReturnValue_3) == 0x0000F4, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Less_IntInt_ReturnValue) == 0x0000F5, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, K2Node_DynamicCast_AsRB_NPC) == 0x0000F8, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::K2Node_DynamicCast_AsRB_NPC' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_HasAuthority_ReturnValue) == 0x000101, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Conv_ObjectToString_ReturnValue_1) == 0x000108, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Conv_ObjectToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000118, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_IsPlayInEditor_ReturnValue) == 0x000130, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_IsPlayInEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, K2Node_MakeStruct_FormatArgumentData_1) == 0x000138, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, K2Node_MakeArray_Array) == 0x000178, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Format_ReturnValue) == 0x000188, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Conv_TextToString_ReturnValue) == 0x0001A0, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Array_Get_Item_1) == 0x0001B0, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_IsValid_ReturnValue_4) == 0x0001B8, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Array_Length_ReturnValue_1) == 0x0001BC, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_HasAuthority_ReturnValue_1) == 0x0001C0, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001C1, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Array_Get_Item_2) == 0x0001C8, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Array_Length_ReturnValue_2) == 0x0001D0, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_IsValid_ReturnValue_5) == 0x0001D4, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001D5, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_GetOwningComponent_ReturnValue) == 0x0001D8, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_BP_WillSkeletalMeshTick_ReturnValue) == 0x0001E0, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_BP_WillSkeletalMeshTick_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Array_Add_ReturnValue) == 0x0001E4, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_HasAuthority_ReturnValue_2) == 0x0001E8, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Array_Get_Item_3) == 0x0001F0, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_IsValid_ReturnValue_6) == 0x0001F8, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Array_Length_ReturnValue_3) == 0x0001FC, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Less_IntInt_ReturnValue_3) == 0x000200, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_Not_PreBool_ReturnValue) == 0x000201, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_BooleanAND_ReturnValue) == 0x000202, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_HasAuthority_ReturnValue_3) == 0x000203, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_GetFacePoseAsset_ReturnValue) == 0x000208, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_GetFacePoseAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_GetFacePoseAsset_ReturnValue_1) == 0x000210, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_GetFacePoseAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP, CallFunc_IsValid_ReturnValue_7) == 0x000218, "Member 'ScriptedNPC_Base_BP_C_ExecuteUbergraph_ScriptedNPC_Base_BP::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");

// Function ScriptedNPC_Base_BP.ScriptedNPC_Base_BP_C.NotifyExitFinished
// 0x0010 (0x0010 - 0x0000)
struct ScriptedNPC_Base_BP_C_NotifyExitFinished final
{
public:
	class USkeletalMeshComponent*                 Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScriptedNPC_Base_BP_C_NotifyExitFinished) == 0x000008, "Wrong alignment on ScriptedNPC_Base_BP_C_NotifyExitFinished");
static_assert(sizeof(ScriptedNPC_Base_BP_C_NotifyExitFinished) == 0x000010, "Wrong size on ScriptedNPC_Base_BP_C_NotifyExitFinished");
static_assert(offsetof(ScriptedNPC_Base_BP_C_NotifyExitFinished, Component) == 0x000000, "Member 'ScriptedNPC_Base_BP_C_NotifyExitFinished::Component' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_NotifyExitFinished, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'ScriptedNPC_Base_BP_C_NotifyExitFinished::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_NotifyExitFinished, CallFunc_Array_IsEmpty_ReturnValue) == 0x000009, "Member 'ScriptedNPC_Base_BP_C_NotifyExitFinished::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_NotifyExitFinished, CallFunc_Array_RemoveItem_ReturnValue) == 0x00000A, "Member 'ScriptedNPC_Base_BP_C_NotifyExitFinished::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function ScriptedNPC_Base_BP.ScriptedNPC_Base_BP_C.OnRep_IsInLoopB
// 0x0020 (0x0020 - 0x0000)
struct ScriptedNPC_Base_BP_C_OnRep_IsInLoopB final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptedNPC_Base_AnimBP_C*             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScriptedNPC_Base_BP_C_OnRep_IsInLoopB) == 0x000008, "Wrong alignment on ScriptedNPC_Base_BP_C_OnRep_IsInLoopB");
static_assert(sizeof(ScriptedNPC_Base_BP_C_OnRep_IsInLoopB) == 0x000020, "Wrong size on ScriptedNPC_Base_BP_C_OnRep_IsInLoopB");
static_assert(offsetof(ScriptedNPC_Base_BP_C_OnRep_IsInLoopB, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ScriptedNPC_Base_BP_C_OnRep_IsInLoopB::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_OnRep_IsInLoopB, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ScriptedNPC_Base_BP_C_OnRep_IsInLoopB::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_OnRep_IsInLoopB, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ScriptedNPC_Base_BP_C_OnRep_IsInLoopB::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_OnRep_IsInLoopB, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'ScriptedNPC_Base_BP_C_OnRep_IsInLoopB::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_OnRep_IsInLoopB, CallFunc_Array_Get_Item) == 0x000010, "Member 'ScriptedNPC_Base_BP_C_OnRep_IsInLoopB::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_OnRep_IsInLoopB, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'ScriptedNPC_Base_BP_C_OnRep_IsInLoopB::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_OnRep_IsInLoopB, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'ScriptedNPC_Base_BP_C_OnRep_IsInLoopB::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ScriptedNPC_Base_BP.ScriptedNPC_Base_BP_C.OnRep_Exiting
// 0x0020 (0x0020 - 0x0000)
struct ScriptedNPC_Base_BP_C_OnRep_Exiting final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScriptedNPC_Base_AnimBP_C*             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScriptedNPC_Base_BP_C_OnRep_Exiting) == 0x000008, "Wrong alignment on ScriptedNPC_Base_BP_C_OnRep_Exiting");
static_assert(sizeof(ScriptedNPC_Base_BP_C_OnRep_Exiting) == 0x000020, "Wrong size on ScriptedNPC_Base_BP_C_OnRep_Exiting");
static_assert(offsetof(ScriptedNPC_Base_BP_C_OnRep_Exiting, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ScriptedNPC_Base_BP_C_OnRep_Exiting::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_OnRep_Exiting, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ScriptedNPC_Base_BP_C_OnRep_Exiting::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_OnRep_Exiting, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ScriptedNPC_Base_BP_C_OnRep_Exiting::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_OnRep_Exiting, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'ScriptedNPC_Base_BP_C_OnRep_Exiting::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_OnRep_Exiting, CallFunc_Array_Get_Item) == 0x000010, "Member 'ScriptedNPC_Base_BP_C_OnRep_Exiting::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_OnRep_Exiting, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'ScriptedNPC_Base_BP_C_OnRep_Exiting::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_OnRep_Exiting, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'ScriptedNPC_Base_BP_C_OnRep_Exiting::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ScriptedNPC_Base_BP.ScriptedNPC_Base_BP_C.DisableDecalsOnSkelmeshes
// 0x0030 (0x0030 - 0x0000)
struct ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes) == 0x000008, "Wrong alignment on ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes");
static_assert(sizeof(ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes) == 0x000030, "Wrong size on ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes");
static_assert(offsetof(ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes, CallFunc_Array_Get_Item) == 0x000020, "Member 'ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'ScriptedNPC_Base_BP_C_DisableDecalsOnSkelmeshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ScriptedNPC_Base_BP.ScriptedNPC_Base_BP_C.PlayAnimOnSpecificMesh
// 0x0048 (0x0048 - 0x0000)
struct ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh final
{
public:
	class UAnimSequenceBase*                      Anim;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Tag;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CallFunc_GetComponentsByTag_ReturnValue;           // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh) == 0x000008, "Wrong alignment on ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh");
static_assert(sizeof(ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh) == 0x000048, "Wrong size on ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh");
static_assert(offsetof(ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh, Anim) == 0x000000, "Member 'ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh::Anim' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh, Tag) == 0x000008, "Member 'ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh::Tag' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh, CallFunc_GetComponentsByTag_ReturnValue) == 0x000010, "Member 'ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh, Temp_int_Array_Index_Variable) == 0x000020, "Member 'ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh, CallFunc_Array_Get_Item) == 0x000028, "Member 'ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000030, "Member 'ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'ScriptedNPC_Base_BP_C_PlayAnimOnSpecificMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function ScriptedNPC_Base_BP.ScriptedNPC_Base_BP_C.CannotBeInterrupted
// 0x0001 (0x0001 - 0x0000)
struct ScriptedNPC_Base_BP_C_CannotBeInterrupted final
{
public:
	bool                                          CannotBeInterrupted_0;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScriptedNPC_Base_BP_C_CannotBeInterrupted) == 0x000001, "Wrong alignment on ScriptedNPC_Base_BP_C_CannotBeInterrupted");
static_assert(sizeof(ScriptedNPC_Base_BP_C_CannotBeInterrupted) == 0x000001, "Wrong size on ScriptedNPC_Base_BP_C_CannotBeInterrupted");
static_assert(offsetof(ScriptedNPC_Base_BP_C_CannotBeInterrupted, CannotBeInterrupted_0) == 0x000000, "Member 'ScriptedNPC_Base_BP_C_CannotBeInterrupted::CannotBeInterrupted_0' has a wrong offset!");

// Function ScriptedNPC_Base_BP.ScriptedNPC_Base_BP_C.AttachAccessory
// 0x0004 (0x0004 - 0x0000)
struct ScriptedNPC_Base_BP_C_AttachAccessory final
{
public:
	int32                                         WhichAccessorySlot;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScriptedNPC_Base_BP_C_AttachAccessory) == 0x000004, "Wrong alignment on ScriptedNPC_Base_BP_C_AttachAccessory");
static_assert(sizeof(ScriptedNPC_Base_BP_C_AttachAccessory) == 0x000004, "Wrong size on ScriptedNPC_Base_BP_C_AttachAccessory");
static_assert(offsetof(ScriptedNPC_Base_BP_C_AttachAccessory, WhichAccessorySlot) == 0x000000, "Member 'ScriptedNPC_Base_BP_C_AttachAccessory::WhichAccessorySlot' has a wrong offset!");

// Function ScriptedNPC_Base_BP.ScriptedNPC_Base_BP_C.DetachAccessory
// 0x0004 (0x0004 - 0x0000)
struct ScriptedNPC_Base_BP_C_DetachAccessory final
{
public:
	int32                                         WhichAccessorySlot;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScriptedNPC_Base_BP_C_DetachAccessory) == 0x000004, "Wrong alignment on ScriptedNPC_Base_BP_C_DetachAccessory");
static_assert(sizeof(ScriptedNPC_Base_BP_C_DetachAccessory) == 0x000004, "Wrong size on ScriptedNPC_Base_BP_C_DetachAccessory");
static_assert(offsetof(ScriptedNPC_Base_BP_C_DetachAccessory, WhichAccessorySlot) == 0x000000, "Member 'ScriptedNPC_Base_BP_C_DetachAccessory::WhichAccessorySlot' has a wrong offset!");

}

