#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScriptedNPC_Base_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ScriptedNPC_Base_AnimBP.ScriptedNPC_Base_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ScriptedNPC_Base_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ScriptedNPC_Base_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on ScriptedNPC_Base_AnimBP_C_AnimGraph");
static_assert(sizeof(ScriptedNPC_Base_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on ScriptedNPC_Base_AnimBP_C_AnimGraph");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ScriptedNPC_Base_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ScriptedNPC_Base_AnimBP.ScriptedNPC_Base_AnimBP_C.ExecuteUbergraph_ScriptedNPC_Base_AnimBP
// 0x0068 (0x0068 - 0x0000)
struct ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AScriptedNPC_Base_BP_C*                 K2Node_DynamicCast_AsScripted_NPC_Base_BP;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_1;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AScriptedNPC_Base_BP_C*                 K2Node_DynamicCast_AsScripted_NPC_Base_BP_1;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_2;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AScriptedNPC_Base_BP_C*                 K2Node_DynamicCast_AsScripted_NPC_Base_BP_2;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP) == 0x000008, "Wrong alignment on ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP");
static_assert(sizeof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP) == 0x000068, "Wrong size on ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, EntryPoint) == 0x000000, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000008, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, CallFunc_Less_FloatFloat_ReturnValue) == 0x00000C, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, CallFunc_GetOwningActor_ReturnValue) == 0x000010, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x000018, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, K2Node_DynamicCast_AsScripted_NPC_Base_BP) == 0x000020, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::K2Node_DynamicCast_AsScripted_NPC_Base_BP' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, CallFunc_BooleanOR_ReturnValue_1) == 0x00002A, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, CallFunc_GetOwningActor_ReturnValue_1) == 0x000030, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::CallFunc_GetOwningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, CallFunc_GetOwningComponent_ReturnValue) == 0x000038, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, K2Node_DynamicCast_AsScripted_NPC_Base_BP_1) == 0x000040, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::K2Node_DynamicCast_AsScripted_NPC_Base_BP_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, CallFunc_GetOwningActor_ReturnValue_2) == 0x000050, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::CallFunc_GetOwningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, K2Node_DynamicCast_AsScripted_NPC_Base_BP_2) == 0x000058, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::K2Node_DynamicCast_AsScripted_NPC_Base_BP_2' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'ScriptedNPC_Base_AnimBP_C_ExecuteUbergraph_ScriptedNPC_Base_AnimBP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

