#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShadowBox_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ShadowBox_BP.ShadowBox_BP_C
// 0x0030 (0x0260 - 0x0230)
class AShadowBox_BP_C final : public AActor
{
public:
	class UStaticMeshComponent*                   ShadowBoxMinus01;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Gizmo2Location;                                    // 0x0240(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GizmoLocation;                                     // 0x024C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hidden_Shadow;                                     // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void SetGizmo();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShadowBox_BP_C">();
	}
	static class AShadowBox_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AShadowBox_BP_C>();
	}
};
static_assert(alignof(AShadowBox_BP_C) == 0x000008, "Wrong alignment on AShadowBox_BP_C");
static_assert(sizeof(AShadowBox_BP_C) == 0x000260, "Wrong size on AShadowBox_BP_C");
static_assert(offsetof(AShadowBox_BP_C, ShadowBoxMinus01) == 0x000230, "Member 'AShadowBox_BP_C::ShadowBoxMinus01' has a wrong offset!");
static_assert(offsetof(AShadowBox_BP_C, DefaultSceneRoot) == 0x000238, "Member 'AShadowBox_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AShadowBox_BP_C, Gizmo2Location) == 0x000240, "Member 'AShadowBox_BP_C::Gizmo2Location' has a wrong offset!");
static_assert(offsetof(AShadowBox_BP_C, GizmoLocation) == 0x00024C, "Member 'AShadowBox_BP_C::GizmoLocation' has a wrong offset!");
static_assert(offsetof(AShadowBox_BP_C, Hidden_Shadow) == 0x000258, "Member 'AShadowBox_BP_C::Hidden_Shadow' has a wrong offset!");

}

