#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShadowBox_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ShadowBox_BP.ShadowBox_BP_C.SetGizmo
// 0x0120 (0x0120 - 0x0000)
struct ShadowBox_BP_C_SetGizmo final
{
public:
	struct FVector                                _PreviousActorPos;                                 // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _PreviousAnchor;                                   // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddActorLocalOffset_SweepHitResult;    // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_InverseTransformRotation_ReturnValue;     // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IsPropertyWidgetSelected_outWidgetIndex;  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPropertyWidgetSelected_ReturnValue;     // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShadowBox_BP_C_SetGizmo) == 0x000010, "Wrong alignment on ShadowBox_BP_C_SetGizmo");
static_assert(sizeof(ShadowBox_BP_C_SetGizmo) == 0x000120, "Wrong size on ShadowBox_BP_C_SetGizmo");
static_assert(offsetof(ShadowBox_BP_C_SetGizmo, _PreviousActorPos) == 0x000000, "Member 'ShadowBox_BP_C_SetGizmo::_PreviousActorPos' has a wrong offset!");
static_assert(offsetof(ShadowBox_BP_C_SetGizmo, _PreviousAnchor) == 0x00000C, "Member 'ShadowBox_BP_C_SetGizmo::_PreviousAnchor' has a wrong offset!");
static_assert(offsetof(ShadowBox_BP_C_SetGizmo, CallFunc_K2_AddActorLocalOffset_SweepHitResult) == 0x000010, "Member 'ShadowBox_BP_C_SetGizmo::CallFunc_K2_AddActorLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(ShadowBox_BP_C_SetGizmo, CallFunc_GetTransform_ReturnValue) == 0x0000A0, "Member 'ShadowBox_BP_C_SetGizmo::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowBox_BP_C_SetGizmo, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D0, "Member 'ShadowBox_BP_C_SetGizmo::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowBox_BP_C_SetGizmo, CallFunc_InverseTransformRotation_ReturnValue) == 0x0000DC, "Member 'ShadowBox_BP_C_SetGizmo::CallFunc_InverseTransformRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowBox_BP_C_SetGizmo, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000E8, "Member 'ShadowBox_BP_C_SetGizmo::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowBox_BP_C_SetGizmo, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0000F4, "Member 'ShadowBox_BP_C_SetGizmo::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowBox_BP_C_SetGizmo, CallFunc_Add_VectorVector_ReturnValue) == 0x000100, "Member 'ShadowBox_BP_C_SetGizmo::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShadowBox_BP_C_SetGizmo, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00010C, "Member 'ShadowBox_BP_C_SetGizmo::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShadowBox_BP_C_SetGizmo, CallFunc_IsPropertyWidgetSelected_outWidgetIndex) == 0x000118, "Member 'ShadowBox_BP_C_SetGizmo::CallFunc_IsPropertyWidgetSelected_outWidgetIndex' has a wrong offset!");
static_assert(offsetof(ShadowBox_BP_C_SetGizmo, CallFunc_IsPropertyWidgetSelected_ReturnValue) == 0x00011C, "Member 'ShadowBox_BP_C_SetGizmo::CallFunc_IsPropertyWidgetSelected_ReturnValue' has a wrong offset!");

// Function ShadowBox_BP.ShadowBox_BP_C.UserConstructionScript
// 0x000C (0x000C - 0x0000)
struct ShadowBox_BP_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShadowBox_BP_C_UserConstructionScript) == 0x000004, "Wrong alignment on ShadowBox_BP_C_UserConstructionScript");
static_assert(sizeof(ShadowBox_BP_C_UserConstructionScript) == 0x00000C, "Wrong size on ShadowBox_BP_C_UserConstructionScript");
static_assert(offsetof(ShadowBox_BP_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000000, "Member 'ShadowBox_BP_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

}

