#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shared_Face_BaseEmotion_Struct

#include "Basic.hpp"

#include "Face_AllList_Enum_structs.hpp"


namespace SDK
{

// UserDefinedStruct Shared_Face_BaseEmotion_Struct.Shared_Face_BaseEmotion_Struct
// 0x0320 (0x0320 - 0x0000)
struct FShared_Face_BaseEmotion_Struct final
{
public:
	TMap<EFace_AllList_Enum, class UAnimSequence*> Default_58_599E99054D8D9DA09BBFC2A0DD36563F;       // 0x0000(0x0050)(Edit, BlueprintVisible)
	TMap<EFace_AllList_Enum, class UAnimSequence*> Unaware_102_35EE47684EBF85E2148C9DB516DA9866;      // 0x0050(0x0050)(Edit, BlueprintVisible)
	TMap<EFace_AllList_Enum, class UAnimSequence*> Suspicious_103_2669DB0945500A1E6CEB12B77A39A6A8;   // 0x00A0(0x0050)(Edit, BlueprintVisible)
	TMap<EFace_AllList_Enum, class UAnimSequence*> Chase_104_589C377D4B723CA6094FC9B1CC7F8F62;        // 0x00F0(0x0050)(Edit, BlueprintVisible)
	TMap<EFace_AllList_Enum, class UAnimSequence*> Uninjured_105_E6AC79C0434BE0ACF6B9678F7F760B2C;    // 0x0140(0x0050)(Edit, BlueprintVisible)
	TMap<EFace_AllList_Enum, class UAnimSequence*> SlightlyInjured_106_B39538754AE25FFB93741A862795BEFB; // 0x0190(0x0050)(Edit, BlueprintVisible)
	TMap<EFace_AllList_Enum, class UAnimSequence*> ModeratelyInjured_107_894535094C4EA959BBD6508C1BA05259; // 0x01E0(0x0050)(Edit, BlueprintVisible)
	TMap<EFace_AllList_Enum, class UAnimSequence*> HighlyInjured_108_FE11E2464F798996C3A98EB8CCDFE70B; // 0x0230(0x0050)(Edit, BlueprintVisible)
	TMap<EFace_AllList_Enum, class UAnimSequence*> InMenu_109_5BBE161447B806ED871D7F89816272C5;       // 0x0280(0x0050)(Edit, BlueprintVisible)
	TMap<EFace_AllList_Enum, class UAnimSequence*> InMiniGame_110_BE454C4E46AE8A5AC15355B7E14E816B;   // 0x02D0(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FShared_Face_BaseEmotion_Struct) == 0x000008, "Wrong alignment on FShared_Face_BaseEmotion_Struct");
static_assert(sizeof(FShared_Face_BaseEmotion_Struct) == 0x000320, "Wrong size on FShared_Face_BaseEmotion_Struct");
static_assert(offsetof(FShared_Face_BaseEmotion_Struct, Default_58_599E99054D8D9DA09BBFC2A0DD36563F) == 0x000000, "Member 'FShared_Face_BaseEmotion_Struct::Default_58_599E99054D8D9DA09BBFC2A0DD36563F' has a wrong offset!");
static_assert(offsetof(FShared_Face_BaseEmotion_Struct, Unaware_102_35EE47684EBF85E2148C9DB516DA9866) == 0x000050, "Member 'FShared_Face_BaseEmotion_Struct::Unaware_102_35EE47684EBF85E2148C9DB516DA9866' has a wrong offset!");
static_assert(offsetof(FShared_Face_BaseEmotion_Struct, Suspicious_103_2669DB0945500A1E6CEB12B77A39A6A8) == 0x0000A0, "Member 'FShared_Face_BaseEmotion_Struct::Suspicious_103_2669DB0945500A1E6CEB12B77A39A6A8' has a wrong offset!");
static_assert(offsetof(FShared_Face_BaseEmotion_Struct, Chase_104_589C377D4B723CA6094FC9B1CC7F8F62) == 0x0000F0, "Member 'FShared_Face_BaseEmotion_Struct::Chase_104_589C377D4B723CA6094FC9B1CC7F8F62' has a wrong offset!");
static_assert(offsetof(FShared_Face_BaseEmotion_Struct, Uninjured_105_E6AC79C0434BE0ACF6B9678F7F760B2C) == 0x000140, "Member 'FShared_Face_BaseEmotion_Struct::Uninjured_105_E6AC79C0434BE0ACF6B9678F7F760B2C' has a wrong offset!");
static_assert(offsetof(FShared_Face_BaseEmotion_Struct, SlightlyInjured_106_B39538754AE25FFB93741A862795BEFB) == 0x000190, "Member 'FShared_Face_BaseEmotion_Struct::SlightlyInjured_106_B39538754AE25FFB93741A862795BEFB' has a wrong offset!");
static_assert(offsetof(FShared_Face_BaseEmotion_Struct, ModeratelyInjured_107_894535094C4EA959BBD6508C1BA05259) == 0x0001E0, "Member 'FShared_Face_BaseEmotion_Struct::ModeratelyInjured_107_894535094C4EA959BBD6508C1BA05259' has a wrong offset!");
static_assert(offsetof(FShared_Face_BaseEmotion_Struct, HighlyInjured_108_FE11E2464F798996C3A98EB8CCDFE70B) == 0x000230, "Member 'FShared_Face_BaseEmotion_Struct::HighlyInjured_108_FE11E2464F798996C3A98EB8CCDFE70B' has a wrong offset!");
static_assert(offsetof(FShared_Face_BaseEmotion_Struct, InMenu_109_5BBE161447B806ED871D7F89816272C5) == 0x000280, "Member 'FShared_Face_BaseEmotion_Struct::InMenu_109_5BBE161447B806ED871D7F89816272C5' has a wrong offset!");
static_assert(offsetof(FShared_Face_BaseEmotion_Struct, InMiniGame_110_BE454C4E46AE8A5AC15355B7E14E816B) == 0x0002D0, "Member 'FShared_Face_BaseEmotion_Struct::InMiniGame_110_BE454C4E46AE8A5AC15355B7E14E816B' has a wrong offset!");

}

