#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleWallMinus01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ModuleMeshData_structs.hpp"
#include "ModuleAlternativeMeshData_structs.hpp"
#include "StaticmeshArray_Stuc_structs.hpp"


namespace SDK::Params
{

// Function SimpleWall-01_BP.SimpleWall-01_BP_C.UserConstructionScript
// 0x01C8 (0x01C8 - 0x0000)
struct SimpleWallMinus01_BP_C_UserConstructionScript final
{
public:
	struct FVector                                _LastLocation;                                     // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _NewSize;                                          // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _yLocationMax;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateRow_LastLocation;                 // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_PopulateRow_StaticmeshComponents1;        // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_PopulateRow_LastAlphaMeshSize;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateRow_AlphaScale;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateRow_LastLocation_1;               // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_PopulateRow_StaticmeshComponents1_1;      // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_PopulateRow_LastAlphaMeshSize_1;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateRow_AlphaScale_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateRow_LastLocation_2;               // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_PopulateRow_StaticmeshComponents1_2;      // 0x00C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_PopulateRow_LastAlphaMeshSize_2;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateRow_AlphaScale_2;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateRow_LastLocation_3;               // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_PopulateRow_StaticmeshComponents1_3;      // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_PopulateRow_LastAlphaMeshSize_3;          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateRow_AlphaScale_3;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_5;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_5;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_5;                          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateSurface_LastLocation;             // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize;            // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale;              // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes;          // 0x0150(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize;        // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateRow_LastLocation_4;               // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_PopulateRow_StaticmeshComponents1_4;      // 0x0178(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_PopulateRow_LastAlphaMeshSize_4;          // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateRow_AlphaScale_4;                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_PopulateSurface_LastLocation_1;           // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize_1;          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale_1;            // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes_1;        // 0x01A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount_1;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize_1;      // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale_1;             // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleWallMinus01_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on SimpleWallMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(SimpleWallMinus01_BP_C_UserConstructionScript) == 0x0001C8, "Wrong size on SimpleWallMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, _LastLocation) == 0x000000, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::_LastLocation' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, _NewSize) == 0x00000C, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::_NewSize' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, _yLocationMax) == 0x000018, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::_yLocationMax' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001D, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue_2) == 0x00001E, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue_3) == 0x00001F, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000020, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000024, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000028, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x00002C, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000030, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x000034, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastLocation) == 0x000038, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastLocation' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_StaticmeshComponents1) == 0x000048, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_StaticmeshComponents1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastAlphaMeshSize) == 0x000058, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastAlphaMeshSize' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_AlphaScale) == 0x00005C, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_AlphaScale' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastLocation_1) == 0x000060, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastLocation_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_StaticmeshComponents1_1) == 0x000070, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_StaticmeshComponents1_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastAlphaMeshSize_1) == 0x000080, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastAlphaMeshSize_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_AlphaScale_1) == 0x000084, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_AlphaScale_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_2) == 0x000088, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_2) == 0x00008C, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_2) == 0x000090, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_3) == 0x000094, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_3) == 0x000098, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_3) == 0x00009C, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x0000A0, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x0000AC, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastLocation_2) == 0x0000B8, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastLocation_2' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_StaticmeshComponents1_2) == 0x0000C8, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_StaticmeshComponents1_2' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastAlphaMeshSize_2) == 0x0000D8, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastAlphaMeshSize_2' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_AlphaScale_2) == 0x0000DC, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_AlphaScale_2' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastLocation_3) == 0x0000E0, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastLocation_3' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_StaticmeshComponents1_3) == 0x0000F0, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_StaticmeshComponents1_3' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastAlphaMeshSize_3) == 0x000100, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastAlphaMeshSize_3' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_AlphaScale_3) == 0x000104, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_AlphaScale_3' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_4) == 0x000108, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_4) == 0x00010C, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_4) == 0x000110, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_2) == 0x000114, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000120, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_5) == 0x00012C, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_5' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_5) == 0x000130, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_5' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_5) == 0x000134, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_5' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation) == 0x000138, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize) == 0x000144, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale) == 0x000148, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes) == 0x000150, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount) == 0x000160, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize) == 0x000164, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale) == 0x000168, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastLocation_4) == 0x00016C, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastLocation_4' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_StaticmeshComponents1_4) == 0x000178, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_StaticmeshComponents1_4' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastAlphaMeshSize_4) == 0x000188, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastAlphaMeshSize_4' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_AlphaScale_4) == 0x00018C, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_AlphaScale_4' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000190, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation_1) == 0x000194, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize_1) == 0x0001A0, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale_1) == 0x0001A4, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes_1) == 0x0001A8, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount_1) == 0x0001B8, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize_1) == 0x0001BC, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale_1) == 0x0001C0, "Member 'SimpleWallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale_1' has a wrong offset!");

// Function SimpleWall-01_BP.SimpleWall-01_BP_C.ExcludeStructForAutomaticCollision
// 0x0078 (0x0078 - 0x0000)
struct SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision final
{
public:
	TArray<struct FModuleMeshData>                Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FModuleMeshData                        CallFunc_Array_Get_Item;                           // 0x0028(0x0020)(HasGetValueTypeHash)
	struct FModuleAlternativeMeshData             CallFunc_Array_Get_Item_1;                         // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision) == 0x000008, "Wrong alignment on SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision");
static_assert(sizeof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision) == 0x000078, "Wrong size on SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, Array) == 0x000000, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::Array' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, Temp_int_Array_Index_Variable) == 0x000020, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, CallFunc_Array_Get_Item) == 0x000028, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, Temp_int_Loop_Counter_Variable_1) == 0x000064, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, CallFunc_Array_AddUnique_ReturnValue) == 0x000068, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, CallFunc_Less_IntInt_ReturnValue_1) == 0x00006C, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000074, "Member 'SimpleWallMinus01_BP_C_ExcludeStructForAutomaticCollision::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");

// Function SimpleWall-01_BP.SimpleWall-01_BP_C.GetStateName
// 0x0028 (0x0028 - 0x0000)
struct SimpleWallMinus01_BP_C_GetStateName final
{
public:
	class FString                                 StateA;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StateB;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SimpleWallMinus01_BP_C_GetStateName) == 0x000008, "Wrong alignment on SimpleWallMinus01_BP_C_GetStateName");
static_assert(sizeof(SimpleWallMinus01_BP_C_GetStateName) == 0x000028, "Wrong size on SimpleWallMinus01_BP_C_GetStateName");
static_assert(offsetof(SimpleWallMinus01_BP_C_GetStateName, StateA) == 0x000000, "Member 'SimpleWallMinus01_BP_C_GetStateName::StateA' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_GetStateName, StateB) == 0x000010, "Member 'SimpleWallMinus01_BP_C_GetStateName::StateB' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_GetStateName, ReturnValue) == 0x000020, "Member 'SimpleWallMinus01_BP_C_GetStateName::ReturnValue' has a wrong offset!");

// Function SimpleWall-01_BP.SimpleWall-01_BP_C.setVariable
// 0x0034 (0x0034 - 0x0000)
struct SimpleWallMinus01_BP_C_SetVariable final
{
public:
	struct FVector                                NewLocalVar_0;                                     // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _CurrentMeshSecondSize;                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _SecondTotal;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _MainTotal;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _SecondSizeLeft;                                   // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _BetaSize;                                         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _MainSizeLeft;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _MainSize;                                         // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _ySizeLeft;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _yTotal;                                           // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _WallHeight;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleWallMinus01_BP_C_SetVariable) == 0x000004, "Wrong alignment on SimpleWallMinus01_BP_C_SetVariable");
static_assert(sizeof(SimpleWallMinus01_BP_C_SetVariable) == 0x000034, "Wrong size on SimpleWallMinus01_BP_C_SetVariable");
static_assert(offsetof(SimpleWallMinus01_BP_C_SetVariable, NewLocalVar_0) == 0x000000, "Member 'SimpleWallMinus01_BP_C_SetVariable::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_SetVariable, _CurrentMeshSecondSize) == 0x00000C, "Member 'SimpleWallMinus01_BP_C_SetVariable::_CurrentMeshSecondSize' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_SetVariable, _SecondTotal) == 0x000010, "Member 'SimpleWallMinus01_BP_C_SetVariable::_SecondTotal' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_SetVariable, _MainTotal) == 0x000014, "Member 'SimpleWallMinus01_BP_C_SetVariable::_MainTotal' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_SetVariable, _SecondSizeLeft) == 0x000018, "Member 'SimpleWallMinus01_BP_C_SetVariable::_SecondSizeLeft' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_SetVariable, _BetaSize) == 0x00001C, "Member 'SimpleWallMinus01_BP_C_SetVariable::_BetaSize' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_SetVariable, _MainSizeLeft) == 0x000020, "Member 'SimpleWallMinus01_BP_C_SetVariable::_MainSizeLeft' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_SetVariable, _MainSize) == 0x000024, "Member 'SimpleWallMinus01_BP_C_SetVariable::_MainSize' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_SetVariable, _ySizeLeft) == 0x000028, "Member 'SimpleWallMinus01_BP_C_SetVariable::_ySizeLeft' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_SetVariable, _yTotal) == 0x00002C, "Member 'SimpleWallMinus01_BP_C_SetVariable::_yTotal' has a wrong offset!");
static_assert(offsetof(SimpleWallMinus01_BP_C_SetVariable, _WallHeight) == 0x000030, "Member 'SimpleWallMinus01_BP_C_SetVariable::_WallHeight' has a wrong offset!");

// Function SimpleWall-01_BP.SimpleWall-01_BP_C.IsStateA
// 0x0001 (0x0001 - 0x0000)
struct SimpleWallMinus01_BP_C_IsStateA final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SimpleWallMinus01_BP_C_IsStateA) == 0x000001, "Wrong alignment on SimpleWallMinus01_BP_C_IsStateA");
static_assert(sizeof(SimpleWallMinus01_BP_C_IsStateA) == 0x000001, "Wrong size on SimpleWallMinus01_BP_C_IsStateA");
static_assert(offsetof(SimpleWallMinus01_BP_C_IsStateA, ReturnValue) == 0x000000, "Member 'SimpleWallMinus01_BP_C_IsStateA::ReturnValue' has a wrong offset!");

}

