#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleMesh_ThrowableWeapon_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function SimpleMesh_ThrowableWeapon_BP.SimpleMesh_ThrowableWeapon_BP_C.ExecuteUbergraph_SimpleMesh_ThrowableWeapon_BP
// 0x0018 (0x0018 - 0x0000)
struct SimpleMesh_ThrowableWeapon_BP_C_ExecuteUbergraph_SimpleMesh_ThrowableWeapon_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBContainer*                           CallFunc_GetContainer_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SimpleMesh_ThrowableWeapon_BP_C_ExecuteUbergraph_SimpleMesh_ThrowableWeapon_BP) == 0x000008, "Wrong alignment on SimpleMesh_ThrowableWeapon_BP_C_ExecuteUbergraph_SimpleMesh_ThrowableWeapon_BP");
static_assert(sizeof(SimpleMesh_ThrowableWeapon_BP_C_ExecuteUbergraph_SimpleMesh_ThrowableWeapon_BP) == 0x000018, "Wrong size on SimpleMesh_ThrowableWeapon_BP_C_ExecuteUbergraph_SimpleMesh_ThrowableWeapon_BP");
static_assert(offsetof(SimpleMesh_ThrowableWeapon_BP_C_ExecuteUbergraph_SimpleMesh_ThrowableWeapon_BP, EntryPoint) == 0x000000, "Member 'SimpleMesh_ThrowableWeapon_BP_C_ExecuteUbergraph_SimpleMesh_ThrowableWeapon_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SimpleMesh_ThrowableWeapon_BP_C_ExecuteUbergraph_SimpleMesh_ThrowableWeapon_BP, CallFunc_GetContainer_ReturnValue) == 0x000008, "Member 'SimpleMesh_ThrowableWeapon_BP_C_ExecuteUbergraph_SimpleMesh_ThrowableWeapon_BP::CallFunc_GetContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleMesh_ThrowableWeapon_BP_C_ExecuteUbergraph_SimpleMesh_ThrowableWeapon_BP, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'SimpleMesh_ThrowableWeapon_BP_C_ExecuteUbergraph_SimpleMesh_ThrowableWeapon_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

