#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleDestructibleStage_Stuc

#include "Basic.hpp"

#include "SimpleDestructiblePhysicalMesh_Stuc_structs.hpp"
#include "SimpleDestructibleMeshes_Stuc_structs.hpp"
#include "SimpleDestructibleParticles_Stuc_structs.hpp"
#include "SimpleDestructibleLights_Stuc_structs.hpp"
#include "SimpleDestructibleSound_Stuc_structs.hpp"


namespace SDK
{

// UserDefinedStruct SimpleDestructibleStage_Stuc.SimpleDestructibleStage_Stuc
// 0x0060 (0x0060 - 0x0000)
struct FSimpleDestructibleStage_Stuc final
{
public:
	float                                         HitsPoint_15_733E3EDC4A483A7A8FEFDE9ABCB7005F;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSimpleDestructibleMeshes_Stuc> Meshes_26_F145667A40528EE611AD4399B1A02425;        // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<struct FSimpleDestructiblePhysicalMesh_Stuc> PhysicalMeshes_37_0EB5630540147F6E082CEE97235A8A40; // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<struct FSimpleDestructibleParticles_Stuc> Particles_27_BE02A85A4D672EC0EE0753BA5DB32250;     // 0x0028(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<struct FSimpleDestructibleLights_Stuc> BlastLights_39_9AE6958344F75C364E9562A04E8777CC;   // 0x0038(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<struct FSimpleDestructibleSound_Stuc>  Sound_33_9FA9A92645BAF9D9E2669E838F860110;         // 0x0048(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          ToggleOnOff_43_54B4F87C4F1788F26F35D58FA64AC0BA;   // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ApplyImpulseOnHit_41_9D5053AD4710F724E18443A473774E17; // 0x0059(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FSimpleDestructibleStage_Stuc) == 0x000008, "Wrong alignment on FSimpleDestructibleStage_Stuc");
static_assert(sizeof(FSimpleDestructibleStage_Stuc) == 0x000060, "Wrong size on FSimpleDestructibleStage_Stuc");
static_assert(offsetof(FSimpleDestructibleStage_Stuc, HitsPoint_15_733E3EDC4A483A7A8FEFDE9ABCB7005F) == 0x000000, "Member 'FSimpleDestructibleStage_Stuc::HitsPoint_15_733E3EDC4A483A7A8FEFDE9ABCB7005F' has a wrong offset!");
static_assert(offsetof(FSimpleDestructibleStage_Stuc, Meshes_26_F145667A40528EE611AD4399B1A02425) == 0x000008, "Member 'FSimpleDestructibleStage_Stuc::Meshes_26_F145667A40528EE611AD4399B1A02425' has a wrong offset!");
static_assert(offsetof(FSimpleDestructibleStage_Stuc, PhysicalMeshes_37_0EB5630540147F6E082CEE97235A8A40) == 0x000018, "Member 'FSimpleDestructibleStage_Stuc::PhysicalMeshes_37_0EB5630540147F6E082CEE97235A8A40' has a wrong offset!");
static_assert(offsetof(FSimpleDestructibleStage_Stuc, Particles_27_BE02A85A4D672EC0EE0753BA5DB32250) == 0x000028, "Member 'FSimpleDestructibleStage_Stuc::Particles_27_BE02A85A4D672EC0EE0753BA5DB32250' has a wrong offset!");
static_assert(offsetof(FSimpleDestructibleStage_Stuc, BlastLights_39_9AE6958344F75C364E9562A04E8777CC) == 0x000038, "Member 'FSimpleDestructibleStage_Stuc::BlastLights_39_9AE6958344F75C364E9562A04E8777CC' has a wrong offset!");
static_assert(offsetof(FSimpleDestructibleStage_Stuc, Sound_33_9FA9A92645BAF9D9E2669E838F860110) == 0x000048, "Member 'FSimpleDestructibleStage_Stuc::Sound_33_9FA9A92645BAF9D9E2669E838F860110' has a wrong offset!");
static_assert(offsetof(FSimpleDestructibleStage_Stuc, ToggleOnOff_43_54B4F87C4F1788F26F35D58FA64AC0BA) == 0x000058, "Member 'FSimpleDestructibleStage_Stuc::ToggleOnOff_43_54B4F87C4F1788F26F35D58FA64AC0BA' has a wrong offset!");
static_assert(offsetof(FSimpleDestructibleStage_Stuc, ApplyImpulseOnHit_41_9D5053AD4710F724E18443A473774E17) == 0x000059, "Member 'FSimpleDestructibleStage_Stuc::ApplyImpulseOnHit_41_9D5053AD4710F724E18443A473774E17' has a wrong offset!");

}

