#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleDestructibleProps_BP

#include "Basic.hpp"

#include "SimpleDestructibleParticles_Stuc_structs.hpp"
#include "AkAudio_structs.hpp"
#include "SimpleDestructibleSound_Stuc_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SimpleDestructibleLights_Stuc_structs.hpp"
#include "SimpleDestructibleMeshes_Stuc_structs.hpp"
#include "SimpleDestructiblePhysicalMesh_Stuc_structs.hpp"
#include "SimpleDestructibleStage_Stuc_structs.hpp"


namespace SDK::Params
{

// Function SimpleDestructibleProps_BP.SimpleDestructibleProps_BP_C.OnRep_isOff
// 0x0028 (0x0028 - 0x0000)
struct SimpleDestructibleProps_BP_C_OnRep_isOff final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_1;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleDestructibleProps_BP_C_OnRep_isOff) == 0x000004, "Wrong alignment on SimpleDestructibleProps_BP_C_OnRep_isOff");
static_assert(sizeof(SimpleDestructibleProps_BP_C_OnRep_isOff) == 0x000028, "Wrong size on SimpleDestructibleProps_BP_C_OnRep_isOff");
static_assert(offsetof(SimpleDestructibleProps_BP_C_OnRep_isOff, Temp_delegate_Variable) == 0x000000, "Member 'SimpleDestructibleProps_BP_C_OnRep_isOff::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_OnRep_isOff, Temp_delegate_Variable_1) == 0x000010, "Member 'SimpleDestructibleProps_BP_C_OnRep_isOff::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_OnRep_isOff, CallFunc_PostEventOnActor_ReturnValue) == 0x000020, "Member 'SimpleDestructibleProps_BP_C_OnRep_isOff::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_OnRep_isOff, CallFunc_PostEventOnActor_ReturnValue_1) == 0x000024, "Member 'SimpleDestructibleProps_BP_C_OnRep_isOff::CallFunc_PostEventOnActor_ReturnValue_1' has a wrong offset!");

// Function SimpleDestructibleProps_BP.SimpleDestructibleProps_BP_C.UpdateHittable
// 0x0008 (0x0008 - 0x0000)
struct SimpleDestructibleProps_BP_C_UpdateHittable final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SimpleDestructibleProps_BP_C_UpdateHittable) == 0x000004, "Wrong alignment on SimpleDestructibleProps_BP_C_UpdateHittable");
static_assert(sizeof(SimpleDestructibleProps_BP_C_UpdateHittable) == 0x000008, "Wrong size on SimpleDestructibleProps_BP_C_UpdateHittable");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateHittable, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'SimpleDestructibleProps_BP_C_UpdateHittable::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateHittable, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000004, "Member 'SimpleDestructibleProps_BP_C_UpdateHittable::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function SimpleDestructibleProps_BP.SimpleDestructibleProps_BP_C.UpdateLastHitterInfo
// 0x00A0 (0x00A0 - 0x0000)
struct SimpleDestructibleProps_BP_C_UpdateLastHitterInfo final
{
public:
	class AActor*                                 LastHitter;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_2;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo) == 0x000008, "Wrong alignment on SimpleDestructibleProps_BP_C_UpdateLastHitterInfo");
static_assert(sizeof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo) == 0x0000A0, "Wrong size on SimpleDestructibleProps_BP_C_UpdateLastHitterInfo");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, LastHitter) == 0x000000, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::LastHitter' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000028, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000030, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x00003C, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000048, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_BreakRotator_Roll) == 0x000054, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_BreakRotator_Pitch) == 0x000058, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_BreakRotator_Yaw) == 0x00005C, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_Normal_ReturnValue) == 0x000060, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_K2_GetRootComponent_ReturnValue_2) == 0x000070, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_K2_GetRootComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000078, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_FindLookAtRotation_ReturnValue) == 0x000084, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_BreakRotator_Roll_1) == 0x000090, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_BreakRotator_Pitch_1) == 0x000094, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_BreakRotator_Yaw_1) == 0x000098, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_UpdateLastHitterInfo, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00009C, "Member 'SimpleDestructibleProps_BP_C_UpdateLastHitterInfo::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function SimpleDestructibleProps_BP.SimpleDestructibleProps_BP_C.SetCurrentSounds
// 0x0058 (0x0058 - 0x0000)
struct SimpleDestructibleProps_BP_C_SetCurrentSounds final
{
public:
	TArray<struct FSimpleDestructibleSound_Stuc>  Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSimpleDestructibleSound_Stuc          CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleDestructibleProps_BP_C_SetCurrentSounds) == 0x000008, "Wrong alignment on SimpleDestructibleProps_BP_C_SetCurrentSounds");
static_assert(sizeof(SimpleDestructibleProps_BP_C_SetCurrentSounds) == 0x000058, "Wrong size on SimpleDestructibleProps_BP_C_SetCurrentSounds");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentSounds, Array) == 0x000000, "Member 'SimpleDestructibleProps_BP_C_SetCurrentSounds::Array' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentSounds, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'SimpleDestructibleProps_BP_C_SetCurrentSounds::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentSounds, Temp_delegate_Variable) == 0x000014, "Member 'SimpleDestructibleProps_BP_C_SetCurrentSounds::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentSounds, Temp_int_Array_Index_Variable) == 0x000024, "Member 'SimpleDestructibleProps_BP_C_SetCurrentSounds::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentSounds, CallFunc_Array_Get_Item) == 0x000028, "Member 'SimpleDestructibleProps_BP_C_SetCurrentSounds::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentSounds, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'SimpleDestructibleProps_BP_C_SetCurrentSounds::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentSounds, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'SimpleDestructibleProps_BP_C_SetCurrentSounds::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentSounds, CallFunc_Array_Add_ReturnValue_1) == 0x000040, "Member 'SimpleDestructibleProps_BP_C_SetCurrentSounds::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentSounds, CallFunc_PostEventOnActor_ReturnValue) == 0x000044, "Member 'SimpleDestructibleProps_BP_C_SetCurrentSounds::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentSounds, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'SimpleDestructibleProps_BP_C_SetCurrentSounds::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentSounds, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'SimpleDestructibleProps_BP_C_SetCurrentSounds::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentSounds, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'SimpleDestructibleProps_BP_C_SetCurrentSounds::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentSounds, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'SimpleDestructibleProps_BP_C_SetCurrentSounds::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function SimpleDestructibleProps_BP.SimpleDestructibleProps_BP_C.SetCurrentLights
// 0x0090 (0x0090 - 0x0000)
struct SimpleDestructibleProps_BP_C_SetCurrentLights final
{
public:
	TArray<struct FSimpleDestructibleLights_Stuc> Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSimpleDestructibleLights_Stuc         CallFunc_Array_Get_Item;                           // 0x0020(0x0050)(IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPointLightComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleDestructibleProps_BP_C_SetCurrentLights) == 0x000010, "Wrong alignment on SimpleDestructibleProps_BP_C_SetCurrentLights");
static_assert(sizeof(SimpleDestructibleProps_BP_C_SetCurrentLights) == 0x000090, "Wrong size on SimpleDestructibleProps_BP_C_SetCurrentLights");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentLights, Array) == 0x000000, "Member 'SimpleDestructibleProps_BP_C_SetCurrentLights::Array' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentLights, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'SimpleDestructibleProps_BP_C_SetCurrentLights::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentLights, Temp_int_Array_Index_Variable) == 0x000014, "Member 'SimpleDestructibleProps_BP_C_SetCurrentLights::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentLights, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'SimpleDestructibleProps_BP_C_SetCurrentLights::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentLights, CallFunc_Array_Get_Item) == 0x000020, "Member 'SimpleDestructibleProps_BP_C_SetCurrentLights::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentLights, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'SimpleDestructibleProps_BP_C_SetCurrentLights::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentLights, CallFunc_AddComponent_ReturnValue) == 0x000078, "Member 'SimpleDestructibleProps_BP_C_SetCurrentLights::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentLights, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'SimpleDestructibleProps_BP_C_SetCurrentLights::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentLights, CallFunc_Array_Add_ReturnValue) == 0x000084, "Member 'SimpleDestructibleProps_BP_C_SetCurrentLights::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function SimpleDestructibleProps_BP.SimpleDestructibleProps_BP_C.SetCurrentParticles
// 0x00E0 (0x00E0 - 0x0000)
struct SimpleDestructibleProps_BP_C_SetCurrentParticles final
{
public:
	TArray<struct FSimpleDestructibleParticles_Stuc> Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSimpleDestructibleParticles_Stuc      CallFunc_Array_Get_Item;                           // 0x0020(0x0050)(IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleDestructibleProps_BP_C_SetCurrentParticles) == 0x000010, "Wrong alignment on SimpleDestructibleProps_BP_C_SetCurrentParticles");
static_assert(sizeof(SimpleDestructibleProps_BP_C_SetCurrentParticles) == 0x0000E0, "Wrong size on SimpleDestructibleProps_BP_C_SetCurrentParticles");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, Array) == 0x000000, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::Array' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, Temp_int_Array_Index_Variable) == 0x000014, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_Array_Get_Item) == 0x000020, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_BreakTransform_Location) == 0x000074, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_BreakTransform_Rotation) == 0x000080, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_BreakTransform_Scale) == 0x00008C, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_BreakRotator_Roll) == 0x00009C, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_BreakRotator_Pitch) == 0x0000A0, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_BreakRotator_Yaw) == 0x0000A4, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, Temp_bool_Variable) == 0x0000AC, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000B0, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000B8, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000BC, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, K2Node_Select_Default) == 0x0000C0, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_MakeRotator_ReturnValue) == 0x0000C4, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0000D0, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentParticles, CallFunc_Array_Add_ReturnValue) == 0x0000D8, "Member 'SimpleDestructibleProps_BP_C_SetCurrentParticles::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function SimpleDestructibleProps_BP.SimpleDestructibleProps_BP_C.SetCurrentPhysicalMeshes
// 0x00D0 (0x00D0 - 0x0000)
struct SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes final
{
public:
	TArray<struct FSimpleDestructiblePhysicalMesh_Stuc> Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ApplyImpulse;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorFloat_ReturnValue;         // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSimpleDestructiblePhysicalMesh_Stuc   CallFunc_Array_Get_Item;                           // 0x0040(0x0050)(IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UStaticMeshComponent*             Temp_object_Variable;                              // 0x00C0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes) == 0x000010, "Wrong alignment on SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes");
static_assert(sizeof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes) == 0x0000D0, "Wrong size on SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, Array) == 0x000000, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::Array' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, ApplyImpulse) == 0x000010, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::ApplyImpulse' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, CallFunc_RandomUnitVector_ReturnValue) == 0x000014, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, CallFunc_Subtract_VectorFloat_ReturnValue) == 0x000020, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::CallFunc_Subtract_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, CallFunc_Array_Get_Item) == 0x000040, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, CallFunc_AddComponent_ReturnValue) == 0x000090, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, CallFunc_SetStaticMesh_ReturnValue) == 0x000099, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000AC, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, Temp_object_Variable) == 0x0000C0, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes, CallFunc_Array_Add_ReturnValue) == 0x0000C8, "Member 'SimpleDestructibleProps_BP_C_SetCurrentPhysicalMeshes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function SimpleDestructibleProps_BP.SimpleDestructibleProps_BP_C.SetCurrentMeshes
// 0x00A0 (0x00A0 - 0x0000)
struct SimpleDestructibleProps_BP_C_SetCurrentMeshes final
{
public:
	TArray<struct FSimpleDestructibleMeshes_Stuc> Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSimpleDestructibleMeshes_Stuc         CallFunc_Array_Get_Item;                           // 0x0020(0x0040)(IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleDestructibleProps_BP_C_SetCurrentMeshes) == 0x000010, "Wrong alignment on SimpleDestructibleProps_BP_C_SetCurrentMeshes");
static_assert(sizeof(SimpleDestructibleProps_BP_C_SetCurrentMeshes) == 0x0000A0, "Wrong size on SimpleDestructibleProps_BP_C_SetCurrentMeshes");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, Array) == 0x000000, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::Array' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, Temp_int_Array_Index_Variable) == 0x000014, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, CallFunc_Array_Get_Item) == 0x000020, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, CallFunc_SetStaticMesh_ReturnValue) == 0x000070, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000078, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, Temp_int_Loop_Counter_Variable) == 0x000084, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000088, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_SetCurrentMeshes, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000094, "Member 'SimpleDestructibleProps_BP_C_SetCurrentMeshes::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function SimpleDestructibleProps_BP.SimpleDestructibleProps_BP_C.CleanLastState
// 0x0070 (0x0070 - 0x0000)
struct SimpleDestructibleProps_BP_C_CleanLastState final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          CallFunc_Array_Get_Item_2;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleDestructibleProps_BP_C_CleanLastState) == 0x000008, "Wrong alignment on SimpleDestructibleProps_BP_C_CleanLastState");
static_assert(sizeof(SimpleDestructibleProps_BP_C_CleanLastState) == 0x000070, "Wrong size on SimpleDestructibleProps_BP_C_CleanLastState");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, Temp_int_Array_Index_Variable) == 0x000008, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, Temp_int_Array_Index_Variable_2) == 0x000018, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, Temp_delegate_Variable) == 0x00001C, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, CallFunc_Array_Get_Item) == 0x000030, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, CallFunc_Array_Length_ReturnValue_1) == 0x00004C, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, Temp_int_Loop_Counter_Variable_2) == 0x000050, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, CallFunc_Array_Get_Item_2) == 0x000058, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, CallFunc_Array_Length_ReturnValue_2) == 0x000060, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, CallFunc_PostEventOnActor_ReturnValue) == 0x000064, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, CallFunc_Less_IntInt_ReturnValue_1) == 0x000068, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, CallFunc_Less_IntInt_ReturnValue_2) == 0x000069, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SimpleDestructibleProps_BP_C_CleanLastState, CallFunc_Add_IntInt_ReturnValue_2) == 0x00006C, "Member 'SimpleDestructibleProps_BP_C_CleanLastState::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function SimpleDestructibleProps_BP.SimpleDestructibleProps_BP_C.UpdateBroken
// 0x0028 (0x0028 - 0x0000)
