#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleDestructibleLights_Stuc

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SimpleDestructibleLights_Stuc.SimpleDestructibleLights_Stuc
// 0x0050 (0x0050 - 0x0000)
struct FSimpleDestructibleLights_Stuc final
{
public:
	struct FTransform                             Transform_35_BE02A85A4D672EC0EE0753BA5DB32250;     // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Color_34_126C9C9A407DAA940612D9A3ECBF4995;         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Intensity_33_892237444996609AAE542090551DA063;     // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSimpleDestructibleLights_Stuc) == 0x000010, "Wrong alignment on FSimpleDestructibleLights_Stuc");
static_assert(sizeof(FSimpleDestructibleLights_Stuc) == 0x000050, "Wrong size on FSimpleDestructibleLights_Stuc");
static_assert(offsetof(FSimpleDestructibleLights_Stuc, Transform_35_BE02A85A4D672EC0EE0753BA5DB32250) == 0x000000, "Member 'FSimpleDestructibleLights_Stuc::Transform_35_BE02A85A4D672EC0EE0753BA5DB32250' has a wrong offset!");
static_assert(offsetof(FSimpleDestructibleLights_Stuc, Color_34_126C9C9A407DAA940612D9A3ECBF4995) == 0x000030, "Member 'FSimpleDestructibleLights_Stuc::Color_34_126C9C9A407DAA940612D9A3ECBF4995' has a wrong offset!");
static_assert(offsetof(FSimpleDestructibleLights_Stuc, Intensity_33_892237444996609AAE542090551DA063) == 0x000040, "Member 'FSimpleDestructibleLights_Stuc::Intensity_33_892237444996609AAE542090551DA063' has a wrong offset!");

}

