#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleActionTooltip

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SimpleActionTooltip.SimpleActionTooltip_C.ExecuteUbergraph_SimpleActionTooltip
// 0x0018 (0x0018 - 0x0000)
struct SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip) == 0x000008, "Wrong alignment on SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip");
static_assert(sizeof(SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip) == 0x000018, "Wrong size on SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip");
static_assert(offsetof(SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip, EntryPoint) == 0x000000, "Member 'SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'SimpleActionTooltip_C_ExecuteUbergraph_SimpleActionTooltip::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function SimpleActionTooltip.SimpleActionTooltip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SimpleActionTooltip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SimpleActionTooltip_C_PreConstruct) == 0x000001, "Wrong alignment on SimpleActionTooltip_C_PreConstruct");
static_assert(sizeof(SimpleActionTooltip_C_PreConstruct) == 0x000001, "Wrong size on SimpleActionTooltip_C_PreConstruct");
static_assert(offsetof(SimpleActionTooltip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SimpleActionTooltip_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SimpleActionTooltip.SimpleActionTooltip_C.UpdateText
// 0x0018 (0x0018 - 0x0000)
struct SimpleActionTooltip_C_UpdateText final
{
public:
	class FText                                   DesiredText_0;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SimpleActionTooltip_C_UpdateText) == 0x000008, "Wrong alignment on SimpleActionTooltip_C_UpdateText");
static_assert(sizeof(SimpleActionTooltip_C_UpdateText) == 0x000018, "Wrong size on SimpleActionTooltip_C_UpdateText");
static_assert(offsetof(SimpleActionTooltip_C_UpdateText, DesiredText_0) == 0x000000, "Member 'SimpleActionTooltip_C_UpdateText::DesiredText_0' has a wrong offset!");

}

