#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleDestructibleProps_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SimpleDestructibleStage_Stuc_structs.hpp"
#include "SimpleDestructibleSound_Stuc_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SimpleDestructibleProps_BP.SimpleDestructibleProps_BP_C
// 0x0180 (0x05D0 - 0x0450)
class ASimpleDestructibleProps_BP_C : public ARBHittableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActor;                                        // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BaseMesh;                                          // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_8C54EC3A42DB600067A1A9B488272D1B; // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_8C54EC3A42DB600067A1A9B488272D1B; // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorEmissive;                                     // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULightComponent*>                BaseLights;                                        // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         CurrentStage;                                      // 0x04A0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	int32                                         StartingStage;                                     // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BreakingStage;                                     // 0x04A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULightComponent*>                BlastLights;                                       // 0x04B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsBroken;                                          // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          StartOff;                                          // 0x04C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C2[0x6];                                      // 0x04C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSimpleDestructibleStage_Stuc>  Stages;                                            // 0x04C8(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class ULightComponent*>                CurrentLights;                                     // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           CurrentMeshes;                                     // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         NumberOfStages;                                    // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UParticleSystemComponent*>       CurrentParticles;                                  // 0x0500(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class ULightComponent*>                AnimatedLights;                                    // 0x0510(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           BaseMeshes;                                        // 0x0520(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UAkComponent*                           NewVar_0;                                          // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAkAudioEvent*>                  CurrentSounds;                                     // 0x0538(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAkAudioEvent*>                  CurrentSoundsStop;                                 // 0x0548(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UStaticMeshComponent*>           CurrentPhysicalMeshes;                             // 0x0558(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FSimpleDestructibleSound_Stuc          BaseSound;                                         // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          UseBaseStaticMesh;                                 // 0x0578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseChildActor;                                     // 0x0579(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57A[0x2];                                      // 0x057A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TotalDamage;                                       // 0x057C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewCurrentStage;                                   // 0x0580(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseConstructionScript;                             // 0x0584(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_585[0x3];                                      // 0x0585(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IncrementalValue;                                  // 0x0588(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StageParticalesYaw;                                // 0x058C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasBeginPlay;                                      // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DelayedCurrentStage;                               // 0x0591(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_592[0x6];                                      // 0x0592(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnBrokenChanged;                                   // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsOff;                                             // 0x05A8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	struct FLightingChannels                      LightingChannels;                                  // 0x05A9(0x0001)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_5AA[0x2];                                      // 0x05AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastHitDirection;                                  // 0x05AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnBreakImpulse;                                    // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreviewMode;                                       // 0x05BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BD[0x3];                                      // 0x05BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LastHitterActor;                                   // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDamage;                                         // 0x05C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnRep_isOff();
	void UpdateHittable();
	void UpdateLastHitterInfo(class AActor* LastHitter);
	void SetCurrentSounds(TArray<struct FSimpleDestructibleSound_Stuc>& Array);
	void SetCurrentLights(TArray<struct FSimpleDestructibleLights_Stuc>& Array);
	void SetCurrentParticles(TArray<struct FSimpleDestructibleParticles_Stuc>& Array);
	void SetCurrentPhysicalMeshes(TArray<struct FSimpleDestructiblePhysicalMesh_Stuc>& Array, bool ApplyImpulse);
	void SetCurrentMeshes(TArray<struct FSimpleDestructibleMeshes_Stuc>& Array);
	void CleanLastState();
	void UpdateBroken(bool Toggle);
	void OnCurrentStageChanged();
	void OnRep_CurrentStage();
	void SetOn(bool IsOff_0);
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void ReceiveBeginPlay();
	void Event_OnTriggered();
	void Event_OnUntriggered();
	void BlastLight();
	void Event_SnapToState();
	void BndEvt__DamageableComponent_K2Node_ComponentBoundEvent_2_OnDamageableDamaged__DelegateSignature(class URBDamageableComponent* DamageableComponent_0, bool IsDestroyed);
	void ExecuteUbergraph_SimpleDestructibleProps_BP(int32 EntryPoint);
	void OnBrokenChanged__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SimpleDestructibleProps_BP_C">();
	}
	static class ASimpleDestructibleProps_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASimpleDestructibleProps_BP_C>();
	}
};
static_assert(alignof(ASimpleDestructibleProps_BP_C) == 0x000010, "Wrong alignment on ASimpleDestructibleProps_BP_C");
static_assert(sizeof(ASimpleDestructibleProps_BP_C) == 0x0005D0, "Wrong size on ASimpleDestructibleProps_BP_C");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, UberGraphFrame) == 0x000450, "Member 'ASimpleDestructibleProps_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, Billboard) == 0x000458, "Member 'ASimpleDestructibleProps_BP_C::Billboard' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, ChildActor) == 0x000460, "Member 'ASimpleDestructibleProps_BP_C::ChildActor' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, BaseMesh) == 0x000468, "Member 'ASimpleDestructibleProps_BP_C::BaseMesh' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, Timeline_0_NewTrack_0_8C54EC3A42DB600067A1A9B488272D1B) == 0x000470, "Member 'ASimpleDestructibleProps_BP_C::Timeline_0_NewTrack_0_8C54EC3A42DB600067A1A9B488272D1B' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, Timeline_0__Direction_8C54EC3A42DB600067A1A9B488272D1B) == 0x000474, "Member 'ASimpleDestructibleProps_BP_C::Timeline_0__Direction_8C54EC3A42DB600067A1A9B488272D1B' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, Timeline_0) == 0x000478, "Member 'ASimpleDestructibleProps_BP_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, ColorEmissive) == 0x000480, "Member 'ASimpleDestructibleProps_BP_C::ColorEmissive' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, BaseLights) == 0x000490, "Member 'ASimpleDestructibleProps_BP_C::BaseLights' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, CurrentStage) == 0x0004A0, "Member 'ASimpleDestructibleProps_BP_C::CurrentStage' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, StartingStage) == 0x0004A4, "Member 'ASimpleDestructibleProps_BP_C::StartingStage' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, BreakingStage) == 0x0004A8, "Member 'ASimpleDestructibleProps_BP_C::BreakingStage' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, BlastLights) == 0x0004B0, "Member 'ASimpleDestructibleProps_BP_C::BlastLights' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, IsBroken) == 0x0004C0, "Member 'ASimpleDestructibleProps_BP_C::IsBroken' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, StartOff) == 0x0004C1, "Member 'ASimpleDestructibleProps_BP_C::StartOff' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, Stages) == 0x0004C8, "Member 'ASimpleDestructibleProps_BP_C::Stages' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, CurrentLights) == 0x0004D8, "Member 'ASimpleDestructibleProps_BP_C::CurrentLights' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, CurrentMeshes) == 0x0004E8, "Member 'ASimpleDestructibleProps_BP_C::CurrentMeshes' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, NumberOfStages) == 0x0004F8, "Member 'ASimpleDestructibleProps_BP_C::NumberOfStages' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, CurrentParticles) == 0x000500, "Member 'ASimpleDestructibleProps_BP_C::CurrentParticles' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, AnimatedLights) == 0x000510, "Member 'ASimpleDestructibleProps_BP_C::AnimatedLights' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, BaseMeshes) == 0x000520, "Member 'ASimpleDestructibleProps_BP_C::BaseMeshes' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, NewVar_0) == 0x000530, "Member 'ASimpleDestructibleProps_BP_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, CurrentSounds) == 0x000538, "Member 'ASimpleDestructibleProps_BP_C::CurrentSounds' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, CurrentSoundsStop) == 0x000548, "Member 'ASimpleDestructibleProps_BP_C::CurrentSoundsStop' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, CurrentPhysicalMeshes) == 0x000558, "Member 'ASimpleDestructibleProps_BP_C::CurrentPhysicalMeshes' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, BaseSound) == 0x000568, "Member 'ASimpleDestructibleProps_BP_C::BaseSound' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, UseBaseStaticMesh) == 0x000578, "Member 'ASimpleDestructibleProps_BP_C::UseBaseStaticMesh' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, UseChildActor) == 0x000579, "Member 'ASimpleDestructibleProps_BP_C::UseChildActor' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, TotalDamage) == 0x00057C, "Member 'ASimpleDestructibleProps_BP_C::TotalDamage' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, NewCurrentStage) == 0x000580, "Member 'ASimpleDestructibleProps_BP_C::NewCurrentStage' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, UseConstructionScript) == 0x000584, "Member 'ASimpleDestructibleProps_BP_C::UseConstructionScript' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, IncrementalValue) == 0x000588, "Member 'ASimpleDestructibleProps_BP_C::IncrementalValue' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, StageParticalesYaw) == 0x00058C, "Member 'ASimpleDestructibleProps_BP_C::StageParticalesYaw' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, HasBeginPlay) == 0x000590, "Member 'ASimpleDestructibleProps_BP_C::HasBeginPlay' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, DelayedCurrentStage) == 0x000591, "Member 'ASimpleDestructibleProps_BP_C::DelayedCurrentStage' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, OnBrokenChanged) == 0x000598, "Member 'ASimpleDestructibleProps_BP_C::OnBrokenChanged' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, IsOff) == 0x0005A8, "Member 'ASimpleDestructibleProps_BP_C::IsOff' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, LightingChannels) == 0x0005A9, "Member 'ASimpleDestructibleProps_BP_C::LightingChannels' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, LastHitDirection) == 0x0005AC, "Member 'ASimpleDestructibleProps_BP_C::LastHitDirection' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, OnBreakImpulse) == 0x0005B8, "Member 'ASimpleDestructibleProps_BP_C::OnBreakImpulse' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, PreviewMode) == 0x0005BC, "Member 'ASimpleDestructibleProps_BP_C::PreviewMode' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, LastHitterActor) == 0x0005C0, "Member 'ASimpleDestructibleProps_BP_C::LastHitterActor' has a wrong offset!");
static_assert(offsetof(ASimpleDestructibleProps_BP_C, MaxDamage) == 0x0005C8, "Member 'ASimpleDestructibleProps_BP_C::MaxDamage' has a wrong offset!");

}

