#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SJ_CashRegisterMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RBScareJumpBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SJ_CashRegister-01_BP.SJ_CashRegister-01_BP_C
// 0x0030 (0x0540 - 0x0510)
class ASJ_CashRegisterMinus01_BP_C final : public ARBScareJumpBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SJ_CashRegisterMinus01_BP_C;        // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   CashRegisterDrawer;                                // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CashRegister;                                      // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Diode;                                             // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DrawerTimeline_Y_D0F2A29741B19FC4EB2C259FF1D89DDA; // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DrawerTimeline__Direction_D0F2A29741B19FC4EB2C259FF1D89DDA; // 0x0534(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_535[0x3];                                      // 0x0535(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DrawerTimeline;                                    // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DrawerTimeline__FinishedFunc();
	void DrawerTimeline__UpdateFunc();
	void Event_OnTriggered();
	void Event_OnUntriggered();
	void Event_OnResetStage();
	void ExecuteUbergraph_SJ_CashRegisterMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SJ_CashRegister-01_BP_C">();
	}
	static class ASJ_CashRegisterMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASJ_CashRegisterMinus01_BP_C>();
	}
};
static_assert(alignof(ASJ_CashRegisterMinus01_BP_C) == 0x000010, "Wrong alignment on ASJ_CashRegisterMinus01_BP_C");
static_assert(sizeof(ASJ_CashRegisterMinus01_BP_C) == 0x000540, "Wrong size on ASJ_CashRegisterMinus01_BP_C");
static_assert(offsetof(ASJ_CashRegisterMinus01_BP_C, UberGraphFrame_SJ_CashRegisterMinus01_BP_C) == 0x000508, "Member 'ASJ_CashRegisterMinus01_BP_C::UberGraphFrame_SJ_CashRegisterMinus01_BP_C' has a wrong offset!");
static_assert(offsetof(ASJ_CashRegisterMinus01_BP_C, CashRegisterDrawer) == 0x000510, "Member 'ASJ_CashRegisterMinus01_BP_C::CashRegisterDrawer' has a wrong offset!");
static_assert(offsetof(ASJ_CashRegisterMinus01_BP_C, CashRegister) == 0x000518, "Member 'ASJ_CashRegisterMinus01_BP_C::CashRegister' has a wrong offset!");
static_assert(offsetof(ASJ_CashRegisterMinus01_BP_C, PointLight) == 0x000520, "Member 'ASJ_CashRegisterMinus01_BP_C::PointLight' has a wrong offset!");
static_assert(offsetof(ASJ_CashRegisterMinus01_BP_C, Diode) == 0x000528, "Member 'ASJ_CashRegisterMinus01_BP_C::Diode' has a wrong offset!");
static_assert(offsetof(ASJ_CashRegisterMinus01_BP_C, DrawerTimeline_Y_D0F2A29741B19FC4EB2C259FF1D89DDA) == 0x000530, "Member 'ASJ_CashRegisterMinus01_BP_C::DrawerTimeline_Y_D0F2A29741B19FC4EB2C259FF1D89DDA' has a wrong offset!");
static_assert(offsetof(ASJ_CashRegisterMinus01_BP_C, DrawerTimeline__Direction_D0F2A29741B19FC4EB2C259FF1D89DDA) == 0x000534, "Member 'ASJ_CashRegisterMinus01_BP_C::DrawerTimeline__Direction_D0F2A29741B19FC4EB2C259FF1D89DDA' has a wrong offset!");
static_assert(offsetof(ASJ_CashRegisterMinus01_BP_C, DrawerTimeline) == 0x000538, "Member 'ASJ_CashRegisterMinus01_BP_C::DrawerTimeline' has a wrong offset!");

}

