#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SJ_CashRegisterMinus01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SJ_CashRegister-01_BP.SJ_CashRegister-01_BP_C.ExecuteUbergraph_SJ_CashRegister-01_BP
// 0x009C (0x009C - 0x0000)
struct SJ_CashRegisterMinus01_BP_C_ExecuteUbergraph_SJ_CashRegisterMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0014(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SJ_CashRegisterMinus01_BP_C_ExecuteUbergraph_SJ_CashRegisterMinus01_BP) == 0x000004, "Wrong alignment on SJ_CashRegisterMinus01_BP_C_ExecuteUbergraph_SJ_CashRegisterMinus01_BP");
static_assert(sizeof(SJ_CashRegisterMinus01_BP_C_ExecuteUbergraph_SJ_CashRegisterMinus01_BP) == 0x00009C, "Wrong size on SJ_CashRegisterMinus01_BP_C_ExecuteUbergraph_SJ_CashRegisterMinus01_BP");
static_assert(offsetof(SJ_CashRegisterMinus01_BP_C_ExecuteUbergraph_SJ_CashRegisterMinus01_BP, EntryPoint) == 0x000000, "Member 'SJ_CashRegisterMinus01_BP_C_ExecuteUbergraph_SJ_CashRegisterMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SJ_CashRegisterMinus01_BP_C_ExecuteUbergraph_SJ_CashRegisterMinus01_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'SJ_CashRegisterMinus01_BP_C_ExecuteUbergraph_SJ_CashRegisterMinus01_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SJ_CashRegisterMinus01_BP_C_ExecuteUbergraph_SJ_CashRegisterMinus01_BP, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'SJ_CashRegisterMinus01_BP_C_ExecuteUbergraph_SJ_CashRegisterMinus01_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SJ_CashRegisterMinus01_BP_C_ExecuteUbergraph_SJ_CashRegisterMinus01_BP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000014, "Member 'SJ_CashRegisterMinus01_BP_C_ExecuteUbergraph_SJ_CashRegisterMinus01_BP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

}

