#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SJ_ElectricSparkMinus01_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function SJ_ElectricSpark-01_BP.SJ_ElectricSpark-01_BP_C.ExecuteUbergraph_SJ_ElectricSpark-01_BP
// 0x000C (0x000C - 0x0000)
struct SJ_ElectricSparkMinus01_BP_C_ExecuteUbergraph_SJ_ElectricSparkMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SJ_ElectricSparkMinus01_BP_C_ExecuteUbergraph_SJ_ElectricSparkMinus01_BP) == 0x000004, "Wrong alignment on SJ_ElectricSparkMinus01_BP_C_ExecuteUbergraph_SJ_ElectricSparkMinus01_BP");
static_assert(sizeof(SJ_ElectricSparkMinus01_BP_C_ExecuteUbergraph_SJ_ElectricSparkMinus01_BP) == 0x00000C, "Wrong size on SJ_ElectricSparkMinus01_BP_C_ExecuteUbergraph_SJ_ElectricSparkMinus01_BP");
static_assert(offsetof(SJ_ElectricSparkMinus01_BP_C_ExecuteUbergraph_SJ_ElectricSparkMinus01_BP, EntryPoint) == 0x000000, "Member 'SJ_ElectricSparkMinus01_BP_C_ExecuteUbergraph_SJ_ElectricSparkMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SJ_ElectricSparkMinus01_BP_C_ExecuteUbergraph_SJ_ElectricSparkMinus01_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'SJ_ElectricSparkMinus01_BP_C_ExecuteUbergraph_SJ_ElectricSparkMinus01_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SJ_ElectricSparkMinus01_BP_C_ExecuteUbergraph_SJ_ElectricSparkMinus01_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'SJ_ElectricSparkMinus01_BP_C_ExecuteUbergraph_SJ_ElectricSparkMinus01_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

}

