#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SJ_ExplodingBulbMinus01_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function SJ_ExplodingBulb-01_BP.SJ_ExplodingBulb-01_BP_C.ExecuteUbergraph_SJ_ExplodingBulb-01_BP
// 0x000C (0x000C - 0x0000)
struct SJ_ExplodingBulbMinus01_BP_C_ExecuteUbergraph_SJ_ExplodingBulbMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SJ_ExplodingBulbMinus01_BP_C_ExecuteUbergraph_SJ_ExplodingBulbMinus01_BP) == 0x000004, "Wrong alignment on SJ_ExplodingBulbMinus01_BP_C_ExecuteUbergraph_SJ_ExplodingBulbMinus01_BP");
static_assert(sizeof(SJ_ExplodingBulbMinus01_BP_C_ExecuteUbergraph_SJ_ExplodingBulbMinus01_BP) == 0x00000C, "Wrong size on SJ_ExplodingBulbMinus01_BP_C_ExecuteUbergraph_SJ_ExplodingBulbMinus01_BP");
static_assert(offsetof(SJ_ExplodingBulbMinus01_BP_C_ExecuteUbergraph_SJ_ExplodingBulbMinus01_BP, EntryPoint) == 0x000000, "Member 'SJ_ExplodingBulbMinus01_BP_C_ExecuteUbergraph_SJ_ExplodingBulbMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SJ_ExplodingBulbMinus01_BP_C_ExecuteUbergraph_SJ_ExplodingBulbMinus01_BP, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'SJ_ExplodingBulbMinus01_BP_C_ExecuteUbergraph_SJ_ExplodingBulbMinus01_BP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SJ_ExplodingBulbMinus01_BP_C_ExecuteUbergraph_SJ_ExplodingBulbMinus01_BP, CallFunc_SetStaticMesh_ReturnValue) == 0x000008, "Member 'SJ_ExplodingBulbMinus01_BP_C_ExecuteUbergraph_SJ_ExplodingBulbMinus01_BP::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(SJ_ExplodingBulbMinus01_BP_C_ExecuteUbergraph_SJ_ExplodingBulbMinus01_BP, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000009, "Member 'SJ_ExplodingBulbMinus01_BP_C_ExecuteUbergraph_SJ_ExplodingBulbMinus01_BP::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");

}

