#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SJ_ElectricSparkMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RBScareJumpBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SJ_ElectricSpark-01_BP.SJ_ElectricSpark-01_BP_C
// 0x0040 (0x0550 - 0x0510)
class ASJ_ElectricSparkMinus01_BP_C final : public ARBScareJumpBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SJ_ElectricSparkMinus01_BP_C;       // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Nrg_Spark;                                         // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    SparkBillboard;                                    // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   Text;                                              // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Intensity_2BF9C6294E0CA41D4179CBB2F416E221; // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_2BF9C6294E0CA41D4179CBB2F416E221; // 0x053C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53D[0x3];                                      // 0x053D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Event_OnTriggered();
	void Event_OnUntriggered();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_SJ_ElectricSparkMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SJ_ElectricSpark-01_BP_C">();
	}
	static class ASJ_ElectricSparkMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASJ_ElectricSparkMinus01_BP_C>();
	}
};
static_assert(alignof(ASJ_ElectricSparkMinus01_BP_C) == 0x000010, "Wrong alignment on ASJ_ElectricSparkMinus01_BP_C");
static_assert(sizeof(ASJ_ElectricSparkMinus01_BP_C) == 0x000550, "Wrong size on ASJ_ElectricSparkMinus01_BP_C");
static_assert(offsetof(ASJ_ElectricSparkMinus01_BP_C, UberGraphFrame_SJ_ElectricSparkMinus01_BP_C) == 0x000508, "Member 'ASJ_ElectricSparkMinus01_BP_C::UberGraphFrame_SJ_ElectricSparkMinus01_BP_C' has a wrong offset!");
static_assert(offsetof(ASJ_ElectricSparkMinus01_BP_C, Arrow) == 0x000510, "Member 'ASJ_ElectricSparkMinus01_BP_C::Arrow' has a wrong offset!");
static_assert(offsetof(ASJ_ElectricSparkMinus01_BP_C, PointLight) == 0x000518, "Member 'ASJ_ElectricSparkMinus01_BP_C::PointLight' has a wrong offset!");
static_assert(offsetof(ASJ_ElectricSparkMinus01_BP_C, Nrg_Spark) == 0x000520, "Member 'ASJ_ElectricSparkMinus01_BP_C::Nrg_Spark' has a wrong offset!");
static_assert(offsetof(ASJ_ElectricSparkMinus01_BP_C, SparkBillboard) == 0x000528, "Member 'ASJ_ElectricSparkMinus01_BP_C::SparkBillboard' has a wrong offset!");
static_assert(offsetof(ASJ_ElectricSparkMinus01_BP_C, Text) == 0x000530, "Member 'ASJ_ElectricSparkMinus01_BP_C::Text' has a wrong offset!");
static_assert(offsetof(ASJ_ElectricSparkMinus01_BP_C, Timeline_0_Intensity_2BF9C6294E0CA41D4179CBB2F416E221) == 0x000538, "Member 'ASJ_ElectricSparkMinus01_BP_C::Timeline_0_Intensity_2BF9C6294E0CA41D4179CBB2F416E221' has a wrong offset!");
static_assert(offsetof(ASJ_ElectricSparkMinus01_BP_C, Timeline_0__Direction_2BF9C6294E0CA41D4179CBB2F416E221) == 0x00053C, "Member 'ASJ_ElectricSparkMinus01_BP_C::Timeline_0__Direction_2BF9C6294E0CA41D4179CBB2F416E221' has a wrong offset!");
static_assert(offsetof(ASJ_ElectricSparkMinus01_BP_C, Timeline_0) == 0x000540, "Member 'ASJ_ElectricSparkMinus01_BP_C::Timeline_0' has a wrong offset!");

}

