#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SJ_FanMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RBScareJumpBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SJ_Fan-01_BP.SJ_Fan-01_BP_C
// 0x0050 (0x0560 - 0x0510)
class ASJ_FanMinus01_BP_C final : public ARBScareJumpBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SJ_FanMinus01_BP_C;                 // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Ngr_Burst;                                         // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 WallFanMinus01;                                    // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Intensity_0566167044C6A5D40A11C7A0CD36EF8B; // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_0566167044C6A5D40A11C7A0CD36EF8B; // 0x0534(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_535[0x3];                                      // 0x0535(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NewTrack_0_D80C0AE242EA88A95FE296A6A38371E5; // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_D80C0AE242EA88A95FE296A6A38371E5; // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_545[0x3];                                      // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewPlayRate;                                       // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayRate;                                          // 0x0554(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxAnimDistance;                                   // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChosenSoundIndex;                                  // 0x055C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void Event_OnTriggered();
	void Event_OnUntriggered();
	void ReceiveBeginPlay();
	void Event_OnResetStage();
	void ChooseFanSound();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void PrintSoundName();
	void ExecuteUbergraph_SJ_FanMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SJ_Fan-01_BP_C">();
	}
	static class ASJ_FanMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASJ_FanMinus01_BP_C>();
	}
};
static_assert(alignof(ASJ_FanMinus01_BP_C) == 0x000010, "Wrong alignment on ASJ_FanMinus01_BP_C");
static_assert(sizeof(ASJ_FanMinus01_BP_C) == 0x000560, "Wrong size on ASJ_FanMinus01_BP_C");
static_assert(offsetof(ASJ_FanMinus01_BP_C, UberGraphFrame_SJ_FanMinus01_BP_C) == 0x000508, "Member 'ASJ_FanMinus01_BP_C::UberGraphFrame_SJ_FanMinus01_BP_C' has a wrong offset!");
static_assert(offsetof(ASJ_FanMinus01_BP_C, Billboard) == 0x000510, "Member 'ASJ_FanMinus01_BP_C::Billboard' has a wrong offset!");
static_assert(offsetof(ASJ_FanMinus01_BP_C, PointLight) == 0x000518, "Member 'ASJ_FanMinus01_BP_C::PointLight' has a wrong offset!");
static_assert(offsetof(ASJ_FanMinus01_BP_C, Ngr_Burst) == 0x000520, "Member 'ASJ_FanMinus01_BP_C::Ngr_Burst' has a wrong offset!");
static_assert(offsetof(ASJ_FanMinus01_BP_C, WallFanMinus01) == 0x000528, "Member 'ASJ_FanMinus01_BP_C::WallFanMinus01' has a wrong offset!");
static_assert(offsetof(ASJ_FanMinus01_BP_C, Timeline_0_Intensity_0566167044C6A5D40A11C7A0CD36EF8B) == 0x000530, "Member 'ASJ_FanMinus01_BP_C::Timeline_0_Intensity_0566167044C6A5D40A11C7A0CD36EF8B' has a wrong offset!");
static_assert(offsetof(ASJ_FanMinus01_BP_C, Timeline_0__Direction_0566167044C6A5D40A11C7A0CD36EF8B) == 0x000534, "Member 'ASJ_FanMinus01_BP_C::Timeline_0__Direction_0566167044C6A5D40A11C7A0CD36EF8B' has a wrong offset!");
static_assert(offsetof(ASJ_FanMinus01_BP_C, Timeline_0) == 0x000538, "Member 'ASJ_FanMinus01_BP_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ASJ_FanMinus01_BP_C, Timeline_1_NewTrack_0_D80C0AE242EA88A95FE296A6A38371E5) == 0x000540, "Member 'ASJ_FanMinus01_BP_C::Timeline_1_NewTrack_0_D80C0AE242EA88A95FE296A6A38371E5' has a wrong offset!");
static_assert(offsetof(ASJ_FanMinus01_BP_C, Timeline_1__Direction_D80C0AE242EA88A95FE296A6A38371E5) == 0x000544, "Member 'ASJ_FanMinus01_BP_C::Timeline_1__Direction_D80C0AE242EA88A95FE296A6A38371E5' has a wrong offset!");
static_assert(offsetof(ASJ_FanMinus01_BP_C, Timeline_1) == 0x000548, "Member 'ASJ_FanMinus01_BP_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ASJ_FanMinus01_BP_C, NewPlayRate) == 0x000550, "Member 'ASJ_FanMinus01_BP_C::NewPlayRate' has a wrong offset!");
static_assert(offsetof(ASJ_FanMinus01_BP_C, PlayRate) == 0x000554, "Member 'ASJ_FanMinus01_BP_C::PlayRate' has a wrong offset!");
static_assert(offsetof(ASJ_FanMinus01_BP_C, MaxAnimDistance) == 0x000558, "Member 'ASJ_FanMinus01_BP_C::MaxAnimDistance' has a wrong offset!");
static_assert(offsetof(ASJ_FanMinus01_BP_C, ChosenSoundIndex) == 0x00055C, "Member 'ASJ_FanMinus01_BP_C::ChosenSoundIndex' has a wrong offset!");

}

