#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SJ_FallingObject_Base_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RBScareJumpBase_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SJ_FallingObject_Base_BP.SJ_FallingObject_Base_BP_C
// 0x0070 (0x0580 - 0x0510)
class ASJ_FallingObject_Base_BP_C : public ARBScareJumpBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SJ_FallingObject_Base_BP_C;         // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   FallingMesh;                                       // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ImpulseStrength;                                   // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0xC];                                      // 0x0524(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InitialMeshTransform;                              // 0x0530(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAkAudioEvent*                          AKEvent_HitGround;                                 // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AngularImpulseStrength;                            // 0x0568(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PushTime;                                          // 0x0574(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayedInitialHitAudioEvent;                       // 0x0578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void HitGround();
	void Event_OnTriggered();
	void Event_OnUntriggered();
	void BndEvt__FallingMesh_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void Event_OnResetStage();
	void ExecuteUbergraph_SJ_FallingObject_Base_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SJ_FallingObject_Base_BP_C">();
	}
	static class ASJ_FallingObject_Base_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASJ_FallingObject_Base_BP_C>();
	}
};
static_assert(alignof(ASJ_FallingObject_Base_BP_C) == 0x000010, "Wrong alignment on ASJ_FallingObject_Base_BP_C");
static_assert(sizeof(ASJ_FallingObject_Base_BP_C) == 0x000580, "Wrong size on ASJ_FallingObject_Base_BP_C");
static_assert(offsetof(ASJ_FallingObject_Base_BP_C, UberGraphFrame_SJ_FallingObject_Base_BP_C) == 0x000508, "Member 'ASJ_FallingObject_Base_BP_C::UberGraphFrame_SJ_FallingObject_Base_BP_C' has a wrong offset!");
static_assert(offsetof(ASJ_FallingObject_Base_BP_C, FallingMesh) == 0x000510, "Member 'ASJ_FallingObject_Base_BP_C::FallingMesh' has a wrong offset!");
static_assert(offsetof(ASJ_FallingObject_Base_BP_C, Arrow) == 0x000518, "Member 'ASJ_FallingObject_Base_BP_C::Arrow' has a wrong offset!");
static_assert(offsetof(ASJ_FallingObject_Base_BP_C, ImpulseStrength) == 0x000520, "Member 'ASJ_FallingObject_Base_BP_C::ImpulseStrength' has a wrong offset!");
static_assert(offsetof(ASJ_FallingObject_Base_BP_C, InitialMeshTransform) == 0x000530, "Member 'ASJ_FallingObject_Base_BP_C::InitialMeshTransform' has a wrong offset!");
static_assert(offsetof(ASJ_FallingObject_Base_BP_C, AKEvent_HitGround) == 0x000560, "Member 'ASJ_FallingObject_Base_BP_C::AKEvent_HitGround' has a wrong offset!");
static_assert(offsetof(ASJ_FallingObject_Base_BP_C, AngularImpulseStrength) == 0x000568, "Member 'ASJ_FallingObject_Base_BP_C::AngularImpulseStrength' has a wrong offset!");
static_assert(offsetof(ASJ_FallingObject_Base_BP_C, PushTime) == 0x000574, "Member 'ASJ_FallingObject_Base_BP_C::PushTime' has a wrong offset!");
static_assert(offsetof(ASJ_FallingObject_Base_BP_C, bPlayedInitialHitAudioEvent) == 0x000578, "Member 'ASJ_FallingObject_Base_BP_C::bPlayedInitialHitAudioEvent' has a wrong offset!");

}

