#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SJ_JukeBoxMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RBScareJumpBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SJ_JukeBox-01_BP.SJ_JukeBox-01_BP_C
// 0x0040 (0x0550 - 0x0510)
class ASJ_JukeBoxMinus01_BP_C final : public ARBScareJumpBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SJ_JukeBoxMinus01_BP_C;             // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   JukeBoxMesh;                                       // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight;                                       // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           JukeboxColors_NewTrack_0_032DF396463CE6D041BFEBB7ACD5AA1B; // 0x0520(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            JukeboxColors__Direction_032DF396463CE6D041BFEBB7ACD5AA1B; // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     JukeboxColors;                                     // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseJukeboxSpotlight;                               // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void SetPreviewAssetsVisibility(bool Preview);
	void JukeboxColors__FinishedFunc();
	void JukeboxColors__UpdateFunc();
	void Event_OnTriggered();
	void Event_OnUntriggered();
	void Event_OnResetStage();
	void ExecuteUbergraph_SJ_JukeBoxMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SJ_JukeBox-01_BP_C">();
	}
	static class ASJ_JukeBoxMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASJ_JukeBoxMinus01_BP_C>();
	}
};
static_assert(alignof(ASJ_JukeBoxMinus01_BP_C) == 0x000010, "Wrong alignment on ASJ_JukeBoxMinus01_BP_C");
static_assert(sizeof(ASJ_JukeBoxMinus01_BP_C) == 0x000550, "Wrong size on ASJ_JukeBoxMinus01_BP_C");
static_assert(offsetof(ASJ_JukeBoxMinus01_BP_C, UberGraphFrame_SJ_JukeBoxMinus01_BP_C) == 0x000508, "Member 'ASJ_JukeBoxMinus01_BP_C::UberGraphFrame_SJ_JukeBoxMinus01_BP_C' has a wrong offset!");
static_assert(offsetof(ASJ_JukeBoxMinus01_BP_C, JukeBoxMesh) == 0x000510, "Member 'ASJ_JukeBoxMinus01_BP_C::JukeBoxMesh' has a wrong offset!");
static_assert(offsetof(ASJ_JukeBoxMinus01_BP_C, RBSpotLight) == 0x000518, "Member 'ASJ_JukeBoxMinus01_BP_C::RBSpotLight' has a wrong offset!");
static_assert(offsetof(ASJ_JukeBoxMinus01_BP_C, JukeboxColors_NewTrack_0_032DF396463CE6D041BFEBB7ACD5AA1B) == 0x000520, "Member 'ASJ_JukeBoxMinus01_BP_C::JukeboxColors_NewTrack_0_032DF396463CE6D041BFEBB7ACD5AA1B' has a wrong offset!");
static_assert(offsetof(ASJ_JukeBoxMinus01_BP_C, JukeboxColors__Direction_032DF396463CE6D041BFEBB7ACD5AA1B) == 0x000530, "Member 'ASJ_JukeBoxMinus01_BP_C::JukeboxColors__Direction_032DF396463CE6D041BFEBB7ACD5AA1B' has a wrong offset!");
static_assert(offsetof(ASJ_JukeBoxMinus01_BP_C, JukeboxColors) == 0x000538, "Member 'ASJ_JukeBoxMinus01_BP_C::JukeboxColors' has a wrong offset!");
static_assert(offsetof(ASJ_JukeBoxMinus01_BP_C, UseJukeboxSpotlight) == 0x000540, "Member 'ASJ_JukeBoxMinus01_BP_C::UseJukeboxSpotlight' has a wrong offset!");

}

