#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SJ_JollyChimpMinus01_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function SJ_JollyChimp-01_BP.SJ_JollyChimp-01_BP_C.ExecuteUbergraph_SJ_JollyChimp-01_BP
// 0x0050 (0x0050 - 0x0000)
struct SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJollyChimpMinus01_ABP_C*               K2Node_DynamicCast_AsJolly_Chimp_01_ABP;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJollyChimpMinus01_ABP_C*               K2Node_DynamicCast_AsJolly_Chimp_01_ABP_1;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UJollyChimpMinus01_ABP_C*               K2Node_DynamicCast_AsJolly_Chimp_01_ABP_2;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP) == 0x000008, "Wrong alignment on SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP");
static_assert(sizeof(SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP) == 0x000050, "Wrong size on SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP");
static_assert(offsetof(SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP, EntryPoint) == 0x000000, "Member 'SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP, K2Node_DynamicCast_AsJolly_Chimp_01_ABP) == 0x000010, "Member 'SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP::K2Node_DynamicCast_AsJolly_Chimp_01_ABP' has a wrong offset!");
static_assert(offsetof(SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000020, "Member 'SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP, K2Node_DynamicCast_AsJolly_Chimp_01_ABP_1) == 0x000028, "Member 'SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP::K2Node_DynamicCast_AsJolly_Chimp_01_ABP_1' has a wrong offset!");
static_assert(offsetof(SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000031, "Member 'SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000038, "Member 'SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP, K2Node_DynamicCast_AsJolly_Chimp_01_ABP_2) == 0x000040, "Member 'SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP::K2Node_DynamicCast_AsJolly_Chimp_01_ABP_2' has a wrong offset!");
static_assert(offsetof(SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'SJ_JollyChimpMinus01_BP_C_ExecuteUbergraph_SJ_JollyChimpMinus01_BP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

}

