#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SJ_SmallRobotMinus01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SJ_SmallRobot-01_BP.SJ_SmallRobot-01_BP_C.ExecuteUbergraph_SJ_SmallRobot-01_BP
// 0x00A0 (0x00A0 - 0x0000)
struct SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0014(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP) == 0x000004, "Wrong alignment on SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP");
static_assert(sizeof(SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP) == 0x0000A0, "Wrong size on SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP");
static_assert(offsetof(SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP, EntryPoint) == 0x000000, "Member 'SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000014, "Member 'SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00009C, "Member 'SJ_SmallRobotMinus01_BP_C_ExecuteUbergraph_SJ_SmallRobotMinus01_BP::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

}

