#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SJ_SteamPipeMinus01_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function SJ_SteamPipe-01_BP.SJ_SteamPipe-01_BP_C.ExecuteUbergraph_SJ_SteamPipe-01_BP
// 0x0008 (0x0008 - 0x0000)
struct SJ_SteamPipeMinus01_BP_C_ExecuteUbergraph_SJ_SteamPipeMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SJ_SteamPipeMinus01_BP_C_ExecuteUbergraph_SJ_SteamPipeMinus01_BP) == 0x000004, "Wrong alignment on SJ_SteamPipeMinus01_BP_C_ExecuteUbergraph_SJ_SteamPipeMinus01_BP");
static_assert(sizeof(SJ_SteamPipeMinus01_BP_C_ExecuteUbergraph_SJ_SteamPipeMinus01_BP) == 0x000008, "Wrong size on SJ_SteamPipeMinus01_BP_C_ExecuteUbergraph_SJ_SteamPipeMinus01_BP");
static_assert(offsetof(SJ_SteamPipeMinus01_BP_C_ExecuteUbergraph_SJ_SteamPipeMinus01_BP, EntryPoint) == 0x000000, "Member 'SJ_SteamPipeMinus01_BP_C_ExecuteUbergraph_SJ_SteamPipeMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SJ_SteamPipeMinus01_BP_C_ExecuteUbergraph_SJ_SteamPipeMinus01_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'SJ_SteamPipeMinus01_BP_C_ExecuteUbergraph_SJ_SteamPipeMinus01_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SJ_SteamPipeMinus01_BP_C_ExecuteUbergraph_SJ_SteamPipeMinus01_BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000005, "Member 'SJ_SteamPipeMinus01_BP_C_ExecuteUbergraph_SJ_SteamPipeMinus01_BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");

}

