#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SJ_TelephoneMinus01_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function SJ_Telephone-01_BP.SJ_Telephone-01_BP_C.ExecuteUbergraph_SJ_Telephone-01_BP
// 0x0008 (0x0008 - 0x0000)
struct SJ_TelephoneMinus01_BP_C_ExecuteUbergraph_SJ_TelephoneMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SJ_TelephoneMinus01_BP_C_ExecuteUbergraph_SJ_TelephoneMinus01_BP) == 0x000004, "Wrong alignment on SJ_TelephoneMinus01_BP_C_ExecuteUbergraph_SJ_TelephoneMinus01_BP");
static_assert(sizeof(SJ_TelephoneMinus01_BP_C_ExecuteUbergraph_SJ_TelephoneMinus01_BP) == 0x000008, "Wrong size on SJ_TelephoneMinus01_BP_C_ExecuteUbergraph_SJ_TelephoneMinus01_BP");
static_assert(offsetof(SJ_TelephoneMinus01_BP_C_ExecuteUbergraph_SJ_TelephoneMinus01_BP, EntryPoint) == 0x000000, "Member 'SJ_TelephoneMinus01_BP_C_ExecuteUbergraph_SJ_TelephoneMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SJ_TelephoneMinus01_BP_C_ExecuteUbergraph_SJ_TelephoneMinus01_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'SJ_TelephoneMinus01_BP_C_ExecuteUbergraph_SJ_TelephoneMinus01_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SJ_TelephoneMinus01_BP_C_ExecuteUbergraph_SJ_TelephoneMinus01_BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000005, "Member 'SJ_TelephoneMinus01_BP_C_ExecuteUbergraph_SJ_TelephoneMinus01_BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");

// Function SJ_Telephone-01_BP.SJ_Telephone-01_BP_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct SJ_TelephoneMinus01_BP_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SJ_TelephoneMinus01_BP_C_UserConstructionScript) == 0x000004, "Wrong alignment on SJ_TelephoneMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(SJ_TelephoneMinus01_BP_C_UserConstructionScript) == 0x000004, "Wrong size on SJ_TelephoneMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(SJ_TelephoneMinus01_BP_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000000, "Member 'SJ_TelephoneMinus01_BP_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

