#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SJ_TelephoneMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RBScareJumpBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SJ_Telephone-01_BP.SJ_Telephone-01_BP_C
// 0x0020 (0x0530 - 0x0510)
class ASJ_TelephoneMinus01_BP_C final : public ARBScareJumpBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SJ_TelephoneMinus01_BP_C;           // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PhoneMesh;                                         // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Diode;                                             // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SJ_TelephoneMinus01_BP(int32 EntryPoint);
	void Event_OnResetStage();
	void Event_OnUntriggered();
	void Event_OnTriggered();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SJ_Telephone-01_BP_C">();
	}
	static class ASJ_TelephoneMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASJ_TelephoneMinus01_BP_C>();
	}
};
static_assert(alignof(ASJ_TelephoneMinus01_BP_C) == 0x000010, "Wrong alignment on ASJ_TelephoneMinus01_BP_C");
static_assert(sizeof(ASJ_TelephoneMinus01_BP_C) == 0x000530, "Wrong size on ASJ_TelephoneMinus01_BP_C");
static_assert(offsetof(ASJ_TelephoneMinus01_BP_C, UberGraphFrame_SJ_TelephoneMinus01_BP_C) == 0x000508, "Member 'ASJ_TelephoneMinus01_BP_C::UberGraphFrame_SJ_TelephoneMinus01_BP_C' has a wrong offset!");
static_assert(offsetof(ASJ_TelephoneMinus01_BP_C, Billboard) == 0x000510, "Member 'ASJ_TelephoneMinus01_BP_C::Billboard' has a wrong offset!");
static_assert(offsetof(ASJ_TelephoneMinus01_BP_C, PhoneMesh) == 0x000518, "Member 'ASJ_TelephoneMinus01_BP_C::PhoneMesh' has a wrong offset!");
static_assert(offsetof(ASJ_TelephoneMinus01_BP_C, PointLight) == 0x000520, "Member 'ASJ_TelephoneMinus01_BP_C::PointLight' has a wrong offset!");
static_assert(offsetof(ASJ_TelephoneMinus01_BP_C, Diode) == 0x000528, "Member 'ASJ_TelephoneMinus01_BP_C::Diode' has a wrong offset!");

}

