#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SJ_VendingMachineMinus01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "RBScareJumpBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SJ_VendingMachine-01_BP.SJ_VendingMachine-01_BP_C
// 0x0050 (0x0560 - 0x0510)
class ASJ_VendingMachineMinus01_BP_C final : public ARBScareJumpBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SJ_VendingMachineMinus01_BP_C;      // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   DispenserMachine_DecalMinus02;                     // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBBoxNavMeshBlockingComponent*         RBBoxNavMeshBlocking;                              // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   VendingMachineMesh;                                // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight;                                       // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NewTrack_0_757569154193F78EDC2CF9A2A64EC9D7; // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_757569154193F78EDC2CF9A2A64EC9D7; // 0x053C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53D[0x3];                                      // 0x053D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_B84128DF4BBD53F83BF35EBCC8E2A496; // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_B84128DF4BBD53F83BF35EBCC8E2A496; // 0x054C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54D[0x3];                                      // 0x054D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpulseStength;                                    // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Event_OnTriggered();
	void Event_OnUntriggered();
	void Event_OnResetStage();
	void ExecuteUbergraph_SJ_VendingMachineMinus01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SJ_VendingMachine-01_BP_C">();
	}
	static class ASJ_VendingMachineMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASJ_VendingMachineMinus01_BP_C>();
	}
};
static_assert(alignof(ASJ_VendingMachineMinus01_BP_C) == 0x000010, "Wrong alignment on ASJ_VendingMachineMinus01_BP_C");
static_assert(sizeof(ASJ_VendingMachineMinus01_BP_C) == 0x000560, "Wrong size on ASJ_VendingMachineMinus01_BP_C");
static_assert(offsetof(ASJ_VendingMachineMinus01_BP_C, UberGraphFrame_SJ_VendingMachineMinus01_BP_C) == 0x000508, "Member 'ASJ_VendingMachineMinus01_BP_C::UberGraphFrame_SJ_VendingMachineMinus01_BP_C' has a wrong offset!");
static_assert(offsetof(ASJ_VendingMachineMinus01_BP_C, DispenserMachine_DecalMinus02) == 0x000510, "Member 'ASJ_VendingMachineMinus01_BP_C::DispenserMachine_DecalMinus02' has a wrong offset!");
static_assert(offsetof(ASJ_VendingMachineMinus01_BP_C, Billboard) == 0x000518, "Member 'ASJ_VendingMachineMinus01_BP_C::Billboard' has a wrong offset!");
static_assert(offsetof(ASJ_VendingMachineMinus01_BP_C, RBBoxNavMeshBlocking) == 0x000520, "Member 'ASJ_VendingMachineMinus01_BP_C::RBBoxNavMeshBlocking' has a wrong offset!");
static_assert(offsetof(ASJ_VendingMachineMinus01_BP_C, VendingMachineMesh) == 0x000528, "Member 'ASJ_VendingMachineMinus01_BP_C::VendingMachineMesh' has a wrong offset!");
static_assert(offsetof(ASJ_VendingMachineMinus01_BP_C, RBSpotLight) == 0x000530, "Member 'ASJ_VendingMachineMinus01_BP_C::RBSpotLight' has a wrong offset!");
static_assert(offsetof(ASJ_VendingMachineMinus01_BP_C, Timeline_1_NewTrack_0_757569154193F78EDC2CF9A2A64EC9D7) == 0x000538, "Member 'ASJ_VendingMachineMinus01_BP_C::Timeline_1_NewTrack_0_757569154193F78EDC2CF9A2A64EC9D7' has a wrong offset!");
static_assert(offsetof(ASJ_VendingMachineMinus01_BP_C, Timeline_1__Direction_757569154193F78EDC2CF9A2A64EC9D7) == 0x00053C, "Member 'ASJ_VendingMachineMinus01_BP_C::Timeline_1__Direction_757569154193F78EDC2CF9A2A64EC9D7' has a wrong offset!");
static_assert(offsetof(ASJ_VendingMachineMinus01_BP_C, Timeline_1) == 0x000540, "Member 'ASJ_VendingMachineMinus01_BP_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ASJ_VendingMachineMinus01_BP_C, Timeline_0_NewTrack_0_B84128DF4BBD53F83BF35EBCC8E2A496) == 0x000548, "Member 'ASJ_VendingMachineMinus01_BP_C::Timeline_0_NewTrack_0_B84128DF4BBD53F83BF35EBCC8E2A496' has a wrong offset!");
static_assert(offsetof(ASJ_VendingMachineMinus01_BP_C, Timeline_0__Direction_B84128DF4BBD53F83BF35EBCC8E2A496) == 0x00054C, "Member 'ASJ_VendingMachineMinus01_BP_C::Timeline_0__Direction_B84128DF4BBD53F83BF35EBCC8E2A496' has a wrong offset!");
static_assert(offsetof(ASJ_VendingMachineMinus01_BP_C, Timeline_0) == 0x000550, "Member 'ASJ_VendingMachineMinus01_BP_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ASJ_VendingMachineMinus01_BP_C, ImpulseStength) == 0x000558, "Member 'ASJ_VendingMachineMinus01_BP_C::ImpulseStength' has a wrong offset!");

}

