#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillChargeItemMinus01_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function SkillChargeItem-01_BP.SkillChargeItem-01_BP_C.ExecuteUbergraph_SkillChargeItem-01_BP
// 0x0010 (0x0010 - 0x0000)
struct SkillChargeItemMinus01_BP_C_ExecuteUbergraph_SkillChargeItemMinus01_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_Event_pawn;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillChargeItemMinus01_BP_C_ExecuteUbergraph_SkillChargeItemMinus01_BP) == 0x000008, "Wrong alignment on SkillChargeItemMinus01_BP_C_ExecuteUbergraph_SkillChargeItemMinus01_BP");
static_assert(sizeof(SkillChargeItemMinus01_BP_C_ExecuteUbergraph_SkillChargeItemMinus01_BP) == 0x000010, "Wrong size on SkillChargeItemMinus01_BP_C_ExecuteUbergraph_SkillChargeItemMinus01_BP");
static_assert(offsetof(SkillChargeItemMinus01_BP_C_ExecuteUbergraph_SkillChargeItemMinus01_BP, EntryPoint) == 0x000000, "Member 'SkillChargeItemMinus01_BP_C_ExecuteUbergraph_SkillChargeItemMinus01_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SkillChargeItemMinus01_BP_C_ExecuteUbergraph_SkillChargeItemMinus01_BP, K2Node_Event_pawn) == 0x000008, "Member 'SkillChargeItemMinus01_BP_C_ExecuteUbergraph_SkillChargeItemMinus01_BP::K2Node_Event_pawn' has a wrong offset!");

// Function SkillChargeItem-01_BP.SkillChargeItem-01_BP_C.OnConsumeItemCancelledNotify
// 0x0008 (0x0008 - 0x0000)
struct SkillChargeItemMinus01_BP_C_OnConsumeItemCancelledNotify final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillChargeItemMinus01_BP_C_OnConsumeItemCancelledNotify) == 0x000008, "Wrong alignment on SkillChargeItemMinus01_BP_C_OnConsumeItemCancelledNotify");
static_assert(sizeof(SkillChargeItemMinus01_BP_C_OnConsumeItemCancelledNotify) == 0x000008, "Wrong size on SkillChargeItemMinus01_BP_C_OnConsumeItemCancelledNotify");
static_assert(offsetof(SkillChargeItemMinus01_BP_C_OnConsumeItemCancelledNotify, Pawn) == 0x000000, "Member 'SkillChargeItemMinus01_BP_C_OnConsumeItemCancelledNotify::Pawn' has a wrong offset!");

}

