#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_PartyOption

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.OnValueUpdated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SocialMenu_PartyOption_C_OnValueUpdated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_PartyOption_C_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong alignment on SocialMenu_PartyOption_C_OnValueUpdated__DelegateSignature");
static_assert(sizeof(SocialMenu_PartyOption_C_OnValueUpdated__DelegateSignature) == 0x000004, "Wrong size on SocialMenu_PartyOption_C_OnValueUpdated__DelegateSignature");
static_assert(offsetof(SocialMenu_PartyOption_C_OnValueUpdated__DelegateSignature, Value) == 0x000000, "Member 'SocialMenu_PartyOption_C_OnValueUpdated__DelegateSignature::Value' has a wrong offset!");

// Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.ExecuteUbergraph_SocialMenu_PartyOption
// 0x0024 (0x0024 - 0x0000)
struct SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Left;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption) == 0x000004, "Wrong alignment on SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption");
static_assert(sizeof(SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption) == 0x000024, "Wrong size on SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption");
static_assert(offsetof(SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption, EntryPoint) == 0x000000, "Member 'SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption::EntryPoint' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption, K2Node_CustomEvent_Left) == 0x000004, "Member 'SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption::K2Node_CustomEvent_Left' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption, K2Node_Event_IsDesignTime) == 0x000005, "Member 'SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption, CallFunc_Percent_IntInt_ReturnValue) == 0x000018, "Member 'SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption, CallFunc_Array_Length_ReturnValue_1) == 0x00001C, "Member 'SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000020, "Member 'SocialMenu_PartyOption_C_ExecuteUbergraph_SocialMenu_PartyOption::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");

// Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.Cycle
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_PartyOption_C_Cycle final
{
public:
	bool                                          Left;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_PartyOption_C_Cycle) == 0x000001, "Wrong alignment on SocialMenu_PartyOption_C_Cycle");
static_assert(sizeof(SocialMenu_PartyOption_C_Cycle) == 0x000001, "Wrong size on SocialMenu_PartyOption_C_Cycle");
static_assert(offsetof(SocialMenu_PartyOption_C_Cycle, Left) == 0x000000, "Member 'SocialMenu_PartyOption_C_Cycle::Left' has a wrong offset!");

// Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_PartyOption_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_PartyOption_C_PreConstruct) == 0x000001, "Wrong alignment on SocialMenu_PartyOption_C_PreConstruct");
static_assert(sizeof(SocialMenu_PartyOption_C_PreConstruct) == 0x000001, "Wrong size on SocialMenu_PartyOption_C_PreConstruct");
static_assert(offsetof(SocialMenu_PartyOption_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SocialMenu_PartyOption_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.Setup
// 0x0020 (0x0020 - 0x0000)
struct SocialMenu_PartyOption_C_Setup final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_PartyOption_C_Setup) == 0x000008, "Wrong alignment on SocialMenu_PartyOption_C_Setup");
static_assert(sizeof(SocialMenu_PartyOption_C_Setup) == 0x000020, "Wrong size on SocialMenu_PartyOption_C_Setup");
static_assert(offsetof(SocialMenu_PartyOption_C_Setup, Temp_bool_Variable) == 0x000000, "Member 'SocialMenu_PartyOption_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_Setup, Temp_object_Variable) == 0x000008, "Member 'SocialMenu_PartyOption_C_Setup::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_Setup, Temp_object_Variable_1) == 0x000010, "Member 'SocialMenu_PartyOption_C_Setup::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_Setup, K2Node_Select_Default) == 0x000018, "Member 'SocialMenu_PartyOption_C_Setup::K2Node_Select_Default' has a wrong offset!");

// Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct SocialMenu_PartyOption_C_SetEnabled final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_PartyOption_C_SetEnabled) == 0x000001, "Wrong alignment on SocialMenu_PartyOption_C_SetEnabled");
static_assert(sizeof(SocialMenu_PartyOption_C_SetEnabled) == 0x000001, "Wrong size on SocialMenu_PartyOption_C_SetEnabled");
static_assert(offsetof(SocialMenu_PartyOption_C_SetEnabled, bInEnabled) == 0x000000, "Member 'SocialMenu_PartyOption_C_SetEnabled::bInEnabled' has a wrong offset!");

// Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.SetValue
// 0x0004 (0x0004 - 0x0000)
struct SocialMenu_PartyOption_C_SetValue final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SocialMenu_PartyOption_C_SetValue) == 0x000004, "Wrong alignment on SocialMenu_PartyOption_C_SetValue");
static_assert(sizeof(SocialMenu_PartyOption_C_SetValue) == 0x000004, "Wrong size on SocialMenu_PartyOption_C_SetValue");
static_assert(offsetof(SocialMenu_PartyOption_C_SetValue, Value) == 0x000000, "Member 'SocialMenu_PartyOption_C_SetValue::Value' has a wrong offset!");

// Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.SetHovered
// 0x0030 (0x0030 - 0x0000)
struct SocialMenu_PartyOption_C_SetHovered final
{
public:
	bool                                          bInHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_PartyOption_C_SetHovered) == 0x000008, "Wrong alignment on SocialMenu_PartyOption_C_SetHovered");
static_assert(sizeof(SocialMenu_PartyOption_C_SetHovered) == 0x000030, "Wrong size on SocialMenu_PartyOption_C_SetHovered");
static_assert(offsetof(SocialMenu_PartyOption_C_SetHovered, bInHovered) == 0x000000, "Member 'SocialMenu_PartyOption_C_SetHovered::bInHovered' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_SetHovered, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'SocialMenu_PartyOption_C_SetHovered::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_SetHovered, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'SocialMenu_PartyOption_C_SetHovered::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_SetHovered, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000028, "Member 'SocialMenu_PartyOption_C_SetHovered::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct SocialMenu_PartyOption_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
	bool                                          CallFunc_BP_IsUsingGamepad_ReturnValue;            // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_PartyOption_C_OnFocusReceived) == 0x000008, "Wrong alignment on SocialMenu_PartyOption_C_OnFocusReceived");
static_assert(sizeof(SocialMenu_PartyOption_C_OnFocusReceived) == 0x0001C0, "Wrong size on SocialMenu_PartyOption_C_OnFocusReceived");
static_assert(offsetof(SocialMenu_PartyOption_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'SocialMenu_PartyOption_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'SocialMenu_PartyOption_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'SocialMenu_PartyOption_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_OnFocusReceived, CallFunc_GetMenuManager_ReturnValue) == 0x0000F8, "Member 'SocialMenu_PartyOption_C_OnFocusReceived::CallFunc_GetMenuManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'SocialMenu_PartyOption_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_OnFocusReceived, CallFunc_BP_IsUsingGamepad_ReturnValue) == 0x0001B8, "Member 'SocialMenu_PartyOption_C_OnFocusReceived::CallFunc_BP_IsUsingGamepad_ReturnValue' has a wrong offset!");

// Function SocialMenu_PartyOption.SocialMenu_PartyOption_C.HandleLeftRightNavigation
// 0x0002 (0x0002 - 0x0000)
struct SocialMenu_PartyOption_C_HandleLeftRightNavigation final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SocialMenu_PartyOption_C_HandleLeftRightNavigation) == 0x000001, "Wrong alignment on SocialMenu_PartyOption_C_HandleLeftRightNavigation");
static_assert(sizeof(SocialMenu_PartyOption_C_HandleLeftRightNavigation) == 0x000002, "Wrong size on SocialMenu_PartyOption_C_HandleLeftRightNavigation");
static_assert(offsetof(SocialMenu_PartyOption_C_HandleLeftRightNavigation, Navigation_0) == 0x000000, "Member 'SocialMenu_PartyOption_C_HandleLeftRightNavigation::Navigation_0' has a wrong offset!");
static_assert(offsetof(SocialMenu_PartyOption_C_HandleLeftRightNavigation, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'SocialMenu_PartyOption_C_HandleLeftRightNavigation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

