#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialMenu_ContextualMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SocialMenu_ContextualMenu.SocialMenu_ContextualMenu_C
// 0x0050 (0x02C0 - 0x0270)
class USocialMenu_ContextualMenu_C final : public URBSocialMenuEntryContextualMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WaitingAnimation;                                  // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           Action_container;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxContainer;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USocialMenu_ContextualMenu_Action_C*    SocialMenuEntryContextualMenuActionV2;             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USocialMenu_ContextualMenu_Action_C*    SocialMenuEntryContextualMenuActionV2_1;           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USocialMenu_ContextualMenu_Action_C*    SocialMenuEntryContextualMenuActionV2_2;           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USocialMenu_ContextualMenu_Action_C*    SocialMenuEntryContextualMenuActionV2_3;           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USocialMenu_ContextualMenu_Action_C*    SocialMenuEntryContextualMenuActionV2_4;           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USocialMenu_Slider_C*                   VoiceChatVolumeSlider;                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SocialMenu_ContextualMenu(int32 EntryPoint);
	void BndEvt__SocialMenu_ContextualMenu_VoiceChatVolumeSlider_K2Node_ComponentBoundEvent_0_OnValueUpdated__DelegateSignature(float Value);
	void OnActionTriggered(ERBSocialMenuEntryAction Action);
	void Event_Refresh();
	class FText GetActionText(ERBSocialMenuEntryAction Enumerator);
	class UWidget* DoCustomNavigation_0(EUINavigation Navigation_0);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SocialMenu_ContextualMenu_C">();
	}
	static class USocialMenu_ContextualMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialMenu_ContextualMenu_C>();
	}
};
static_assert(alignof(USocialMenu_ContextualMenu_C) == 0x000008, "Wrong alignment on USocialMenu_ContextualMenu_C");
static_assert(sizeof(USocialMenu_ContextualMenu_C) == 0x0002C0, "Wrong size on USocialMenu_ContextualMenu_C");
static_assert(offsetof(USocialMenu_ContextualMenu_C, UberGraphFrame) == 0x000270, "Member 'USocialMenu_ContextualMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_C, WaitingAnimation) == 0x000278, "Member 'USocialMenu_ContextualMenu_C::WaitingAnimation' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_C, Action_container) == 0x000280, "Member 'USocialMenu_ContextualMenu_C::Action_container' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_C, SizeBoxContainer) == 0x000288, "Member 'USocialMenu_ContextualMenu_C::SizeBoxContainer' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_C, SocialMenuEntryContextualMenuActionV2) == 0x000290, "Member 'USocialMenu_ContextualMenu_C::SocialMenuEntryContextualMenuActionV2' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_C, SocialMenuEntryContextualMenuActionV2_1) == 0x000298, "Member 'USocialMenu_ContextualMenu_C::SocialMenuEntryContextualMenuActionV2_1' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_C, SocialMenuEntryContextualMenuActionV2_2) == 0x0002A0, "Member 'USocialMenu_ContextualMenu_C::SocialMenuEntryContextualMenuActionV2_2' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_C, SocialMenuEntryContextualMenuActionV2_3) == 0x0002A8, "Member 'USocialMenu_ContextualMenu_C::SocialMenuEntryContextualMenuActionV2_3' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_C, SocialMenuEntryContextualMenuActionV2_4) == 0x0002B0, "Member 'USocialMenu_ContextualMenu_C::SocialMenuEntryContextualMenuActionV2_4' has a wrong offset!");
static_assert(offsetof(USocialMenu_ContextualMenu_C, VoiceChatVolumeSlider) == 0x0002B8, "Member 'USocialMenu_ContextualMenu_C::VoiceChatVolumeSlider' has a wrong offset!");

}

