#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundTrap_Base_BP

#include "Basic.hpp"

#include "SoundTrap_ENU_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SoundTrap_Stuc_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function SoundTrap_Base_BP.SoundTrap_Base_BP_C.GetStateName
// 0x0028 (0x0028 - 0x0000)
struct SoundTrap_Base_BP_C_GetStateName final
{
public:
	class FString                                 StateA;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StateB;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SoundTrap_Base_BP_C_GetStateName) == 0x000008, "Wrong alignment on SoundTrap_Base_BP_C_GetStateName");
static_assert(sizeof(SoundTrap_Base_BP_C_GetStateName) == 0x000028, "Wrong size on SoundTrap_Base_BP_C_GetStateName");
static_assert(offsetof(SoundTrap_Base_BP_C_GetStateName, StateA) == 0x000000, "Member 'SoundTrap_Base_BP_C_GetStateName::StateA' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_GetStateName, StateB) == 0x000010, "Member 'SoundTrap_Base_BP_C_GetStateName::StateB' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_GetStateName, ReturnValue) == 0x000020, "Member 'SoundTrap_Base_BP_C_GetStateName::ReturnValue' has a wrong offset!");

// Function SoundTrap_Base_BP.SoundTrap_Base_BP_C.ConstructionClearanceBoxSize
// 0x00A8 (0x00A8 - 0x0000)
struct SoundTrap_Base_BP_C_ConstructionClearanceBoxSize final
{
public:
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0020(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SoundTrap_Base_BP_C_ConstructionClearanceBoxSize) == 0x000004, "Wrong alignment on SoundTrap_Base_BP_C_ConstructionClearanceBoxSize");
static_assert(sizeof(SoundTrap_Base_BP_C_ConstructionClearanceBoxSize) == 0x0000A8, "Wrong size on SoundTrap_Base_BP_C_ConstructionClearanceBoxSize");
static_assert(offsetof(SoundTrap_Base_BP_C_ConstructionClearanceBoxSize, CallFunc_GetScaledCapsuleRadius_ReturnValue) == 0x000000, "Member 'SoundTrap_Base_BP_C_ConstructionClearanceBoxSize::CallFunc_GetScaledCapsuleRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_ConstructionClearanceBoxSize, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000004, "Member 'SoundTrap_Base_BP_C_ConstructionClearanceBoxSize::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_ConstructionClearanceBoxSize, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'SoundTrap_Base_BP_C_ConstructionClearanceBoxSize::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_ConstructionClearanceBoxSize, CallFunc_MakeVector_ReturnValue) == 0x000014, "Member 'SoundTrap_Base_BP_C_ConstructionClearanceBoxSize::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_ConstructionClearanceBoxSize, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000020, "Member 'SoundTrap_Base_BP_C_ConstructionClearanceBoxSize::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function SoundTrap_Base_BP.SoundTrap_Base_BP_C.SnapToCeiling
// 0x0410 (0x0410 - 0x0000)
struct SoundTrap_Base_BP_C_SnapToCeiling final
{
public:
	float                                         SnapDistance;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartLocation;                                     // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0040(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_EditorLineTraceSingle_OutHit;             // 0x005C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EditorLineTraceSingle_ReturnValue;        // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Acos_ReturnValue;                         // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue;                          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZY_ReturnValue;                // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X_1;                          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x01E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0xF];                                      // 0x0271(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0280(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_InverseTransformRotation_ReturnValue;     // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Square_ReturnValue;                       // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x02C0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Square_ReturnValue_1;                     // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue;                         // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0334(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BE[0x2];                                      // 0x03BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x03C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x03CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumBones_ReturnValue;                  // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetBoneName_ReturnValue;                  // 0x03EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBoneLocation_ReturnValue;              // 0x03F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SoundTrap_Base_BP_C_SnapToCeiling) == 0x000010, "Wrong alignment on SoundTrap_Base_BP_C_SnapToCeiling");
static_assert(sizeof(SoundTrap_Base_BP_C_SnapToCeiling) == 0x000410, "Wrong size on SoundTrap_Base_BP_C_SnapToCeiling");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, SnapDistance) == 0x000000, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::SnapDistance' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, StartLocation) == 0x000004, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::StartLocation' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, Temp_object_Variable) == 0x000040, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Add_VectorVector_ReturnValue) == 0x000050, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_EditorLineTraceSingle_OutHit) == 0x00005C, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_EditorLineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_EditorLineTraceSingle_ReturnValue) == 0x0000E4, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_EditorLineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_GetActorRightVector_ReturnValue) == 0x0000E8, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_bBlockingHit) == 0x0000F4, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000F5, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_Time) == 0x0000F8, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_Distance) == 0x0000FC, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_Location) == 0x000100, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_ImpactPoint) == 0x00010C, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_Normal) == 0x000118, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_ImpactNormal) == 0x000124, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_PhysMat) == 0x000130, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_HitActor) == 0x000138, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_HitComponent) == 0x000140, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_HitBoneName) == 0x000148, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_HitItem) == 0x000150, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_ElementIndex) == 0x000154, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_FaceIndex) == 0x000158, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_TraceStart) == 0x00015C, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakHitResult_TraceEnd) == 0x000168, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000174, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Dot_VectorVector_ReturnValue) == 0x000180, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_X) == 0x000184, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_Y) == 0x000188, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_Z) == 0x00018C, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Acos_ReturnValue) == 0x000190, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Acos_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000194, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Sin_ReturnValue) == 0x0001A0, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_MakeRotFromZY_ReturnValue) == 0x0001A4, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_MakeRotFromZY_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_X_1) == 0x0001B0, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_Y_1) == 0x0001B4, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_Z_1) == 0x0001B8, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001BC, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_X_2) == 0x0001C0, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_Y_2) == 0x0001C4, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_Z_2) == 0x0001C8, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001CC, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_MakeVector_ReturnValue) == 0x0001D0, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_MakeVector_ReturnValue_1) == 0x0001DC, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0001E8, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000270, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_GetTransform_ReturnValue) == 0x000280, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_InverseTransformRotation_ReturnValue) == 0x0002B0, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_InverseTransformRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Square_ReturnValue) == 0x0002BC, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_MakeTransform_ReturnValue_1) == 0x0002C0, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0002F0, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Square_ReturnValue_1) == 0x0002F4, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Square_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0002F8, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Sqrt_ReturnValue) == 0x0002FC, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Sqrt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_X_3) == 0x000300, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_Y_3) == 0x000304, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_Z_3) == 0x000308, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_MakeVector_ReturnValue_2) == 0x00030C, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000318, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00031C, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_MakeVector_ReturnValue_3) == 0x000328, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x000334, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x0003BC, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Less_FloatFloat_ReturnValue) == 0x0003BD, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0003C0, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0003CC, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_X_4) == 0x0003D8, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_Y_4) == 0x0003DC, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_BreakVector_Z_4) == 0x0003E0, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_GetNumBones_ReturnValue) == 0x0003E4, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_GetNumBones_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_Subtract_IntInt_ReturnValue) == 0x0003E8, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_GetBoneName_ReturnValue) == 0x0003EC, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_GetBoneName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, CallFunc_GetBoneLocation_ReturnValue) == 0x0003F4, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::CallFunc_GetBoneLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToCeiling, K2Node_SwitchEnum_CmpSuccess) == 0x000400, "Member 'SoundTrap_Base_BP_C_SnapToCeiling::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function SoundTrap_Base_BP.SoundTrap_Base_BP_C.SnapToGround_Internal
// 0x0250 (0x0250 - 0x0000)
struct SoundTrap_Base_BP_C_SnapToGround_Internal final
{
public:
	float                                         GroundOffset;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxRandom;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TestDistance;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitDistance;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0040(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_BreakVector_X;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_EditorLineTraceSingle_OutHit;             // 0x009C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EditorLineTraceSingle_ReturnValue;        // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_127[0x1];                                      // 0x0127(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x01C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SoundTrap_Base_BP_C_SnapToGround_Internal) == 0x000008, "Wrong alignment on SoundTrap_Base_BP_C_SnapToGround_Internal");
static_assert(sizeof(SoundTrap_Base_BP_C_SnapToGround_Internal) == 0x000250, "Wrong size on SoundTrap_Base_BP_C_SnapToGround_Internal");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, GroundOffset) == 0x000000, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::GroundOffset' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, MaxRandom) == 0x000004, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::MaxRandom' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, TestDistance) == 0x000008, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::TestDistance' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, HitDistance) == 0x00000C, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::HitDistance' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_MakeVector_ReturnValue_1) == 0x000028, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_RandomFloat_ReturnValue) == 0x000034, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, Temp_object_Variable) == 0x000040, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakVector_X) == 0x000050, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakVector_Y) == 0x000054, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakVector_Z) == 0x000058, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00005C, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_Add_FloatFloat_ReturnValue) == 0x000060, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000064, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000068, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, K2Node_SwitchEnum_CmpSuccess) == 0x00006C, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000070, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000074, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_FMin_ReturnValue) == 0x000080, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000084, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_MakeVector_ReturnValue_2) == 0x000090, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_EditorLineTraceSingle_OutHit) == 0x00009C, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_EditorLineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_EditorLineTraceSingle_ReturnValue) == 0x000124, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_EditorLineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_bBlockingHit) == 0x000125, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_bInitialOverlap) == 0x000126, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_Time) == 0x000128, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_Distance) == 0x00012C, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_Location) == 0x000130, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_ImpactPoint) == 0x00013C, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_Normal) == 0x000148, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_ImpactNormal) == 0x000154, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_PhysMat) == 0x000160, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_HitActor) == 0x000168, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_HitComponent) == 0x000170, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_HitBoneName) == 0x000178, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_HitItem) == 0x000180, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_ElementIndex) == 0x000184, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_FaceIndex) == 0x000188, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_TraceStart) == 0x00018C, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_BreakHitResult_TraceEnd) == 0x000198, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0001A4, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_MakeVector_ReturnValue_3) == 0x0001A8, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_Add_VectorVector_ReturnValue) == 0x0001B4, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001C0, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0001C4, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SoundTrap_Base_BP_C_SnapToGround_Internal, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00024C, "Member 'SoundTrap_Base_BP_C_SnapToGround_Internal::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function SoundTrap_Base_BP.SoundTrap_Base_BP_C.Editor_RopeOverlap
// 0x02F8 (0x02F8 - 0x0000)
struct SoundTrap_Base_BP_C_Editor_RopeOverlap final
{
public:
	bool                                          bOverlaps;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutOverlaps;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Overlaps;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<float>                                 TopOffsetByIndex;                                  // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0038(0x0010)(ConstParm, ReferenceParm)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x00CC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x00D8(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_Array_Get_Item;                           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleSize_OutRadius;           // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleSize_OutHalfHeight;       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
