#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundTrap_Stuc

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SoundTrap_Stuc.SoundTrap_Stuc
// 0x0050 (0x0050 - 0x0000)
struct FSoundTrap_Stuc final
{
public:
	TArray<class UStaticMesh*>                    StaticMesh_9_C101FABA4058DA7E2E477A8670FB3496;     // 0x0000(0x0010)(Edit, BlueprintVisible)
	struct FTransform                             Transform_5_D688841147DB42BCC71F2B87B1F8E3CE;      // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	int32                                         Bones_8_217A515147D49200F66D828FF3005018;          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSoundTrap_Stuc) == 0x000010, "Wrong alignment on FSoundTrap_Stuc");
static_assert(sizeof(FSoundTrap_Stuc) == 0x000050, "Wrong size on FSoundTrap_Stuc");
static_assert(offsetof(FSoundTrap_Stuc, StaticMesh_9_C101FABA4058DA7E2E477A8670FB3496) == 0x000000, "Member 'FSoundTrap_Stuc::StaticMesh_9_C101FABA4058DA7E2E477A8670FB3496' has a wrong offset!");
static_assert(offsetof(FSoundTrap_Stuc, Transform_5_D688841147DB42BCC71F2B87B1F8E3CE) == 0x000010, "Member 'FSoundTrap_Stuc::Transform_5_D688841147DB42BCC71F2B87B1F8E3CE' has a wrong offset!");
static_assert(offsetof(FSoundTrap_Stuc, Bones_8_217A515147D49200F66D828FF3005018) == 0x000040, "Member 'FSoundTrap_Stuc::Bones_8_217A515147D49200F66D828FF3005018' has a wrong offset!");

}

