#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SPMinusThrowMinusBrickMinusSurface_CustomRotation_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SP-Throw-Brick-Surface_CustomRotation_BP.SP-Throw-Brick-Surface_CustomRotation_BP_C.UserConstructionScript
// 0x0098 (0x0098 - 0x0000)
struct SPMinusThrowMinusBrickMinusSurface_CustomRotation_BP_C_UserConstructionScript final
{
public:
	class FName                                   Temp_name_Variable;                                // 0x0000(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0008(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SPMinusThrowMinusBrickMinusSurface_CustomRotation_BP_C_UserConstructionScript) == 0x000004, "Wrong alignment on SPMinusThrowMinusBrickMinusSurface_CustomRotation_BP_C_UserConstructionScript");
static_assert(sizeof(SPMinusThrowMinusBrickMinusSurface_CustomRotation_BP_C_UserConstructionScript) == 0x000098, "Wrong size on SPMinusThrowMinusBrickMinusSurface_CustomRotation_BP_C_UserConstructionScript");
static_assert(offsetof(SPMinusThrowMinusBrickMinusSurface_CustomRotation_BP_C_UserConstructionScript, Temp_name_Variable) == 0x000000, "Member 'SPMinusThrowMinusBrickMinusSurface_CustomRotation_BP_C_UserConstructionScript::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(SPMinusThrowMinusBrickMinusSurface_CustomRotation_BP_C_UserConstructionScript, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000008, "Member 'SPMinusThrowMinusBrickMinusSurface_CustomRotation_BP_C_UserConstructionScript::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(SPMinusThrowMinusBrickMinusSurface_CustomRotation_BP_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000090, "Member 'SPMinusThrowMinusBrickMinusSurface_CustomRotation_BP_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SPMinusThrowMinusBrickMinusSurface_CustomRotation_BP_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000094, "Member 'SPMinusThrowMinusBrickMinusSurface_CustomRotation_BP_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

