#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StageEnd_Button_BP

#include "Basic.hpp"

#include "Base_Movable_Button_BP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass StageEnd_Button_BP.StageEnd_Button_BP_C
// 0x0038 (0x0340 - 0x0308)
class AStageEnd_Button_BP_C final : public ABase_Movable_Button_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_StageEnd_Button_BP_C;               // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   Second_00;                                         // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Second_0;                                          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Minute_0;                                          // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Minute_00;                                         // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time_Before_Damage_At_End_Of_Stage;                // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetTrainArrivalTime(float Time);
	void Update_Time(int32 Time);
	void Event_OnResetStage();
	void BndEvt__StageEnd_Button_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_2_OnInteractionEvent__DelegateSignature(class ARBPawn* Interactor, class URBInteractibleComponent* Component);
	void BndEvt__StageEnd_Button_BP_ButtonPressComponent_K2Node_ComponentBoundEvent_3_OnEnabledChanged__DelegateSignature(class URBInteractionZoneComponent* Component);
	void ExecuteUbergraph_StageEnd_Button_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StageEnd_Button_BP_C">();
	}
	static class AStageEnd_Button_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStageEnd_Button_BP_C>();
	}
};
static_assert(alignof(AStageEnd_Button_BP_C) == 0x000008, "Wrong alignment on AStageEnd_Button_BP_C");
static_assert(sizeof(AStageEnd_Button_BP_C) == 0x000340, "Wrong size on AStageEnd_Button_BP_C");
static_assert(offsetof(AStageEnd_Button_BP_C, UberGraphFrame_StageEnd_Button_BP_C) == 0x000308, "Member 'AStageEnd_Button_BP_C::UberGraphFrame_StageEnd_Button_BP_C' has a wrong offset!");
static_assert(offsetof(AStageEnd_Button_BP_C, Second_00) == 0x000310, "Member 'AStageEnd_Button_BP_C::Second_00' has a wrong offset!");
static_assert(offsetof(AStageEnd_Button_BP_C, Second_0) == 0x000318, "Member 'AStageEnd_Button_BP_C::Second_0' has a wrong offset!");
static_assert(offsetof(AStageEnd_Button_BP_C, Minute_0) == 0x000320, "Member 'AStageEnd_Button_BP_C::Minute_0' has a wrong offset!");
static_assert(offsetof(AStageEnd_Button_BP_C, Minute_00) == 0x000328, "Member 'AStageEnd_Button_BP_C::Minute_00' has a wrong offset!");
static_assert(offsetof(AStageEnd_Button_BP_C, StaticMesh) == 0x000330, "Member 'AStageEnd_Button_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AStageEnd_Button_BP_C, CurrentTime) == 0x000338, "Member 'AStageEnd_Button_BP_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(AStageEnd_Button_BP_C, Time_Before_Damage_At_End_Of_Stage) == 0x00033C, "Member 'AStageEnd_Button_BP_C::Time_Before_Damage_At_End_Of_Stage' has a wrong offset!");

}

