#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StaminaMinusConsumable_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Stamina-Consumable_BP.Stamina-Consumable_BP_C.OnConsumeItemNotify
// 0x0008 (0x0008 - 0x0000)
struct StaminaMinusConsumable_BP_C_OnConsumeItemNotify final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StaminaMinusConsumable_BP_C_OnConsumeItemNotify) == 0x000008, "Wrong alignment on StaminaMinusConsumable_BP_C_OnConsumeItemNotify");
static_assert(sizeof(StaminaMinusConsumable_BP_C_OnConsumeItemNotify) == 0x000008, "Wrong size on StaminaMinusConsumable_BP_C_OnConsumeItemNotify");
static_assert(offsetof(StaminaMinusConsumable_BP_C_OnConsumeItemNotify, Pawn) == 0x000000, "Member 'StaminaMinusConsumable_BP_C_OnConsumeItemNotify::Pawn' has a wrong offset!");

// Function Stamina-Consumable_BP.Stamina-Consumable_BP_C.OnConsumeItemCancelledNotify
// 0x0008 (0x0008 - 0x0000)
struct StaminaMinusConsumable_BP_C_OnConsumeItemCancelledNotify final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StaminaMinusConsumable_BP_C_OnConsumeItemCancelledNotify) == 0x000008, "Wrong alignment on StaminaMinusConsumable_BP_C_OnConsumeItemCancelledNotify");
static_assert(sizeof(StaminaMinusConsumable_BP_C_OnConsumeItemCancelledNotify) == 0x000008, "Wrong size on StaminaMinusConsumable_BP_C_OnConsumeItemCancelledNotify");
static_assert(offsetof(StaminaMinusConsumable_BP_C_OnConsumeItemCancelledNotify, Pawn) == 0x000000, "Member 'StaminaMinusConsumable_BP_C_OnConsumeItemCancelledNotify::Pawn' has a wrong offset!");

// Function Stamina-Consumable_BP.Stamina-Consumable_BP_C.ExecuteUbergraph_Stamina-Consumable_BP
// 0x0018 (0x0018 - 0x0000)
struct StaminaMinusConsumable_BP_C_ExecuteUbergraph_StaminaMinusConsumable_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                K2Node_Event_pawn;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_Event_pawn_1;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StaminaMinusConsumable_BP_C_ExecuteUbergraph_StaminaMinusConsumable_BP) == 0x000008, "Wrong alignment on StaminaMinusConsumable_BP_C_ExecuteUbergraph_StaminaMinusConsumable_BP");
static_assert(sizeof(StaminaMinusConsumable_BP_C_ExecuteUbergraph_StaminaMinusConsumable_BP) == 0x000018, "Wrong size on StaminaMinusConsumable_BP_C_ExecuteUbergraph_StaminaMinusConsumable_BP");
static_assert(offsetof(StaminaMinusConsumable_BP_C_ExecuteUbergraph_StaminaMinusConsumable_BP, EntryPoint) == 0x000000, "Member 'StaminaMinusConsumable_BP_C_ExecuteUbergraph_StaminaMinusConsumable_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(StaminaMinusConsumable_BP_C_ExecuteUbergraph_StaminaMinusConsumable_BP, K2Node_Event_pawn) == 0x000008, "Member 'StaminaMinusConsumable_BP_C_ExecuteUbergraph_StaminaMinusConsumable_BP::K2Node_Event_pawn' has a wrong offset!");
static_assert(offsetof(StaminaMinusConsumable_BP_C_ExecuteUbergraph_StaminaMinusConsumable_BP, K2Node_Event_pawn_1) == 0x000010, "Member 'StaminaMinusConsumable_BP_C_ExecuteUbergraph_StaminaMinusConsumable_BP::K2Node_Event_pawn_1' has a wrong offset!");

}

