#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StaminaMinusConsumable_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SimpleMesh_Pickup_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Stamina-Consumable_BP.Stamina-Consumable_BP_C
// 0x0020 (0x0AA0 - 0x0A80)
class AStaminaMinusConsumable_BP_C final : public ASimpleMesh_Pickup_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_StaminaMinusConsumable_BP_C;        // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_NewTrack_0_1413424E414C62DBA8EB7EAFFD3D6EC7; // 0x0A88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_1413424E414C62DBA8EB7EAFFD3D6EC7; // 0x0A8C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8D[0x3];                                      // 0x0A8D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void OnConsumeItemNotify(class ARBPawn* Pawn);
	void OnConsumeItemCancelledNotify(class ARBPawn* Pawn);
	void ExecuteUbergraph_StaminaMinusConsumable_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Stamina-Consumable_BP_C">();
	}
	static class AStaminaMinusConsumable_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStaminaMinusConsumable_BP_C>();
	}
};
static_assert(alignof(AStaminaMinusConsumable_BP_C) == 0x000010, "Wrong alignment on AStaminaMinusConsumable_BP_C");
static_assert(sizeof(AStaminaMinusConsumable_BP_C) == 0x000AA0, "Wrong size on AStaminaMinusConsumable_BP_C");
static_assert(offsetof(AStaminaMinusConsumable_BP_C, UberGraphFrame_StaminaMinusConsumable_BP_C) == 0x000A80, "Member 'AStaminaMinusConsumable_BP_C::UberGraphFrame_StaminaMinusConsumable_BP_C' has a wrong offset!");
static_assert(offsetof(AStaminaMinusConsumable_BP_C, Timeline_0_NewTrack_0_1413424E414C62DBA8EB7EAFFD3D6EC7) == 0x000A88, "Member 'AStaminaMinusConsumable_BP_C::Timeline_0_NewTrack_0_1413424E414C62DBA8EB7EAFFD3D6EC7' has a wrong offset!");
static_assert(offsetof(AStaminaMinusConsumable_BP_C, Timeline_0__Direction_1413424E414C62DBA8EB7EAFFD3D6EC7) == 0x000A8C, "Member 'AStaminaMinusConsumable_BP_C::Timeline_0__Direction_1413424E414C62DBA8EB7EAFFD3D6EC7' has a wrong offset!");
static_assert(offsetof(AStaminaMinusConsumable_BP_C, Timeline_0) == 0x000A90, "Member 'AStaminaMinusConsumable_BP_C::Timeline_0' has a wrong offset!");

}

