#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Subtitles

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Subtitles.Subtitles_C
// 0x0028 (0x0290 - 0x0268)
class USubtitles_C final : public URBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SubTitleBlock;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       SubTitleInvalidationBox;                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SubtitleOverlay;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Subtitles(int32 EntryPoint);
	void OnSubtitleConfigChanged();
	void OnCurrentSubtitleUpdated(const class FString& CurrentSubtitle);
	void Construct();
	void SetSubtitleText(const class FString& SubTitleText);
	void UpdateTextSize(EUIFontSize Size);
	void GetMaxCharactersPerLine(int32* MaxCharactersPerLine);
	bool IsCJKLanguage();
	void AddStringToMessage(class FText& Message, const class FString& String);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Subtitles_C">();
	}
	static class USubtitles_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubtitles_C>();
	}
};
static_assert(alignof(USubtitles_C) == 0x000008, "Wrong alignment on USubtitles_C");
static_assert(sizeof(USubtitles_C) == 0x000290, "Wrong size on USubtitles_C");
static_assert(offsetof(USubtitles_C, UberGraphFrame) == 0x000268, "Member 'USubtitles_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USubtitles_C, Background) == 0x000270, "Member 'USubtitles_C::Background' has a wrong offset!");
static_assert(offsetof(USubtitles_C, SubTitleBlock) == 0x000278, "Member 'USubtitles_C::SubTitleBlock' has a wrong offset!");
static_assert(offsetof(USubtitles_C, SubTitleInvalidationBox) == 0x000280, "Member 'USubtitles_C::SubTitleInvalidationBox' has a wrong offset!");
static_assert(offsetof(USubtitles_C, SubtitleOverlay) == 0x000288, "Member 'USubtitles_C::SubtitleOverlay' has a wrong offset!");

}

