#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SuspendedCeiling_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "StaticmeshArray_Stuc_structs.hpp"


namespace SDK::Params
{

// Function SuspendedCeiling_BP.SuspendedCeiling_BP_C.UserConstructionScript
// 0x0068 (0x0068 - 0x0000)
struct SuspendedCeiling_BP_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_PopulateSurface_LastLocation;             // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes;          // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateSurface_LastLocation_1;           // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize_1;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale_1;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes_1;        // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize_1;      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale_1;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SuspendedCeiling_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on SuspendedCeiling_BP_C_UserConstructionScript");
static_assert(sizeof(SuspendedCeiling_BP_C_UserConstructionScript) == 0x000068, "Wrong size on SuspendedCeiling_BP_C_UserConstructionScript");
static_assert(offsetof(SuspendedCeiling_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation) == 0x000000, "Member 'SuspendedCeiling_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation' has a wrong offset!");
static_assert(offsetof(SuspendedCeiling_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize) == 0x00000C, "Member 'SuspendedCeiling_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize' has a wrong offset!");
static_assert(offsetof(SuspendedCeiling_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale) == 0x000010, "Member 'SuspendedCeiling_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale' has a wrong offset!");
static_assert(offsetof(SuspendedCeiling_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes) == 0x000018, "Member 'SuspendedCeiling_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes' has a wrong offset!");
static_assert(offsetof(SuspendedCeiling_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount) == 0x000028, "Member 'SuspendedCeiling_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount' has a wrong offset!");
static_assert(offsetof(SuspendedCeiling_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize) == 0x00002C, "Member 'SuspendedCeiling_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize' has a wrong offset!");
static_assert(offsetof(SuspendedCeiling_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale) == 0x000030, "Member 'SuspendedCeiling_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale' has a wrong offset!");
static_assert(offsetof(SuspendedCeiling_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation_1) == 0x000034, "Member 'SuspendedCeiling_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation_1' has a wrong offset!");
static_assert(offsetof(SuspendedCeiling_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize_1) == 0x000040, "Member 'SuspendedCeiling_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize_1' has a wrong offset!");
static_assert(offsetof(SuspendedCeiling_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale_1) == 0x000044, "Member 'SuspendedCeiling_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale_1' has a wrong offset!");
static_assert(offsetof(SuspendedCeiling_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes_1) == 0x000048, "Member 'SuspendedCeiling_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes_1' has a wrong offset!");
static_assert(offsetof(SuspendedCeiling_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount_1) == 0x000058, "Member 'SuspendedCeiling_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount_1' has a wrong offset!");
static_assert(offsetof(SuspendedCeiling_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize_1) == 0x00005C, "Member 'SuspendedCeiling_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize_1' has a wrong offset!");
static_assert(offsetof(SuspendedCeiling_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale_1) == 0x000060, "Member 'SuspendedCeiling_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale_1' has a wrong offset!");

}

