#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TableLampMinus05

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TableLamp-05.TableLamp-05_C
// 0x0030 (0x07A0 - 0x0770)
class ATableLampMinus05_C final : public ARBLight_BP_C
{
public:
	class UStaticMeshComponent*                   LampMinus01Socket;                                 // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Static;                                  // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Movable;                                 // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TableLampMinus01;                                  // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TableLamp-05_C">();
	}
	static class ATableLampMinus05_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATableLampMinus05_C>();
	}
};
static_assert(alignof(ATableLampMinus05_C) == 0x000010, "Wrong alignment on ATableLampMinus05_C");
static_assert(sizeof(ATableLampMinus05_C) == 0x0007A0, "Wrong size on ATableLampMinus05_C");
static_assert(offsetof(ATableLampMinus05_C, LampMinus01Socket) == 0x000770, "Member 'ATableLampMinus05_C::LampMinus01Socket' has a wrong offset!");
static_assert(offsetof(ATableLampMinus05_C, PointLight) == 0x000778, "Member 'ATableLampMinus05_C::PointLight' has a wrong offset!");
static_assert(offsetof(ATableLampMinus05_C, SpotLight_Static) == 0x000780, "Member 'ATableLampMinus05_C::SpotLight_Static' has a wrong offset!");
static_assert(offsetof(ATableLampMinus05_C, SpotLight_Movable) == 0x000788, "Member 'ATableLampMinus05_C::SpotLight_Movable' has a wrong offset!");
static_assert(offsetof(ATableLampMinus05_C, TableLampMinus01) == 0x000790, "Member 'ATableLampMinus05_C::TableLampMinus01' has a wrong offset!");

}

