#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TableLampMinus07

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TableLamp-07.TableLamp-07_C
// 0x0030 (0x07A0 - 0x0770)
class ATableLampMinus07_C final : public ARBLight_BP_C
{
public:
	class UPointLightComponent*                   PointLight_Dual;                                   // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  SpotLight_Static;                                  // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Movable;                                 // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LampMinus02a;                                      // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TableLampMinus01;                                  // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TableLamp-07_C">();
	}
	static class ATableLampMinus07_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATableLampMinus07_C>();
	}
};
static_assert(alignof(ATableLampMinus07_C) == 0x000010, "Wrong alignment on ATableLampMinus07_C");
static_assert(sizeof(ATableLampMinus07_C) == 0x0007A0, "Wrong size on ATableLampMinus07_C");
static_assert(offsetof(ATableLampMinus07_C, PointLight_Dual) == 0x000770, "Member 'ATableLampMinus07_C::PointLight_Dual' has a wrong offset!");
static_assert(offsetof(ATableLampMinus07_C, SpotLight_Static) == 0x000778, "Member 'ATableLampMinus07_C::SpotLight_Static' has a wrong offset!");
static_assert(offsetof(ATableLampMinus07_C, SpotLight_Movable) == 0x000780, "Member 'ATableLampMinus07_C::SpotLight_Movable' has a wrong offset!");
static_assert(offsetof(ATableLampMinus07_C, LampMinus02a) == 0x000788, "Member 'ATableLampMinus07_C::LampMinus02a' has a wrong offset!");
static_assert(offsetof(ATableLampMinus07_C, TableLampMinus01) == 0x000790, "Member 'ATableLampMinus07_C::TableLampMinus01' has a wrong offset!");

}

