#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TalkWheelSlice_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TalkWheelSlice_V2.TalkWheelSlice_V2_C
// 0x0030 (0x0290 - 0x0260)
class UTalkWheelSlice_V2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HighlightFadeIn;                                   // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Highlight_Background;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SliceIcon;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SliceText;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SliceVBox;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TalkWheelSlice_V2(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Highlight();
	void Downlight();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TalkWheelSlice_V2_C">();
	}
	static class UTalkWheelSlice_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTalkWheelSlice_V2_C>();
	}
};
static_assert(alignof(UTalkWheelSlice_V2_C) == 0x000008, "Wrong alignment on UTalkWheelSlice_V2_C");
static_assert(sizeof(UTalkWheelSlice_V2_C) == 0x000290, "Wrong size on UTalkWheelSlice_V2_C");
static_assert(offsetof(UTalkWheelSlice_V2_C, UberGraphFrame) == 0x000260, "Member 'UTalkWheelSlice_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTalkWheelSlice_V2_C, HighlightFadeIn) == 0x000268, "Member 'UTalkWheelSlice_V2_C::HighlightFadeIn' has a wrong offset!");
static_assert(offsetof(UTalkWheelSlice_V2_C, Highlight_Background) == 0x000270, "Member 'UTalkWheelSlice_V2_C::Highlight_Background' has a wrong offset!");
static_assert(offsetof(UTalkWheelSlice_V2_C, SliceIcon) == 0x000278, "Member 'UTalkWheelSlice_V2_C::SliceIcon' has a wrong offset!");
static_assert(offsetof(UTalkWheelSlice_V2_C, SliceText) == 0x000280, "Member 'UTalkWheelSlice_V2_C::SliceText' has a wrong offset!");
static_assert(offsetof(UTalkWheelSlice_V2_C, SliceVBox) == 0x000288, "Member 'UTalkWheelSlice_V2_C::SliceVBox' has a wrong offset!");

}

