#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskNotificationsWidget

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TaskNotificationsWidget.TaskNotificationsWidget_C
// 0x0038 (0x02B0 - 0x0278)
class UTaskNotificationsWidget_C final : public URBTaskNotificationsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTaskProgressionHudWidget_C*            TaskProgressionHudWidget;                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTaskProgressionHudWidget_C*            TaskProgressionHudWidget_1;                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTaskProgressionHudWidget_C*            TaskProgressionHudWidget_2;                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TasksVBox;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FRBTaskHudProgressDisplayDetails> PendingTasksDetails;                               // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_TaskNotificationsWidget(int32 EntryPoint);
	void OnTaskProgressionHUDWidgetShown(class UTaskProgressionHudWidget_C* TaskProgressionHudWidget_0);
	void OnTaskProgressionHUDWidgetHidden(class UTaskProgressionHudWidget_C* TaskProgressionHudWidget_0);
	void Construct();
	void Event_ShowTaskProgress(const struct FRBTaskHudProgressDisplayDetails& Progress);
	void Event_Reset();
	void TryHideFirstDisplayedTask();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TaskNotificationsWidget_C">();
	}
	static class UTaskNotificationsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTaskNotificationsWidget_C>();
	}
};
static_assert(alignof(UTaskNotificationsWidget_C) == 0x000008, "Wrong alignment on UTaskNotificationsWidget_C");
static_assert(sizeof(UTaskNotificationsWidget_C) == 0x0002B0, "Wrong size on UTaskNotificationsWidget_C");
static_assert(offsetof(UTaskNotificationsWidget_C, UberGraphFrame) == 0x000278, "Member 'UTaskNotificationsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTaskNotificationsWidget_C, TaskProgressionHudWidget) == 0x000280, "Member 'UTaskNotificationsWidget_C::TaskProgressionHudWidget' has a wrong offset!");
static_assert(offsetof(UTaskNotificationsWidget_C, TaskProgressionHudWidget_1) == 0x000288, "Member 'UTaskNotificationsWidget_C::TaskProgressionHudWidget_1' has a wrong offset!");
static_assert(offsetof(UTaskNotificationsWidget_C, TaskProgressionHudWidget_2) == 0x000290, "Member 'UTaskNotificationsWidget_C::TaskProgressionHudWidget_2' has a wrong offset!");
static_assert(offsetof(UTaskNotificationsWidget_C, TasksVBox) == 0x000298, "Member 'UTaskNotificationsWidget_C::TasksVBox' has a wrong offset!");
static_assert(offsetof(UTaskNotificationsWidget_C, PendingTasksDetails) == 0x0002A0, "Member 'UTaskNotificationsWidget_C::PendingTasksDetails' has a wrong offset!");

}

