#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskNotificationsWidget

#include "Basic.hpp"

#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function TaskNotificationsWidget.TaskNotificationsWidget_C.ExecuteUbergraph_TaskNotificationsWidget
// 0x0050 (0x0050 - 0x0000)
struct TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTaskProgressionHudWidget_C* TaskProgressionHudWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UTaskProgressionHudWidget_C* TaskProgressionHudWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTaskProgressionHudWidget_C*            K2Node_CustomEvent_TaskProgressionHUDWidget_1;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTaskProgressionHudWidget_C*            K2Node_CustomEvent_TaskProgressionHUDWidget;       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_1;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget) == 0x000008, "Wrong alignment on TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget");
static_assert(sizeof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget) == 0x000050, "Wrong size on TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget");
static_assert(offsetof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget, EntryPoint) == 0x000000, "Member 'TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget, K2Node_CustomEvent_TaskProgressionHUDWidget_1) == 0x000028, "Member 'TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget::K2Node_CustomEvent_TaskProgressionHUDWidget_1' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget, CallFunc_RemoveChild_ReturnValue) == 0x000030, "Member 'TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget, CallFunc_Array_IsEmpty_ReturnValue) == 0x000031, "Member 'TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget, K2Node_CustomEvent_TaskProgressionHUDWidget) == 0x000038, "Member 'TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget::K2Node_CustomEvent_TaskProgressionHUDWidget' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget, CallFunc_Array_IsEmpty_ReturnValue_1) == 0x000040, "Member 'TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget::CallFunc_Array_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget, CallFunc_Not_PreBool_ReturnValue_1) == 0x000041, "Member 'TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget, CallFunc_GetChildrenCount_ReturnValue) == 0x000044, "Member 'TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000048, "Member 'TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'TaskNotificationsWidget_C_ExecuteUbergraph_TaskNotificationsWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function TaskNotificationsWidget.TaskNotificationsWidget_C.OnTaskProgressionHUDWidgetShown
// 0x0008 (0x0008 - 0x0000)
struct TaskNotificationsWidget_C_OnTaskProgressionHUDWidgetShown final
{
public:
	class UTaskProgressionHudWidget_C*            TaskProgressionHudWidget_0;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskNotificationsWidget_C_OnTaskProgressionHUDWidgetShown) == 0x000008, "Wrong alignment on TaskNotificationsWidget_C_OnTaskProgressionHUDWidgetShown");
static_assert(sizeof(TaskNotificationsWidget_C_OnTaskProgressionHUDWidgetShown) == 0x000008, "Wrong size on TaskNotificationsWidget_C_OnTaskProgressionHUDWidgetShown");
static_assert(offsetof(TaskNotificationsWidget_C_OnTaskProgressionHUDWidgetShown, TaskProgressionHudWidget_0) == 0x000000, "Member 'TaskNotificationsWidget_C_OnTaskProgressionHUDWidgetShown::TaskProgressionHudWidget_0' has a wrong offset!");

// Function TaskNotificationsWidget.TaskNotificationsWidget_C.OnTaskProgressionHUDWidgetHidden
// 0x0008 (0x0008 - 0x0000)
struct TaskNotificationsWidget_C_OnTaskProgressionHUDWidgetHidden final
{
public:
	class UTaskProgressionHudWidget_C*            TaskProgressionHudWidget_0;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskNotificationsWidget_C_OnTaskProgressionHUDWidgetHidden) == 0x000008, "Wrong alignment on TaskNotificationsWidget_C_OnTaskProgressionHUDWidgetHidden");
static_assert(sizeof(TaskNotificationsWidget_C_OnTaskProgressionHUDWidgetHidden) == 0x000008, "Wrong size on TaskNotificationsWidget_C_OnTaskProgressionHUDWidgetHidden");
static_assert(offsetof(TaskNotificationsWidget_C_OnTaskProgressionHUDWidgetHidden, TaskProgressionHudWidget_0) == 0x000000, "Member 'TaskNotificationsWidget_C_OnTaskProgressionHUDWidgetHidden::TaskProgressionHudWidget_0' has a wrong offset!");

// Function TaskNotificationsWidget.TaskNotificationsWidget_C.Event_ShowTaskProgress
// 0x0058 (0x0058 - 0x0000)
struct TaskNotificationsWidget_C_Event_ShowTaskProgress final
{
public:
	struct FRBTaskHudProgressDisplayDetails       Progress;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UTaskProgressionHudWidget_C*            NewTaskProgressionHUDWidget;                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTaskProgressionHudWidget_C*            CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTaskProgressionHudWidget_C* TaskProgressionHudWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UTaskProgressionHudWidget_C* TaskProgressionHudWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TaskNotificationsWidget_C_Event_ShowTaskProgress) == 0x000008, "Wrong alignment on TaskNotificationsWidget_C_Event_ShowTaskProgress");
static_assert(sizeof(TaskNotificationsWidget_C_Event_ShowTaskProgress) == 0x000058, "Wrong size on TaskNotificationsWidget_C_Event_ShowTaskProgress");
static_assert(offsetof(TaskNotificationsWidget_C_Event_ShowTaskProgress, Progress) == 0x000000, "Member 'TaskNotificationsWidget_C_Event_ShowTaskProgress::Progress' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_ShowTaskProgress, NewTaskProgressionHUDWidget) == 0x000010, "Member 'TaskNotificationsWidget_C_Event_ShowTaskProgress::NewTaskProgressionHUDWidget' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_ShowTaskProgress, CallFunc_Create_ReturnValue) == 0x000018, "Member 'TaskNotificationsWidget_C_Event_ShowTaskProgress::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_ShowTaskProgress, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'TaskNotificationsWidget_C_Event_ShowTaskProgress::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_ShowTaskProgress, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'TaskNotificationsWidget_C_Event_ShowTaskProgress::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_ShowTaskProgress, CallFunc_Array_Contains_ReturnValue) == 0x000040, "Member 'TaskNotificationsWidget_C_Event_ShowTaskProgress::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_ShowTaskProgress, CallFunc_Array_IsEmpty_ReturnValue) == 0x000041, "Member 'TaskNotificationsWidget_C_Event_ShowTaskProgress::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_ShowTaskProgress, CallFunc_BooleanOR_ReturnValue) == 0x000042, "Member 'TaskNotificationsWidget_C_Event_ShowTaskProgress::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_ShowTaskProgress, CallFunc_Array_Add_ReturnValue) == 0x000044, "Member 'TaskNotificationsWidget_C_Event_ShowTaskProgress::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_ShowTaskProgress, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000048, "Member 'TaskNotificationsWidget_C_Event_ShowTaskProgress::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_ShowTaskProgress, CallFunc_GetChildrenCount_ReturnValue) == 0x000050, "Member 'TaskNotificationsWidget_C_Event_ShowTaskProgress::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_ShowTaskProgress, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'TaskNotificationsWidget_C_Event_ShowTaskProgress::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_ShowTaskProgress, CallFunc_BooleanAND_ReturnValue) == 0x000055, "Member 'TaskNotificationsWidget_C_Event_ShowTaskProgress::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function TaskNotificationsWidget.TaskNotificationsWidget_C.Event_Reset
// 0x0040 (0x0040 - 0x0000)
struct TaskNotificationsWidget_C_Event_Reset final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTaskProgressionHudWidget_C*            K2Node_DynamicCast_AsTask_Progression_Hud_Widget;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TaskNotificationsWidget_C_Event_Reset) == 0x000008, "Wrong alignment on TaskNotificationsWidget_C_Event_Reset");
static_assert(sizeof(TaskNotificationsWidget_C_Event_Reset) == 0x000040, "Wrong size on TaskNotificationsWidget_C_Event_Reset");
static_assert(offsetof(TaskNotificationsWidget_C_Event_Reset, Temp_int_Array_Index_Variable) == 0x000000, "Member 'TaskNotificationsWidget_C_Event_Reset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_Reset, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'TaskNotificationsWidget_C_Event_Reset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_Reset, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'TaskNotificationsWidget_C_Event_Reset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_Reset, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'TaskNotificationsWidget_C_Event_Reset::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_Reset, CallFunc_Array_Get_Item) == 0x000020, "Member 'TaskNotificationsWidget_C_Event_Reset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_Reset, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'TaskNotificationsWidget_C_Event_Reset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_Reset, K2Node_DynamicCast_AsTask_Progression_Hud_Widget) == 0x000030, "Member 'TaskNotificationsWidget_C_Event_Reset::K2Node_DynamicCast_AsTask_Progression_Hud_Widget' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_Reset, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'TaskNotificationsWidget_C_Event_Reset::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_Event_Reset, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'TaskNotificationsWidget_C_Event_Reset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function TaskNotificationsWidget.TaskNotificationsWidget_C.TryHideFirstDisplayedTask
// 0x0018 (0x0018 - 0x0000)
struct TaskNotificationsWidget_C_TryHideFirstDisplayedTask final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTaskProgressionHudWidget_C*            K2Node_DynamicCast_AsTask_Progression_Hud_Widget;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TaskNotificationsWidget_C_TryHideFirstDisplayedTask) == 0x000008, "Wrong alignment on TaskNotificationsWidget_C_TryHideFirstDisplayedTask");
static_assert(sizeof(TaskNotificationsWidget_C_TryHideFirstDisplayedTask) == 0x000018, "Wrong size on TaskNotificationsWidget_C_TryHideFirstDisplayedTask");
static_assert(offsetof(TaskNotificationsWidget_C_TryHideFirstDisplayedTask, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'TaskNotificationsWidget_C_TryHideFirstDisplayedTask::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_TryHideFirstDisplayedTask, K2Node_DynamicCast_AsTask_Progression_Hud_Widget) == 0x000008, "Member 'TaskNotificationsWidget_C_TryHideFirstDisplayedTask::K2Node_DynamicCast_AsTask_Progression_Hud_Widget' has a wrong offset!");
static_assert(offsetof(TaskNotificationsWidget_C_TryHideFirstDisplayedTask, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'TaskNotificationsWidget_C_TryHideFirstDisplayedTask::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

