#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskProgressionHudWidget

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TaskProgressionHudWidget.TaskProgressionHudWidget_C
// 0x0090 (0x02F8 - 0x0268)
class UTaskProgressionHudWidget_C final : public URBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAnimation;                                     // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowAnimation;                                     // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UScaleBox*                              AnimScaleBox;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Iconbackground;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tag_new;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TaskName;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ARBPlayer*                              CurrentPlayer;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowing;                                          // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             HideAnimationCompleted;                            // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             ShowAnimationCompleted;                            // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FRBTaskHudProgressDisplayDetails       Details;                                           // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           HideDelayHandle;                                   // 0x02F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void HideAnimationCompleted__DelegateSignature(class UTaskProgressionHudWidget_C* TaskProgressionHudWidget);
	void ShowAnimationCompleted__DelegateSignature(class UTaskProgressionHudWidget_C* TaskProgressionHudWidget);
	void ExecuteUbergraph_TaskProgressionHudWidget(int32 EntryPoint);
	void Hide();
	void Show(const struct FRBTaskHudProgressDisplayDetails& Details_0);
	void Finished_834C97B640C6BE2D69407DB01C70378B();
	void Finished_47575FA94A951F3F5015F8A3EFEEEB83();
	void OnLoaded_225EBAA349307E17F6FD5792DBFB9AEE(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TaskProgressionHudWidget_C">();
	}
	static class UTaskProgressionHudWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTaskProgressionHudWidget_C>();
	}
};
static_assert(alignof(UTaskProgressionHudWidget_C) == 0x000008, "Wrong alignment on UTaskProgressionHudWidget_C");
static_assert(sizeof(UTaskProgressionHudWidget_C) == 0x0002F8, "Wrong size on UTaskProgressionHudWidget_C");
static_assert(offsetof(UTaskProgressionHudWidget_C, UberGraphFrame) == 0x000268, "Member 'UTaskProgressionHudWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTaskProgressionHudWidget_C, HideAnimation) == 0x000270, "Member 'UTaskProgressionHudWidget_C::HideAnimation' has a wrong offset!");
static_assert(offsetof(UTaskProgressionHudWidget_C, ShowAnimation) == 0x000278, "Member 'UTaskProgressionHudWidget_C::ShowAnimation' has a wrong offset!");
static_assert(offsetof(UTaskProgressionHudWidget_C, AnimScaleBox) == 0x000280, "Member 'UTaskProgressionHudWidget_C::AnimScaleBox' has a wrong offset!");
static_assert(offsetof(UTaskProgressionHudWidget_C, Icon) == 0x000288, "Member 'UTaskProgressionHudWidget_C::Icon' has a wrong offset!");
static_assert(offsetof(UTaskProgressionHudWidget_C, Iconbackground) == 0x000290, "Member 'UTaskProgressionHudWidget_C::Iconbackground' has a wrong offset!");
static_assert(offsetof(UTaskProgressionHudWidget_C, Tag_new) == 0x000298, "Member 'UTaskProgressionHudWidget_C::Tag_new' has a wrong offset!");
static_assert(offsetof(UTaskProgressionHudWidget_C, TaskName) == 0x0002A0, "Member 'UTaskProgressionHudWidget_C::TaskName' has a wrong offset!");
static_assert(offsetof(UTaskProgressionHudWidget_C, Title) == 0x0002A8, "Member 'UTaskProgressionHudWidget_C::Title' has a wrong offset!");
static_assert(offsetof(UTaskProgressionHudWidget_C, CurrentPlayer) == 0x0002B0, "Member 'UTaskProgressionHudWidget_C::CurrentPlayer' has a wrong offset!");
static_assert(offsetof(UTaskProgressionHudWidget_C, bShowing) == 0x0002B8, "Member 'UTaskProgressionHudWidget_C::bShowing' has a wrong offset!");
static_assert(offsetof(UTaskProgressionHudWidget_C, HideAnimationCompleted) == 0x0002C0, "Member 'UTaskProgressionHudWidget_C::HideAnimationCompleted' has a wrong offset!");
static_assert(offsetof(UTaskProgressionHudWidget_C, ShowAnimationCompleted) == 0x0002D0, "Member 'UTaskProgressionHudWidget_C::ShowAnimationCompleted' has a wrong offset!");
static_assert(offsetof(UTaskProgressionHudWidget_C, Details) == 0x0002E0, "Member 'UTaskProgressionHudWidget_C::Details' has a wrong offset!");
static_assert(offsetof(UTaskProgressionHudWidget_C, HideDelayHandle) == 0x0002F0, "Member 'UTaskProgressionHudWidget_C::HideDelayHandle' has a wrong offset!");

}

