#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskCategoryButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TaskCategoryButton.TaskCategoryButton_C
// 0x00C8 (0x0328 - 0x0260)
class UTaskCategoryButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 AllClaimedTagImage;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CounterIcon;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedBottomLeftBracket_1;                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedBottomRightBracket_1;                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedTopLeftBracket_1;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocussedTopRightBracket_1;                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Iconbackground;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InteractionButton;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyToClaimTagImage;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SelectionBorderPanel;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TimeLeft;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TimeLeftHBox;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bFocused;                                          // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHovered;                                          // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsGamepad;                                        // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ID;                                                // 0x02FC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasSeenTaskGroup;                                 // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHasCompletedTasksPendingConsume;                  // 0x0305(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSelected;                                         // 0x0306(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHasRefreshTimer;                                  // 0x0307(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHasClaimedAllTasks;                               // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DaysUntilRefresh;                                  // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HoursUntilRefresh;                                 // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnFocused;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnClicked__DelegateSignature(class FName ID_0);
	void OnFocused__DelegateSignature(class FName ID_0);
	void ExecuteUbergraph_TaskCategoryButton(int32 EntryPoint);
	void SetIcon(TSoftObjectPtr<class UObject> Asset);
	void Destruct();
	void OnMenuInputSourceChanged();
	void Construct();
	void BndEvt__PerkCategoryButton_InteractionButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__PerkCategoryButton_InteractionButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__PerkCategoryButton_InteractionButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void OnLoaded_DB41A6CB40D5CBDE4EA03AB9C7E72F12(class UObject* Loaded);
	void Setup(class FName ID_0, const class FText& Text, bool bHasSeenTaskGroup_0, bool bHasCompletedTasksPendingConsume_0, TSoftObjectPtr<class UTexture2D> Icon_0, bool bHasRefreshTimer_0, int32 DaysUntilRefresh_0, int32 HoursUntilRefresh_0, bool bHasClaimedAllTasks_0);
	void Update(bool HasSeenTaskGroup, bool bHasCompletedTasksPendingConsume_0, bool HasRefreshTimer, int32 DaysUntilRefresh_0, int32 HoursUntilRefresh_0, bool bHasClaimedAllTasks_0);
	void Refresh();
	void SetHovered(bool IsHovered_0);
	void SetFocused(bool bInFocused);
	void IsConsideredHovered(bool* bConsideredHovered);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void SetSelected(bool IsSelected_0);
	void UpdateMenuFocusAction();
	void IsSelected(bool* bSelected_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TaskCategoryButton_C">();
	}
	static class UTaskCategoryButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTaskCategoryButton_C>();
	}
};
static_assert(alignof(UTaskCategoryButton_C) == 0x000008, "Wrong alignment on UTaskCategoryButton_C");
static_assert(sizeof(UTaskCategoryButton_C) == 0x000328, "Wrong size on UTaskCategoryButton_C");
static_assert(offsetof(UTaskCategoryButton_C, UberGraphFrame) == 0x000260, "Member 'UTaskCategoryButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, AllClaimedTagImage) == 0x000268, "Member 'UTaskCategoryButton_C::AllClaimedTagImage' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, BackgroundImage) == 0x000270, "Member 'UTaskCategoryButton_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, CounterIcon) == 0x000278, "Member 'UTaskCategoryButton_C::CounterIcon' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, FocussedBottomLeftBracket_1) == 0x000280, "Member 'UTaskCategoryButton_C::FocussedBottomLeftBracket_1' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, FocussedBottomRightBracket_1) == 0x000288, "Member 'UTaskCategoryButton_C::FocussedBottomRightBracket_1' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, FocussedTopLeftBracket_1) == 0x000290, "Member 'UTaskCategoryButton_C::FocussedTopLeftBracket_1' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, FocussedTopRightBracket_1) == 0x000298, "Member 'UTaskCategoryButton_C::FocussedTopRightBracket_1' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, Icon) == 0x0002A0, "Member 'UTaskCategoryButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, Iconbackground) == 0x0002A8, "Member 'UTaskCategoryButton_C::Iconbackground' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, InteractionButton) == 0x0002B0, "Member 'UTaskCategoryButton_C::InteractionButton' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, ReadyToClaimTagImage) == 0x0002B8, "Member 'UTaskCategoryButton_C::ReadyToClaimTagImage' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, SelectionBorderPanel) == 0x0002C0, "Member 'UTaskCategoryButton_C::SelectionBorderPanel' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, TimeLeft) == 0x0002C8, "Member 'UTaskCategoryButton_C::TimeLeft' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, TimeLeftHBox) == 0x0002D0, "Member 'UTaskCategoryButton_C::TimeLeftHBox' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, Title) == 0x0002D8, "Member 'UTaskCategoryButton_C::Title' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, bFocused) == 0x0002E0, "Member 'UTaskCategoryButton_C::bFocused' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, bHovered) == 0x0002E1, "Member 'UTaskCategoryButton_C::bHovered' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, OnClicked) == 0x0002E8, "Member 'UTaskCategoryButton_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, bIsGamepad) == 0x0002F8, "Member 'UTaskCategoryButton_C::bIsGamepad' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, ID) == 0x0002FC, "Member 'UTaskCategoryButton_C::ID' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, bHasSeenTaskGroup) == 0x000304, "Member 'UTaskCategoryButton_C::bHasSeenTaskGroup' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, bHasCompletedTasksPendingConsume) == 0x000305, "Member 'UTaskCategoryButton_C::bHasCompletedTasksPendingConsume' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, bSelected) == 0x000306, "Member 'UTaskCategoryButton_C::bSelected' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, bHasRefreshTimer) == 0x000307, "Member 'UTaskCategoryButton_C::bHasRefreshTimer' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, bHasClaimedAllTasks) == 0x000308, "Member 'UTaskCategoryButton_C::bHasClaimedAllTasks' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, DaysUntilRefresh) == 0x00030C, "Member 'UTaskCategoryButton_C::DaysUntilRefresh' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, HoursUntilRefresh) == 0x000310, "Member 'UTaskCategoryButton_C::HoursUntilRefresh' has a wrong offset!");
static_assert(offsetof(UTaskCategoryButton_C, OnFocused) == 0x000318, "Member 'UTaskCategoryButton_C::OnFocused' has a wrong offset!");

}

