#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Television01_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SimpleDestructibleProps_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Television01_BP.Television01_BP_C
// 0x0020 (0x05F0 - 0x05D0)
class ATelevision01_BP_C final : public ASimpleDestructibleProps_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Television01_BP_C;                  // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBPropOptimizerComponent*              RBPropOptimizer;                                   // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Television01_BP_DamageableComponent_K2Node_ComponentBoundEvent_0_OnDamageableDamaged__DelegateSignature(class URBDamageableComponent* DamageableComponent_0, bool IsDestroyed);
	void ExecuteUbergraph_Television01_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Television01_BP_C">();
	}
	static class ATelevision01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATelevision01_BP_C>();
	}
};
static_assert(alignof(ATelevision01_BP_C) == 0x000010, "Wrong alignment on ATelevision01_BP_C");
static_assert(sizeof(ATelevision01_BP_C) == 0x0005F0, "Wrong size on ATelevision01_BP_C");
static_assert(offsetof(ATelevision01_BP_C, UberGraphFrame_Television01_BP_C) == 0x0005D0, "Member 'ATelevision01_BP_C::UberGraphFrame_Television01_BP_C' has a wrong offset!");
static_assert(offsetof(ATelevision01_BP_C, RBPropOptimizer) == 0x0005D8, "Member 'ATelevision01_BP_C::RBPropOptimizer' has a wrong offset!");
static_assert(offsetof(ATelevision01_BP_C, SpotLight) == 0x0005E0, "Member 'ATelevision01_BP_C::SpotLight' has a wrong offset!");

}

