#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TempHealthGainMinusConsumable_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TempHealthGain-Consumable_BP.TempHealthGain-Consumable_BP_C.OnConsumeItemNotify
// 0x0008 (0x0008 - 0x0000)
struct TempHealthGainMinusConsumable_BP_C_OnConsumeItemNotify final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TempHealthGainMinusConsumable_BP_C_OnConsumeItemNotify) == 0x000008, "Wrong alignment on TempHealthGainMinusConsumable_BP_C_OnConsumeItemNotify");
static_assert(sizeof(TempHealthGainMinusConsumable_BP_C_OnConsumeItemNotify) == 0x000008, "Wrong size on TempHealthGainMinusConsumable_BP_C_OnConsumeItemNotify");
static_assert(offsetof(TempHealthGainMinusConsumable_BP_C_OnConsumeItemNotify, Pawn) == 0x000000, "Member 'TempHealthGainMinusConsumable_BP_C_OnConsumeItemNotify::Pawn' has a wrong offset!");

// Function TempHealthGain-Consumable_BP.TempHealthGain-Consumable_BP_C.ExecuteUbergraph_TempHealthGain-Consumable_BP
// 0x0070 (0x0070 - 0x0000)
struct TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                K2Node_Event_pawn;                                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FX_ItemConsume_Heal_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer_BP_C*                         K2Node_DynamicCast_AsRB_Player_BP;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_IsInFirstPerson_ReturnValue;           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP) == 0x000010, "Wrong alignment on TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP");
static_assert(sizeof(TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP) == 0x000070, "Wrong size on TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP");
static_assert(offsetof(TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP, EntryPoint) == 0x000000, "Member 'TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP, K2Node_Event_pawn) == 0x000048, "Member 'TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP::K2Node_Event_pawn' has a wrong offset!");
static_assert(offsetof(TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP, K2Node_DynamicCast_AsRB_Player_BP) == 0x000058, "Member 'TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP::K2Node_DynamicCast_AsRB_Player_BP' has a wrong offset!");
static_assert(offsetof(TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP, CallFunc_BP_IsInFirstPerson_ReturnValue) == 0x000061, "Member 'TempHealthGainMinusConsumable_BP_C_ExecuteUbergraph_TempHealthGainMinusConsumable_BP::CallFunc_BP_IsInFirstPerson_ReturnValue' has a wrong offset!");

}

