#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TentacleTrapAnim_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TentacleTrapAnim_BP.TentacleTrapAnim_BP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct TentacleTrapAnim_BP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(TentacleTrapAnim_BP_C_AnimGraph) == 0x000008, "Wrong alignment on TentacleTrapAnim_BP_C_AnimGraph");
static_assert(sizeof(TentacleTrapAnim_BP_C_AnimGraph) == 0x000010, "Wrong size on TentacleTrapAnim_BP_C_AnimGraph");
static_assert(offsetof(TentacleTrapAnim_BP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'TentacleTrapAnim_BP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function TentacleTrapAnim_BP.TentacleTrapAnim_BP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct TentacleTrapAnim_BP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TentacleTrapAnim_BP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on TentacleTrapAnim_BP_C_BlueprintUpdateAnimation");
static_assert(sizeof(TentacleTrapAnim_BP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on TentacleTrapAnim_BP_C_BlueprintUpdateAnimation");
static_assert(offsetof(TentacleTrapAnim_BP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'TentacleTrapAnim_BP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function TentacleTrapAnim_BP.TentacleTrapAnim_BP_C.ExecuteUbergraph_TentacleTrapAnim_BP
// 0x0008 (0x0008 - 0x0000)
struct TentacleTrapAnim_BP_C_ExecuteUbergraph_TentacleTrapAnim_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TentacleTrapAnim_BP_C_ExecuteUbergraph_TentacleTrapAnim_BP) == 0x000004, "Wrong alignment on TentacleTrapAnim_BP_C_ExecuteUbergraph_TentacleTrapAnim_BP");
static_assert(sizeof(TentacleTrapAnim_BP_C_ExecuteUbergraph_TentacleTrapAnim_BP) == 0x000008, "Wrong size on TentacleTrapAnim_BP_C_ExecuteUbergraph_TentacleTrapAnim_BP");
static_assert(offsetof(TentacleTrapAnim_BP_C_ExecuteUbergraph_TentacleTrapAnim_BP, EntryPoint) == 0x000000, "Member 'TentacleTrapAnim_BP_C_ExecuteUbergraph_TentacleTrapAnim_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TentacleTrapAnim_BP_C_ExecuteUbergraph_TentacleTrapAnim_BP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'TentacleTrapAnim_BP_C_ExecuteUbergraph_TentacleTrapAnim_BP::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

