#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TestGateWagonMinushallucinationMinus01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TestGateWagon-hallucination-01.TestGateWagon-hallucination-01_C
// 0x0638 (0x0880 - 0x0248)
class ATestGateWagonMinushallucinationMinus01_C final : public ARBLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                ENtityBlurTL_NewTrack_0_55BF1A1E4ED79C429F892BA1BB98B2DF; // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ENtityBlurTL__Direction_55BF1A1E4ED79C429F892BA1BB98B2DF; // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ENtityBlurTL;                                      // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   Settings;                                          // 0x0270(0x05B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          DrugSequenceStarted;                               // 0x0820(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_821[0x7];                                      // 0x0821(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ARBSAS>                  RB_Sas;                                            // 0x0828(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class ALevelSequenceActor*                    BeginSeq;                                          // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    EnvSeq;                                            // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    MiddleSeq;                                         // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    EndSeq;                                            // 0x0868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBFXControlActor*                      RBFXControlActor_1_ExecuteUbergraph_TestGateWagonMinushallucinationMinus01_RefProperty; // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     DrugPost_ExecuteUbergraph_TestGateWagonMinushallucinationMinus01_RefProperty; // 0x0878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetLevelSequencers();
	void SetPivotRefRelativeToChair();
	void Get_Player_Chair_Location(class ARBSAS* Target, class URBSASChairPanelComponent** Chair);
	void ENtityBlurTL__FinishedFunc();
	void ENtityBlurTL__UpdateFunc();
	void DrugMiddle();
	void DrugEnd();
	void StartFXController();
	void StopFXController();
	void OnDrugEndStop();
	void OnDrugSequenceStop();
	void DrugStart();
	void EnableDrugPostProcess();
	void DisableDrugPostProcess();
	void ReceiveBeginPlay();
	void OnGameStageInfoChanged(const struct FRBGameStageInfo& GameStageInfo);
	void InitDrugSequence();
	void bpiBlurEntity();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SND_TestHalluStop();
	void ExecuteUbergraph_TestGateWagonMinushallucinationMinus01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TestGateWagon-hallucination-01_C">();
	}
	static class ATestGateWagonMinushallucinationMinus01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATestGateWagonMinushallucinationMinus01_C>();
	}
};
static_assert(alignof(ATestGateWagonMinushallucinationMinus01_C) == 0x000010, "Wrong alignment on ATestGateWagonMinushallucinationMinus01_C");
static_assert(sizeof(ATestGateWagonMinushallucinationMinus01_C) == 0x000880, "Wrong size on ATestGateWagonMinushallucinationMinus01_C");
static_assert(offsetof(ATestGateWagonMinushallucinationMinus01_C, UberGraphFrame) == 0x000248, "Member 'ATestGateWagonMinushallucinationMinus01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATestGateWagonMinushallucinationMinus01_C, ENtityBlurTL_NewTrack_0_55BF1A1E4ED79C429F892BA1BB98B2DF) == 0x000250, "Member 'ATestGateWagonMinushallucinationMinus01_C::ENtityBlurTL_NewTrack_0_55BF1A1E4ED79C429F892BA1BB98B2DF' has a wrong offset!");
static_assert(offsetof(ATestGateWagonMinushallucinationMinus01_C, ENtityBlurTL__Direction_55BF1A1E4ED79C429F892BA1BB98B2DF) == 0x00025C, "Member 'ATestGateWagonMinushallucinationMinus01_C::ENtityBlurTL__Direction_55BF1A1E4ED79C429F892BA1BB98B2DF' has a wrong offset!");
static_assert(offsetof(ATestGateWagonMinushallucinationMinus01_C, ENtityBlurTL) == 0x000260, "Member 'ATestGateWagonMinushallucinationMinus01_C::ENtityBlurTL' has a wrong offset!");
static_assert(offsetof(ATestGateWagonMinushallucinationMinus01_C, Settings) == 0x000270, "Member 'ATestGateWagonMinushallucinationMinus01_C::Settings' has a wrong offset!");
static_assert(offsetof(ATestGateWagonMinushallucinationMinus01_C, DrugSequenceStarted) == 0x000820, "Member 'ATestGateWagonMinushallucinationMinus01_C::DrugSequenceStarted' has a wrong offset!");
static_assert(offsetof(ATestGateWagonMinushallucinationMinus01_C, RB_Sas) == 0x000828, "Member 'ATestGateWagonMinushallucinationMinus01_C::RB_Sas' has a wrong offset!");
static_assert(offsetof(ATestGateWagonMinushallucinationMinus01_C, BeginSeq) == 0x000850, "Member 'ATestGateWagonMinushallucinationMinus01_C::BeginSeq' has a wrong offset!");
static_assert(offsetof(ATestGateWagonMinushallucinationMinus01_C, EnvSeq) == 0x000858, "Member 'ATestGateWagonMinushallucinationMinus01_C::EnvSeq' has a wrong offset!");
static_assert(offsetof(ATestGateWagonMinushallucinationMinus01_C, MiddleSeq) == 0x000860, "Member 'ATestGateWagonMinushallucinationMinus01_C::MiddleSeq' has a wrong offset!");
static_assert(offsetof(ATestGateWagonMinushallucinationMinus01_C, EndSeq) == 0x000868, "Member 'ATestGateWagonMinushallucinationMinus01_C::EndSeq' has a wrong offset!");
static_assert(offsetof(ATestGateWagonMinushallucinationMinus01_C, RBFXControlActor_1_ExecuteUbergraph_TestGateWagonMinushallucinationMinus01_RefProperty) == 0x000870, "Member 'ATestGateWagonMinushallucinationMinus01_C::RBFXControlActor_1_ExecuteUbergraph_TestGateWagonMinushallucinationMinus01_RefProperty' has a wrong offset!");
static_assert(offsetof(ATestGateWagonMinushallucinationMinus01_C, DrugPost_ExecuteUbergraph_TestGateWagonMinushallucinationMinus01_RefProperty) == 0x000878, "Member 'ATestGateWagonMinushallucinationMinus01_C::DrugPost_ExecuteUbergraph_TestGateWagonMinushallucinationMinus01_RefProperty' has a wrong offset!");

}

