#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TestGateWagonMinushallucinationMinus01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function TestGateWagon-hallucination-01.TestGateWagon-hallucination-01_C.GetLevelSequencers
// 0x00A0 (0x00A0 - 0x0000)
struct TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ALevelSequenceActor*>            CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    CallFunc_Array_Random_OutItem;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ALevelSequenceActor*>            CallFunc_GetAllActorsOfClassWithTag_OutActors_1;   // 0x0030(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_1;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    CallFunc_Array_Random_OutItem_1;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ALevelSequenceActor*>            CallFunc_GetAllActorsOfClassWithTag_OutActors_2;   // 0x0058(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_2;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    CallFunc_Array_Random_OutItem_2;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_2;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ALevelSequenceActor*>            CallFunc_GetAllActorsOfClassWithTag_OutActors_3;   // 0x0080(0x0010)(ReferenceParm)
	class ALevelSequenceActor*                    CallFunc_Array_Random_OutItem_3;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_3;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue_3;              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers) == 0x000008, "Wrong alignment on TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers");
static_assert(sizeof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers) == 0x0000A0, "Wrong size on TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_IsValid_ReturnValue_3) == 0x000003, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000008, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_Array_IsEmpty_ReturnValue) == 0x000018, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_Array_Random_OutItem) == 0x000020, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_Array_Random_OutIndex) == 0x000028, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_GetAllActorsOfClassWithTag_OutActors_1) == 0x000030, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_GetAllActorsOfClassWithTag_OutActors_1' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_Array_IsEmpty_ReturnValue_1) == 0x000040, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_Array_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_Array_Random_OutItem_1) == 0x000048, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_Array_Random_OutItem_1' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_Array_Random_OutIndex_1) == 0x000050, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_Array_Random_OutIndex_1' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_GetAllActorsOfClassWithTag_OutActors_2) == 0x000058, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_GetAllActorsOfClassWithTag_OutActors_2' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_Array_IsEmpty_ReturnValue_2) == 0x000068, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_Array_IsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_Array_Random_OutItem_2) == 0x000070, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_Array_Random_OutItem_2' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_Array_Random_OutIndex_2) == 0x000078, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_Array_Random_OutIndex_2' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_GetAllActorsOfClassWithTag_OutActors_3) == 0x000080, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_GetAllActorsOfClassWithTag_OutActors_3' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_Array_Random_OutItem_3) == 0x000090, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_Array_Random_OutItem_3' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_Array_Random_OutIndex_3) == 0x000098, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_Array_Random_OutIndex_3' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers, CallFunc_Array_IsEmpty_ReturnValue_3) == 0x00009C, "Member 'TestGateWagonMinushallucinationMinus01_C_GetLevelSequencers::CallFunc_Array_IsEmpty_ReturnValue_3' has a wrong offset!");

// Function TestGateWagon-hallucination-01.TestGateWagon-hallucination-01_C.SetPivotRefRelativeToChair
// 0x0140 (0x0140 - 0x0000)
struct TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBSAS*                                 CallFunc_GetCurrentSAS_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBSASChairPanelComponent*              CallFunc_Get_Player_Chair_Location_Chair;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0060(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x00A4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair) == 0x000010, "Wrong alignment on TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair");
static_assert(sizeof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair) == 0x000140, "Wrong size on TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, Temp_int_Array_Index_Variable) == 0x000000, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_GetCurrentSAS_ReturnValue) == 0x000008, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_GetCurrentSAS_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_Get_Player_Chair_Location_Chair) == 0x000010, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_Get_Player_Chair_Location_Chair' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000028, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000030, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_GetAllActorsWithTag_OutActors) == 0x000060, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_BreakTransform_Location) == 0x000070, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_BreakTransform_Rotation) == 0x00007C, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_BreakTransform_Scale) == 0x000088, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_Array_Get_Item) == 0x000098, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x0000A4, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x00012C, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, Temp_int_Loop_Counter_Variable) == 0x000130, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_Less_IntInt_ReturnValue) == 0x000134, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair, CallFunc_Add_IntInt_ReturnValue) == 0x000138, "Member 'TestGateWagonMinushallucinationMinus01_C_SetPivotRefRelativeToChair::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function TestGateWagon-hallucination-01.TestGateWagon-hallucination-01_C.Get Player Chair Location
// 0x0048 (0x0048 - 0x0000)
struct TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location final
{
public:
	class ARBSAS*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBSASChairPanelComponent*              Chair;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBSASChairPanelComponent*              CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPawn*                                CallFunc_GetPawnInteracting_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location) == 0x000008, "Wrong alignment on TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location");
static_assert(sizeof(TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location) == 0x000048, "Wrong size on TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location, Target) == 0x000000, "Member 'TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location::Target' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location, Chair) == 0x000008, "Member 'TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location::Chair' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location, Temp_int_Array_Index_Variable) == 0x000010, "Member 'TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location, CallFunc_Array_Get_Item) == 0x000018, "Member 'TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location, CallFunc_GetPawnInteracting_ReturnValue) == 0x000020, "Member 'TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location::CallFunc_GetPawnInteracting_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location, CallFunc_GetLocalPawn_ReturnValue) == 0x000038, "Member 'TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location::CallFunc_GetLocalPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000040, "Member 'TestGateWagonMinushallucinationMinus01_C_Get_Player_Chair_Location::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function TestGateWagon-hallucination-01.TestGateWagon-hallucination-01_C.OnGameStageInfoChanged
// 0x00B8 (0x00B8 - 0x0000)
struct TestGateWagonMinushallucinationMinus01_C_OnGameStageInfoChanged final
{
public:
	struct FRBGameStageInfo                       GameStageInfo;                                     // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TestGateWagonMinushallucinationMinus01_C_OnGameStageInfoChanged) == 0x000008, "Wrong alignment on TestGateWagonMinushallucinationMinus01_C_OnGameStageInfoChanged");
static_assert(sizeof(TestGateWagonMinushallucinationMinus01_C_OnGameStageInfoChanged) == 0x0000B8, "Wrong size on TestGateWagonMinushallucinationMinus01_C_OnGameStageInfoChanged");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_OnGameStageInfoChanged, GameStageInfo) == 0x000000, "Member 'TestGateWagonMinushallucinationMinus01_C_OnGameStageInfoChanged::GameStageInfo' has a wrong offset!");

// Function TestGateWagon-hallucination-01.TestGateWagon-hallucination-01_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct TestGateWagonMinushallucinationMinus01_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TestGateWagonMinushallucinationMinus01_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on TestGateWagonMinushallucinationMinus01_C_ReceiveEndPlay");
static_assert(sizeof(TestGateWagonMinushallucinationMinus01_C_ReceiveEndPlay) == 0x000001, "Wrong size on TestGateWagonMinushallucinationMinus01_C_ReceiveEndPlay");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'TestGateWagonMinushallucinationMinus01_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function TestGateWagon-hallucination-01.TestGateWagon-hallucination-01_C.ExecuteUbergraph_TestGateWagon-hallucination-01
// 0x01C0 (0x01C0 - 0x0000)
struct TestGateWagonMinushallucinationMinus01_C_ExecuteUbergraph_TestGateWagonMinushallucinationMinus01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(struct FRBGameStageInfo& GameStageInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoteEvent_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_1;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_2;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_3;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_4;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_5;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue_6;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBGameStageInfo                       K2Node_CustomEvent_gameStageInfo;                  // 0x00C8(0x00B8)(ConstParm)
	bool                                          CallFunc_IsStageIDValid_ReturnValue;               // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0188(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue_1;             // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue_2;             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TestGateWagonMinushallucinationMinus01_C_ExecuteUbergraph_TestGateWagonMinushallucinationMinus01) == 0x000008, "Wrong alignment on TestGateWagonMinushallucinationMinus01_C_ExecuteUbergraph_TestGateWagonMinushallucinationMinus01");
static_assert(sizeof(TestGateWagonMinushallucinationMinus01_C_ExecuteUbergraph_TestGateWagonMinushallucinationMinus01) == 0x0001C0, "Wrong size on TestGateWagonMinushallucinationMinus01_C_ExecuteUbergraph_TestGateWagonMinushallucinationMinus01");
static_assert(offsetof(TestGateWagonMinushallucinationMinus01_C_ExecuteUbergraph_TestGateWagonMinushallucinationMinus01, EntryPoint) == 0x000000, "Member 'TestGateWagonMinushallucinationMinus01_C_ExecuteUbergraph_TestGateWagonMinushallucinationMinus01::EntryPoint' has a wrong offset!");
