#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TestGateWagonMinus01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "TextAnimArray_Struc_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TestGateWagon-01.TestGateWagon-01_C.UpdateSASDoorText
// 0x0020 (0x0020 - 0x0000)
struct TestGateWagonMinus01_C_UpdateSASDoorText final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class ASasDoorMinus03_BP1_C*                  Door;                                              // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TestGateWagonMinus01_C_UpdateSASDoorText) == 0x000008, "Wrong alignment on TestGateWagonMinus01_C_UpdateSASDoorText");
static_assert(sizeof(TestGateWagonMinus01_C_UpdateSASDoorText) == 0x000020, "Wrong size on TestGateWagonMinus01_C_UpdateSASDoorText");
static_assert(offsetof(TestGateWagonMinus01_C_UpdateSASDoorText, Name_0) == 0x000000, "Member 'TestGateWagonMinus01_C_UpdateSASDoorText::Name_0' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_UpdateSASDoorText, Door) == 0x000018, "Member 'TestGateWagonMinus01_C_UpdateSASDoorText::Door' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.GetLight
// 0x0048 (0x0048 - 0x0000)
struct TestGateWagonMinus01_C_GetLight final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBLight_BP_C*                          CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASpotLight*>                     CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0028(0x0010)(ReferenceParm)
	TArray<class ARBLight_BP_C*>                  CallFunc_GetAllActorsOfClassWithTag_OutActors_1;   // 0x0038(0x0010)(ReferenceParm)
};
static_assert(alignof(TestGateWagonMinus01_C_GetLight) == 0x000008, "Wrong alignment on TestGateWagonMinus01_C_GetLight");
static_assert(sizeof(TestGateWagonMinus01_C_GetLight) == 0x000048, "Wrong size on TestGateWagonMinus01_C_GetLight");
static_assert(offsetof(TestGateWagonMinus01_C_GetLight, Temp_int_Array_Index_Variable) == 0x000000, "Member 'TestGateWagonMinus01_C_GetLight::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLight, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'TestGateWagonMinus01_C_GetLight::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLight, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'TestGateWagonMinus01_C_GetLight::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLight, CallFunc_Array_Get_Item) == 0x000010, "Member 'TestGateWagonMinus01_C_GetLight::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLight, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'TestGateWagonMinus01_C_GetLight::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLight, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'TestGateWagonMinus01_C_GetLight::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLight, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'TestGateWagonMinus01_C_GetLight::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLight, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000028, "Member 'TestGateWagonMinus01_C_GetLight::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLight, CallFunc_GetAllActorsOfClassWithTag_OutActors_1) == 0x000038, "Member 'TestGateWagonMinus01_C_GetLight::CallFunc_GetAllActorsOfClassWithTag_OutActors_1' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.SetDestinationSignsText
// 0x0038 (0x0038 - 0x0000)
struct TestGateWagonMinus01_C_SetDestinationSignsText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATrainStationSignMinus01_BP_C*          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TestGateWagonMinus01_C_SetDestinationSignsText) == 0x000008, "Wrong alignment on TestGateWagonMinus01_C_SetDestinationSignsText");
static_assert(sizeof(TestGateWagonMinus01_C_SetDestinationSignsText) == 0x000038, "Wrong size on TestGateWagonMinus01_C_SetDestinationSignsText");
static_assert(offsetof(TestGateWagonMinus01_C_SetDestinationSignsText, Text) == 0x000000, "Member 'TestGateWagonMinus01_C_SetDestinationSignsText::Text' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetDestinationSignsText, Temp_int_Array_Index_Variable) == 0x000018, "Member 'TestGateWagonMinus01_C_SetDestinationSignsText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetDestinationSignsText, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'TestGateWagonMinus01_C_SetDestinationSignsText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetDestinationSignsText, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'TestGateWagonMinus01_C_SetDestinationSignsText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetDestinationSignsText, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'TestGateWagonMinus01_C_SetDestinationSignsText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetDestinationSignsText, CallFunc_Array_Get_Item) == 0x000028, "Member 'TestGateWagonMinus01_C_SetDestinationSignsText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetDestinationSignsText, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'TestGateWagonMinus01_C_SetDestinationSignsText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.ForceAllTvUp
// 0x0028 (0x0028 - 0x0000)
struct TestGateWagonMinus01_C_ForceAllTvUp final
{
public:
	bool                                          ForceUP;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBSASChairPanelComponent*              CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TestGateWagonMinus01_C_ForceAllTvUp) == 0x000008, "Wrong alignment on TestGateWagonMinus01_C_ForceAllTvUp");
static_assert(sizeof(TestGateWagonMinus01_C_ForceAllTvUp) == 0x000028, "Wrong size on TestGateWagonMinus01_C_ForceAllTvUp");
static_assert(offsetof(TestGateWagonMinus01_C_ForceAllTvUp, ForceUP) == 0x000000, "Member 'TestGateWagonMinus01_C_ForceAllTvUp::ForceUP' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_ForceAllTvUp, Temp_int_Array_Index_Variable) == 0x000004, "Member 'TestGateWagonMinus01_C_ForceAllTvUp::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_ForceAllTvUp, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'TestGateWagonMinus01_C_ForceAllTvUp::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_ForceAllTvUp, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'TestGateWagonMinus01_C_ForceAllTvUp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_ForceAllTvUp, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'TestGateWagonMinus01_C_ForceAllTvUp::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_ForceAllTvUp, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'TestGateWagonMinus01_C_ForceAllTvUp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_ForceAllTvUp, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'TestGateWagonMinus01_C_ForceAllTvUp::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_ForceAllTvUp, CallFunc_Array_Get_Item) == 0x000018, "Member 'TestGateWagonMinus01_C_ForceAllTvUp::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_ForceAllTvUp, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'TestGateWagonMinus01_C_ForceAllTvUp::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.CanPlayIntroAnim
// 0x0018 (0x0018 - 0x0000)
struct TestGateWagonMinus01_C_CanPlayIntroAnim final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TestGateWagonMinus01_C_CanPlayIntroAnim) == 0x000008, "Wrong alignment on TestGateWagonMinus01_C_CanPlayIntroAnim");
static_assert(sizeof(TestGateWagonMinus01_C_CanPlayIntroAnim) == 0x000018, "Wrong size on TestGateWagonMinus01_C_CanPlayIntroAnim");
static_assert(offsetof(TestGateWagonMinus01_C_CanPlayIntroAnim, Value) == 0x000000, "Member 'TestGateWagonMinus01_C_CanPlayIntroAnim::Value' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_CanPlayIntroAnim, CallFunc_GetRBGameState_ReturnValue) == 0x000008, "Member 'TestGateWagonMinus01_C_CanPlayIntroAnim::CallFunc_GetRBGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_CanPlayIntroAnim, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'TestGateWagonMinus01_C_CanPlayIntroAnim::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_CanPlayIntroAnim, CallFunc_Not_PreBool_ReturnValue_1) == 0x000011, "Member 'TestGateWagonMinus01_C_CanPlayIntroAnim::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_CanPlayIntroAnim, CallFunc_IsDedicatedServer_ReturnValue) == 0x000012, "Member 'TestGateWagonMinus01_C_CanPlayIntroAnim::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_CanPlayIntroAnim, CallFunc_Not_PreBool_ReturnValue_2) == 0x000013, "Member 'TestGateWagonMinus01_C_CanPlayIntroAnim::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_CanPlayIntroAnim, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'TestGateWagonMinus01_C_CanPlayIntroAnim::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_CanPlayIntroAnim, CallFunc_BooleanAND_ReturnValue_1) == 0x000015, "Member 'TestGateWagonMinus01_C_CanPlayIntroAnim::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.SetAllTVsON
// 0x00C0 (0x00C0 - 0x0000)
struct TestGateWagonMinus01_C_SetAllTVsON final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0008(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSASChairPanelComponent*              CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TestGateWagonMinus01_C_SetAllTVsON) == 0x000008, "Wrong alignment on TestGateWagonMinus01_C_SetAllTVsON");
static_assert(sizeof(TestGateWagonMinus01_C_SetAllTVsON) == 0x0000C0, "Wrong size on TestGateWagonMinus01_C_SetAllTVsON");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, IsOn) == 0x000000, "Member 'TestGateWagonMinus01_C_SetAllTVsON::IsOn' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'TestGateWagonMinus01_C_SetAllTVsON::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, CallFunc_Conv_BoolToText_ReturnValue) == 0x000008, "Member 'TestGateWagonMinus01_C_SetAllTVsON::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'TestGateWagonMinus01_C_SetAllTVsON::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'TestGateWagonMinus01_C_SetAllTVsON::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, K2Node_MakeArray_Array) == 0x000068, "Member 'TestGateWagonMinus01_C_SetAllTVsON::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, CallFunc_Format_ReturnValue) == 0x000078, "Member 'TestGateWagonMinus01_C_SetAllTVsON::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, CallFunc_Conv_TextToString_ReturnValue) == 0x000090, "Member 'TestGateWagonMinus01_C_SetAllTVsON::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, Temp_int_Array_Index_Variable) == 0x0000A0, "Member 'TestGateWagonMinus01_C_SetAllTVsON::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000A4, "Member 'TestGateWagonMinus01_C_SetAllTVsON::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, CallFunc_IsValid_ReturnValue) == 0x0000A5, "Member 'TestGateWagonMinus01_C_SetAllTVsON::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'TestGateWagonMinus01_C_SetAllTVsON::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'TestGateWagonMinus01_C_SetAllTVsON::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'TestGateWagonMinus01_C_SetAllTVsON::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_SetAllTVsON, CallFunc_IsValid_ReturnValue_1) == 0x0000B9, "Member 'TestGateWagonMinus01_C_SetAllTVsON::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.PlayAnimationOnAllTVs
// 0x0020 (0x0020 - 0x0000)
struct TestGateWagonMinus01_C_PlayAnimationOnAllTVs final
{
public:
	struct FNarrativeScreenAnimationData          AnimData;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TestGateWagonMinus01_C_PlayAnimationOnAllTVs) == 0x000008, "Wrong alignment on TestGateWagonMinus01_C_PlayAnimationOnAllTVs");
static_assert(sizeof(TestGateWagonMinus01_C_PlayAnimationOnAllTVs) == 0x000020, "Wrong size on TestGateWagonMinus01_C_PlayAnimationOnAllTVs");
static_assert(offsetof(TestGateWagonMinus01_C_PlayAnimationOnAllTVs, AnimData) == 0x000000, "Member 'TestGateWagonMinus01_C_PlayAnimationOnAllTVs::AnimData' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_PlayAnimationOnAllTVs, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'TestGateWagonMinus01_C_PlayAnimationOnAllTVs::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_PlayAnimationOnAllTVs, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'TestGateWagonMinus01_C_PlayAnimationOnAllTVs::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.GetLocalPlayerChairPanel
// 0x0048 (0x0048 - 0x0000)
struct TestGateWagonMinus01_C_GetLocalPlayerChairPanel final
{
public:
	class URBSASChairPanelComponent*              Chair_0;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSASChairPanelComponent*              CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                CallFunc_GetPawnInteracting_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPlayer*                              CallFunc_GetLocalPawn_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TestGateWagonMinus01_C_GetLocalPlayerChairPanel) == 0x000008, "Wrong alignment on TestGateWagonMinus01_C_GetLocalPlayerChairPanel");
static_assert(sizeof(TestGateWagonMinus01_C_GetLocalPlayerChairPanel) == 0x000048, "Wrong size on TestGateWagonMinus01_C_GetLocalPlayerChairPanel");
static_assert(offsetof(TestGateWagonMinus01_C_GetLocalPlayerChairPanel, Chair_0) == 0x000000, "Member 'TestGateWagonMinus01_C_GetLocalPlayerChairPanel::Chair_0' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLocalPlayerChairPanel, Temp_int_Array_Index_Variable) == 0x000008, "Member 'TestGateWagonMinus01_C_GetLocalPlayerChairPanel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLocalPlayerChairPanel, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'TestGateWagonMinus01_C_GetLocalPlayerChairPanel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLocalPlayerChairPanel, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'TestGateWagonMinus01_C_GetLocalPlayerChairPanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLocalPlayerChairPanel, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'TestGateWagonMinus01_C_GetLocalPlayerChairPanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLocalPlayerChairPanel, CallFunc_Array_Get_Item) == 0x000018, "Member 'TestGateWagonMinus01_C_GetLocalPlayerChairPanel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLocalPlayerChairPanel, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'TestGateWagonMinus01_C_GetLocalPlayerChairPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLocalPlayerChairPanel, CallFunc_GetPawnInteracting_ReturnValue) == 0x000028, "Member 'TestGateWagonMinus01_C_GetLocalPlayerChairPanel::CallFunc_GetPawnInteracting_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLocalPlayerChairPanel, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'TestGateWagonMinus01_C_GetLocalPlayerChairPanel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLocalPlayerChairPanel, CallFunc_GetLocalPawn_ReturnValue) == 0x000038, "Member 'TestGateWagonMinus01_C_GetLocalPlayerChairPanel::CallFunc_GetLocalPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_GetLocalPlayerChairPanel, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000040, "Member 'TestGateWagonMinus01_C_GetLocalPlayerChairPanel::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.ForcePlayersOutOfChairs
// 0x0020 (0x0020 - 0x0000)
struct TestGateWagonMinus01_C_ForcePlayersOutOfChairs final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URBSASChairPanelComponent*              CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TestGateWagonMinus01_C_ForcePlayersOutOfChairs) == 0x000008, "Wrong alignment on TestGateWagonMinus01_C_ForcePlayersOutOfChairs");
static_assert(sizeof(TestGateWagonMinus01_C_ForcePlayersOutOfChairs) == 0x000020, "Wrong size on TestGateWagonMinus01_C_ForcePlayersOutOfChairs");
static_assert(offsetof(TestGateWagonMinus01_C_ForcePlayersOutOfChairs, Temp_int_Array_Index_Variable) == 0x000000, "Member 'TestGateWagonMinus01_C_ForcePlayersOutOfChairs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_ForcePlayersOutOfChairs, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'TestGateWagonMinus01_C_ForcePlayersOutOfChairs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_ForcePlayersOutOfChairs, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'TestGateWagonMinus01_C_ForcePlayersOutOfChairs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_ForcePlayersOutOfChairs, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'TestGateWagonMinus01_C_ForcePlayersOutOfChairs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_ForcePlayersOutOfChairs, CallFunc_Array_Get_Item) == 0x000010, "Member 'TestGateWagonMinus01_C_ForcePlayersOutOfChairs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_ForcePlayersOutOfChairs, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'TestGateWagonMinus01_C_ForcePlayersOutOfChairs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_ForcePlayersOutOfChairs, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'TestGateWagonMinus01_C_ForcePlayersOutOfChairs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.StartTrain
// 0x0001 (0x0001 - 0x0000)
struct TestGateWagonMinus01_C_StartTrain final
{
public:
	bool                                          ToLobby;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TestGateWagonMinus01_C_StartTrain) == 0x000001, "Wrong alignment on TestGateWagonMinus01_C_StartTrain");
static_assert(sizeof(TestGateWagonMinus01_C_StartTrain) == 0x000001, "Wrong size on TestGateWagonMinus01_C_StartTrain");
static_assert(offsetof(TestGateWagonMinus01_C_StartTrain, ToLobby) == 0x000000, "Member 'TestGateWagonMinus01_C_StartTrain::ToLobby' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.OnGamePhaseUpdated
// 0x0001 (0x0001 - 0x0000)
struct TestGateWagonMinus01_C_OnGamePhaseUpdated final
{
public:
	EGamePhase                                    GamePhase;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TestGateWagonMinus01_C_OnGamePhaseUpdated) == 0x000001, "Wrong alignment on TestGateWagonMinus01_C_OnGamePhaseUpdated");
static_assert(sizeof(TestGateWagonMinus01_C_OnGamePhaseUpdated) == 0x000001, "Wrong size on TestGateWagonMinus01_C_OnGamePhaseUpdated");
static_assert(offsetof(TestGateWagonMinus01_C_OnGamePhaseUpdated, GamePhase) == 0x000000, "Member 'TestGateWagonMinus01_C_OnGamePhaseUpdated::GamePhase' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.OnGameStageInfoChanged
// 0x00B8 (0x00B8 - 0x0000)
struct TestGateWagonMinus01_C_OnGameStageInfoChanged final
{
public:
	struct FRBGameStageInfo                       GameStageInfo;                                     // 0x0000(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TestGateWagonMinus01_C_OnGameStageInfoChanged) == 0x000008, "Wrong alignment on TestGateWagonMinus01_C_OnGameStageInfoChanged");
static_assert(sizeof(TestGateWagonMinus01_C_OnGameStageInfoChanged) == 0x0000B8, "Wrong size on TestGateWagonMinus01_C_OnGameStageInfoChanged");
static_assert(offsetof(TestGateWagonMinus01_C_OnGameStageInfoChanged, GameStageInfo) == 0x000000, "Member 'TestGateWagonMinus01_C_OnGameStageInfoChanged::GameStageInfo' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct TestGateWagonMinus01_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TestGateWagonMinus01_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on TestGateWagonMinus01_C_ReceiveEndPlay");
static_assert(sizeof(TestGateWagonMinus01_C_ReceiveEndPlay) == 0x000001, "Wrong size on TestGateWagonMinus01_C_ReceiveEndPlay");
static_assert(offsetof(TestGateWagonMinus01_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'TestGateWagonMinus01_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.OnCurrentSasChanged
// 0x0010 (0x0010 - 0x0000)
struct TestGateWagonMinus01_C_OnCurrentSasChanged final
{
public:
	const class ARBSAS*                           OldSAS;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class ARBSAS*                           CurrentSAS_0;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TestGateWagonMinus01_C_OnCurrentSasChanged) == 0x000008, "Wrong alignment on TestGateWagonMinus01_C_OnCurrentSasChanged");
static_assert(sizeof(TestGateWagonMinus01_C_OnCurrentSasChanged) == 0x000010, "Wrong size on TestGateWagonMinus01_C_OnCurrentSasChanged");
static_assert(offsetof(TestGateWagonMinus01_C_OnCurrentSasChanged, OldSAS) == 0x000000, "Member 'TestGateWagonMinus01_C_OnCurrentSasChanged::OldSAS' has a wrong offset!");
static_assert(offsetof(TestGateWagonMinus01_C_OnCurrentSasChanged, CurrentSAS_0) == 0x000008, "Member 'TestGateWagonMinus01_C_OnCurrentSasChanged::CurrentSAS_0' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.OnSASStateChangedCallback
// 0x0001 (0x0001 - 0x0000)
struct TestGateWagonMinus01_C_OnSASStateChangedCallback final
{
public:
	ESASState                                     State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TestGateWagonMinus01_C_OnSASStateChangedCallback) == 0x000001, "Wrong alignment on TestGateWagonMinus01_C_OnSASStateChangedCallback");
static_assert(sizeof(TestGateWagonMinus01_C_OnSASStateChangedCallback) == 0x000001, "Wrong size on TestGateWagonMinus01_C_OnSASStateChangedCallback");
static_assert(offsetof(TestGateWagonMinus01_C_OnSASStateChangedCallback, State) == 0x000000, "Member 'TestGateWagonMinus01_C_OnSASStateChangedCallback::State' has a wrong offset!");

// Function TestGateWagon-01.TestGateWagon-01_C.ExecuteUbergraph_TestGateWagon-01
// 0x0DC0 (0x0DC0 - 0x0000)
struct TestGateWagonMinus01_C_ExecuteUbergraph_TestGateWagonMinus01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNarrativeSoundEventsInfo              K2Node_MakeStruct_NarrativeSoundEventsInfo;        // 0x0008(0x0020)()
	TDelegate<void(struct FRBGameStageInfo& GameStageInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_1;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0060(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_2;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ARBSAS* OldSAS, class ARBSAS* CurrentSAS)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ESASState State)>              K2Node_CreateDelegate_OutputDelegate_3;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x00B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x00E0(0x05B0)()
	class UPostProcessComponent*                  CallFunc_AddComponent_ReturnValue;                 // 0x0690(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0698(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x06AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EGamePhase GamePhase)>         K2Node_CreateDelegate_OutputDelegate_5;            // 0x06B4(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x06E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x06E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x06E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x06FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD[0x3];                                      // 0x06FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0704(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0705(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x0706(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_ToLobby;                        // 0x0707(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_711[0x3];                                      // 0x0711(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0718(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_8;                   // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_8;                  // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x073C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_9;                   // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_9;                  // 0x0744(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASAS_TanglingCableMinus01_BP_C*         CallFunc_Array_Get_Item;                           // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0754(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_755[0x3];                                      // 0x0755(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75C[0x4];                                      // 0x075C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASAS_TanglingCableMinus01_BP_C*         CallFunc_Array_Get_Item_1;                         // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x076C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_771[0x3];                                      // 0x0771(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0774(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0780(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0788(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x0818(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0824(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x08AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x08B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePhase                                    K2Node_CustomEvent_gamePhase;                      // 0x08B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x08B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B6[0x2];                                      // 0x08B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRBGameStageInfo                       K2Node_CustomEvent_gameStageInfo;                  // 0x08B8(0x00B8)(ConstParm)
	float                                         CallFunc_GetGameTime_ReturnValue;                  // 0x0970(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTime_ReturnValue_1;                // 0x0974(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_979[0x3];                                      // 0x0979(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetElapsedTime_ReturnValue;               // 0x097C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0980(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0984(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_985[0x3];                                      // 0x0985(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue_1;             // 0x0988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0990(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_991[0x7];                                      // 0x0991(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue_2;             // 0x0998(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue_3;             // 0x09A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A9[0x3];                                      // 0x09A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetServerGamePhaseChangedTimeStamp_ReturnValue; // 0x09AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x09B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B1[0x3];                                      // 0x09B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetElapsedServerTime_ReturnValue;         // 0x09B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x09B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x09B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPlayIntroAnim_value;                   // 0x09BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x09BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPlayIntroAnim_value_1;                 // 0x09BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPlayIntroAnim_value_2;                 // 0x09BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x09BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9BF[0x1];                                      // 0x09BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue_4;             // 0x09C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x09C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x09C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_5;          // 0x09CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
