#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextChatWidget_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TextChatWidget_BP.TextChatWidget_BP_C
// 0x0068 (0x0318 - 0x02B0)
class UTextChatWidget_BP_C final : public URBTextChatWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_TextChatWidget;                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MessageContainerSizeBox;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MessagesVBox;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TextBackground;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FRBTextChatMessage                     TestMessage;                                       // 0x02D8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_TextChatWidget_BP(int32 EntryPoint);
	void Event_HideMessage(int32 MessageId);
	void Event_ShowMessage(const struct FRBTextChatMessage& Message);
	void PreConstruct(bool IsDesignTime);
	void AddMessage(const struct FRBTextChatMessage& Message);
	void OnEntryHidden(class UTextChatEntry_C* Entry);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TextChatWidget_BP_C">();
	}
	static class UTextChatWidget_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextChatWidget_BP_C>();
	}
};
static_assert(alignof(UTextChatWidget_BP_C) == 0x000008, "Wrong alignment on UTextChatWidget_BP_C");
static_assert(sizeof(UTextChatWidget_BP_C) == 0x000318, "Wrong size on UTextChatWidget_BP_C");
static_assert(offsetof(UTextChatWidget_BP_C, UberGraphFrame) == 0x0002B0, "Member 'UTextChatWidget_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTextChatWidget_BP_C, InvalidationBox_TextChatWidget) == 0x0002B8, "Member 'UTextChatWidget_BP_C::InvalidationBox_TextChatWidget' has a wrong offset!");
static_assert(offsetof(UTextChatWidget_BP_C, MessageContainerSizeBox) == 0x0002C0, "Member 'UTextChatWidget_BP_C::MessageContainerSizeBox' has a wrong offset!");
static_assert(offsetof(UTextChatWidget_BP_C, MessagesVBox) == 0x0002C8, "Member 'UTextChatWidget_BP_C::MessagesVBox' has a wrong offset!");
static_assert(offsetof(UTextChatWidget_BP_C, TextBackground) == 0x0002D0, "Member 'UTextChatWidget_BP_C::TextBackground' has a wrong offset!");
static_assert(offsetof(UTextChatWidget_BP_C, TestMessage) == 0x0002D8, "Member 'UTextChatWidget_BP_C::TestMessage' has a wrong offset!");

}

