#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextAnim_Struc

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct TextAnim_Struc.TextAnim_Struc
// 0x0060 (0x0060 - 0x0000)
struct FTextAnim_Struc final
{
public:
	class FText                                   Text_3_063F560F4EADCF934DEC33A37F44E501;           // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FString                                 String_5_30DBFE2C4E02D227850CEE824AE48D77;         // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         StartTime_17_D86BE86A44A2C1ED307A8E98803EB88E;     // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndTime_18_571820434EF225AA662F568C0241EE8E;       // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TextIntensity_39_76A316494A59234980A4CBB60DD0A6F6; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextColor_43_EDAB39124C28D39BF6849F8E3C19965C;     // 0x0034(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TEXTSIZE_13_78DD5D7E4357A8C07A8B7D801C43ED99;      // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               TVImage_22_5C73FAD043C8052AF58A0D943BC98797;       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Sound_26_43B19AC9428E8CAA1C0D6C8E3F85511C;         // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlaySoundOnNarrator_36_D04AD0234716824F32CB509F6904C317; // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSoundVO_38_E98FBDD64AE823015233719EC7A35841;     // 0x0059(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Noise_28_F30532F843A673D7A2A98590F24D0D17;         // 0x005A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Rorschard_30_FEAF14F04F2BA7CB7537CBAC30042E48;     // 0x005B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          MovieFlash_32_C8BC1C244A7D3BBF65223E85561AE8E1;    // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FTextAnim_Struc) == 0x000008, "Wrong alignment on FTextAnim_Struc");
static_assert(sizeof(FTextAnim_Struc) == 0x000060, "Wrong size on FTextAnim_Struc");
static_assert(offsetof(FTextAnim_Struc, Text_3_063F560F4EADCF934DEC33A37F44E501) == 0x000000, "Member 'FTextAnim_Struc::Text_3_063F560F4EADCF934DEC33A37F44E501' has a wrong offset!");
static_assert(offsetof(FTextAnim_Struc, String_5_30DBFE2C4E02D227850CEE824AE48D77) == 0x000018, "Member 'FTextAnim_Struc::String_5_30DBFE2C4E02D227850CEE824AE48D77' has a wrong offset!");
static_assert(offsetof(FTextAnim_Struc, StartTime_17_D86BE86A44A2C1ED307A8E98803EB88E) == 0x000028, "Member 'FTextAnim_Struc::StartTime_17_D86BE86A44A2C1ED307A8E98803EB88E' has a wrong offset!");
static_assert(offsetof(FTextAnim_Struc, EndTime_18_571820434EF225AA662F568C0241EE8E) == 0x00002C, "Member 'FTextAnim_Struc::EndTime_18_571820434EF225AA662F568C0241EE8E' has a wrong offset!");
static_assert(offsetof(FTextAnim_Struc, TextIntensity_39_76A316494A59234980A4CBB60DD0A6F6) == 0x000030, "Member 'FTextAnim_Struc::TextIntensity_39_76A316494A59234980A4CBB60DD0A6F6' has a wrong offset!");
static_assert(offsetof(FTextAnim_Struc, TextColor_43_EDAB39124C28D39BF6849F8E3C19965C) == 0x000034, "Member 'FTextAnim_Struc::TextColor_43_EDAB39124C28D39BF6849F8E3C19965C' has a wrong offset!");
static_assert(offsetof(FTextAnim_Struc, TEXTSIZE_13_78DD5D7E4357A8C07A8B7D801C43ED99) == 0x000044, "Member 'FTextAnim_Struc::TEXTSIZE_13_78DD5D7E4357A8C07A8B7D801C43ED99' has a wrong offset!");
static_assert(offsetof(FTextAnim_Struc, TVImage_22_5C73FAD043C8052AF58A0D943BC98797) == 0x000048, "Member 'FTextAnim_Struc::TVImage_22_5C73FAD043C8052AF58A0D943BC98797' has a wrong offset!");
static_assert(offsetof(FTextAnim_Struc, Sound_26_43B19AC9428E8CAA1C0D6C8E3F85511C) == 0x000050, "Member 'FTextAnim_Struc::Sound_26_43B19AC9428E8CAA1C0D6C8E3F85511C' has a wrong offset!");
static_assert(offsetof(FTextAnim_Struc, PlaySoundOnNarrator_36_D04AD0234716824F32CB509F6904C317) == 0x000058, "Member 'FTextAnim_Struc::PlaySoundOnNarrator_36_D04AD0234716824F32CB509F6904C317' has a wrong offset!");
static_assert(offsetof(FTextAnim_Struc, IsSoundVO_38_E98FBDD64AE823015233719EC7A35841) == 0x000059, "Member 'FTextAnim_Struc::IsSoundVO_38_E98FBDD64AE823015233719EC7A35841' has a wrong offset!");
static_assert(offsetof(FTextAnim_Struc, Noise_28_F30532F843A673D7A2A98590F24D0D17) == 0x00005A, "Member 'FTextAnim_Struc::Noise_28_F30532F843A673D7A2A98590F24D0D17' has a wrong offset!");
static_assert(offsetof(FTextAnim_Struc, Rorschard_30_FEAF14F04F2BA7CB7537CBAC30042E48) == 0x00005B, "Member 'FTextAnim_Struc::Rorschard_30_FEAF14F04F2BA7CB7537CBAC30042E48' has a wrong offset!");
static_assert(offsetof(FTextAnim_Struc, MovieFlash_32_C8BC1C244A7D3BBF65223E85561AE8E1) == 0x00005C, "Member 'FTextAnim_Struc::MovieFlash_32_C8BC1C244A7D3BBF65223E85561AE8E1' has a wrong offset!");

}

