#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextBox

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct TextBox.TextBox
// 0x0090 (0x0090 - 0x0000)
struct FTextBox final
{
public:
	class FText                                   Text_44_BC2D0814482B1E1808D36A8F757E7FC1;          // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FString                                 String_45_D525E99446A95CBB25B53EAF689203B2;        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               BorderRLTB_11_E8A4F54440B2BC9C35E31FBEA403A526;    // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFont*                                  Font_6_9876006543FF6A9B6A90C5967F26F16B;           // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FontScale_29_A5EDC95248C49190EF6113A3D1B330E2;     // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FontColor_28_87D486A246E4E3C9753F3CA1501E233F;     // 0x004C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FontOutlineColor_35_A814854F48BF6BAB0B368DAB7534C37A; // 0x005C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FontShadowColor_33_620D06484C61E6871139059757FE0081; // 0x006C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FontKerning_30_E2AEFB8B411F45E7C7DA29A6F6C798DF;   // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LineSpace_22_84BB51A94153917E619F678A2B43D36F;     // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CenterX_38_9ECC00C6408B6DEEC03A12A09EE69AB6;       // 0x0084(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CenterY_39_C1AAF35F44D20A4C47A964BA8526A449;       // 0x0085(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FTextBox) == 0x000010, "Wrong alignment on FTextBox");
static_assert(sizeof(FTextBox) == 0x000090, "Wrong size on FTextBox");
static_assert(offsetof(FTextBox, Text_44_BC2D0814482B1E1808D36A8F757E7FC1) == 0x000000, "Member 'FTextBox::Text_44_BC2D0814482B1E1808D36A8F757E7FC1' has a wrong offset!");
static_assert(offsetof(FTextBox, String_45_D525E99446A95CBB25B53EAF689203B2) == 0x000018, "Member 'FTextBox::String_45_D525E99446A95CBB25B53EAF689203B2' has a wrong offset!");
static_assert(offsetof(FTextBox, BorderRLTB_11_E8A4F54440B2BC9C35E31FBEA403A526) == 0x000030, "Member 'FTextBox::BorderRLTB_11_E8A4F54440B2BC9C35E31FBEA403A526' has a wrong offset!");
static_assert(offsetof(FTextBox, Font_6_9876006543FF6A9B6A90C5967F26F16B) == 0x000040, "Member 'FTextBox::Font_6_9876006543FF6A9B6A90C5967F26F16B' has a wrong offset!");
static_assert(offsetof(FTextBox, FontScale_29_A5EDC95248C49190EF6113A3D1B330E2) == 0x000048, "Member 'FTextBox::FontScale_29_A5EDC95248C49190EF6113A3D1B330E2' has a wrong offset!");
static_assert(offsetof(FTextBox, FontColor_28_87D486A246E4E3C9753F3CA1501E233F) == 0x00004C, "Member 'FTextBox::FontColor_28_87D486A246E4E3C9753F3CA1501E233F' has a wrong offset!");
static_assert(offsetof(FTextBox, FontOutlineColor_35_A814854F48BF6BAB0B368DAB7534C37A) == 0x00005C, "Member 'FTextBox::FontOutlineColor_35_A814854F48BF6BAB0B368DAB7534C37A' has a wrong offset!");
static_assert(offsetof(FTextBox, FontShadowColor_33_620D06484C61E6871139059757FE0081) == 0x00006C, "Member 'FTextBox::FontShadowColor_33_620D06484C61E6871139059757FE0081' has a wrong offset!");
static_assert(offsetof(FTextBox, FontKerning_30_E2AEFB8B411F45E7C7DA29A6F6C798DF) == 0x00007C, "Member 'FTextBox::FontKerning_30_E2AEFB8B411F45E7C7DA29A6F6C798DF' has a wrong offset!");
static_assert(offsetof(FTextBox, LineSpace_22_84BB51A94153917E619F678A2B43D36F) == 0x000080, "Member 'FTextBox::LineSpace_22_84BB51A94153917E619F678A2B43D36F' has a wrong offset!");
static_assert(offsetof(FTextBox, CenterX_38_9ECC00C6408B6DEEC03A12A09EE69AB6) == 0x000084, "Member 'FTextBox::CenterX_38_9ECC00C6408B6DEEC03A12A09EE69AB6' has a wrong offset!");
static_assert(offsetof(FTextBox, CenterY_39_C1AAF35F44D20A4C47A964BA8526A449) == 0x000085, "Member 'FTextBox::CenterY_39_C1AAF35F44D20A4C47A964BA8526A449' has a wrong offset!");

}

