#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrainStationSignMinus01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TrainStationSign-01_BP.TrainStationSign-01_BP_C
// 0x0080 (0x02B0 - 0x0230)
class ATrainStationSignMinus01_BP_C final : public ARBClientOnlyActor
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLight;                                          // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   LightMesh;                                         // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LightTransfrom;                                    // 0x0260(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class FText                                   PreviewText;                                       // 0x0290(0x0018)(Edit, BlueprintVisible)

public:
	void SetText(const class FText& Text);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TrainStationSign-01_BP_C">();
	}
	static class ATrainStationSignMinus01_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrainStationSignMinus01_BP_C>();
	}
};
static_assert(alignof(ATrainStationSignMinus01_BP_C) == 0x000010, "Wrong alignment on ATrainStationSignMinus01_BP_C");
static_assert(sizeof(ATrainStationSignMinus01_BP_C) == 0x0002B0, "Wrong size on ATrainStationSignMinus01_BP_C");
static_assert(offsetof(ATrainStationSignMinus01_BP_C, StaticMesh) == 0x000230, "Member 'ATrainStationSignMinus01_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ATrainStationSignMinus01_BP_C, TextRender) == 0x000238, "Member 'ATrainStationSignMinus01_BP_C::TextRender' has a wrong offset!");
static_assert(offsetof(ATrainStationSignMinus01_BP_C, Scene) == 0x000240, "Member 'ATrainStationSignMinus01_BP_C::Scene' has a wrong offset!");
static_assert(offsetof(ATrainStationSignMinus01_BP_C, UseLight) == 0x000248, "Member 'ATrainStationSignMinus01_BP_C::UseLight' has a wrong offset!");
static_assert(offsetof(ATrainStationSignMinus01_BP_C, LightMesh) == 0x000250, "Member 'ATrainStationSignMinus01_BP_C::LightMesh' has a wrong offset!");
static_assert(offsetof(ATrainStationSignMinus01_BP_C, LightTransfrom) == 0x000260, "Member 'ATrainStationSignMinus01_BP_C::LightTransfrom' has a wrong offset!");
static_assert(offsetof(ATrainStationSignMinus01_BP_C, PreviewText) == 0x000290, "Member 'ATrainStationSignMinus01_BP_C::PreviewText' has a wrong offset!");

}

