#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrapDart_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TrapDart_BP.TrapDart_BP_C.SimulatePhysics
// 0x0010 (0x0010 - 0x0000)
struct TrapDart_BP_C_SimulatePhysics final
{
public:
	bool                                          bAddImpulse;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrapDart_BP_C_SimulatePhysics) == 0x000004, "Wrong alignment on TrapDart_BP_C_SimulatePhysics");
static_assert(sizeof(TrapDart_BP_C_SimulatePhysics) == 0x000010, "Wrong size on TrapDart_BP_C_SimulatePhysics");
static_assert(offsetof(TrapDart_BP_C_SimulatePhysics, bAddImpulse) == 0x000000, "Member 'TrapDart_BP_C_SimulatePhysics::bAddImpulse' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_SimulatePhysics, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000004, "Member 'TrapDart_BP_C_SimulatePhysics::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function TrapDart_BP.TrapDart_BP_C.ReachEndOfCable
// 0x0018 (0x0018 - 0x0000)
struct TrapDart_BP_C_ReachEndOfCable final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrapDart_BP_C_ReachEndOfCable) == 0x000004, "Wrong alignment on TrapDart_BP_C_ReachEndOfCable");
static_assert(sizeof(TrapDart_BP_C_ReachEndOfCable) == 0x000018, "Wrong size on TrapDart_BP_C_ReachEndOfCable");
static_assert(offsetof(TrapDart_BP_C_ReachEndOfCable, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'TrapDart_BP_C_ReachEndOfCable::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ReachEndOfCable, Temp_delegate_Variable) == 0x000004, "Member 'TrapDart_BP_C_ReachEndOfCable::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ReachEndOfCable, CallFunc_PostEventOnActor_ReturnValue) == 0x000014, "Member 'TrapDart_BP_C_ReachEndOfCable::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");

// Function TrapDart_BP.TrapDart_BP_C.BP_OnHitPlayer
// 0x0008 (0x0008 - 0x0000)
struct TrapDart_BP_C_BP_OnHitPlayer final
{
public:
	class ARBPlayer*                              Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrapDart_BP_C_BP_OnHitPlayer) == 0x000008, "Wrong alignment on TrapDart_BP_C_BP_OnHitPlayer");
static_assert(sizeof(TrapDart_BP_C_BP_OnHitPlayer) == 0x000008, "Wrong size on TrapDart_BP_C_BP_OnHitPlayer");
static_assert(offsetof(TrapDart_BP_C_BP_OnHitPlayer, Player) == 0x000000, "Member 'TrapDart_BP_C_BP_OnHitPlayer::Player' has a wrong offset!");

// Function TrapDart_BP.TrapDart_BP_C.BP_OnDetachFromPlayer
// 0x0008 (0x0008 - 0x0000)
struct TrapDart_BP_C_BP_OnDetachFromPlayer final
{
public:
	class ARBPlayer*                              Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrapDart_BP_C_BP_OnDetachFromPlayer) == 0x000008, "Wrong alignment on TrapDart_BP_C_BP_OnDetachFromPlayer");
static_assert(sizeof(TrapDart_BP_C_BP_OnDetachFromPlayer) == 0x000008, "Wrong size on TrapDart_BP_C_BP_OnDetachFromPlayer");
static_assert(offsetof(TrapDart_BP_C_BP_OnDetachFromPlayer, Player) == 0x000000, "Member 'TrapDart_BP_C_BP_OnDetachFromPlayer::Player' has a wrong offset!");

// Function TrapDart_BP.TrapDart_BP_C.BP_OnHitNPC
// 0x0008 (0x0008 - 0x0000)
struct TrapDart_BP_C_BP_OnHitNPC final
{
public:
	class ARBNPC*                                 NPC;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrapDart_BP_C_BP_OnHitNPC) == 0x000008, "Wrong alignment on TrapDart_BP_C_BP_OnHitNPC");
static_assert(sizeof(TrapDart_BP_C_BP_OnHitNPC) == 0x000008, "Wrong size on TrapDart_BP_C_BP_OnHitNPC");
static_assert(offsetof(TrapDart_BP_C_BP_OnHitNPC, NPC) == 0x000000, "Member 'TrapDart_BP_C_BP_OnHitNPC::NPC' has a wrong offset!");

// Function TrapDart_BP.TrapDart_BP_C.ExecuteUbergraph_TrapDart_BP
// 0x0100 (0x0100 - 0x0000)
struct TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue_1;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_Event_player_1;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_Event_player;                               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2;                          // 0x0044(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BP_DoesDamage_ReturnValue;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_DoesPsychosis_ReturnValue;             // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57[0x1];                                       // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x0058(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBNPC*                                 K2Node_Event_npc;                                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP) == 0x000008, "Wrong alignment on TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP");
static_assert(sizeof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP) == 0x000100, "Wrong size on TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, EntryPoint) == 0x000000, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, Temp_delegate_Variable) == 0x000004, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, CallFunc_PostEventOnActor_ReturnValue) == 0x000014, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, Temp_delegate_Variable_1) == 0x00001C, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, CallFunc_PostEventOnActor_ReturnValue_1) == 0x00002C, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::CallFunc_PostEventOnActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, K2Node_Event_player_1) == 0x000030, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::K2Node_Event_player_1' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, K2Node_Event_player) == 0x000038, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::K2Node_Event_player' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, CallFunc_HasAuthority_ReturnValue) == 0x000040, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, Temp_delegate_Variable_2) == 0x000044, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, CallFunc_BP_DoesDamage_ReturnValue) == 0x000054, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::CallFunc_BP_DoesDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, CallFunc_BP_DoesPsychosis_ReturnValue) == 0x000055, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::CallFunc_BP_DoesPsychosis_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000056, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x000058, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, Temp_struct_Variable) == 0x0000E0, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, CallFunc_PostAkEvent_ReturnValue) == 0x0000F0, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP, K2Node_Event_npc) == 0x0000F8, "Member 'TrapDart_BP_C_ExecuteUbergraph_TrapDart_BP::K2Node_Event_npc' has a wrong offset!");

}

