#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrialChainingItemContainer_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OPP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TrialChainingItemContainer_BP.TrialChainingItemContainer_BP_C
// 0x0130 (0x0670 - 0x0540)
class ATrialChainingItemContainer_BP_C final : public ARBInteractibleContainer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URBPingComponent*                       RBPing;                                            // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collsiion;                                         // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview11;                         // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     RBContainerSpawnLocation11;                        // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview10;                         // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     RBContainerSpawnLocation10;                        // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview9;                          // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     RBContainerSpawnLocation9;                         // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview8;                          // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     RBContainerSpawnLocation8;                         // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview7;                          // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     RBContainerSpawnLocation7;                         // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview6;                          // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     RBContainerSpawnLocation6;                         // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview5;                          // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     RBContainerSpawnLocation5;                         // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview4;                          // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     RBContainerSpawnLocation4;                         // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RewardBoxMesh;                                     // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview3;                          // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     RBContainerSpawnLocation3;                         // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview2;                          // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     RBContainerSpawnLocation2;                         // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview1;                          // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     RBContainerSpawnLocation1;                         // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBEditorSelectedPreviewComponent*      RBEditorSelectedPreview;                           // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBContainerSpawnLocationComponent*     RBContainerSpawnLocation;                          // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            InteractionStaticMesh_0;                           // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_628[0x8];                                      // 0x0628(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BaseTransform_0;                                   // 0x0630(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         TotalNumberOfItems;                                // 0x0660(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TrialChainingItemContainer_BP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnSpawnedItemInfosChanged();
	void OnRep_TotalNumberOfItems();
	void UpdateVisibility();

	bool GetPingEnabled(class ARBPlayer* PingOwner, const struct FHitResult& HitResult, bool* OutIsEnabled) const;
	bool GetPlayerPingWorldLocation(class ARBPlayer* PingOwner, const struct FHitResult& HitResult, struct FVector* OutLocation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TrialChainingItemContainer_BP_C">();
	}
	static class ATrialChainingItemContainer_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrialChainingItemContainer_BP_C>();
	}
};
static_assert(alignof(ATrialChainingItemContainer_BP_C) == 0x000010, "Wrong alignment on ATrialChainingItemContainer_BP_C");
static_assert(sizeof(ATrialChainingItemContainer_BP_C) == 0x000670, "Wrong size on ATrialChainingItemContainer_BP_C");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, UberGraphFrame) == 0x000540, "Member 'ATrialChainingItemContainer_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBPing) == 0x000548, "Member 'ATrialChainingItemContainer_BP_C::RBPing' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, Collsiion) == 0x000550, "Member 'ATrialChainingItemContainer_BP_C::Collsiion' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBEditorSelectedPreview11) == 0x000558, "Member 'ATrialChainingItemContainer_BP_C::RBEditorSelectedPreview11' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBContainerSpawnLocation11) == 0x000560, "Member 'ATrialChainingItemContainer_BP_C::RBContainerSpawnLocation11' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBEditorSelectedPreview10) == 0x000568, "Member 'ATrialChainingItemContainer_BP_C::RBEditorSelectedPreview10' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBContainerSpawnLocation10) == 0x000570, "Member 'ATrialChainingItemContainer_BP_C::RBContainerSpawnLocation10' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBEditorSelectedPreview9) == 0x000578, "Member 'ATrialChainingItemContainer_BP_C::RBEditorSelectedPreview9' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBContainerSpawnLocation9) == 0x000580, "Member 'ATrialChainingItemContainer_BP_C::RBContainerSpawnLocation9' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBEditorSelectedPreview8) == 0x000588, "Member 'ATrialChainingItemContainer_BP_C::RBEditorSelectedPreview8' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBContainerSpawnLocation8) == 0x000590, "Member 'ATrialChainingItemContainer_BP_C::RBContainerSpawnLocation8' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBEditorSelectedPreview7) == 0x000598, "Member 'ATrialChainingItemContainer_BP_C::RBEditorSelectedPreview7' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBContainerSpawnLocation7) == 0x0005A0, "Member 'ATrialChainingItemContainer_BP_C::RBContainerSpawnLocation7' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBEditorSelectedPreview6) == 0x0005A8, "Member 'ATrialChainingItemContainer_BP_C::RBEditorSelectedPreview6' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBContainerSpawnLocation6) == 0x0005B0, "Member 'ATrialChainingItemContainer_BP_C::RBContainerSpawnLocation6' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBEditorSelectedPreview5) == 0x0005B8, "Member 'ATrialChainingItemContainer_BP_C::RBEditorSelectedPreview5' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBContainerSpawnLocation5) == 0x0005C0, "Member 'ATrialChainingItemContainer_BP_C::RBContainerSpawnLocation5' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBEditorSelectedPreview4) == 0x0005C8, "Member 'ATrialChainingItemContainer_BP_C::RBEditorSelectedPreview4' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBContainerSpawnLocation4) == 0x0005D0, "Member 'ATrialChainingItemContainer_BP_C::RBContainerSpawnLocation4' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RewardBoxMesh) == 0x0005D8, "Member 'ATrialChainingItemContainer_BP_C::RewardBoxMesh' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBEditorSelectedPreview3) == 0x0005E0, "Member 'ATrialChainingItemContainer_BP_C::RBEditorSelectedPreview3' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBContainerSpawnLocation3) == 0x0005E8, "Member 'ATrialChainingItemContainer_BP_C::RBContainerSpawnLocation3' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBEditorSelectedPreview2) == 0x0005F0, "Member 'ATrialChainingItemContainer_BP_C::RBEditorSelectedPreview2' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBContainerSpawnLocation2) == 0x0005F8, "Member 'ATrialChainingItemContainer_BP_C::RBContainerSpawnLocation2' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBEditorSelectedPreview1) == 0x000600, "Member 'ATrialChainingItemContainer_BP_C::RBEditorSelectedPreview1' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBContainerSpawnLocation1) == 0x000608, "Member 'ATrialChainingItemContainer_BP_C::RBContainerSpawnLocation1' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBEditorSelectedPreview) == 0x000610, "Member 'ATrialChainingItemContainer_BP_C::RBEditorSelectedPreview' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, RBContainerSpawnLocation) == 0x000618, "Member 'ATrialChainingItemContainer_BP_C::RBContainerSpawnLocation' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, InteractionStaticMesh_0) == 0x000620, "Member 'ATrialChainingItemContainer_BP_C::InteractionStaticMesh_0' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, BaseTransform_0) == 0x000630, "Member 'ATrialChainingItemContainer_BP_C::BaseTransform_0' has a wrong offset!");
static_assert(offsetof(ATrialChainingItemContainer_BP_C, TotalNumberOfItems) == 0x000660, "Member 'ATrialChainingItemContainer_BP_C::TotalNumberOfItems' has a wrong offset!");

}

