#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrialChainingTransitionScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TrialChainingTransitionScreen.TrialChainingTransitionScreen_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct TrialChainingTransitionScreen_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(TrialChainingTransitionScreen_C_OnFocusReceived) == 0x000008, "Wrong alignment on TrialChainingTransitionScreen_C_OnFocusReceived");
static_assert(sizeof(TrialChainingTransitionScreen_C_OnFocusReceived) == 0x0001B0, "Wrong size on TrialChainingTransitionScreen_C_OnFocusReceived");
static_assert(offsetof(TrialChainingTransitionScreen_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'TrialChainingTransitionScreen_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'TrialChainingTransitionScreen_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'TrialChainingTransitionScreen_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'TrialChainingTransitionScreen_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function TrialChainingTransitionScreen.TrialChainingTransitionScreen_C.SetupVariators
// 0x0058 (0x0058 - 0x0000)
struct TrialChainingTransitionScreen_C_SetupVariators final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgramTrialVariatorWidget_C*          CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBVariatorManager*                     CallFunc_GetVariatorManager_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class URBVariatorInfo*>                CallFunc_GetCurrentVariatorConfigs_ReturnValue;    // 0x0020(0x0010)(ConstParm, ReferenceParm)
	class URBVariatorInfo*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrialChainingTransitionScreen_C_SetupVariators) == 0x000008, "Wrong alignment on TrialChainingTransitionScreen_C_SetupVariators");
static_assert(sizeof(TrialChainingTransitionScreen_C_SetupVariators) == 0x000058, "Wrong size on TrialChainingTransitionScreen_C_SetupVariators");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupVariators, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'TrialChainingTransitionScreen_C_SetupVariators::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupVariators, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'TrialChainingTransitionScreen_C_SetupVariators::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupVariators, Temp_int_Array_Index_Variable) == 0x000008, "Member 'TrialChainingTransitionScreen_C_SetupVariators::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupVariators, CallFunc_Create_ReturnValue) == 0x000010, "Member 'TrialChainingTransitionScreen_C_SetupVariators::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupVariators, CallFunc_GetVariatorManager_ReturnValue) == 0x000018, "Member 'TrialChainingTransitionScreen_C_SetupVariators::CallFunc_GetVariatorManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupVariators, CallFunc_GetCurrentVariatorConfigs_ReturnValue) == 0x000020, "Member 'TrialChainingTransitionScreen_C_SetupVariators::CallFunc_GetCurrentVariatorConfigs_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupVariators, CallFunc_Array_Get_Item) == 0x000030, "Member 'TrialChainingTransitionScreen_C_SetupVariators::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupVariators, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'TrialChainingTransitionScreen_C_SetupVariators::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupVariators, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'TrialChainingTransitionScreen_C_SetupVariators::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupVariators, CallFunc_IsValid_ReturnValue) == 0x00003D, "Member 'TrialChainingTransitionScreen_C_SetupVariators::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupVariators, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000040, "Member 'TrialChainingTransitionScreen_C_SetupVariators::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupVariators, K2Node_MakeStruct_Margin) == 0x000048, "Member 'TrialChainingTransitionScreen_C_SetupVariators::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function TrialChainingTransitionScreen.TrialChainingTransitionScreen_C.SetupFields
// 0x0158 (0x0158 - 0x0000)
struct TrialChainingTransitionScreen_C_SetupFields final
{
public:
	class URBGameStructureConfig*                 CallFunc_GetGameStructureConfig_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTrialId_ReturnValue;                   // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRBTrialInfoRow                        CallFunc_GetTrialInfo_ReturnValue;                 // 0x0018(0x00E8)(ConstParm)
	class FText                                   CallFunc_NormalizedScoreToText_ReturnValue;        // 0x0100(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0118(0x0018)()
	class FString                                 CallFunc_FormatTimeFromFloat_ReturnValue;          // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0140(0x0018)()
};
static_assert(alignof(TrialChainingTransitionScreen_C_SetupFields) == 0x000008, "Wrong alignment on TrialChainingTransitionScreen_C_SetupFields");
static_assert(sizeof(TrialChainingTransitionScreen_C_SetupFields) == 0x000158, "Wrong size on TrialChainingTransitionScreen_C_SetupFields");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupFields, CallFunc_GetGameStructureConfig_ReturnValue) == 0x000000, "Member 'TrialChainingTransitionScreen_C_SetupFields::CallFunc_GetGameStructureConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupFields, CallFunc_GetRBGameState_ReturnValue) == 0x000008, "Member 'TrialChainingTransitionScreen_C_SetupFields::CallFunc_GetRBGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupFields, CallFunc_GetTrialId_ReturnValue) == 0x000010, "Member 'TrialChainingTransitionScreen_C_SetupFields::CallFunc_GetTrialId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupFields, CallFunc_GetTrialInfo_ReturnValue) == 0x000018, "Member 'TrialChainingTransitionScreen_C_SetupFields::CallFunc_GetTrialInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupFields, CallFunc_NormalizedScoreToText_ReturnValue) == 0x000100, "Member 'TrialChainingTransitionScreen_C_SetupFields::CallFunc_NormalizedScoreToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupFields, CallFunc_Conv_IntToText_ReturnValue) == 0x000118, "Member 'TrialChainingTransitionScreen_C_SetupFields::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupFields, CallFunc_FormatTimeFromFloat_ReturnValue) == 0x000130, "Member 'TrialChainingTransitionScreen_C_SetupFields::CallFunc_FormatTimeFromFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetupFields, CallFunc_Conv_StringToText_ReturnValue) == 0x000140, "Member 'TrialChainingTransitionScreen_C_SetupFields::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function TrialChainingTransitionScreen.TrialChainingTransitionScreen_C.UpdateSecondsRemaining
// 0x00F0 (0x00F0 - 0x0000)
struct TrialChainingTransitionScreen_C_UpdateSecondsRemaining final
{
public:
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSecondsRemainingUntilEndOfVote_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0070(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
};
static_assert(alignof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining) == 0x000008, "Wrong alignment on TrialChainingTransitionScreen_C_UpdateSecondsRemaining");
static_assert(sizeof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining) == 0x0000F0, "Wrong size on TrialChainingTransitionScreen_C_UpdateSecondsRemaining");
static_assert(offsetof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000000, "Member 'TrialChainingTransitionScreen_C_UpdateSecondsRemaining::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining, CallFunc_GetSecondsRemainingUntilEndOfVote_ReturnValue) == 0x000004, "Member 'TrialChainingTransitionScreen_C_UpdateSecondsRemaining::CallFunc_GetSecondsRemainingUntilEndOfVote_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'TrialChainingTransitionScreen_C_UpdateSecondsRemaining::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000009, "Member 'TrialChainingTransitionScreen_C_UpdateSecondsRemaining::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'TrialChainingTransitionScreen_C_UpdateSecondsRemaining::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining, CallFunc_Percent_IntInt_ReturnValue) == 0x00000C, "Member 'TrialChainingTransitionScreen_C_UpdateSecondsRemaining::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'TrialChainingTransitionScreen_C_UpdateSecondsRemaining::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining, CallFunc_Divide_IntInt_ReturnValue) == 0x000028, "Member 'TrialChainingTransitionScreen_C_UpdateSecondsRemaining::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'TrialChainingTransitionScreen_C_UpdateSecondsRemaining::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000070, "Member 'TrialChainingTransitionScreen_C_UpdateSecondsRemaining::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'TrialChainingTransitionScreen_C_UpdateSecondsRemaining::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining, K2Node_MakeArray_Array) == 0x0000C8, "Member 'TrialChainingTransitionScreen_C_UpdateSecondsRemaining::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_UpdateSecondsRemaining, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'TrialChainingTransitionScreen_C_UpdateSecondsRemaining::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function TrialChainingTransitionScreen.TrialChainingTransitionScreen_C.BindContinueButton
// 0x0014 (0x0014 - 0x0000)
struct TrialChainingTransitionScreen_C_BindContinueButton final
{
public:
	bool                                          bBind;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(TrialChainingTransitionScreen_C_BindContinueButton) == 0x000004, "Wrong alignment on TrialChainingTransitionScreen_C_BindContinueButton");
static_assert(sizeof(TrialChainingTransitionScreen_C_BindContinueButton) == 0x000014, "Wrong size on TrialChainingTransitionScreen_C_BindContinueButton");
static_assert(offsetof(TrialChainingTransitionScreen_C_BindContinueButton, bBind) == 0x000000, "Member 'TrialChainingTransitionScreen_C_BindContinueButton::bBind' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_BindContinueButton, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'TrialChainingTransitionScreen_C_BindContinueButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function TrialChainingTransitionScreen.TrialChainingTransitionScreen_C.SetButtonsActive
// 0x0006 (0x0006 - 0x0000)
struct TrialChainingTransitionScreen_C_SetButtonsActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrialChainingTransitionScreen_C_SetButtonsActive) == 0x000001, "Wrong alignment on TrialChainingTransitionScreen_C_SetButtonsActive");
static_assert(sizeof(TrialChainingTransitionScreen_C_SetButtonsActive) == 0x000006, "Wrong size on TrialChainingTransitionScreen_C_SetButtonsActive");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetButtonsActive, bActive) == 0x000000, "Member 'TrialChainingTransitionScreen_C_SetButtonsActive::bActive' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetButtonsActive, Temp_bool_Variable) == 0x000001, "Member 'TrialChainingTransitionScreen_C_SetButtonsActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetButtonsActive, Temp_byte_Variable) == 0x000002, "Member 'TrialChainingTransitionScreen_C_SetButtonsActive::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetButtonsActive, Temp_byte_Variable_1) == 0x000003, "Member 'TrialChainingTransitionScreen_C_SetButtonsActive::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetButtonsActive, K2Node_Select_Default) == 0x000004, "Member 'TrialChainingTransitionScreen_C_SetButtonsActive::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_SetButtonsActive, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000005, "Member 'TrialChainingTransitionScreen_C_SetButtonsActive::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function TrialChainingTransitionScreen.TrialChainingTransitionScreen_C.OnGamePhaseUpdated_Event
// 0x0001 (0x0001 - 0x0000)
struct TrialChainingTransitionScreen_C_OnGamePhaseUpdated_Event final
{
public:
	EGamePhase                                    GamePhase;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialChainingTransitionScreen_C_OnGamePhaseUpdated_Event) == 0x000001, "Wrong alignment on TrialChainingTransitionScreen_C_OnGamePhaseUpdated_Event");
static_assert(sizeof(TrialChainingTransitionScreen_C_OnGamePhaseUpdated_Event) == 0x000001, "Wrong size on TrialChainingTransitionScreen_C_OnGamePhaseUpdated_Event");
static_assert(offsetof(TrialChainingTransitionScreen_C_OnGamePhaseUpdated_Event, GamePhase) == 0x000000, "Member 'TrialChainingTransitionScreen_C_OnGamePhaseUpdated_Event::GamePhase' has a wrong offset!");

// Function TrialChainingTransitionScreen.TrialChainingTransitionScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct TrialChainingTransitionScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialChainingTransitionScreen_C_Tick) == 0x000004, "Wrong alignment on TrialChainingTransitionScreen_C_Tick");
static_assert(sizeof(TrialChainingTransitionScreen_C_Tick) == 0x00003C, "Wrong size on TrialChainingTransitionScreen_C_Tick");
static_assert(offsetof(TrialChainingTransitionScreen_C_Tick, MyGeometry) == 0x000000, "Member 'TrialChainingTransitionScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'TrialChainingTransitionScreen_C_Tick::InDeltaTime' has a wrong offset!");

// Function TrialChainingTransitionScreen.TrialChainingTransitionScreen_C.Event_InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct TrialChainingTransitionScreen_C_Event_InputSourceChanged final
{
public:
	bool                                          bIsGamepad;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TrialChainingTransitionScreen_C_Event_InputSourceChanged) == 0x000001, "Wrong alignment on TrialChainingTransitionScreen_C_Event_InputSourceChanged");
static_assert(sizeof(TrialChainingTransitionScreen_C_Event_InputSourceChanged) == 0x000001, "Wrong size on TrialChainingTransitionScreen_C_Event_InputSourceChanged");
static_assert(offsetof(TrialChainingTransitionScreen_C_Event_InputSourceChanged, bIsGamepad) == 0x000000, "Member 'TrialChainingTransitionScreen_C_Event_InputSourceChanged::bIsGamepad' has a wrong offset!");

// Function TrialChainingTransitionScreen.TrialChainingTransitionScreen_C.OnMenuActionProgressChanged
// 0x000C (0x000C - 0x0000)
struct TrialChainingTransitionScreen_C_OnMenuActionProgressChanged final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewProgress;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TrialChainingTransitionScreen_C_OnMenuActionProgressChanged) == 0x000004, "Wrong alignment on TrialChainingTransitionScreen_C_OnMenuActionProgressChanged");
static_assert(sizeof(TrialChainingTransitionScreen_C_OnMenuActionProgressChanged) == 0x00000C, "Wrong size on TrialChainingTransitionScreen_C_OnMenuActionProgressChanged");
static_assert(offsetof(TrialChainingTransitionScreen_C_OnMenuActionProgressChanged, ActionName) == 0x000000, "Member 'TrialChainingTransitionScreen_C_OnMenuActionProgressChanged::ActionName' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_OnMenuActionProgressChanged, NewProgress) == 0x000008, "Member 'TrialChainingTransitionScreen_C_OnMenuActionProgressChanged::NewProgress' has a wrong offset!");

// Function TrialChainingTransitionScreen.TrialChainingTransitionScreen_C.ExecuteUbergraph_TrialChainingTransitionScreen
// 0x0238 (0x0238 - 0x0000)
struct TrialChainingTransitionScreen_C_ExecuteUbergraph_TrialChainingTransitionScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBGameState*                           CallFunc_GetRBGameState_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_1;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTrialChainIndex_ReturnValue;           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	EGamePhase                                    K2Node_CustomEvent_gamePhase;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x1];                                       // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00D4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x0110(0x0018)()
	int32                                         CallFunc_GetSecondsRemainingUntilEndOfVote_ReturnValue; // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0130(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0178(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01B8(0x0010)(ReferenceParm)
	class FText                                   K2Node_Select_Default;                             // 0x01C8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01E0(0x0018)()
	bool                                          K2Node_Event_bIsGamepad;                           // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_actionName;                     // 0x01FC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_newProgress;                    // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBMenuManager*                         CallFunc_GetMenuManager_ReturnValue;               // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_223[0x1];                                      // 0x0223(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EGamePhase GamePhase)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0224(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(TrialChainingTransitionScreen_C_ExecuteUbergraph_TrialChainingTransitionScreen) == 0x000008, "Wrong alignment on TrialChainingTransitionScreen_C_ExecuteUbergraph_TrialChainingTransitionScreen");
static_assert(sizeof(TrialChainingTransitionScreen_C_ExecuteUbergraph_TrialChainingTransitionScreen) == 0x000238, "Wrong size on TrialChainingTransitionScreen_C_ExecuteUbergraph_TrialChainingTransitionScreen");
static_assert(offsetof(TrialChainingTransitionScreen_C_ExecuteUbergraph_TrialChainingTransitionScreen, EntryPoint) == 0x000000, "Member 'TrialChainingTransitionScreen_C_ExecuteUbergraph_TrialChainingTransitionScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(TrialChainingTransitionScreen_C_ExecuteUbergraph_TrialChainingTransitionScreen, Temp_text_Variable) == 0x000008, "Member 'TrialChainingTransitionScreen_C_ExecuteUbergraph_TrialChainingTransitionScreen::Temp_text_Variable' has a wrong offset!");
