#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrialChainingRecapEntry

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TrialChainingRecapEntry.TrialChainingRecapEntry_C
// 0x0038 (0x0298 - 0x0260)
class UTrialChainingRecapEntry_C final : public UUserWidget
{
public:
	class UImage*                                 BottomLine;                                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GroupScoreText;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerScore;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrialCount;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrialName;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TrialPicture;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         VariatorHBox;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void Setup(class UTexture2D* TrialPicture_0, int32 TrialIndex, const class FText& TrialName_0, TArray<class URBVariatorInfo*>& VariatorsInfos, float GroupScore, float PlayerScore_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TrialChainingRecapEntry_C">();
	}
	static class UTrialChainingRecapEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrialChainingRecapEntry_C>();
	}
};
static_assert(alignof(UTrialChainingRecapEntry_C) == 0x000008, "Wrong alignment on UTrialChainingRecapEntry_C");
static_assert(sizeof(UTrialChainingRecapEntry_C) == 0x000298, "Wrong size on UTrialChainingRecapEntry_C");
static_assert(offsetof(UTrialChainingRecapEntry_C, BottomLine) == 0x000260, "Member 'UTrialChainingRecapEntry_C::BottomLine' has a wrong offset!");
static_assert(offsetof(UTrialChainingRecapEntry_C, GroupScoreText) == 0x000268, "Member 'UTrialChainingRecapEntry_C::GroupScoreText' has a wrong offset!");
static_assert(offsetof(UTrialChainingRecapEntry_C, PlayerScore) == 0x000270, "Member 'UTrialChainingRecapEntry_C::PlayerScore' has a wrong offset!");
static_assert(offsetof(UTrialChainingRecapEntry_C, TrialCount) == 0x000278, "Member 'UTrialChainingRecapEntry_C::TrialCount' has a wrong offset!");
static_assert(offsetof(UTrialChainingRecapEntry_C, TrialName) == 0x000280, "Member 'UTrialChainingRecapEntry_C::TrialName' has a wrong offset!");
static_assert(offsetof(UTrialChainingRecapEntry_C, TrialPicture) == 0x000288, "Member 'UTrialChainingRecapEntry_C::TrialPicture' has a wrong offset!");
static_assert(offsetof(UTrialChainingRecapEntry_C, VariatorHBox) == 0x000290, "Member 'UTrialChainingRecapEntry_C::VariatorHBox' has a wrong offset!");

}

