#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrialChainingTransitionScreen

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"
#include "OPP_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TrialChainingTransitionScreen.TrialChainingTransitionScreen_C
// 0x00A0 (0x05C0 - 0x0520)
class UTrialChainingTransitionScreen_C final : public URBTrialChainingTransitionScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UExperimentBoardActionButton_C*         AbandonBtn;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExperimentBoardActionButton_C*         ContinueBtn;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                GamepadFocusHolder;                                // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GradeBox;                                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Header;                                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialVariatorWidget_C*          ProgramTrialVariatorWidget;                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialVariatorWidget_C*          ProgramTrialVariatorWidget_1;                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialVariatorWidget_C*          ProgramTrialVariatorWidget_2;                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialVariatorWidget_C*          ProgramTrialVariatorWidget_3;                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialVariatorWidget_C*          ProgramTrialVariatorWidget_4;                      // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgramTrialVariatorWidget_C*          ProgramTrialVariatorWidget_5;                      // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReturningToSleepRoomPendingWidget_C*   StatusWidget;                                      // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrialCompletionTimeText;                           // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrialDeathCountText;                               // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrialName;                                         // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TrialRankText;                                     // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         VariatorsHBox;                                     // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bButtonsActive;                                    // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bQuitSelected;                                     // 0x05B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B2[0x2];                                      // 0x05B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreviousSecondsRemaining;                          // 0x05B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamePhase                                    CurrentGamePhase;                                  // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateShortcutsDisplay();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetupVariators();
	void SetupFields();
	void UpdateSecondsRemaining();
	void BindContinueButton(bool bBind);
	void SetButtonsActive(bool bActive);
	void OnGamePhaseUpdated_Event(EGamePhase GamePhase);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__TrialChainingTransitionScreen_ContinueBtn_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void Event_OnQuitConfirmed();
	void Event_InputSourceChanged(bool bIsGamepad);
	void OnContinuePressed();
	void Construct();
	void OnMenuActionProgressChanged(const class FName& ActionName, float NewProgress);
	void BndEvt__TrialChainingTransitionScreen_AbandonBtn_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature();
	void BndEvt__TrialChainingTransitionScreen_AbandonBtn_K2Node_ComponentBoundEvent_4_OnReleased__DelegateSignature();
	void ExecuteUbergraph_TrialChainingTransitionScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TrialChainingTransitionScreen_C">();
	}
	static class UTrialChainingTransitionScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrialChainingTransitionScreen_C>();
	}
};
static_assert(alignof(UTrialChainingTransitionScreen_C) == 0x000008, "Wrong alignment on UTrialChainingTransitionScreen_C");
static_assert(sizeof(UTrialChainingTransitionScreen_C) == 0x0005C0, "Wrong size on UTrialChainingTransitionScreen_C");
static_assert(offsetof(UTrialChainingTransitionScreen_C, UberGraphFrame) == 0x000520, "Member 'UTrialChainingTransitionScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, AbandonBtn) == 0x000528, "Member 'UTrialChainingTransitionScreen_C::AbandonBtn' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, ContinueBtn) == 0x000530, "Member 'UTrialChainingTransitionScreen_C::ContinueBtn' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, GamepadFocusHolder) == 0x000538, "Member 'UTrialChainingTransitionScreen_C::GamepadFocusHolder' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, GradeBox) == 0x000540, "Member 'UTrialChainingTransitionScreen_C::GradeBox' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, Header) == 0x000548, "Member 'UTrialChainingTransitionScreen_C::Header' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, ProgramTrialVariatorWidget) == 0x000550, "Member 'UTrialChainingTransitionScreen_C::ProgramTrialVariatorWidget' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, ProgramTrialVariatorWidget_1) == 0x000558, "Member 'UTrialChainingTransitionScreen_C::ProgramTrialVariatorWidget_1' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, ProgramTrialVariatorWidget_2) == 0x000560, "Member 'UTrialChainingTransitionScreen_C::ProgramTrialVariatorWidget_2' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, ProgramTrialVariatorWidget_3) == 0x000568, "Member 'UTrialChainingTransitionScreen_C::ProgramTrialVariatorWidget_3' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, ProgramTrialVariatorWidget_4) == 0x000570, "Member 'UTrialChainingTransitionScreen_C::ProgramTrialVariatorWidget_4' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, ProgramTrialVariatorWidget_5) == 0x000578, "Member 'UTrialChainingTransitionScreen_C::ProgramTrialVariatorWidget_5' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, StatusWidget) == 0x000580, "Member 'UTrialChainingTransitionScreen_C::StatusWidget' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, TrialCompletionTimeText) == 0x000588, "Member 'UTrialChainingTransitionScreen_C::TrialCompletionTimeText' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, TrialDeathCountText) == 0x000590, "Member 'UTrialChainingTransitionScreen_C::TrialDeathCountText' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, TrialName) == 0x000598, "Member 'UTrialChainingTransitionScreen_C::TrialName' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, TrialRankText) == 0x0005A0, "Member 'UTrialChainingTransitionScreen_C::TrialRankText' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, VariatorsHBox) == 0x0005A8, "Member 'UTrialChainingTransitionScreen_C::VariatorsHBox' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, bButtonsActive) == 0x0005B0, "Member 'UTrialChainingTransitionScreen_C::bButtonsActive' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, bQuitSelected) == 0x0005B1, "Member 'UTrialChainingTransitionScreen_C::bQuitSelected' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, PreviousSecondsRemaining) == 0x0005B4, "Member 'UTrialChainingTransitionScreen_C::PreviousSecondsRemaining' has a wrong offset!");
static_assert(offsetof(UTrialChainingTransitionScreen_C, CurrentGamePhase) == 0x0005B8, "Member 'UTrialChainingTransitionScreen_C::CurrentGamePhase' has a wrong offset!");

}

