#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TriggerTrap_BatteryPowered_Right_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function TriggerTrap_BatteryPowered_Right_BP.TriggerTrap_BatteryPowered_Right_BP_C.RefreshConvertedVisuals
// 0x0018 (0x0018 - 0x0000)
struct TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals final
{
public:
	bool                                          bHacked;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsArmed_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHackState                                    CallFunc_GetCurrentHackState_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals) == 0x000004, "Wrong alignment on TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals");
static_assert(sizeof(TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals) == 0x000018, "Wrong size on TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals, bHacked) == 0x000000, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals::bHacked' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals, CallFunc_IsDedicatedServer_ReturnValue) == 0x000001, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals, CallFunc_GetIsArmed_ReturnValue) == 0x000002, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals::CallFunc_GetIsArmed_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals, CallFunc_GetCurrentHackState_ReturnValue) == 0x000003, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals::CallFunc_GetCurrentHackState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals, CallFunc_SelectColor_ReturnValue) == 0x000008, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_RefreshConvertedVisuals::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function TriggerTrap_BatteryPowered_Right_BP.TriggerTrap_BatteryPowered_Right_BP_C.DestroyedSpawnedBattery
// 0x0048 (0x0048 - 0x0000)
struct TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AElectricTrap_Container_BP_C*           K2Node_DynamicCast_AsElectric_Trap_Container_BP;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContainerSpawnedItemInfo              CallFunc_Array_Get_Item;                           // 0x0020(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABatteryMinus01_BP_C*                   K2Node_DynamicCast_AsBattery_01_BP;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery) == 0x000008, "Wrong alignment on TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery");
static_assert(sizeof(TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery) == 0x000048, "Wrong size on TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery, Temp_int_Array_Index_Variable) == 0x000000, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery, K2Node_DynamicCast_AsElectric_Trap_Container_BP) == 0x000010, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery::K2Node_DynamicCast_AsElectric_Trap_Container_BP' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery, CallFunc_Array_Get_Item) == 0x000020, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery, K2Node_DynamicCast_AsBattery_01_BP) == 0x000038, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery::K2Node_DynamicCast_AsBattery_01_BP' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_DestroyedSpawnedBattery::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function TriggerTrap_BatteryPowered_Right_BP.TriggerTrap_BatteryPowered_Right_BP_C.PlaySpecialMoveAnimation
// 0x0010 (0x0010 - 0x0000)
struct TriggerTrap_BatteryPowered_Right_BP_C_PlaySpecialMoveAnimation final
{
public:
	class ARBPawn*                                InteractorPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  SpecialMove;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TriggerTrap_BatteryPowered_Right_BP_C_PlaySpecialMoveAnimation) == 0x000008, "Wrong alignment on TriggerTrap_BatteryPowered_Right_BP_C_PlaySpecialMoveAnimation");
static_assert(sizeof(TriggerTrap_BatteryPowered_Right_BP_C_PlaySpecialMoveAnimation) == 0x000010, "Wrong size on TriggerTrap_BatteryPowered_Right_BP_C_PlaySpecialMoveAnimation");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_PlaySpecialMoveAnimation, InteractorPawn) == 0x000000, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_PlaySpecialMoveAnimation::InteractorPawn' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_PlaySpecialMoveAnimation, SpecialMove) == 0x000008, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_PlaySpecialMoveAnimation::SpecialMove' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_PlaySpecialMoveAnimation, ReturnValue) == 0x000009, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_PlaySpecialMoveAnimation::ReturnValue' has a wrong offset!");

// Function TriggerTrap_BatteryPowered_Right_BP.TriggerTrap_BatteryPowered_Right_BP_C.SetSpawnedItemsInteractible
// 0x0040 (0x0040 - 0x0000)
struct TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible final
{
public:
	bool                                          IsInteractibe;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AElectricTrap_Container_BP_C*           K2Node_DynamicCast_AsElectric_Trap_Container_BP;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContainerSpawnedItemInfo              CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible) == 0x000008, "Wrong alignment on TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible");
static_assert(sizeof(TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible) == 0x000040, "Wrong size on TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible, IsInteractibe) == 0x000000, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible::IsInteractibe' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible, Temp_int_Array_Index_Variable) == 0x000004, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible, K2Node_DynamicCast_AsElectric_Trap_Container_BP) == 0x000018, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible::K2Node_DynamicCast_AsElectric_Trap_Container_BP' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible, CallFunc_Array_Get_Item) == 0x000028, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_SetSpawnedItemsInteractible::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TriggerTrap_BatteryPowered_Right_BP.TriggerTrap_BatteryPowered_Right_BP_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct TriggerTrap_BatteryPowered_Right_BP_C_UserConstructionScript final
{
public:
	TArray<class UPrimitiveComponent*>            K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TriggerTrap_BatteryPowered_Right_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on TriggerTrap_BatteryPowered_Right_BP_C_UserConstructionScript");
static_assert(sizeof(TriggerTrap_BatteryPowered_Right_BP_C_UserConstructionScript) == 0x000018, "Wrong size on TriggerTrap_BatteryPowered_Right_BP_C_UserConstructionScript");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TriggerTrap_BatteryPowered_Right_BP.TriggerTrap_BatteryPowered_Right_BP_C.Event_OnCompletedOperation
// 0x0010 (0x0010 - 0x0000)
struct TriggerTrap_BatteryPowered_Right_BP_C_Event_OnCompletedOperation final
{
public:
	TArray<class ARBPawn*>                        Pawns;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(TriggerTrap_BatteryPowered_Right_BP_C_Event_OnCompletedOperation) == 0x000008, "Wrong alignment on TriggerTrap_BatteryPowered_Right_BP_C_Event_OnCompletedOperation");
static_assert(sizeof(TriggerTrap_BatteryPowered_Right_BP_C_Event_OnCompletedOperation) == 0x000010, "Wrong size on TriggerTrap_BatteryPowered_Right_BP_C_Event_OnCompletedOperation");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_Event_OnCompletedOperation, Pawns) == 0x000000, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_Event_OnCompletedOperation::Pawns' has a wrong offset!");

// Function TriggerTrap_BatteryPowered_Right_BP.TriggerTrap_BatteryPowered_Right_BP_C.BndEvt__BatterySpawnerActor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__BatterySpawnerActor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature final
{
public:
	class URBActorPrevisComponent*                ActorPrevis;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 RuntimeChildActor;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__BatterySpawnerActor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature) == 0x000008, "Wrong alignment on TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__BatterySpawnerActor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature");
static_assert(sizeof(TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__BatterySpawnerActor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature) == 0x000010, "Wrong size on TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__BatterySpawnerActor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__BatterySpawnerActor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature, ActorPrevis) == 0x000000, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__BatterySpawnerActor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature::ActorPrevis' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__BatterySpawnerActor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature, RuntimeChildActor) == 0x000008, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__BatterySpawnerActor_K2Node_ComponentBoundEvent_0_OnActorPrevisRuntimeChildActorChanged__DelegateSignature::RuntimeChildActor' has a wrong offset!");

// Function TriggerTrap_BatteryPowered_Right_BP.TriggerTrap_BatteryPowered_Right_BP_C.OnDisarmed_Internal
// 0x0001 (0x0001 - 0x0000)
struct TriggerTrap_BatteryPowered_Right_BP_C_OnDisarmed_Internal final
{
public:
	bool                                          bSnapToState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TriggerTrap_BatteryPowered_Right_BP_C_OnDisarmed_Internal) == 0x000001, "Wrong alignment on TriggerTrap_BatteryPowered_Right_BP_C_OnDisarmed_Internal");
static_assert(sizeof(TriggerTrap_BatteryPowered_Right_BP_C_OnDisarmed_Internal) == 0x000001, "Wrong size on TriggerTrap_BatteryPowered_Right_BP_C_OnDisarmed_Internal");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_OnDisarmed_Internal, bSnapToState) == 0x000000, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_OnDisarmed_Internal::bSnapToState' has a wrong offset!");

// Function TriggerTrap_BatteryPowered_Right_BP.TriggerTrap_BatteryPowered_Right_BP_C.BndEvt__TriggerTrap_BatteryPowered_Right_BP_DeviceHackZone_K2Node_ComponentBoundEvent_1_OnCurrentHackStateChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__TriggerTrap_BatteryPowered_Right_BP_DeviceHackZone_K2Node_ComponentBoundEvent_1_OnCurrentHackStateChanged__DelegateSignature final
{
public:
	class URBHackableComponent*                   HackableComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__TriggerTrap_BatteryPowered_Right_BP_DeviceHackZone_K2Node_ComponentBoundEvent_1_OnCurrentHackStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__TriggerTrap_BatteryPowered_Right_BP_DeviceHackZone_K2Node_ComponentBoundEvent_1_OnCurrentHackStateChanged__DelegateSignature");
static_assert(sizeof(TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__TriggerTrap_BatteryPowered_Right_BP_DeviceHackZone_K2Node_ComponentBoundEvent_1_OnCurrentHackStateChanged__DelegateSignature) == 0x000008, "Wrong size on TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__TriggerTrap_BatteryPowered_Right_BP_DeviceHackZone_K2Node_ComponentBoundEvent_1_OnCurrentHackStateChanged__DelegateSignature");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__TriggerTrap_BatteryPowered_Right_BP_DeviceHackZone_K2Node_ComponentBoundEvent_1_OnCurrentHackStateChanged__DelegateSignature, HackableComponent) == 0x000000, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_BndEvt__TriggerTrap_BatteryPowered_Right_BP_DeviceHackZone_K2Node_ComponentBoundEvent_1_OnCurrentHackStateChanged__DelegateSignature::HackableComponent' has a wrong offset!");

// Function TriggerTrap_BatteryPowered_Right_BP.TriggerTrap_BatteryPowered_Right_BP_C.ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP
// 0x00E0 (0x00E0 - 0x0000)
struct TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADoorBase_BP_C*                         K2Node_DynamicCast_AsDoor_Base_BP;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARBPawn*>                        K2Node_Event_pawns;                                // 0x0018(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AElectricTrap_Container_BP_C*           K2Node_DynamicCast_AsElectric_Trap_Container_BP;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AElectricTrap_Container_BP_C*           K2Node_DynamicCast_AsElectric_Trap_Container_BP_1; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URBActorPrevisComponent*                K2Node_ComponentBoundEvent_actorPrevis;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_runtimeChildActor;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AElectricTrap_Container_BP_C*           K2Node_DynamicCast_AsElectric_Trap_Container_BP_2; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsArmed_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bSnapToState;                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ARBPawn*>                        CallFunc_BP_GetInteractorPawns_ReturnValue;        // 0x0078(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARBPawn*                                CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              K2Node_DynamicCast_AsRB_Player;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETrapBatteryState                             CallFunc_GetTrapBatteryState_ReturnValue;          // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBHackableComponent*                   K2Node_ComponentBoundEvent_hackableComponent;      // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer*                              CallFunc_GetPlayerHacker_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHackState                                    CallFunc_GetCurrentHackState_ReturnValue;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ADoorBase_BP_C*                         K2Node_DynamicCast_AsDoor_Base_BP_1;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_5;               // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x00CC(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP) == 0x000008, "Wrong alignment on TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP");
static_assert(sizeof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP) == 0x0000E0, "Wrong size on TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, EntryPoint) == 0x000000, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_DynamicCast_AsDoor_Base_BP) == 0x000008, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_DynamicCast_AsDoor_Base_BP' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000011, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_HasAuthority_ReturnValue) == 0x000012, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000013, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_Event_pawns) == 0x000018, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_Event_pawns' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_HasAuthority_ReturnValue_1) == 0x000028, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_DynamicCast_AsElectric_Trap_Container_BP) == 0x000030, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_DynamicCast_AsElectric_Trap_Container_BP' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_DynamicCast_AsElectric_Trap_Container_BP_1) == 0x000040, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_DynamicCast_AsElectric_Trap_Container_BP_1' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_ComponentBoundEvent_actorPrevis) == 0x000050, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_ComponentBoundEvent_actorPrevis' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_ComponentBoundEvent_runtimeChildActor) == 0x000058, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_ComponentBoundEvent_runtimeChildActor' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_DynamicCast_AsElectric_Trap_Container_BP_2) == 0x000068, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_DynamicCast_AsElectric_Trap_Container_BP_2' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_DynamicCast_bSuccess_3) == 0x000070, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_GetIsArmed_ReturnValue) == 0x000071, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_GetIsArmed_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_CustomEvent_bSnapToState) == 0x000072, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_CustomEvent_bSnapToState' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_HasAuthority_ReturnValue_2) == 0x000073, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_BP_GetInteractorPawns_ReturnValue) == 0x000078, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_BP_GetInteractorPawns_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_HasAuthority_ReturnValue_3) == 0x000088, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_Array_Get_Item) == 0x000090, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_DynamicCast_AsRB_Player) == 0x000098, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_DynamicCast_AsRB_Player' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_DynamicCast_bSuccess_4) == 0x0000A0, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000A1, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_GetTrapBatteryState_ReturnValue) == 0x0000A2, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_GetTrapBatteryState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_SwitchEnum_CmpSuccess) == 0x0000A3, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_ComponentBoundEvent_hackableComponent) == 0x0000A8, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_ComponentBoundEvent_hackableComponent' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_GetPlayerHacker_ReturnValue) == 0x0000B0, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_GetPlayerHacker_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_GetCurrentHackState_ReturnValue) == 0x0000B8, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_GetCurrentHackState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B9, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000BA, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_DynamicCast_AsDoor_Base_BP_1) == 0x0000C0, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_DynamicCast_AsDoor_Base_BP_1' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, K2Node_DynamicCast_bSuccess_5) == 0x0000C8, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_HasAuthority_ReturnValue_4) == 0x0000C9, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_HasAuthority_ReturnValue_5) == 0x0000CA, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_HasAuthority_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, Temp_delegate_Variable) == 0x0000CC, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP, CallFunc_PostEventOnActor_ReturnValue) == 0x0000DC, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_ExecuteUbergraph_TriggerTrap_BatteryPowered_Right_BP::CallFunc_PostEventOnActor_ReturnValue' has a wrong offset!");

// Function TriggerTrap_BatteryPowered_Right_BP.TriggerTrap_BatteryPowered_Right_BP_C.GetFriendlyDeviceIconLocation
// 0x001C (0x001C - 0x0000)
struct TriggerTrap_BatteryPowered_Right_BP_C_GetFriendlyDeviceIconLocation final
{
public:
	struct FVector                                Out_location;                                      // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerTrap_BatteryPowered_Right_BP_C_GetFriendlyDeviceIconLocation) == 0x000004, "Wrong alignment on TriggerTrap_BatteryPowered_Right_BP_C_GetFriendlyDeviceIconLocation");
static_assert(sizeof(TriggerTrap_BatteryPowered_Right_BP_C_GetFriendlyDeviceIconLocation) == 0x00001C, "Wrong size on TriggerTrap_BatteryPowered_Right_BP_C_GetFriendlyDeviceIconLocation");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_GetFriendlyDeviceIconLocation, Out_location) == 0x000000, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_GetFriendlyDeviceIconLocation::Out_location' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_GetFriendlyDeviceIconLocation, ReturnValue) == 0x00000C, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_GetFriendlyDeviceIconLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_GetFriendlyDeviceIconLocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_GetFriendlyDeviceIconLocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function TriggerTrap_BatteryPowered_Right_BP.TriggerTrap_BatteryPowered_Right_BP_C.GetLookAtLocation
// 0x0018 (0x0018 - 0x0000)
struct TriggerTrap_BatteryPowered_Right_BP_C_GetLookAtLocation final
{
public:
	struct FVector                                OutLookAtLocation;                                 // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerTrap_BatteryPowered_Right_BP_C_GetLookAtLocation) == 0x000004, "Wrong alignment on TriggerTrap_BatteryPowered_Right_BP_C_GetLookAtLocation");
static_assert(sizeof(TriggerTrap_BatteryPowered_Right_BP_C_GetLookAtLocation) == 0x000018, "Wrong size on TriggerTrap_BatteryPowered_Right_BP_C_GetLookAtLocation");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_GetLookAtLocation, OutLookAtLocation) == 0x000000, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_GetLookAtLocation::OutLookAtLocation' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_GetLookAtLocation, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00000C, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_GetLookAtLocation::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function TriggerTrap_BatteryPowered_Right_BP.TriggerTrap_BatteryPowered_Right_BP_C.GetInteractionPawnLocation
// 0x00E0 (0x00E0 - 0x0000)
struct TriggerTrap_BatteryPowered_Right_BP_C_GetInteractionPawnLocation final
{
public:
	const class ARBPawn*                          Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  SpecialMove;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutLocation;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutDirection;                                      // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0xB];                                       // 0x0025(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetWorldTransformFromAnimationAnchorByTransform_outLocation; // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWorldTransformFromAnimationAnchorByTransform_outDirection; // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TriggerTrap_BatteryPowered_Right_BP_C_GetInteractionPawnLocation) == 0x000010, "Wrong alignment on TriggerTrap_BatteryPowered_Right_BP_C_GetInteractionPawnLocation");
static_assert(sizeof(TriggerTrap_BatteryPowered_Right_BP_C_GetInteractionPawnLocation) == 0x0000E0, "Wrong size on TriggerTrap_BatteryPowered_Right_BP_C_GetInteractionPawnLocation");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_GetInteractionPawnLocation, Pawn) == 0x000000, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_GetInteractionPawnLocation::Pawn' has a wrong offset!");
static_assert(offsetof(TriggerTrap_BatteryPowered_Right_BP_C_GetInteractionPawnLocation, SpecialMove) == 0x000008, "Member 'TriggerTrap_BatteryPowered_Right_BP_C_GetInteractionPawnLocation::SpecialMove' has a wrong offset!");
