#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TripleMeshPopulate_BP

#include "Basic.hpp"

#include "StaticmeshArray_Stuc_structs.hpp"
#include "MeshPopulateDirection_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MeshPopulate_Parent_classes.hpp"
#include "ModuleMeshDataMinus02_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TripleMeshPopulate_BP.TripleMeshPopulate_BP_C
// 0x0070 (0x0440 - 0x03D0)
#pragma pack(push, 0x1)
class alignas(0x08) ATripleMeshPopulate_BP_C : public AMeshPopulate_Parent_C
{
public:
	EMeshPopulateDirection                        Direction;                                         // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FModuleMeshDataMinus02>         Body;                                              // 0x03D8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FModuleMeshDataMinus02>         Lower;                                             // 0x03E8(0x0010)(Edit, BlueprintVisible)
	TArray<struct FModuleMeshDataMinus02>         Upper;                                             // 0x03F8(0x0010)(Edit, BlueprintVisible)
	struct FVector                                Offset;                                            // 0x0408(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseShadowBox;                                      // 0x0414(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_415[0x3];                                      // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ShadowBoxOffset;                                   // 0x0418(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticmeshArray_Stuc>          AllStactimeshArray;                                // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          Z_Inverted;                                        // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TripleMeshPopulate_BP_C">();
	}
	static class ATripleMeshPopulate_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATripleMeshPopulate_BP_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ATripleMeshPopulate_BP_C) == 0x000008, "Wrong alignment on ATripleMeshPopulate_BP_C");
static_assert(sizeof(ATripleMeshPopulate_BP_C) == 0x000440, "Wrong size on ATripleMeshPopulate_BP_C");
static_assert(offsetof(ATripleMeshPopulate_BP_C, Direction) == 0x0003D0, "Member 'ATripleMeshPopulate_BP_C::Direction' has a wrong offset!");
static_assert(offsetof(ATripleMeshPopulate_BP_C, Body) == 0x0003D8, "Member 'ATripleMeshPopulate_BP_C::Body' has a wrong offset!");
static_assert(offsetof(ATripleMeshPopulate_BP_C, Lower) == 0x0003E8, "Member 'ATripleMeshPopulate_BP_C::Lower' has a wrong offset!");
static_assert(offsetof(ATripleMeshPopulate_BP_C, Upper) == 0x0003F8, "Member 'ATripleMeshPopulate_BP_C::Upper' has a wrong offset!");
static_assert(offsetof(ATripleMeshPopulate_BP_C, Offset) == 0x000408, "Member 'ATripleMeshPopulate_BP_C::Offset' has a wrong offset!");
static_assert(offsetof(ATripleMeshPopulate_BP_C, UseShadowBox) == 0x000414, "Member 'ATripleMeshPopulate_BP_C::UseShadowBox' has a wrong offset!");
static_assert(offsetof(ATripleMeshPopulate_BP_C, ShadowBoxOffset) == 0x000418, "Member 'ATripleMeshPopulate_BP_C::ShadowBoxOffset' has a wrong offset!");
static_assert(offsetof(ATripleMeshPopulate_BP_C, AllStactimeshArray) == 0x000428, "Member 'ATripleMeshPopulate_BP_C::AllStactimeshArray' has a wrong offset!");
static_assert(offsetof(ATripleMeshPopulate_BP_C, Z_Inverted) == 0x000438, "Member 'ATripleMeshPopulate_BP_C::Z_Inverted' has a wrong offset!");

}

