#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UpdateEsopBatteryNotify

#include "Basic.hpp"

#include "OPP_structs.hpp"


namespace SDK::Params
{

// Function UpdateEsopBatteryNotify.UpdateEsopBatteryNotify_C.Received_Notify
// 0x0080 (0x0080 - 0x0000)
struct UpdateEsopBatteryNotify_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARBPlayer_BP_C*                         K2Node_DynamicCast_AsRB_Player_BP;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemDefinition                        CallFunc_GetCurrentEquippedItemDefinition_ReturnValue; // 0x0030(0x0050)(ConstParm)
};
static_assert(alignof(UpdateEsopBatteryNotify_C_Received_Notify) == 0x000008, "Wrong alignment on UpdateEsopBatteryNotify_C_Received_Notify");
static_assert(sizeof(UpdateEsopBatteryNotify_C_Received_Notify) == 0x000080, "Wrong size on UpdateEsopBatteryNotify_C_Received_Notify");
static_assert(offsetof(UpdateEsopBatteryNotify_C_Received_Notify, MeshComp) == 0x000000, "Member 'UpdateEsopBatteryNotify_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(UpdateEsopBatteryNotify_C_Received_Notify, Animation) == 0x000008, "Member 'UpdateEsopBatteryNotify_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(UpdateEsopBatteryNotify_C_Received_Notify, ReturnValue) == 0x000010, "Member 'UpdateEsopBatteryNotify_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(UpdateEsopBatteryNotify_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'UpdateEsopBatteryNotify_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(UpdateEsopBatteryNotify_C_Received_Notify, K2Node_DynamicCast_AsRB_Player_BP) == 0x000020, "Member 'UpdateEsopBatteryNotify_C_Received_Notify::K2Node_DynamicCast_AsRB_Player_BP' has a wrong offset!");
static_assert(offsetof(UpdateEsopBatteryNotify_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UpdateEsopBatteryNotify_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UpdateEsopBatteryNotify_C_Received_Notify, CallFunc_GetCurrentEquippedItemDefinition_ReturnValue) == 0x000030, "Member 'UpdateEsopBatteryNotify_C_Received_Notify::CallFunc_GetCurrentEquippedItemDefinition_ReturnValue' has a wrong offset!");

// Function UpdateEsopBatteryNotify.UpdateEsopBatteryNotify_C.GetNotifyName
// 0x0010 (0x0010 - 0x0000)
struct UpdateEsopBatteryNotify_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(UpdateEsopBatteryNotify_C_GetNotifyName) == 0x000008, "Wrong alignment on UpdateEsopBatteryNotify_C_GetNotifyName");
static_assert(sizeof(UpdateEsopBatteryNotify_C_GetNotifyName) == 0x000010, "Wrong size on UpdateEsopBatteryNotify_C_GetNotifyName");
static_assert(offsetof(UpdateEsopBatteryNotify_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'UpdateEsopBatteryNotify_C_GetNotifyName::ReturnValue' has a wrong offset!");

}

