#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValuablesSafeDrop_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ValuablesSafeDrop_BP.ValuablesSafeDrop_BP_C
// 0x0078 (0x02A8 - 0x0230)
class AValuablesSafeDrop_BP_C final : public AActor
{
public:
	class URBActorPrevisComponent*                RBActorPrevis;                                     // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Boat;                                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UValuablesSafeDrop_InteractionPanel_BP_C* ValuablesSafeDrop_InteractionPanel_BP;             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSoundComponent*                      RBSound;                                           // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AnimAnchor;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBPingComponent*                       RBPing;                                            // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Arrow;                                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LargeObjectRef1;                                   // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBObjectiveActorComponent*             RBObjectiveActor;                                  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBRandomizableHelperComponent*         RBRandomizableHelper;                              // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DoorCollisionDisabledTimestamp;                    // 0x0288(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartingArrowRelativePitch;                        // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLoopingIdleSound;                               // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          IdleLoopingSoundStart;                             // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          IdleLoopingSoundStop;                              // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ValuablesSafeDrop_BP_C">();
	}
	static class AValuablesSafeDrop_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AValuablesSafeDrop_BP_C>();
	}
};
static_assert(alignof(AValuablesSafeDrop_BP_C) == 0x000008, "Wrong alignment on AValuablesSafeDrop_BP_C");
static_assert(sizeof(AValuablesSafeDrop_BP_C) == 0x0002A8, "Wrong size on AValuablesSafeDrop_BP_C");
static_assert(offsetof(AValuablesSafeDrop_BP_C, RBActorPrevis) == 0x000230, "Member 'AValuablesSafeDrop_BP_C::RBActorPrevis' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, Boat) == 0x000238, "Member 'AValuablesSafeDrop_BP_C::Boat' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, ValuablesSafeDrop_InteractionPanel_BP) == 0x000240, "Member 'AValuablesSafeDrop_BP_C::ValuablesSafeDrop_InteractionPanel_BP' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, RBSound) == 0x000248, "Member 'AValuablesSafeDrop_BP_C::RBSound' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, AnimAnchor) == 0x000250, "Member 'AValuablesSafeDrop_BP_C::AnimAnchor' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, RBPing) == 0x000258, "Member 'AValuablesSafeDrop_BP_C::RBPing' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, Arrow) == 0x000260, "Member 'AValuablesSafeDrop_BP_C::Arrow' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, LargeObjectRef1) == 0x000268, "Member 'AValuablesSafeDrop_BP_C::LargeObjectRef1' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, RBObjectiveActor) == 0x000270, "Member 'AValuablesSafeDrop_BP_C::RBObjectiveActor' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, RBRandomizableHelper) == 0x000278, "Member 'AValuablesSafeDrop_BP_C::RBRandomizableHelper' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, DefaultSceneRoot) == 0x000280, "Member 'AValuablesSafeDrop_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, DoorCollisionDisabledTimestamp) == 0x000288, "Member 'AValuablesSafeDrop_BP_C::DoorCollisionDisabledTimestamp' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, StartingArrowRelativePitch) == 0x00028C, "Member 'AValuablesSafeDrop_BP_C::StartingArrowRelativePitch' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, bIsLoopingIdleSound) == 0x000290, "Member 'AValuablesSafeDrop_BP_C::bIsLoopingIdleSound' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, IdleLoopingSoundStart) == 0x000298, "Member 'AValuablesSafeDrop_BP_C::IdleLoopingSoundStart' has a wrong offset!");
static_assert(offsetof(AValuablesSafeDrop_BP_C, IdleLoopingSoundStop) == 0x0002A0, "Member 'AValuablesSafeDrop_BP_C::IdleLoopingSoundStop' has a wrong offset!");

}

