#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValuablesSafeDrop_InteractionPanel_BP

#include "Basic.hpp"

#include "OPP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ValuablesSafeDrop_InteractionPanel_BP.ValuablesSafeDrop_InteractionPanel_BP_C.GetLargeObjectRef
// 0x0058 (0x0058 - 0x0000)
struct ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef final
{
public:
	class ARBLargePickup*                         Pickup;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_HasValidItem_Variable;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetComponentsByTag_ReturnValue;           // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef) == 0x000008, "Wrong alignment on ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef");
static_assert(sizeof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef) == 0x000058, "Wrong size on ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, Pickup) == 0x000000, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::Pickup' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, ReturnValue) == 0x000008, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::ReturnValue' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, Temp_int_Array_Index_Variable) == 0x000010, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, Temp_bool_True_if_break_was_hit_Variable) == 0x00001C, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, Temp_bool_HasValidItem_Variable) == 0x00001E, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::Temp_bool_HasValidItem_Variable' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, CallFunc_GetComponentsByTag_ReturnValue) == 0x000028, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000038, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, CallFunc_Array_Get_Item) == 0x000040, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetLargeObjectRef::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ValuablesSafeDrop_InteractionPanel_BP.ValuablesSafeDrop_InteractionPanel_BP_C.GetInteractionPawnLocation
// 0x00D0 (0x00D0 - 0x0000)
struct ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation final
{
public:
	const class ARBPawn*                          Pawn;                                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpecialMove                                  SpecialMove;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutLocation;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OutDirection;                                      // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AValuablesSafeDrop_BP_C*                K2Node_DynamicCast_AsValuables_Safe_Drop_BP;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetWorldTransformMatrixFromAnimationAnchorByTransform_outTransform; // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation) == 0x000010, "Wrong alignment on ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation");
static_assert(sizeof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation) == 0x0000D0, "Wrong size on ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation, Pawn) == 0x000000, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation::Pawn' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation, SpecialMove) == 0x000008, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation::SpecialMove' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation, OutLocation) == 0x00000C, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation::OutLocation' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation, OutDirection) == 0x000018, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation::OutDirection' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation, ReturnValue) == 0x000024, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation, K2Node_DynamicCast_AsValuables_Safe_Drop_BP) == 0x000030, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation::K2Node_DynamicCast_AsValuables_Safe_Drop_BP' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation, CallFunc_GetWorldTransformMatrixFromAnimationAnchorByTransform_outTransform) == 0x000070, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation::CallFunc_GetWorldTransformMatrixFromAnimationAnchorByTransform_outTransform' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation, CallFunc_BreakTransform_Location) == 0x0000A0, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation, CallFunc_BreakTransform_Rotation) == 0x0000AC, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation, CallFunc_BreakTransform_Scale) == 0x0000B8, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x0000C4, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetInteractionPawnLocation::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");

// Function ValuablesSafeDrop_InteractionPanel_BP.ValuablesSafeDrop_InteractionPanel_BP_C.GetSpecialMoveAnimation
// 0x0038 (0x0038 - 0x0000)
struct ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation final
{
public:
	class ARBPawn*                                Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstPerson;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPawnCloseToObject;                              // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation) == 0x000008, "Wrong alignment on ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation");
static_assert(sizeof(ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation) == 0x000038, "Wrong size on ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation, Pawn) == 0x000000, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation::Pawn' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation, bIsFirstPerson) == 0x000008, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation::bIsFirstPerson' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation, bIsPawnCloseToObject) == 0x000009, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation::bIsPawnCloseToObject' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation, ReturnValue) == 0x000010, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation::ReturnValue' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation, Temp_bool_Variable) == 0x000018, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation, Temp_object_Variable) == 0x000020, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation, Temp_object_Variable_1) == 0x000028, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation, K2Node_Select_Default) == 0x000030, "Member 'ValuablesSafeDrop_InteractionPanel_BP_C_GetSpecialMoveAnimation::K2Node_Select_Default' has a wrong offset!");

}

