#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValveUnlockingMinusButton_BP

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ValveUnlocking-Button_BP.ValveUnlocking-Button_BP_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct ValveUnlockingMinusButton_BP_C_UserConstructionScript final
{
public:
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ValveUnlockingMinusButton_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on ValveUnlockingMinusButton_BP_C_UserConstructionScript");
static_assert(sizeof(ValveUnlockingMinusButton_BP_C_UserConstructionScript) == 0x000010, "Wrong size on ValveUnlockingMinusButton_BP_C_UserConstructionScript");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000000, "Member 'ValveUnlockingMinusButton_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");

// Function ValveUnlocking-Button_BP.ValveUnlocking-Button_BP_C.TickTimer
// 0x0050 (0x0050 - 0x0000)
struct ValveUnlockingMinusButton_BP_C_TickTimer final
{
public:
	float                                         TimeLeftRatio;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetDelayedReleaseTimeLeftRatio_ReturnValue; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ValveUnlockingMinusButton_BP_C_TickTimer) == 0x000008, "Wrong alignment on ValveUnlockingMinusButton_BP_C_TickTimer");
static_assert(sizeof(ValveUnlockingMinusButton_BP_C_TickTimer) == 0x000050, "Wrong size on ValveUnlockingMinusButton_BP_C_TickTimer");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_TickTimer, TimeLeftRatio) == 0x000000, "Member 'ValveUnlockingMinusButton_BP_C_TickTimer::TimeLeftRatio' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_TickTimer, Temp_struct_Variable) == 0x000008, "Member 'ValveUnlockingMinusButton_BP_C_TickTimer::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_TickTimer, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000018, "Member 'ValveUnlockingMinusButton_BP_C_TickTimer::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_TickTimer, Temp_delegate_Variable) == 0x00001C, "Member 'ValveUnlockingMinusButton_BP_C_TickTimer::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_TickTimer, CallFunc_GetDelayedReleaseTimeLeftRatio_ReturnValue) == 0x00002C, "Member 'ValveUnlockingMinusButton_BP_C_TickTimer::CallFunc_GetDelayedReleaseTimeLeftRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_TickTimer, CallFunc_PostAkEvent_ReturnValue) == 0x000030, "Member 'ValveUnlockingMinusButton_BP_C_TickTimer::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_TickTimer, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'ValveUnlockingMinusButton_BP_C_TickTimer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_TickTimer, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000038, "Member 'ValveUnlockingMinusButton_BP_C_TickTimer::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_TickTimer, CallFunc_FFloor_ReturnValue) == 0x00003C, "Member 'ValveUnlockingMinusButton_BP_C_TickTimer::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_TickTimer, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'ValveUnlockingMinusButton_BP_C_TickTimer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_TickTimer, CallFunc_SelectInt_ReturnValue) == 0x000044, "Member 'ValveUnlockingMinusButton_BP_C_TickTimer::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_TickTimer, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000048, "Member 'ValveUnlockingMinusButton_BP_C_TickTimer::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function ValveUnlocking-Button_BP.ValveUnlocking-Button_BP_C.RefreshTimerDiodesVisual
// 0x0050 (0x0050 - 0x0000)
struct ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual) == 0x000008, "Wrong alignment on ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual");
static_assert(sizeof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual) == 0x000050, "Wrong size on ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000014, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, CallFunc_Less_IntInt_ReturnValue) == 0x000015, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, CallFunc_Array_Get_Item) == 0x000030, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, CallFunc_Less_IntInt_ReturnValue_1) == 0x000048, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, CallFunc_Less_IntInt_ReturnValue_2) == 0x000049, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual, CallFunc_IsEnabled_ReturnValue) == 0x00004A, "Member 'ValveUnlockingMinusButton_BP_C_RefreshTimerDiodesVisual::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");

// Function ValveUnlocking-Button_BP.ValveUnlocking-Button_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ValveUnlockingMinusButton_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ValveUnlockingMinusButton_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on ValveUnlockingMinusButton_BP_C_ReceiveTick");
static_assert(sizeof(ValveUnlockingMinusButton_BP_C_ReceiveTick) == 0x000004, "Wrong size on ValveUnlockingMinusButton_BP_C_ReceiveTick");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ValveUnlockingMinusButton_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ValveUnlocking-Button_BP.ValveUnlocking-Button_BP_C.BndEvt__ValveUnlocking-Button_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnCoopOperatableEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ValveUnlockingMinusButton_BP_C_BndEvt__ValveUnlockingMinusButton_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnCoopOperatableEvent__DelegateSignature final
{
public:
	class URBCoopOperatableComponent*             Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ValveUnlockingMinusButton_BP_C_BndEvt__ValveUnlockingMinusButton_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnCoopOperatableEvent__DelegateSignature) == 0x000008, "Wrong alignment on ValveUnlockingMinusButton_BP_C_BndEvt__ValveUnlockingMinusButton_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnCoopOperatableEvent__DelegateSignature");
static_assert(sizeof(ValveUnlockingMinusButton_BP_C_BndEvt__ValveUnlockingMinusButton_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnCoopOperatableEvent__DelegateSignature) == 0x000008, "Wrong size on ValveUnlockingMinusButton_BP_C_BndEvt__ValveUnlockingMinusButton_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnCoopOperatableEvent__DelegateSignature");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_BndEvt__ValveUnlockingMinusButton_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnCoopOperatableEvent__DelegateSignature, Component) == 0x000000, "Member 'ValveUnlockingMinusButton_BP_C_BndEvt__ValveUnlockingMinusButton_BP_OperatableComponent_K2Node_ComponentBoundEvent_0_OnCoopOperatableEvent__DelegateSignature::Component' has a wrong offset!");

// Function ValveUnlocking-Button_BP.ValveUnlocking-Button_BP_C.BndEvt__ValveUnlocking-Button_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnEnabledChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ValveUnlockingMinusButton_BP_C_BndEvt__ValveUnlockingMinusButton_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnEnabledChanged__DelegateSignature final
{
public:
	class URBInteractionZoneComponent*            Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ValveUnlockingMinusButton_BP_C_BndEvt__ValveUnlockingMinusButton_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnEnabledChanged__DelegateSignature) == 0x000008, "Wrong alignment on ValveUnlockingMinusButton_BP_C_BndEvt__ValveUnlockingMinusButton_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnEnabledChanged__DelegateSignature");
static_assert(sizeof(ValveUnlockingMinusButton_BP_C_BndEvt__ValveUnlockingMinusButton_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnEnabledChanged__DelegateSignature) == 0x000008, "Wrong size on ValveUnlockingMinusButton_BP_C_BndEvt__ValveUnlockingMinusButton_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnEnabledChanged__DelegateSignature");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_BndEvt__ValveUnlockingMinusButton_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnEnabledChanged__DelegateSignature, Component) == 0x000000, "Member 'ValveUnlockingMinusButton_BP_C_BndEvt__ValveUnlockingMinusButton_BP_OperatableComponent_K2Node_ComponentBoundEvent_1_OnEnabledChanged__DelegateSignature::Component' has a wrong offset!");

// Function ValveUnlocking-Button_BP.ValveUnlocking-Button_BP_C.ExecuteUbergraph_ValveUnlocking-Button_BP
// 0x0048 (0x0048 - 0x0000)
struct ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URBCoopOperatableComponent*             K2Node_ComponentBoundEvent_component_1;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URBInteractionZoneComponent*            K2Node_ComponentBoundEvent_component;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP) == 0x000008, "Wrong alignment on ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP");
static_assert(sizeof(ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP) == 0x000048, "Wrong size on ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP, EntryPoint) == 0x000000, "Member 'ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP, CallFunc_IsEnabled_ReturnValue) == 0x000004, "Member 'ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP, Temp_int_Array_Index_Variable) == 0x000008, "Member 'ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP, CallFunc_SelectFloat_ReturnValue) == 0x00000C, "Member 'ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP, K2Node_ComponentBoundEvent_component_1) == 0x000020, "Member 'ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP::K2Node_ComponentBoundEvent_component_1' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP, K2Node_ComponentBoundEvent_component) == 0x000028, "Member 'ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP::K2Node_ComponentBoundEvent_component' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP, CallFunc_Array_Get_Item) == 0x000038, "Member 'ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'ValveUnlockingMinusButton_BP_C_ExecuteUbergraph_ValveUnlockingMinusButton_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ValveUnlocking-Button_BP.ValveUnlocking-Button_BP_C.ShouldTick
// 0x0003 (0x0003 - 0x0000)
struct ValveUnlockingMinusButton_BP_C_ShouldTick final
{
public:
	bool                                          bShouldTick;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ValveUnlockingMinusButton_BP_C_ShouldTick) == 0x000001, "Wrong alignment on ValveUnlockingMinusButton_BP_C_ShouldTick");
static_assert(sizeof(ValveUnlockingMinusButton_BP_C_ShouldTick) == 0x000003, "Wrong size on ValveUnlockingMinusButton_BP_C_ShouldTick");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ShouldTick, bShouldTick) == 0x000000, "Member 'ValveUnlockingMinusButton_BP_C_ShouldTick::bShouldTick' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ShouldTick, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000001, "Member 'ValveUnlockingMinusButton_BP_C_ShouldTick::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValveUnlockingMinusButton_BP_C_ShouldTick, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'ValveUnlockingMinusButton_BP_C_ShouldTick::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

