#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WagonMetalWindowMinus01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WagonMetalWindow-01.WagonMetalWindow-01_C.ExecuteUbergraph_WagonMetalWindow-01
// 0x014C (0x014C - 0x0000)
struct WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x003C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01) == 0x000004, "Wrong alignment on WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01");
static_assert(sizeof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01) == 0x00014C, "Wrong size on WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01");
static_assert(offsetof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01, EntryPoint) == 0x000000, "Member 'WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01::EntryPoint' has a wrong offset!");
static_assert(offsetof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01, CallFunc_Lerp_ReturnValue_1) == 0x000008, "Member 'WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01, CallFunc_BreakVector_X) == 0x00000C, "Member 'WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01, CallFunc_BreakVector_Y) == 0x000010, "Member 'WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01, CallFunc_BreakVector_Z) == 0x000014, "Member 'WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01, CallFunc_BreakVector_X_1) == 0x000018, "Member 'WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01, CallFunc_BreakVector_Y_1) == 0x00001C, "Member 'WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01, CallFunc_BreakVector_Z_1) == 0x000020, "Member 'WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01, CallFunc_MakeVector_ReturnValue) == 0x000024, "Member 'WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01, CallFunc_MakeVector_ReturnValue_1) == 0x000030, "Member 'WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00003C, "Member 'WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0000C4, "Member 'WagonMetalWindowMinus01_C_ExecuteUbergraph_WagonMetalWindowMinus01::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");

}

