#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WallLampMinus07

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WallLamp-07.WallLamp-07_C
// 0x0020 (0x0790 - 0x0770)
class AWallLampMinus07_C final : public ARBLight_BP_C
{
public:
	class URBSpotLightComponent*                  SpotLight_Static;                                  // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  SpotLight_Movable;                                 // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight_Dual;                                   // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WallLamp-07_C">();
	}
	static class AWallLampMinus07_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWallLampMinus07_C>();
	}
};
static_assert(alignof(AWallLampMinus07_C) == 0x000010, "Wrong alignment on AWallLampMinus07_C");
static_assert(sizeof(AWallLampMinus07_C) == 0x000790, "Wrong size on AWallLampMinus07_C");
static_assert(offsetof(AWallLampMinus07_C, SpotLight_Static) == 0x000770, "Member 'AWallLampMinus07_C::SpotLight_Static' has a wrong offset!");
static_assert(offsetof(AWallLampMinus07_C, SpotLight_Movable) == 0x000778, "Member 'AWallLampMinus07_C::SpotLight_Movable' has a wrong offset!");
static_assert(offsetof(AWallLampMinus07_C, PointLight_Dual) == 0x000780, "Member 'AWallLampMinus07_C::PointLight_Dual' has a wrong offset!");

}

