#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WallLampMinus08

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WallLamp-08.WallLamp-08_C
// 0x0020 (0x0790 - 0x0770)
class AWallLampMinus08_C final : public ARBLight_BP_C
{
public:
	class URBSpotLightComponent*                  RBSpotLight_Static1;                               // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight_Static;                                // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBVolumetricFogLightComponent*         RBVolumetricFogLight;                              // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight_Dual;                                   // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WallLamp-08_C">();
	}
	static class AWallLampMinus08_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWallLampMinus08_C>();
	}
};
static_assert(alignof(AWallLampMinus08_C) == 0x000010, "Wrong alignment on AWallLampMinus08_C");
static_assert(sizeof(AWallLampMinus08_C) == 0x000790, "Wrong size on AWallLampMinus08_C");
static_assert(offsetof(AWallLampMinus08_C, RBSpotLight_Static1) == 0x000770, "Member 'AWallLampMinus08_C::RBSpotLight_Static1' has a wrong offset!");
static_assert(offsetof(AWallLampMinus08_C, RBSpotLight_Static) == 0x000778, "Member 'AWallLampMinus08_C::RBSpotLight_Static' has a wrong offset!");
static_assert(offsetof(AWallLampMinus08_C, RBVolumetricFogLight) == 0x000780, "Member 'AWallLampMinus08_C::RBVolumetricFogLight' has a wrong offset!");
static_assert(offsetof(AWallLampMinus08_C, PointLight_Dual) == 0x000788, "Member 'AWallLampMinus08_C::PointLight_Dual' has a wrong offset!");

}

