#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WallIndustrialLampMinus03

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WallIndustrialLamp-03.WallIndustrialLamp-03_C
// 0x0020 (0x0790 - 0x0770)
class AWallIndustrialLampMinus03_C final : public ARBLight_BP_C
{
public:
	class UStaticMeshComponent*                   FluorescentMinus01;                                // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Movable;                                 // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Static;                                  // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WallIndustrialLamp-03_C">();
	}
	static class AWallIndustrialLampMinus03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWallIndustrialLampMinus03_C>();
	}
};
static_assert(alignof(AWallIndustrialLampMinus03_C) == 0x000010, "Wrong alignment on AWallIndustrialLampMinus03_C");
static_assert(sizeof(AWallIndustrialLampMinus03_C) == 0x000790, "Wrong size on AWallIndustrialLampMinus03_C");
static_assert(offsetof(AWallIndustrialLampMinus03_C, FluorescentMinus01) == 0x000770, "Member 'AWallIndustrialLampMinus03_C::FluorescentMinus01' has a wrong offset!");
static_assert(offsetof(AWallIndustrialLampMinus03_C, SpotLight_Movable) == 0x000778, "Member 'AWallIndustrialLampMinus03_C::SpotLight_Movable' has a wrong offset!");
static_assert(offsetof(AWallIndustrialLampMinus03_C, SpotLight_Static) == 0x000780, "Member 'AWallIndustrialLampMinus03_C::SpotLight_Static' has a wrong offset!");

}

