#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WallIndustrialLampMinus04

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WallIndustrialLamp-04.WallIndustrialLamp-04_C
// 0x0020 (0x0790 - 0x0770)
class AWallIndustrialLampMinus04_C final : public ARBLight_BP_C
{
public:
	class URBSpotLightComponent*                  RBSpotLight_Movable;                               // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  RBSpotLight_Static;                                // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LightCageMinus01;                                  // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WallIndustrialLamp-04_C">();
	}
	static class AWallIndustrialLampMinus04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWallIndustrialLampMinus04_C>();
	}
};
static_assert(alignof(AWallIndustrialLampMinus04_C) == 0x000010, "Wrong alignment on AWallIndustrialLampMinus04_C");
static_assert(sizeof(AWallIndustrialLampMinus04_C) == 0x000790, "Wrong size on AWallIndustrialLampMinus04_C");
static_assert(offsetof(AWallIndustrialLampMinus04_C, RBSpotLight_Movable) == 0x000770, "Member 'AWallIndustrialLampMinus04_C::RBSpotLight_Movable' has a wrong offset!");
static_assert(offsetof(AWallIndustrialLampMinus04_C, RBSpotLight_Static) == 0x000778, "Member 'AWallIndustrialLampMinus04_C::RBSpotLight_Static' has a wrong offset!");
static_assert(offsetof(AWallIndustrialLampMinus04_C, LightCageMinus01) == 0x000780, "Member 'AWallIndustrialLampMinus04_C::LightCageMinus01' has a wrong offset!");

}

