#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WallMinus01_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ModuleMeshData_structs.hpp"
#include "ModuleAlternativeMeshData_structs.hpp"
#include "WallEnd_Enu_structs.hpp"
#include "WallSide_Enu_structs.hpp"
#include "StaticmeshArray_Stuc_structs.hpp"
#include "Engine_structs.hpp"
#include "ModuleMeshDataMinus02_structs.hpp"
#include "MeshPopulateDirection_structs.hpp"


namespace SDK::Params
{

// Function Wall-01_BP.Wall-01_BP_C.UserConstructionScript
// 0x0428 (0x0428 - 0x0000)
struct WallMinus01_BP_C_UserConstructionScript final
{
public:
	struct FVector                                _LastLocation;                                     // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _NewSize;                                          // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _yLocationMax;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModuleMeshDataMinus02                 CallFunc_Array_Get_Item;                           // 0x0020(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModuleMeshDataMinus02                 CallFunc_Array_Get_Item_1;                         // 0x0040(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateSurface_LastLocation;             // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes;          // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateSurface_LastLocation_1;           // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize_1;          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale_1;            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes_1;        // 0x00C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount_1;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize_1;      // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale_1;             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateSurface_LastLocation_2;           // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize_2;          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale_2;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes_2;        // 0x0108(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount_2;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize_2;      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale_2;             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateRow_LastLocation;                 // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_PopulateRow_StaticmeshComponents1;        // 0x0170(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_PopulateRow_LastAlphaMeshSize;            // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateRow_AlphaScale;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateRow_LastLocation_1;               // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_PopulateRow_StaticmeshComponents1_1;      // 0x0198(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_PopulateRow_LastAlphaMeshSize_1;          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateRow_AlphaScale_1;                 // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateRow_LastLocation_2;               // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_PopulateRow_StaticmeshComponents1_2;      // 0x01C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_PopulateRow_LastAlphaMeshSize_2;          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateRow_AlphaScale_2;                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateRow_LastLocation_3;               // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_PopulateRow_StaticmeshComponents1_3;      // 0x01F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_PopulateRow_LastAlphaMeshSize_3;          // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateRow_AlphaScale_3;                 // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateSurface_LastLocation_3;           // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize_3;          // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale_3;            // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes_3;        // 0x0228(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount_3;               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize_3;      // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale_3;             // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_3;      // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_4;      // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_5;      // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_6;      // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_7;      // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_8;      // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetGap_NumberOfInbetween;                 // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetGap_TotalInbetweenSize;                // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetGap_GapTotal;                          // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FModuleMeshDataMinus02                 K2Node_MakeStruct_ModuleMeshData_02;               // 0x02E0(0x0018)(HasGetValueTypeHash)
	TArray<struct FModuleMeshDataMinus02>         K2Node_MakeArray_Array;                            // 0x02F8(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue_5;                 // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateSurface_LastLocation_4;           // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize_4;          // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale_4;            // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes_4;        // 0x0328(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount_4;               // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize_4;      // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale_4;             // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateRow_LastLocation_4;               // 0x0344(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_PopulateRow_StaticmeshComponents1_4;      // 0x0350(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_PopulateRow_LastAlphaMeshSize_4;          // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateRow_AlphaScale_4;                 // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_PopulateSurface_LastLocation_5;           // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize_5;          // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale_5;            // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes_5;        // 0x0380(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount_5;               // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize_5;      // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale_5;             // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x03A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x03B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PopulateSurface_LastLocation_6;           // 0x03C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_MaxSecondSize_6;          // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_SecondScale_6;            // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticmeshArray_Stuc>          CallFunc_PopulateSurface_AllStactimeshes_6;        // 0x03D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_PopulateSurface_RowCount_6;               // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_LastAlphaMeshSize_6;      // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PopulateSurface_AlphaScale_6;             // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default_1;                           // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_setVariable_NewSize;                      // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WallMinus01_BP_C_UserConstructionScript) == 0x000008, "Wrong alignment on WallMinus01_BP_C_UserConstructionScript");
static_assert(sizeof(WallMinus01_BP_C_UserConstructionScript) == 0x000428, "Wrong size on WallMinus01_BP_C_UserConstructionScript");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, _LastLocation) == 0x000000, "Member 'WallMinus01_BP_C_UserConstructionScript::_LastLocation' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, _NewSize) == 0x00000C, "Member 'WallMinus01_BP_C_UserConstructionScript::_NewSize' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, _yLocationMax) == 0x000018, "Member 'WallMinus01_BP_C_UserConstructionScript::_yLocationMax' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, Temp_bool_Variable) == 0x00001C, "Member 'WallMinus01_BP_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, Temp_bool_Variable_1) == 0x00001D, "Member 'WallMinus01_BP_C_UserConstructionScript::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000020, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000039, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00003A, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00003B, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue) == 0x000058, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue_1) == 0x000059, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue_2) == 0x00005A, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue_3) == 0x00005B, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue_4) == 0x00005C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue_5) == 0x00005D, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue_6) == 0x00005E, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Not_PreBool_ReturnValue_7) == 0x00005F, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000060, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x00006C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000078, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation) == 0x000084, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize) == 0x000090, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale) == 0x000094, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes) == 0x000098, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount) == 0x0000A8, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize) == 0x0000AC, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale) == 0x0000B0, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation_1) == 0x0000B4, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize_1) == 0x0000C0, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale_1) == 0x0000C4, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes_1) == 0x0000C8, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount_1) == 0x0000D8, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize_1) == 0x0000DC, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale_1) == 0x0000E0, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0000E4, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation_2) == 0x0000F0, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize_2) == 0x0000FC, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale_2) == 0x000100, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes_2) == 0x000108, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount_2) == 0x000118, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize_2) == 0x00011C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale_2) == 0x000120, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x000124, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000130, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000134, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000138, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_1) == 0x00013C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_1) == 0x000140, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_1) == 0x000144, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_2) == 0x000148, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_2) == 0x000154, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_2) == 0x000158, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_2) == 0x00015C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastLocation) == 0x000160, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastLocation' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_StaticmeshComponents1) == 0x000170, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_StaticmeshComponents1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastAlphaMeshSize) == 0x000180, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastAlphaMeshSize' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_AlphaScale) == 0x000184, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_AlphaScale' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastLocation_1) == 0x000188, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastLocation_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_StaticmeshComponents1_1) == 0x000198, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_StaticmeshComponents1_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastAlphaMeshSize_1) == 0x0001A8, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastAlphaMeshSize_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_AlphaScale_1) == 0x0001AC, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_AlphaScale_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_3) == 0x0001B0, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastLocation_2) == 0x0001BC, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastLocation_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_StaticmeshComponents1_2) == 0x0001C8, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_StaticmeshComponents1_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastAlphaMeshSize_2) == 0x0001D8, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastAlphaMeshSize_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_AlphaScale_2) == 0x0001DC, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_AlphaScale_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_3) == 0x0001E0, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_3) == 0x0001E4, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_3) == 0x0001E8, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastLocation_3) == 0x0001EC, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastLocation_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_StaticmeshComponents1_3) == 0x0001F8, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_StaticmeshComponents1_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastAlphaMeshSize_3) == 0x000208, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastAlphaMeshSize_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_AlphaScale_3) == 0x00020C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_AlphaScale_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation_3) == 0x000210, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize_3) == 0x00021C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale_3) == 0x000220, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes_3) == 0x000228, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount_3) == 0x000238, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize_3) == 0x00023C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale_3) == 0x000240, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000244, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue_3) == 0x000250, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue_4) == 0x00025C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue_5) == 0x000268, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_X_4) == 0x000274, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Y_4) == 0x000278, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_BreakVector_Z_4) == 0x00027C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue_6) == 0x000280, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x00028C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue_7) == 0x000298, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_4) == 0x0002A4, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002B0, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue_8) == 0x0002BC, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_SetGap_NumberOfInbetween) == 0x0002C8, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_SetGap_NumberOfInbetween' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_SetGap_TotalInbetweenSize) == 0x0002CC, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_SetGap_TotalInbetweenSize' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_SetGap_GapTotal) == 0x0002D0, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_SetGap_GapTotal' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, K2Node_MakeStruct_ModuleMeshData_02) == 0x0002E0, "Member 'WallMinus01_BP_C_UserConstructionScript::K2Node_MakeStruct_ModuleMeshData_02' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x0002F8, "Member 'WallMinus01_BP_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_5) == 0x000308, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation_4) == 0x000314, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize_4) == 0x000320, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale_4) == 0x000324, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes_4) == 0x000328, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount_4) == 0x000338, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize_4) == 0x00033C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale_4) == 0x000340, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastLocation_4) == 0x000344, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastLocation_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_StaticmeshComponents1_4) == 0x000350, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_StaticmeshComponents1_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_LastAlphaMeshSize_4) == 0x000360, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_LastAlphaMeshSize_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateRow_AlphaScale_4) == 0x000364, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateRow_AlphaScale_4' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000368, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation_5) == 0x00036C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation_5' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize_5) == 0x000378, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize_5' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale_5) == 0x00037C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale_5' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes_5) == 0x000380, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes_5' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount_5) == 0x000390, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount_5' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize_5) == 0x000394, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize_5' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale_5) == 0x000398, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale_5' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x00039C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0003A0, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0003A4, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, K2Node_Select_Default) == 0x0003A8, "Member 'WallMinus01_BP_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0003B4, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastLocation_6) == 0x0003C0, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastLocation_6' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_MaxSecondSize_6) == 0x0003CC, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_MaxSecondSize_6' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_SecondScale_6) == 0x0003D0, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_SecondScale_6' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AllStactimeshes_6) == 0x0003D8, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AllStactimeshes_6' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_RowCount_6) == 0x0003E8, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_RowCount_6' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_LastAlphaMeshSize_6) == 0x0003EC, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_LastAlphaMeshSize_6' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_PopulateSurface_AlphaScale_6) == 0x0003F0, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_PopulateSurface_AlphaScale_6' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0003F4, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0003F8, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0003FC, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, K2Node_Select_Default_1) == 0x000400, "Member 'WallMinus01_BP_C_UserConstructionScript::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_setVariable_NewSize) == 0x00040C, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_setVariable_NewSize' has a wrong offset!");
static_assert(offsetof(WallMinus01_BP_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000418, "Member 'WallMinus01_BP_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");

// Function Wall-01_BP.Wall-01_BP_C.ExcludeStructForAutomaticCollision
// 0x0078 (0x0078 - 0x0000)
struct WallMinus01_BP_C_ExcludeStructForAutomaticCollision final
{
public:
	TArray<struct FModuleMeshData>                Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
