#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WallLampMinus03

#include "Basic.hpp"

#include "RBLight_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WallLamp-03.WallLamp-03_C
// 0x0020 (0x0790 - 0x0770)
class AWallLampMinus03_C final : public ARBLight_BP_C
{
public:
	class URBSpotLightComponent*                  RBSpotLight_Static;                                // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBSpotLightComponent*                  SpotLight_Movable;                                 // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URBVolumetricFogLightComponent*         RBVolumetricFogLight;                              // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1_Dual;                                  // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WallLamp-03_C">();
	}
	static class AWallLampMinus03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWallLampMinus03_C>();
	}
};
static_assert(alignof(AWallLampMinus03_C) == 0x000010, "Wrong alignment on AWallLampMinus03_C");
static_assert(sizeof(AWallLampMinus03_C) == 0x000790, "Wrong size on AWallLampMinus03_C");
static_assert(offsetof(AWallLampMinus03_C, RBSpotLight_Static) == 0x000770, "Member 'AWallLampMinus03_C::RBSpotLight_Static' has a wrong offset!");
static_assert(offsetof(AWallLampMinus03_C, SpotLight_Movable) == 0x000778, "Member 'AWallLampMinus03_C::SpotLight_Movable' has a wrong offset!");
static_assert(offsetof(AWallLampMinus03_C, RBVolumetricFogLight) == 0x000780, "Member 'AWallLampMinus03_C::RBVolumetricFogLight' has a wrong offset!");
static_assert(offsetof(AWallLampMinus03_C, PointLight1_Dual) == 0x000788, "Member 'AWallLampMinus03_C::PointLight1_Dual' has a wrong offset!");

}

